NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s

Stm32.elf:     file format elf32-littlearm


Disassembly of section .isr_vector:

08000000 <g_pfnVectors>:
 8000000:	20002800 	andcs	r2, r0, r0, lsl #16
 8000004:	08000625 	stmdaeq	r0, {r0, r2, r5, r9, sl}
 8000008:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800000c:	08000171 	stmdaeq	r0, {r0, r4, r5, r6, r8}
 8000010:	08000173 	stmdaeq	r0, {r0, r1, r4, r5, r6, r8}
 8000014:	08000175 	stmdaeq	r0, {r0, r2, r4, r5, r6, r8}
 8000018:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
	...
 800002c:	08000177 	stmdaeq	r0, {r0, r1, r2, r4, r5, r6, r8}
 8000030:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000034:	00000000 	andeq	r0, r0, r0
 8000038:	080001a5 	stmdaeq	r0, {r0, r2, r5, r7, r8}
 800003c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000040:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000044:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000048:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800004c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000050:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000054:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000058:	080002a9 	stmdaeq	r0, {r0, r3, r5, r7, r9}
 800005c:	080002c5 	stmdaeq	r0, {r0, r2, r6, r7, r9}
 8000060:	080002e1 	stmdaeq	r0, {r0, r5, r6, r7, r9}
 8000064:	080002fd 	stmdaeq	r0, {r0, r2, r3, r4, r5, r6, r7, r9}
 8000068:	08000319 	stmdaeq	r0, {r0, r3, r4, r8, r9}
 800006c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000070:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000074:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000078:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800007c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000080:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000084:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000088:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800008c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000090:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000094:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000098:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800009c:	08000335 	stmdaeq	r0, {r0, r2, r4, r5, r8, r9}
 80000a0:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000a4:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000a8:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000ac:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000b0:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000b4:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000b8:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000bc:	0800044d 	stmdaeq	r0, {r0, r2, r3, r6, sl}
 80000c0:	080003c5 	stmdaeq	r0, {r0, r2, r6, r7, r8, r9}
 80000c4:	080004f7 	stmdaeq	r0, {r0, r1, r2, r4, r5, r6, r7, sl}
 80000c8:	080004f5 	stmdaeq	r0, {r0, r2, r4, r5, r6, r7, sl}
 80000cc:	080004f9 	stmdaeq	r0, {r0, r3, r4, r5, r6, r7, sl}
 80000d0:	08000529 	stmdaeq	r0, {r0, r3, r5, r8, sl}
 80000d4:	08000559 	stmdaeq	r0, {r0, r3, r4, r6, r8, sl}
 80000d8:	08000569 	stmdaeq	r0, {r0, r3, r5, r6, r8, sl}
 80000dc:	08000579 	stmdaeq	r0, {r0, r3, r4, r5, r6, r8, sl}
 80000e0:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000e4:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000e8:	00000000 	andeq	r0, r0, r0
 80000ec:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000f0:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000f4:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000f8:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 80000fc:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000100:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000104:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000108:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800010c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000110:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000114:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000118:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800011c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000120:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000124:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 8000128:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}
 800012c:	08000675 	stmdaeq	r0, {r0, r2, r4, r5, r6, r9, sl}

Disassembly of section .text:

08000130 <__do_global_dtors_aux>:
 8000130:	b510      	push	{r4, lr}
 8000132:	4c05      	ldr	r4, [pc, #20]	@ (8000148 <__do_global_dtors_aux+0x18>)
 8000134:	7823      	ldrb	r3, [r4, #0]
 8000136:	b933      	cbnz	r3, 8000146 <__do_global_dtors_aux+0x16>
 8000138:	4b04      	ldr	r3, [pc, #16]	@ (800014c <__do_global_dtors_aux+0x1c>)
 800013a:	b113      	cbz	r3, 8000142 <__do_global_dtors_aux+0x12>
 800013c:	4804      	ldr	r0, [pc, #16]	@ (8000150 <__do_global_dtors_aux+0x20>)
 800013e:	f3af 8000 	nop.w
 8000142:	2301      	movs	r3, #1
 8000144:	7023      	strb	r3, [r4, #0]
 8000146:	bd10      	pop	{r4, pc}
 8000148:	20000000 	andcs	r0, r0, r0
 800014c:	00000000 	andeq	r0, r0, r0
 8000150:	080006c0 	stmdaeq	r0, {r6, r7, r9, sl}

08000154 <frame_dummy>:
 8000154:	b508      	push	{r3, lr}
 8000156:	4b03      	ldr	r3, [pc, #12]	@ (8000164 <frame_dummy+0x10>)
 8000158:	b11b      	cbz	r3, 8000162 <frame_dummy+0xe>
 800015a:	4903      	ldr	r1, [pc, #12]	@ (8000168 <frame_dummy+0x14>)
 800015c:	4803      	ldr	r0, [pc, #12]	@ (800016c <frame_dummy+0x18>)
 800015e:	f3af 8000 	nop.w
 8000162:	bd08      	pop	{r3, pc}
 8000164:	00000000 	andeq	r0, r0, r0
 8000168:	20000004 	andcs	r0, r0, r4
 800016c:	080006c0 	stmdaeq	r0, {r6, r7, r9, sl}

08000170 <HardFault_Handler>:
 8000170:	e7fe      	b.n	8000170 <HardFault_Handler>

08000172 <MemManage_Handler>:
 8000172:	e7fe      	b.n	8000172 <MemManage_Handler>

08000174 <BusFault_Handler>:
 8000174:	e7fe      	b.n	8000174 <BusFault_Handler>

08000176 <SVC_Handler>:
 8000176:	f01e 0f04 	tst.w	lr, #4
 800017a:	bf0c      	ite	eq
 800017c:	f3ef 8008 	mrseq	r0, MSP
 8000180:	f3ef 8009 	mrsne	r0, PSP
 8000184:	f000 b80d 	b.w	80001a2 <OS_SVC>

