NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
08000188 <FIFO_init>:
 8000188:	b139      	cbz	r1, 800019a <FIFO_init+0x12>
 800018a:	60c1      	str	r1, [r0, #12]
 800018c:	6041      	str	r1, [r0, #4]
 800018e:	6081      	str	r1, [r0, #8]
 8000190:	6102      	str	r2, [r0, #16]
 8000192:	2300      	movs	r3, #0
 8000194:	6003      	str	r3, [r0, #0]
 8000196:	4618      	mov	r0, r3
 8000198:	4770      	bx	lr
 800019a:	2003      	movs	r0, #3
 800019c:	4770      	bx	lr

0800019e <MYRTOS_Idle_Task>:
 800019e:	bf00      	nop
 80001a0:	e7fd      	b.n	800019e <MYRTOS_Idle_Task>

080001a2 <OS_SVC>:
 80001a2:	4770      	bx	lr

080001a4 <PendSV_Handler>:
 80001a4:	4770      	bx	lr
	...

080001a8 <My_RTOS_Creat_Stack>:
 80001a8:	4b06      	ldr	r3, [pc, #24]	@ (80001c4 <My_RTOS_Creat_Stack+0x1c>)
 80001aa:	4a07      	ldr	r2, [pc, #28]	@ (80001c8 <My_RTOS_Creat_Stack+0x20>)
 80001ac:	f8c2 3190 	str.w	r3, [r2, #400]	@ 0x190
 80001b0:	f5a3 6140 	sub.w	r1, r3, #3072	@ 0xc00
 80001b4:	f8c2 1194 	str.w	r1, [r2, #404]	@ 0x194
 80001b8:	f6a3 4308 	subw	r3, r3, #3080	@ 0xc08
 80001bc:	f8c2 3198 	str.w	r3, [r2, #408]	@ 0x198
 80001c0:	4770      	bx	lr
 80001c2:	bf00      	nop
 80001c4:	20002800 	andcs	r2, r0, r0, lsl #16
 80001c8:	20000204 	andcs	r0, r0, r4, lsl #4

080001cc <MY_RTOS_TaskStack>:
 80001cc:	b410      	push	{r4}
 80001ce:	6903      	ldr	r3, [r0, #16]
 80001d0:	1f1a      	subs	r2, r3, #4
 80001d2:	6182      	str	r2, [r0, #24]
 80001d4:	f04f 7280 	mov.w	r2, #16777216	@ 0x1000000
 80001d8:	f843 2c04 	str.w	r2, [r3, #-4]
 80001dc:	6983      	ldr	r3, [r0, #24]
 80001de:	1f1a      	subs	r2, r3, #4
 80001e0:	6182      	str	r2, [r0, #24]
 80001e2:	6882      	ldr	r2, [r0, #8]
 80001e4:	f843 2c04 	str.w	r2, [r3, #-4]
 80001e8:	6983      	ldr	r3, [r0, #24]
 80001ea:	1f1a      	subs	r2, r3, #4
 80001ec:	6182      	str	r2, [r0, #24]
 80001ee:	f06f 0202 	mvn.w	r2, #2
 80001f2:	f843 2c04 	str.w	r2, [r3, #-4]
 80001f6:	230d      	movs	r3, #13
 80001f8:	2400      	movs	r4, #0
 80001fa:	6982      	ldr	r2, [r0, #24]
 80001fc:	1f11      	subs	r1, r2, #4
 80001fe:	6181      	str	r1, [r0, #24]
 8000200:	f842 4c04 	str.w	r4, [r2, #-4]
 8000204:	3b01      	subs	r3, #1
 8000206:	d1f8      	bne.n	80001fa <MY_RTOS_TaskStack+0x2e>
 8000208:	bc10      	pop	{r4}
 800020a:	4770      	bx	lr

0800020c <My_RTOS_Creat_Task>:
 800020c:	4b0c      	ldr	r3, [pc, #48]	@ (8000240 <My_RTOS_Creat_Task+0x34>)
 800020e:	f8d3 3198 	ldr.w	r3, [r3, #408]	@ 0x198
 8000212:	6103      	str	r3, [r0, #16]
 8000214:	6802      	ldr	r2, [r0, #0]
 8000216:	1a9b      	subs	r3, r3, r2
 8000218:	6143      	str	r3, [r0, #20]
 800021a:	4a0a      	ldr	r2, [pc, #40]	@ (8000244 <My_RTOS_Creat_Task+0x38>)
 800021c:	4293      	cmp	r3, r2
 800021e:	d30d      	bcc.n	800023c <My_RTOS_Creat_Task+0x30>
 8000220:	b510      	push	{r4, lr}
 8000222:	4604      	mov	r4, r0
 8000224:	4a06      	ldr	r2, [pc, #24]	@ (8000240 <My_RTOS_Creat_Task+0x34>)
 8000226:	f8d2 3194 	ldr.w	r3, [r2, #404]	@ 0x194
 800022a:	3b08      	subs	r3, #8
 800022c:	f8c2 3198 	str.w	r3, [r2, #408]	@ 0x198
 8000230:	f7ff ffcc 	bl	80001cc <MY_RTOS_TaskStack>
 8000234:	2000      	movs	r0, #0
 8000236:	f884 003a 	strb.w	r0, [r4, #58]	@ 0x3a
 800023a:	bd10      	pop	{r4, pc}
 800023c:	2002      	movs	r0, #2
 800023e:	4770      	bx	lr
 8000240:	20000204 	andcs	r0, r0, r4, lsl #4
 8000244:	20000518 	andcs	r0, r0, r8, lsl r5

08000248 <MYRTOS_Init>:
 8000248:	b538      	push	{r3, r4, r5, lr}
 800024a:	4b11      	ldr	r3, [pc, #68]	@ (8000290 <MYRTOS_Init+0x48>)
 800024c:	2200      	movs	r2, #0
 800024e:	f883 21a8 	strb.w	r2, [r3, #424]	@ 0x1a8
 8000252:	f7ff ffa9 	bl	80001a8 <My_RTOS_Creat_Stack>
 8000256:	2264      	movs	r2, #100	@ 0x64
 8000258:	490e      	ldr	r1, [pc, #56]	@ (8000294 <MYRTOS_Init+0x4c>)
 800025a:	480f      	ldr	r0, [pc, #60]	@ (8000298 <MYRTOS_Init+0x50>)
 800025c:	f7ff ff94 	bl	8000188 <FIFO_init>
 8000260:	4604      	mov	r4, r0
 8000262:	4d0e      	ldr	r5, [pc, #56]	@ (800029c <MYRTOS_Init+0x54>)
 8000264:	4a0e      	ldr	r2, [pc, #56]	@ (80002a0 <MYRTOS_Init+0x58>)
 8000266:	462b      	mov	r3, r5
 8000268:	ca07      	ldmia	r2, {r0, r1, r2}
 800026a:	c303      	stmia	r3!, {r0, r1}
 800026c:	801a      	strh	r2, [r3, #0]
 800026e:	f1a5 001c 	sub.w	r0, r5, #28
 8000272:	23ff      	movs	r3, #255	@ 0xff
 8000274:	7103      	strb	r3, [r0, #4]
 8000276:	4b0b      	ldr	r3, [pc, #44]	@ (80002a4 <MYRTOS_Init+0x5c>)
 8000278:	6083      	str	r3, [r0, #8]
 800027a:	f44f 7396 	mov.w	r3, #300	@ 0x12c
 800027e:	f845 3c1c 	str.w	r3, [r5, #-28]
 8000282:	f7ff ffc3 	bl	800020c <My_RTOS_Creat_Task>
 8000286:	2c00      	cmp	r4, #0
 8000288:	bf18      	it	ne
 800028a:	3001      	addne	r0, #1
 800028c:	b2c0      	uxtb	r0, r0
 800028e:	bd38      	pop	{r3, r4, r5, pc}
 8000290:	20000204 	andcs	r0, r0, r4, lsl #4
 8000294:	20000060 	andcs	r0, r0, r0, rrx
 8000298:	200001f0 	strdcs	r0, [r0], -r0	@ <UNPREDICTABLE>
 800029c:	20000038 	andcs	r0, r0, r8, lsr r0
 80002a0:	080006d8 	stmdaeq	r0, {r3, r4, r6, r7, r9, sl}
 80002a4:	0800019f 	stmdaeq	r0, {r0, r1, r2, r3, r4, r7, r8}

080002a8 <EXTI0_IRQHandler>:
 80002a8:	b508      	push	{r3, lr}
 80002aa:	4a04      	ldr	r2, [pc, #16]	@ (80002bc <EXTI0_IRQHandler+0x14>)
 80002ac:	6953      	ldr	r3, [r2, #20]
 80002ae:	f043 0301 	orr.w	r3, r3, #1
 80002b2:	6153      	str	r3, [r2, #20]
 80002b4:	4b02      	ldr	r3, [pc, #8]	@ (80002c0 <EXTI0_IRQHandler+0x18>)
 80002b6:	681b      	ldr	r3, [r3, #0]
 80002b8:	4798      	blx	r3
 80002ba:	bd08      	pop	{r3, pc}
 80002bc:	40010400 	andmi	r0, r1, r0, lsl #8
 80002c0:	200003b0 			@ <UNDEFINED> instruction: 0x200003b0

080002c4 <EXTI1_IRQHandler>:
 80002c4:	b508      	push	{r3, lr}
 80002c6:	4a04      	ldr	r2, [pc, #16]	@ (80002d8 <EXTI1_IRQHandler+0x14>)
 80002c8:	6953      	ldr	r3, [r2, #20]
 80002ca:	f043 0302 	orr.w	r3, r3, #2
 80002ce:	6153      	str	r3, [r2, #20]
 80002d0:	4b02      	ldr	r3, [pc, #8]	@ (80002dc <EXTI1_IRQHandler+0x18>)
 80002d2:	685b      	ldr	r3, [r3, #4]
 80002d4:	4798      	blx	r3
 80002d6:	bd08      	pop	{r3, pc}
 80002d8:	40010400 	andmi	r0, r1, r0, lsl #8
 80002dc:	200003b0 			@ <UNDEFINED> instruction: 0x200003b0

080002e0 <EXTI2_IRQHandler>:
 80002e0:	b508      	push	{r3, lr}
 80002e2:	4a04      	ldr	r2, [pc, #16]	@ (80002f4 <EXTI2_IRQHandler+0x14>)
 80002e4:	6953      	ldr	r3, [r2, #20]
 80002e6:	f043 0304 	orr.w	r3, r3, #4
 80002ea:	6153      	str	r3, [r2, #20]
 80002ec:	4b02      	ldr	r3, [pc, #8]	@ (80002f8 <EXTI2_IRQHandler+0x18>)
 80002ee:	689b      	ldr	r3, [r3, #8]
 80002f0:	4798      	blx	r3
 80002f2:	bd08      	pop	{r3, pc}
 80002f4:	40010400 	andmi	r0, r1, r0, lsl #8
 80002f8:	200003b0 			@ <UNDEFINED> instruction: 0x200003b0

080002fc <EXTI3_IRQHandler>:
 80002fc:	b508      	push	{r3, lr}
 80002fe:	4a04      	ldr	r2, [pc, #16]	@ (8000310 <EXTI3_IRQHandler+0x14>)
 8000300:	6953      	ldr	r3, [r2, #20]
 8000302:	f043 0308 	orr.w	r3, r3, #8
 8000306:	6153      	str	r3, [r2, #20]
 8000308:	4b02      	ldr	r3, [pc, #8]	@ (8000314 <EXTI3_IRQHandler+0x18>)
 800030a:	68db      	ldr	r3, [r3, #12]
 800030c:	4798      	blx	r3
 800030e:	bd08      	pop	{r3, pc}
 8000310:	40010400 	andmi	r0, r1, r0, lsl #8
 8000314:	200003b0 			@ <UNDEFINED> instruction: 0x200003b0

08000318 <EXTI4_IRQHandler>:
 8000318:	b508      	push	{r3, lr}
 800031a:	4a04      	ldr	r2, [pc, #16]	@ (800032c <EXTI4_IRQHandler+0x14>)
 800031c:	6953      	ldr	r3, [r2, #20]
 800031e:	f043 0310 	orr.w	r3, r3, #16
 8000322:	6153      	str	r3, [r2, #20]
 8000324:	4b02      	ldr	r3, [pc, #8]	@ (8000330 <EXTI4_IRQHandler+0x18>)
 8000326:	691b      	ldr	r3, [r3, #16]
 8000328:	4798      	blx	r3
 800032a:	bd08      	pop	{r3, pc}
 800032c:	40010400 	andmi	r0, r1, r0, lsl #8
 8000330:	200003b0 			@ <UNDEFINED> instruction: 0x200003b0

