NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
08000334 <EXTI9_5_IRQHandler>:
 8000334:	b508      	push	{r3, lr}
 8000336:	4b21      	ldr	r3, [pc, #132]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 8000338:	695b      	ldr	r3, [r3, #20]
 800033a:	f013 0f20 	tst.w	r3, #32
 800033e:	d007      	beq.n	8000350 <EXTI9_5_IRQHandler+0x1c>
 8000340:	4a1e      	ldr	r2, [pc, #120]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 8000342:	6953      	ldr	r3, [r2, #20]
 8000344:	f043 0320 	orr.w	r3, r3, #32
 8000348:	6153      	str	r3, [r2, #20]
 800034a:	4b1d      	ldr	r3, [pc, #116]	@ (80003c0 <EXTI9_5_IRQHandler+0x8c>)
 800034c:	695b      	ldr	r3, [r3, #20]
 800034e:	4798      	blx	r3
 8000350:	4b1a      	ldr	r3, [pc, #104]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 8000352:	695b      	ldr	r3, [r3, #20]
 8000354:	f013 0f40 	tst.w	r3, #64	@ 0x40
 8000358:	d007      	beq.n	800036a <EXTI9_5_IRQHandler+0x36>
 800035a:	4a18      	ldr	r2, [pc, #96]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 800035c:	6953      	ldr	r3, [r2, #20]
 800035e:	f043 0340 	orr.w	r3, r3, #64	@ 0x40
 8000362:	6153      	str	r3, [r2, #20]
 8000364:	4b16      	ldr	r3, [pc, #88]	@ (80003c0 <EXTI9_5_IRQHandler+0x8c>)
 8000366:	699b      	ldr	r3, [r3, #24]
 8000368:	4798      	blx	r3
 800036a:	4b14      	ldr	r3, [pc, #80]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 800036c:	695b      	ldr	r3, [r3, #20]
 800036e:	f013 0f80 	tst.w	r3, #128	@ 0x80
 8000372:	d007      	beq.n	8000384 <EXTI9_5_IRQHandler+0x50>
 8000374:	4a11      	ldr	r2, [pc, #68]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 8000376:	6953      	ldr	r3, [r2, #20]
 8000378:	f043 0380 	orr.w	r3, r3, #128	@ 0x80
 800037c:	6153      	str	r3, [r2, #20]
 800037e:	4b10      	ldr	r3, [pc, #64]	@ (80003c0 <EXTI9_5_IRQHandler+0x8c>)
 8000380:	69db      	ldr	r3, [r3, #28]
 8000382:	4798      	blx	r3
 8000384:	4b0d      	ldr	r3, [pc, #52]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 8000386:	695b      	ldr	r3, [r3, #20]
 8000388:	f413 7f80 	tst.w	r3, #256	@ 0x100
 800038c:	d007      	beq.n	800039e <EXTI9_5_IRQHandler+0x6a>
 800038e:	4a0b      	ldr	r2, [pc, #44]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 8000390:	6953      	ldr	r3, [r2, #20]
 8000392:	f443 7380 	orr.w	r3, r3, #256	@ 0x100
 8000396:	6153      	str	r3, [r2, #20]
 8000398:	4b09      	ldr	r3, [pc, #36]	@ (80003c0 <EXTI9_5_IRQHandler+0x8c>)
 800039a:	6a1b      	ldr	r3, [r3, #32]
 800039c:	4798      	blx	r3
 800039e:	4b07      	ldr	r3, [pc, #28]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 80003a0:	695b      	ldr	r3, [r3, #20]
 80003a2:	f413 7f00 	tst.w	r3, #512	@ 0x200
 80003a6:	d007      	beq.n	80003b8 <EXTI9_5_IRQHandler+0x84>
 80003a8:	4a04      	ldr	r2, [pc, #16]	@ (80003bc <EXTI9_5_IRQHandler+0x88>)
 80003aa:	6953      	ldr	r3, [r2, #20]
 80003ac:	f443 7300 	orr.w	r3, r3, #512	@ 0x200
 80003b0:	6153      	str	r3, [r2, #20]
 80003b2:	4b03      	ldr	r3, [pc, #12]	@ (80003c0 <EXTI9_5_IRQHandler+0x8c>)
 80003b4:	6a5b      	ldr	r3, [r3, #36]	@ 0x24
 80003b6:	4798      	blx	r3
 80003b8:	bd08      	pop	{r3, pc}
 80003ba:	bf00      	nop
 80003bc:	40010400 	andmi	r0, r1, r0, lsl #8
 80003c0:	200003b0 			@ <UNDEFINED> instruction: 0x200003b0

080003c4 <I2C1_ER_IRQHandler>:
 80003c4:	4770      	bx	lr
	...

080003c8 <Slave_States>:
 80003c8:	b508      	push	{r3, lr}
 80003ca:	4b1e      	ldr	r3, [pc, #120]	@ (8000444 <Slave_States+0x7c>)
 80003cc:	1ac3      	subs	r3, r0, r3
 80003ce:	bf18      	it	ne
 80003d0:	2301      	movne	r3, #1
 80003d2:	2904      	cmp	r1, #4
 80003d4:	d805      	bhi.n	80003e2 <Slave_States+0x1a>
 80003d6:	e8df f001 	tbb	[pc, r1]
 80003da:	1b120305 	blne	8480ff6 <_sidata+0x4808fa>
 80003de:	69830028 	stmibvs	r3, {r3, r5}
 80003e2:	bd08      	pop	{r3, pc}
 80003e4:	6982      	ldr	r2, [r0, #24]
 80003e6:	f012 0f04 	tst.w	r2, #4
 80003ea:	d0fa      	beq.n	80003e2 <Slave_States+0x1a>
 80003ec:	eb03 03c3 	add.w	r3, r3, r3, lsl #3
 80003f0:	4a15      	ldr	r2, [pc, #84]	@ (8000448 <Slave_States+0x80>)
 80003f2:	eb02 0383 	add.w	r3, r2, r3, lsl #2
 80003f6:	6a1b      	ldr	r3, [r3, #32]
 80003f8:	2000      	movs	r0, #0
 80003fa:	4798      	blx	r3
 80003fc:	e7f1      	b.n	80003e2 <Slave_States+0x1a>
 80003fe:	eb03 03c3 	add.w	r3, r3, r3, lsl #3
 8000402:	4a11      	ldr	r2, [pc, #68]	@ (8000448 <Slave_States+0x80>)
 8000404:	eb02 0383 	add.w	r3, r2, r3, lsl #2
 8000408:	6a1b      	ldr	r3, [r3, #32]
 800040a:	2002      	movs	r0, #2
 800040c:	4798      	blx	r3
 800040e:	e7e8      	b.n	80003e2 <Slave_States+0x1a>
 8000410:	6982      	ldr	r2, [r0, #24]
 8000412:	f012 0f04 	tst.w	r2, #4
 8000416:	d0e4      	beq.n	80003e2 <Slave_States+0x1a>
 8000418:	eb03 03c3 	add.w	r3, r3, r3, lsl #3
 800041c:	4a0a      	ldr	r2, [pc, #40]	@ (8000448 <Slave_States+0x80>)
 800041e:	eb02 0383 	add.w	r3, r2, r3, lsl #2
 8000422:	6a1b      	ldr	r3, [r3, #32]
 8000424:	2003      	movs	r0, #3
 8000426:	4798      	blx	r3
 8000428:	e7db      	b.n	80003e2 <Slave_States+0x1a>
 800042a:	6982      	ldr	r2, [r0, #24]
 800042c:	f012 0f04 	tst.w	r2, #4
 8000430:	d1d7      	bne.n	80003e2 <Slave_States+0x1a>
 8000432:	eb03 03c3 	add.w	r3, r3, r3, lsl #3
 8000436:	4a04      	ldr	r2, [pc, #16]	@ (8000448 <Slave_States+0x80>)
 8000438:	eb02 0383 	add.w	r3, r2, r3, lsl #2
 800043c:	6a1b      	ldr	r3, [r3, #32]
 800043e:	2004      	movs	r0, #4
 8000440:	4798      	blx	r3
 8000442:	e7ce      	b.n	80003e2 <Slave_States+0x1a>
 8000444:	40005400 	andmi	r5, r0, r0, lsl #8
 8000448:	200003f0 	strdcs	r0, [r0], -r0	@ <UNPREDICTABLE>

0800044c <I2C1_EV_IRQHandler>:
 800044c:	b510      	push	{r4, lr}
 800044e:	b082      	sub	sp, #8
 8000450:	2300      	movs	r3, #0
 8000452:	9301      	str	r3, [sp, #4]
 8000454:	4b26      	ldr	r3, [pc, #152]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 8000456:	685a      	ldr	r2, [r3, #4]
 8000458:	685c      	ldr	r4, [r3, #4]
 800045a:	695b      	ldr	r3, [r3, #20]
 800045c:	f412 7f00 	tst.w	r2, #512	@ 0x200
 8000460:	d040      	beq.n	80004e4 <I2C1_EV_IRQHandler+0x98>
 8000462:	f013 0f10 	tst.w	r3, #16
 8000466:	d10c      	bne.n	8000482 <I2C1_EV_IRQHandler+0x36>
 8000468:	4b21      	ldr	r3, [pc, #132]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 800046a:	695b      	ldr	r3, [r3, #20]
 800046c:	f013 0f02 	tst.w	r3, #2
 8000470:	d10e      	bne.n	8000490 <I2C1_EV_IRQHandler+0x44>
 8000472:	4b1f      	ldr	r3, [pc, #124]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 8000474:	695b      	ldr	r3, [r3, #20]
 8000476:	f414 6f80 	tst.w	r4, #1024	@ 0x400
 800047a:	d117      	bne.n	80004ac <I2C1_EV_IRQHandler+0x60>
 800047c:	4b1c      	ldr	r3, [pc, #112]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 800047e:	695b      	ldr	r3, [r3, #20]
 8000480:	e034      	b.n	80004ec <I2C1_EV_IRQHandler+0xa0>
 8000482:	481b      	ldr	r0, [pc, #108]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 8000484:	6803      	ldr	r3, [r0, #0]
 8000486:	6003      	str	r3, [r0, #0]
 8000488:	2100      	movs	r1, #0
 800048a:	f7ff ff9d 	bl	80003c8 <Slave_States>
 800048e:	e7eb      	b.n	8000468 <I2C1_EV_IRQHandler+0x1c>
 8000490:	4b17      	ldr	r3, [pc, #92]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 8000492:	699b      	ldr	r3, [r3, #24]
 8000494:	f013 0f01 	tst.w	r3, #1
 8000498:	d1eb      	bne.n	8000472 <I2C1_EV_IRQHandler+0x26>
 800049a:	4815      	ldr	r0, [pc, #84]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 800049c:	6943      	ldr	r3, [r0, #20]
 800049e:	9301      	str	r3, [sp, #4]
 80004a0:	6983      	ldr	r3, [r0, #24]
 80004a2:	9301      	str	r3, [sp, #4]
 80004a4:	2102      	movs	r1, #2
 80004a6:	f7ff ff8f 	bl	80003c8 <Slave_States>
 80004aa:	e7e2      	b.n	8000472 <I2C1_EV_IRQHandler+0x26>
 80004ac:	f013 0f80 	tst.w	r3, #128	@ 0x80
 80004b0:	d004      	beq.n	80004bc <I2C1_EV_IRQHandler+0x70>
 80004b2:	4b0f      	ldr	r3, [pc, #60]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 80004b4:	699b      	ldr	r3, [r3, #24]
 80004b6:	f013 0f01 	tst.w	r3, #1
 80004ba:	d00e      	beq.n	80004da <I2C1_EV_IRQHandler+0x8e>
 80004bc:	4b0c      	ldr	r3, [pc, #48]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 80004be:	695b      	ldr	r3, [r3, #20]
 80004c0:	f013 0f40 	tst.w	r3, #64	@ 0x40
 80004c4:	d012      	beq.n	80004ec <I2C1_EV_IRQHandler+0xa0>
 80004c6:	4b0a      	ldr	r3, [pc, #40]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 80004c8:	699b      	ldr	r3, [r3, #24]
 80004ca:	f013 0f01 	tst.w	r3, #1
 80004ce:	d10d      	bne.n	80004ec <I2C1_EV_IRQHandler+0xa0>
 80004d0:	2104      	movs	r1, #4
 80004d2:	4807      	ldr	r0, [pc, #28]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 80004d4:	f7ff ff78 	bl	80003c8 <Slave_States>
 80004d8:	e008      	b.n	80004ec <I2C1_EV_IRQHandler+0xa0>
 80004da:	2103      	movs	r1, #3
 80004dc:	4804      	ldr	r0, [pc, #16]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 80004de:	f7ff ff73 	bl	80003c8 <Slave_States>
 80004e2:	e7eb      	b.n	80004bc <I2C1_EV_IRQHandler+0x70>
 80004e4:	4b02      	ldr	r3, [pc, #8]	@ (80004f0 <I2C1_EV_IRQHandler+0xa4>)
 80004e6:	695a      	ldr	r2, [r3, #20]
 80004e8:	695a      	ldr	r2, [r3, #20]
 80004ea:	695b      	ldr	r3, [r3, #20]
 80004ec:	b002      	add	sp, #8
 80004ee:	bd10      	pop	{r4, pc}
 80004f0:	40005400 	andmi	r5, r0, r0, lsl #8

080004f4 <I2C2_ER_IRQHandler>:
 80004f4:	4770      	bx	lr

080004f6 <I2C2_EV_IRQHandler>:
 80004f6:	4770      	bx	lr

080004f8 <SPI1_IRQHandler>:
 80004f8:	b508      	push	{r3, lr}
 80004fa:	4b09      	ldr	r3, [pc, #36]	@ (8000520 <SPI1_IRQHandler+0x28>)
 80004fc:	689a      	ldr	r2, [r3, #8]
 80004fe:	0852      	lsrs	r2, r2, #1
 8000500:	f04f 0000 	mov.w	r0, #0
 8000504:	f362 0000 	bfi	r0, r2, #0, #1
 8000508:	689a      	ldr	r2, [r3, #8]
 800050a:	f362 0041 	bfi	r0, r2, #1, #1
 800050e:	689b      	ldr	r3, [r3, #8]
 8000510:	091b      	lsrs	r3, r3, #4
 8000512:	f363 0082 	bfi	r0, r3, #2, #1
 8000516:	4b03      	ldr	r3, [pc, #12]	@ (8000524 <SPI1_IRQHandler+0x2c>)
 8000518:	681b      	ldr	r3, [r3, #0]
 800051a:	695b      	ldr	r3, [r3, #20]
 800051c:	4798      	blx	r3
 800051e:	bd08      	pop	{r3, pc}
 8000520:	40013000 	andmi	r3, r1, r0
 8000524:	20000438 	andcs	r0, r0, r8, lsr r4

08000528 <SPI2_IRQHandler>:
 8000528:	b508      	push	{r3, lr}
 800052a:	4b09      	ldr	r3, [pc, #36]	@ (8000550 <SPI2_IRQHandler+0x28>)
 800052c:	689a      	ldr	r2, [r3, #8]
 800052e:	0852      	lsrs	r2, r2, #1
 8000530:	f04f 0000 	mov.w	r0, #0
 8000534:	f362 0000 	bfi	r0, r2, #0, #1
 8000538:	689a      	ldr	r2, [r3, #8]
 800053a:	f362 0041 	bfi	r0, r2, #1, #1
 800053e:	689b      	ldr	r3, [r3, #8]
 8000540:	091b      	lsrs	r3, r3, #4
 8000542:	f363 0082 	bfi	r0, r3, #2, #1
 8000546:	4b03      	ldr	r3, [pc, #12]	@ (8000554 <SPI2_IRQHandler+0x2c>)
 8000548:	685b      	ldr	r3, [r3, #4]
 800054a:	695b      	ldr	r3, [r3, #20]
 800054c:	4798      	blx	r3
 800054e:	bd08      	pop	{r3, pc}
 8000550:	40003800 	andmi	r3, r0, r0, lsl #16
 8000554:	20000438 	andcs	r0, r0, r8, lsr r4

08000558 <USART1_IRQHandler>:
 8000558:	b508      	push	{r3, lr}
 800055a:	4b02      	ldr	r3, [pc, #8]	@ (8000564 <USART1_IRQHandler+0xc>)
 800055c:	681b      	ldr	r3, [r3, #0]
 800055e:	691b      	ldr	r3, [r3, #16]
 8000560:	4798      	blx	r3
 8000562:	bd08      	pop	{r3, pc}
 8000564:	20000440 	andcs	r0, r0, r0, asr #8

