NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
08000568 <USART2_IRQHandler>:
 8000568:	b508      	push	{r3, lr}
 800056a:	4b02      	ldr	r3, [pc, #8]	@ (8000574 <USART2_IRQHandler+0xc>)
 800056c:	681b      	ldr	r3, [r3, #0]
 800056e:	691b      	ldr	r3, [r3, #16]
 8000570:	4798      	blx	r3
 8000572:	bd08      	pop	{r3, pc}
 8000574:	20000440 	andcs	r0, r0, r0, asr #8

08000578 <USART3_IRQHandler>:
 8000578:	b508      	push	{r3, lr}
 800057a:	4b02      	ldr	r3, [pc, #8]	@ (8000584 <USART3_IRQHandler+0xc>)
 800057c:	681b      	ldr	r3, [r3, #0]
 800057e:	691b      	ldr	r3, [r3, #16]
 8000580:	4798      	blx	r3
 8000582:	bd08      	pop	{r3, pc}
 8000584:	20000440 	andcs	r0, r0, r0, asr #8

08000588 <task_1>:
 8000588:	e7fe      	b.n	8000588 <task_1>

0800058a <task_2>:
 800058a:	e7fe      	b.n	800058a <task_2>

0800058c <task_3>:
 800058c:	e7fe      	b.n	800058c <task_3>
	...

08000590 <main>:
 8000590:	b508      	push	{r3, lr}
 8000592:	f7ff fe59 	bl	8000248 <MYRTOS_Init>
 8000596:	b100      	cbz	r0, 800059a <main+0xa>
 8000598:	e7fe      	b.n	8000598 <main+0x8>
 800059a:	4b19      	ldr	r3, [pc, #100]	@ (8000600 <main+0x70>)
 800059c:	f44f 6580 	mov.w	r5, #1024	@ 0x400
 80005a0:	601d      	str	r5, [r3, #0]
 80005a2:	4a18      	ldr	r2, [pc, #96]	@ (8000604 <main+0x74>)
 80005a4:	609a      	str	r2, [r3, #8]
 80005a6:	2203      	movs	r2, #3
 80005a8:	711a      	strb	r2, [r3, #4]
 80005aa:	4e17      	ldr	r6, [pc, #92]	@ (8000608 <main+0x78>)
 80005ac:	6035      	str	r5, [r6, #0]
 80005ae:	4917      	ldr	r1, [pc, #92]	@ (800060c <main+0x7c>)
 80005b0:	60b1      	str	r1, [r6, #8]
 80005b2:	7132      	strb	r2, [r6, #4]
 80005b4:	4916      	ldr	r1, [pc, #88]	@ (8000610 <main+0x80>)
 80005b6:	c903      	ldmia	r1, {r0, r1}
 80005b8:	61d8      	str	r0, [r3, #28]
 80005ba:	8419      	strh	r1, [r3, #32]
 80005bc:	0c09      	lsrs	r1, r1, #16
 80005be:	f883 1022 	strb.w	r1, [r3, #34]	@ 0x22
 80005c2:	4c14      	ldr	r4, [pc, #80]	@ (8000614 <main+0x84>)
 80005c4:	6025      	str	r5, [r4, #0]
 80005c6:	4914      	ldr	r1, [pc, #80]	@ (8000618 <main+0x88>)
 80005c8:	60a1      	str	r1, [r4, #8]
 80005ca:	7122      	strb	r2, [r4, #4]
 80005cc:	4a13      	ldr	r2, [pc, #76]	@ (800061c <main+0x8c>)
 80005ce:	e892 0003 	ldmia.w	r2, {r0, r1}
 80005d2:	61e0      	str	r0, [r4, #28]
 80005d4:	8421      	strh	r1, [r4, #32]
 80005d6:	0c09      	lsrs	r1, r1, #16
 80005d8:	f884 1022 	strb.w	r1, [r4, #34]	@ 0x22
 80005dc:	4618      	mov	r0, r3
 80005de:	f7ff fe15 	bl	800020c <My_RTOS_Creat_Task>
 80005e2:	4d0f      	ldr	r5, [pc, #60]	@ (8000620 <main+0x90>)
 80005e4:	782b      	ldrb	r3, [r5, #0]
 80005e6:	4403      	add	r3, r0
 80005e8:	702b      	strb	r3, [r5, #0]
 80005ea:	4630      	mov	r0, r6
 80005ec:	f7ff fe0e 	bl	800020c <My_RTOS_Creat_Task>
 80005f0:	782b      	ldrb	r3, [r5, #0]
 80005f2:	4403      	add	r3, r0
 80005f4:	702b      	strb	r3, [r5, #0]
 80005f6:	4620      	mov	r0, r4
 80005f8:	f7ff fe08 	bl	800020c <My_RTOS_Creat_Task>
 80005fc:	e7fe      	b.n	80005fc <main+0x6c>
 80005fe:	bf00      	nop
 8000600:	200004d0 	ldrdcs	r0, [r0], -r0	@ <UNPREDICTABLE>
 8000604:	08000589 	stmdaeq	r0, {r0, r3, r7, r8, sl}
 8000608:	2000048c 	andcs	r0, r0, ip, lsl #9
 800060c:	0800058b 	stmdaeq	r0, {r0, r1, r3, r7, r8, sl}
 8000610:	080006e4 	stmdaeq	r0, {r2, r5, r6, r7, r9, sl}
 8000614:	20000448 	andcs	r0, r0, r8, asr #8
 8000618:	0800058d 	stmdaeq	r0, {r0, r2, r3, r7, r8, sl}
 800061c:	080006ec 	stmdaeq	r0, {r2, r3, r5, r6, r7, r9, sl}
 8000620:	20000444 	andcs	r0, r0, r4, asr #8

08000624 <Reset_Handler>:
 8000624:	480d      	ldr	r0, [pc, #52]	@ (800065c <LoopForever+0x2>)
 8000626:	4685      	mov	sp, r0
 8000628:	f3af 8000 	nop.w
 800062c:	480c      	ldr	r0, [pc, #48]	@ (8000660 <LoopForever+0x6>)
 800062e:	490d      	ldr	r1, [pc, #52]	@ (8000664 <LoopForever+0xa>)
 8000630:	4a0d      	ldr	r2, [pc, #52]	@ (8000668 <LoopForever+0xe>)
 8000632:	2300      	movs	r3, #0
 8000634:	e002      	b.n	800063c <LoopCopyDataInit>

08000636 <CopyDataInit>:
 8000636:	58d4      	ldr	r4, [r2, r3]
 8000638:	50c4      	str	r4, [r0, r3]
 800063a:	3304      	adds	r3, #4

0800063c <LoopCopyDataInit>:
 800063c:	18c4      	adds	r4, r0, r3
 800063e:	428c      	cmp	r4, r1
 8000640:	d3f9      	bcc.n	8000636 <CopyDataInit>
 8000642:	4a0a      	ldr	r2, [pc, #40]	@ (800066c <LoopForever+0x12>)
 8000644:	4c0a      	ldr	r4, [pc, #40]	@ (8000670 <LoopForever+0x16>)
 8000646:	2300      	movs	r3, #0
 8000648:	e001      	b.n	800064e <LoopFillZerobss>

0800064a <FillZerobss>:
 800064a:	6013      	str	r3, [r2, #0]
 800064c:	3204      	adds	r2, #4

0800064e <LoopFillZerobss>:
 800064e:	42a2      	cmp	r2, r4
 8000650:	d3fb      	bcc.n	800064a <FillZerobss>
 8000652:	f000 f811 	bl	8000678 <__libc_init_array>
 8000656:	f7ff ff9b 	bl	8000590 <main>

0800065a <LoopForever>:
 800065a:	e7fe      	b.n	800065a <LoopForever>
 800065c:	20002800 	andcs	r2, r0, r0, lsl #16
 8000660:	20000000 	andcs	r0, r0, r0
 8000664:	20000000 	andcs	r0, r0, r0
 8000668:	080006fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9, sl}
 800066c:	20000000 	andcs	r0, r0, r0
 8000670:	20000514 	andcs	r0, r0, r4, lsl r5

08000674 <ADC1_2_IRQHandler>:
 8000674:	e7fe      	b.n	8000674 <ADC1_2_IRQHandler>
	...

08000678 <__libc_init_array>:
 8000678:	b570      	push	{r4, r5, r6, lr}
 800067a:	2600      	movs	r6, #0
 800067c:	4d0c      	ldr	r5, [pc, #48]	@ (80006b0 <__libc_init_array+0x38>)
 800067e:	4c0d      	ldr	r4, [pc, #52]	@ (80006b4 <__libc_init_array+0x3c>)
 8000680:	1b64      	subs	r4, r4, r5
 8000682:	10a4      	asrs	r4, r4, #2
 8000684:	42a6      	cmp	r6, r4
 8000686:	d109      	bne.n	800069c <__libc_init_array+0x24>
 8000688:	f000 f81a 	bl	80006c0 <_init>
 800068c:	2600      	movs	r6, #0
 800068e:	4d0a      	ldr	r5, [pc, #40]	@ (80006b8 <__libc_init_array+0x40>)
 8000690:	4c0a      	ldr	r4, [pc, #40]	@ (80006bc <__libc_init_array+0x44>)
 8000692:	1b64      	subs	r4, r4, r5
 8000694:	10a4      	asrs	r4, r4, #2
 8000696:	42a6      	cmp	r6, r4
 8000698:	d105      	bne.n	80006a6 <__libc_init_array+0x2e>
 800069a:	bd70      	pop	{r4, r5, r6, pc}
 800069c:	f855 3b04 	ldr.w	r3, [r5], #4
 80006a0:	4798      	blx	r3
 80006a2:	3601      	adds	r6, #1
 80006a4:	e7ee      	b.n	8000684 <__libc_init_array+0xc>
 80006a6:	f855 3b04 	ldr.w	r3, [r5], #4
 80006aa:	4798      	blx	r3
 80006ac:	3601      	adds	r6, #1
 80006ae:	e7f2      	b.n	8000696 <__libc_init_array+0x1e>
 80006b0:	080006f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, r9, sl}
 80006b4:	080006f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, r9, sl}
 80006b8:	080006f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, r9, sl}
 80006bc:	080006f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r9, sl}

080006c0 <_init>:
 80006c0:	b5f8      	push	{r3, r4, r5, r6, r7, lr}
 80006c2:	bf00      	nop
 80006c4:	bcf8      	pop	{r3, r4, r5, r6, r7}
 80006c6:	bc08      	pop	{r3}
 80006c8:	469e      	mov	lr, r3
 80006ca:	4770      	bx	lr

080006cc <_fini>:
 80006cc:	b5f8      	push	{r3, r4, r5, r6, r7, lr}
 80006ce:	bf00      	nop
 80006d0:	bcf8      	pop	{r3, r4, r5, r6, r7}
 80006d2:	bc08      	pop	{r3}
 80006d4:	469e      	mov	lr, r3
 80006d6:	4770      	bx	lr

