NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
Disassembly of section .rodata:

080006d8 <.rodata>:
 80006d8:	656c6469 	strbvs	r6, [ip, #-1129]!	@ 0xfffffb97
 80006dc:	73615420 	cmnvc	r1, #32, 8	@ 0x20000000
 80006e0:	0000006b 	andeq	r0, r0, fp, rrx
 80006e4:	6b736154 	blvs	9cd8c3c <_sidata+0x1cd8540>
 80006e8:	0000325f 	andeq	r3, r0, pc, asr r2
 80006ec:	6b736154 	blvs	9cd8c44 <_sidata+0x1cd8548>
 80006f0:	0000335f 	andeq	r3, r0, pc, asr r3

Disassembly of section .init_array:

080006f4 <__frame_dummy_init_array_entry>:
 80006f4:	08000155 	stmdaeq	r0, {r0, r2, r4, r6, r8}

Disassembly of section .fini_array:

080006f8 <__do_global_dtors_aux_fini_array_entry>:
 80006f8:	08000131 	stmdaeq	r0, {r0, r4, r5, r8}

Disassembly of section .ARM.attributes:

00000000 <.ARM.attributes>:
   0:	00002841 	andeq	r2, r0, r1, asr #16
   4:	61656100 	cmnvs	r5, r0, lsl #2
   8:	01006962 	tsteq	r0, r2, ror #18
   c:	0000001e 	andeq	r0, r0, lr, lsl r0
  10:	4d2d3705 	stcmi	7, cr3, [sp, #-20]!	@ 0xffffffec
  14:	070a0600 	streq	r0, [sl, -r0, lsl #12]
  18:	1202094d 	andne	r0, r2, #1261568	@ 0x134000
  1c:	15011404 	strne	r1, [r1, #-1028]	@ 0xfffffbfc
  20:	18031701 	stmdane	r3, {r0, r8, r9, sl, ip}
  24:	22011a01 	andcs	r1, r1, #4096	@ 0x1000
  28:	Address 0x28 is out of bounds.


Disassembly of section .debug_info:

00000000 <.debug_info>:
       0:	000000b4 	strheq	r0, [r0], -r4
       4:	00000002 	andeq	r0, r0, r2
       8:	01040000 	mrseq	r0, (UNDEF: 4)
       c:	00002e38 	andeq	r2, r0, r8, lsr lr
      10:	001eab0c 	andseq	sl, lr, ip, lsl #22
      14:	00151100 	andseq	r1, r5, r0, lsl #2
	...
      2c:	07040200 	streq	r0, [r4, -r0, lsl #4]
      30:	00002061 	andeq	r2, r0, r1, rrx
      34:	2bff0103 	blcs	fffc0448 <_estack+0xdffbdc48>
      38:	2d010000 	stccs	0, cr0, [r1, #-0]
      3c:	00000106 	andeq	r0, r0, r6, lsl #2
      40:	00000000 	andeq	r0, r0, r0
      44:	7d020000 	stcvc	0, cr0, [r2, #-0]
      48:	01040100 	mrseq	r0, (UNDEF: 20)
      4c:	000004aa 	andeq	r0, r0, sl, lsr #9
      50:	761c1f01 	ldrvc	r1, [ip], -r1, lsl #30
      54:	88080001 	stmdahi	r8, {r0}
      58:	02080001 	andeq	r0, r8, #1
      5c:	0301007d 	movweq	r0, #4221	@ 0x107d
      60:	0029c101 	eoreq	ip, r9, r1, lsl #2
      64:	06190100 	ldreq	r0, [r9], -r0, lsl #2
      68:	00000001 	andeq	r0, r0, r1
      6c:	00000000 	andeq	r0, r0, r0
      70:	007d0200 	rsbseq	r0, sp, r0, lsl #4
      74:	03010301 	movweq	r0, #4865	@ 0x1301
      78:	01000010 	tsteq	r0, r0, lsl r0
      7c:	74010614 	strvc	r0, [r1], #-1556	@ 0xfffff9ec
      80:	76080001 	strvc	r0, [r8], -r1
      84:	02080001 	andeq	r0, r8, #1
      88:	0301007d 	movweq	r0, #4221	@ 0x107d
      8c:	00215d01 	eoreq	r5, r1, r1, lsl #26
      90:	060f0100 	streq	r0, [pc], -r0, lsl #2
      94:	00017201 	andeq	r7, r1, r1, lsl #4
      98:	00017408 	andeq	r7, r1, r8, lsl #8
      9c:	007d0208 	rsbseq	r0, sp, r8, lsl #4
      a0:	29010301 	stmdbcs	r1, {r0, r8, r9}
      a4:	0100002c 	tsteq	r0, ip, lsr #32
      a8:	7001060a 	andvc	r0, r1, sl, lsl #12
      ac:	72080001 	andvc	r0, r8, #1
      b0:	02080001 	andeq	r0, r8, #1
      b4:	0001007d 	andeq	r0, r1, sp, ror r0
      b8:	00000394 	muleq	r0, r4, r3
      bc:	00560002 	subseq	r0, r6, r2
      c0:	01040000 	mrseq	r0, (UNDEF: 4)
      c4:	00002e38 	andeq	r2, r0, r8, lsr lr
      c8:	003f470c 	eorseq	r4, pc, ip, lsl #14
      cc:	00151100 	andseq	r1, r5, r0, lsl #2
      d0:	00003800 	andeq	r3, r0, r0, lsl #16
	...
      dc:	00012f00 	andeq	r2, r1, r0, lsl #30
      e0:	00004e00 	andeq	r4, r0, r0, lsl #28
      e4:	06010200 	streq	r0, [r1], -r0, lsl #4
      e8:	0000217d 	andeq	r2, r0, sp, ror r1
      ec:	aa080102 	bge	2004fc <_Min_Stack_Size+0x2000fc>
      f0:	02000022 	andeq	r0, r0, #34	@ 0x22
      f4:	059b0502 	ldreq	r0, [fp, #1282]	@ 0x502
      f8:	02020000 	andeq	r0, r2, #0
      fc:	0026dd07 	eoreq	sp, r6, r7, lsl #26
     100:	05040200 	streq	r0, [r4, #-512]	@ 0xfffffe00
     104:	00002001 	andeq	r2, r0, r1
     108:	74070402 	strvc	r0, [r7], #-1026	@ 0xfffffbfe
     10c:	0200001d 	andeq	r0, r0, #29
     110:	12220508 	eorne	r0, r2, #8, 10	@ 0x2000000
     114:	08020000 	stmdaeq	r2, {}	@ <UNPREDICTABLE>
     118:	002bb607 	eoreq	fp, fp, r7, lsl #12
     11c:	05040300 	streq	r0, [r4, #-768]	@ 0xfffffd00
     120:	00746e69 	rsbseq	r6, r4, r9, ror #28
     124:	61070402 	tstvs	r7, r2, lsl #8
     128:	02000020 	andeq	r0, r0, #32
     12c:	f0a60408 			@ <UNDEFINED> instruction: 0xf0a60408
     130:	04040000 	streq	r0, [r4], #-0
     134:	00000080 	andeq	r0, r0, r0, lsl #1
     138:	01020105 	tsteq	r2, r5, lsl #2
     13c:	00218408 	eoreq	r8, r1, r8, lsl #8
     140:	01070600 	tsteq	r7, r0, lsl #12
     144:	00000034 	andeq	r0, r0, r4, lsr r0
     148:	b0062102 	andlt	r2, r6, r2, lsl #2
     14c:	07000000 	streq	r0, [r0, -r0]
     150:	000109fd 	strdeq	r0, [r1], -sp
     154:	09900700 	ldmibeq	r0, {r8, r9, sl}
     158:	07010001 	streq	r0, [r1, -r1]
     15c:	0000d15f 	andeq	sp, r0, pc, asr r1
     160:	77920702 	ldrvc	r0, [r2, r2, lsl #14]
     164:	00030000 	andeq	r0, r3, r0
     168:	34010706 	strcc	r0, [r1], #-1798	@ 0xfffff8fa
     16c:	02000000 	andeq	r0, r0, #0
     170:	00cb072b 	sbceq	r0, fp, fp, lsr #14
     174:	f3070000 	vhadd.u8	d0, d7, d0
     178:	00000126 	andeq	r0, r0, r6, lsr #2
     17c:	00804f07 	addeq	r4, r0, r7, lsl #30
     180:	08000100 	stmdaeq	r0, {r8}
     184:	02280208 	eoreq	r0, r8, #8, 4	@ 0x80000000
     188:	000000f3 	strdeq	r0, [r0], -r3
     18c:	00ec5c09 	rsceq	r5, ip, r9, lsl #24
     190:	092e0200 	stmdbeq	lr!, {r9}
     194:	000000b0 	strheq	r0, [r0], -r0	@ <UNPREDICTABLE>
     198:	09002302 	stmdbeq	r0, {r1, r8, r9, sp}
     19c:	0000c1e4 	andeq	ip, r0, r4, ror #3
     1a0:	6c0c2f02 	stcvs	15, cr2, [ip], {2}
     1a4:	02000000 	andeq	r0, r0, #0
     1a8:	08000423 	stmdaeq	r0, {r0, r1, r5, sl}
     1ac:	09160244 	ldmdbeq	r6, {r2, r6, r9}
     1b0:	00000193 	muleq	r0, r3, r1
     1b4:	0076ae09 	rsbseq	sl, r6, r9, lsl #28
     1b8:	0b180200 	bleq	6009c0 <_Min_Stack_Size+0x6005c0>
     1bc:	0000006c 	andeq	r0, r0, ip, rrx
     1c0:	09002302 	stmdbeq	r0, {r1, r8, r9, sp}
     1c4:	00009ad4 	ldrdeq	r9, [r0], -r4
     1c8:	34101902 	ldrcc	r1, [r0], #-2306	@ 0xfffff6fe
     1cc:	02000000 	andeq	r0, r0, #0
     1d0:	15090423 	strne	r0, [r9, #-1059]	@ 0xfffffbdd
     1d4:	0200005c 	andeq	r0, r0, #92	@ 0x5c
     1d8:	007a091a 	rsbseq	r0, sl, sl, lsl r9
     1dc:	23020000 	movwcs	r0, #8192	@ 0x2000
     1e0:	f5cb0908 			@ <UNDEFINED> instruction: 0xf5cb0908
     1e4:	1b020000 	blne	801ec <_Min_Stack_Size+0x7fdec>
     1e8:	00019307 	andeq	r9, r1, r7, lsl #6
     1ec:	0c230200 	sfmeq	f0, 4, [r3], #-0
     1f0:	003c1809 	eorseq	r1, ip, r9, lsl #16
     1f4:	0b1c0200 	bleq	7009fc <_Min_Stack_Size+0x7005fc>
     1f8:	0000006c 	andeq	r0, r0, ip, rrx
     1fc:	09102302 	ldmdbeq	r0, {r1, r8, r9, sp}
     200:	0001027c 	andeq	r0, r1, ip, ror r2
     204:	6c0b1d02 	stcvs	13, cr1, [fp], {2}
     208:	02000000 	andeq	r0, r0, #0
     20c:	6c091423 	cfstrsvs	mvf1, [r9], {35}	@ 0x23
     210:	0200003a 	andeq	r0, r0, #58	@ 0x3a
     214:	019a0c1e 	orrseq	r0, sl, lr, lsl ip
     218:	23020000 	movwcs	r0, #8192	@ 0x2000
     21c:	5ddd0918 	vldrpl.16	s1, [sp, #48]	@ 0x30	@ <UNPREDICTABLE>
     220:	1f020000 	svcne	0x00020000
     224:	0001a007 	andeq	sl, r1, r7
     228:	1c230200 	sfmne	f0, 4, [r3], #-0
     22c:	00b9b609 	adcseq	fp, r9, r9, lsl #12
     230:	08260200 	stmdaeq	r6!, {r9}
     234:	00000089 	andeq	r0, r0, r9, lsl #1
     238:	093a2302 	ldmdbeq	sl!, {r1, r8, r9, sp}
     23c:	00007214 	andeq	r7, r0, r4, lsl r2
     240:	cb083002 	blgt	20c250 <_Min_Stack_Size+0x20be50>
     244:	02000000 	andeq	r0, r0, #0
     248:	02003c23 	andeq	r3, r0, #8960	@ 0x2300
     24c:	f0290201 			@ <UNDEFINED> instruction: 0xf0290201
     250:	04040000 	streq	r0, [r4], #-0
     254:	0000006c 	andeq	r0, r0, ip, rrx
     258:	0000820a 	andeq	r8, r0, sl, lsl #4
     25c:	0001b000 	andeq	fp, r1, r0
     260:	006c0b00 	rsbeq	r0, ip, r0, lsl #22
     264:	001d0000 	andseq	r0, sp, r0
     268:	009ee70c 	addseq	lr, lr, ip, lsl #14
     26c:	07320200 	ldreq	r0, [r2, -r0, lsl #4]!
     270:	000000f3 	strdeq	r0, [r0], -r3
     274:	10031408 	andne	r1, r3, r8, lsl #8
     278:	00021109 	andeq	r1, r2, r9, lsl #2
     27c:	aaeb0900 	bge	ffac2684 <_estack+0xdfabfe84>
     280:	11030000 	mrsne	r0, (UNDEF: 3)
     284:	00006c0f 	andeq	r6, r0, pc, lsl #24
     288:	00230200 	eoreq	r0, r3, r0, lsl #4
     28c:	00ddef09 	sbcseq	lr, sp, r9, lsl #30
     290:	10120300 	andsne	r0, r2, r0, lsl #6
     294:	00000211 	andeq	r0, r0, r1, lsl r2
     298:	09042302 	stmdbeq	r4, {r1, r8, r9, sp}
     29c:	0000d649 	andeq	sp, r0, r9, asr #12
     2a0:	11101303 	tstne	r0, r3, lsl #6
     2a4:	02000002 	andeq	r0, r0, #2
     2a8:	05090823 	streq	r0, [r9, #-2083]	@ 0xfffff7dd
     2ac:	030000e1 	movweq	r0, #225	@ 0xe1
     2b0:	02111014 	andseq	r1, r1, #20
     2b4:	23020000 	movwcs	r0, #8192	@ 0x2000
     2b8:	3fd4090c 	svccc	0x00d4090c
     2bc:	15030000 	strne	r0, [r3, #-0]
     2c0:	00006c10 	andeq	r6, r0, r0, lsl ip
     2c4:	10230200 	eorne	r0, r3, r0, lsl #4
     2c8:	17040400 	strne	r0, [r4, -r0, lsl #8]
     2cc:	04000002 	streq	r0, [r0], #-2
     2d0:	0001b004 	andeq	fp, r1, r4
     2d4:	c2fd0c00 	rscsgt	r0, sp, #0, 24
     2d8:	16030000 	strne	r0, [r3], -r0
     2dc:	0001bc02 	andeq	fp, r1, r2, lsl #24
     2e0:	01070600 	tsteq	r7, r0, lsl #12
     2e4:	00000034 	andeq	r0, r0, r4, lsr r0
     2e8:	500d1803 	andpl	r1, sp, r3, lsl #16
     2ec:	07000002 	streq	r0, [r0, -r2]
     2f0:	0000d817 	andeq	sp, r0, r7, lsl r8
     2f4:	77c60700 	strbvc	r0, [r6, r0, lsl #14]
     2f8:	07010000 	streq	r0, [r1, -r0]
     2fc:	000031e2 	andeq	r3, r0, r2, ror #3
     300:	58350702 	ldmdapl	r5!, {r1, r8, r9, sl}
     304:	00030000 	andeq	r0, r3, r0
     308:	00d06c0c 	sbcseq	r6, r0, ip, lsl #24
     30c:	021e0300 	andseq	r0, lr, #0, 6
     310:	00000229 	andeq	r0, r0, r9, lsr #4
     314:	b67b010d 	ldrbtlt	r0, [fp], -sp, lsl #2
     318:	63010000 	movwvs	r0, #4096	@ 0x1000
     31c:	00000106 	andeq	r0, r0, r6, lsl #2
     320:	00000000 	andeq	r0, r0, r0
     324:	7d020000 	stcvc	0, cr0, [r2, #-0]
     328:	02850100 	addeq	r0, r5, #0, 2
     32c:	b90e0000 	stmdblt	lr, {}	@ <UNPREDICTABLE>
     330:	01000076 	tsteq	r0, r6, ror r0
     334:	02851e63 	addeq	r1, r5, #1584	@ 0x630
     338:	50010000 	andpl	r0, r1, r0
     33c:	1d040400 	cfstrsne	mvf0, [r4, #-0]
     340:	0f000002 	svceq	0x00000002
     344:	00454101 	subeq	r4, r5, r1, lsl #2
     348:	0f570100 	svceq	0x00570100
     34c:	00025001 	andeq	r5, r2, r1
	...
     358:	007d0200 	rsbseq	r0, sp, r0, lsl #4
     35c:	0002be01 	andeq	fp, r2, r1, lsl #28
     360:	76b91000 	ldrtvc	r1, [r9], r0
     364:	57010000 	strpl	r0, [r1, -r0]
     368:	00028529 	andeq	r8, r2, r9, lsr #10
     36c:	00001000 	andeq	r1, r0, r0
     370:	00000000 	andeq	r0, r0, r0
     374:	010f0000 	mrseq	r0, CPSR
     378:	0000fd13 	andeq	pc, r0, r3, lsl sp	@ <UNPREDICTABLE>
     37c:	010f3b01 	tsteq	pc, r1, lsl #22
     380:	00000250 	andeq	r0, r0, r0, asr r2
	...
     38c:	01007d02 	tsteq	r0, r2, lsl #26
     390:	00000305 	andeq	r0, r0, r5, lsl #6
     394:	0076b910 	rsbseq	fp, r6, r0, lsl r9
     398:	293b0100 	ldmdbcs	fp!, {r8}
     39c:	00000285 	andeq	r0, r0, r5, lsl #5
     3a0:	0000008c 	andeq	r0, r0, ip, lsl #1
     3a4:	0000007c 	andeq	r0, r0, ip, ror r0
     3a8:	00e35610 	rsceq	r5, r3, r0, lsl r6
     3ac:	3d3b0100 	ldfccs	f0, [fp, #-0]
     3b0:	00000211 	andeq	r0, r0, r1, lsl r2
     3b4:	000000fe 	strdeq	r0, [r0], -lr
     3b8:	000000f8 	strdeq	r0, [r0], -r8
     3bc:	ca010f00 	bgt	43fc4 <_Min_Stack_Size+0x43bc4>
     3c0:	010000ba 	strheq	r0, [r0, -sl]
     3c4:	50010f1d 	andpl	r0, r1, sp, lsl pc
     3c8:	00000002 	andeq	r0, r0, r2
     3cc:	00000000 	andeq	r0, r0, r0
     3d0:	02000000 	andeq	r0, r0, #0
     3d4:	4c01007d 	stcmi	0, cr0, [r1], {125}	@ 0x7d
     3d8:	10000003 	andne	r0, r0, r3
     3dc:	000076b9 			@ <UNDEFINED> instruction: 0x000076b9
     3e0:	85291d01 	strhi	r1, [r9, #-3329]!	@ 0xfffff2ff
     3e4:	3a000002 	bcc	3f4 <_Min_Heap_Size+0x1f4>
     3e8:	2a000001 	bcs	3f4 <_Min_Heap_Size+0x1f4>
     3ec:	10000001 	andne	r0, r0, r1
     3f0:	0000e356 	andeq	lr, r0, r6, asr r3
     3f4:	173b1d01 	ldrne	r1, [fp, -r1, lsl #26]!
     3f8:	ac000002 	stcge	0, cr0, [r0], {2}
     3fc:	a6000001 	strge	r0, [r0], -r1
     400:	00000001 	andeq	r0, r0, r1
     404:	b35a0111 	cmplt	sl, #1073741828	@ 0x40000004
     408:	0c010000 	stceq	0, cr0, [r1], {-0}
     40c:	0250010f 	subseq	r0, r0, #-1073741821	@ 0xc0000003
     410:	01880000 	orreq	r0, r8, r0
     414:	019e0800 	orrseq	r0, lr, r0, lsl #16
     418:	7d020800 	stcvc	8, cr0, [r2, #-0]
     41c:	b9100100 	ldmdblt	r0, {r8}
     420:	01000076 	tsteq	r0, r6, ror r0
     424:	0285260c 	addeq	r2, r5, #12, 12	@ 0xc00000
     428:	01e00000 	mvneq	r0, r0
     42c:	01d80000 	bicseq	r0, r8, r0
     430:	6b0e0000 	blvs	380438 <_Min_Stack_Size+0x380038>
     434:	010000a4 	smlatbeq	r0, r4, r0, r0
     438:	0211390c 	andseq	r3, r1, #12, 18	@ 0x30000
     43c:	51010000 	mrspl	r0, (UNDEF: 1)
     440:	003fd40e 	eorseq	sp, pc, lr, lsl #8
     444:	4d0c0100 	stfmis	f0, [ip, #-0]
     448:	0000006c 	andeq	r0, r0, ip, rrx
     44c:	00005201 	andeq	r5, r0, r1, lsl #4
     450:	00000584 	andeq	r0, r0, r4, lsl #11
     454:	016d0002 	cmneq	sp, r2
     458:	01040000 	mrseq	r0, (UNDEF: 4)
     45c:	00002e38 	andeq	r2, r0, r8, lsr lr
     460:	0109470c 	tsteq	r9, ip, lsl #14
     464:	00151100 	andseq	r1, r5, r0, lsl #2
     468:	00008000 	andeq	r8, r0, r0
	...
     474:	000a2400 	andeq	r2, sl, r0, lsl #8
     478:	0013a800 	andseq	sl, r3, r0, lsl #16
     47c:	05040200 	streq	r0, [r4, #-512]	@ 0xfffffe00
     480:	00746e69 	rsbseq	r6, r4, r9, ror #28
     484:	61070403 	tstvs	r7, r3, lsl #8
     488:	03000020 	movweq	r0, #32
     48c:	12220508 	eorne	r0, r2, #8, 10	@ 0x2000000
     490:	08030000 	stmdaeq	r3, {}	@ <UNPREDICTABLE>
     494:	00f0a604 	rscseq	sl, r0, r4, lsl #12
     498:	06010300 	streq	r0, [r1], -r0, lsl #6
     49c:	0000217d 	andeq	r2, r0, sp, ror r1
     4a0:	aa080103 	bge	2008b4 <_Min_Stack_Size+0x2004b4>
     4a4:	03000022 	movweq	r0, #34	@ 0x22
     4a8:	059b0502 	ldreq	r0, [fp, #1282]	@ 0x502
     4ac:	02030000 	andeq	r0, r3, #0
     4b0:	0026dd07 	eoreq	sp, r6, r7, lsl #26
     4b4:	05040300 	streq	r0, [r4, #-768]	@ 0xfffffd00
     4b8:	00002001 	andeq	r2, r0, r1
     4bc:	74070403 	strvc	r0, [r7], #-1027	@ 0xfffffbfd
     4c0:	0300001d 	movweq	r0, #29
     4c4:	2bb60708 	blcs	fed820ec <_estack+0xded7f8ec>
     4c8:	04040000 	streq	r0, [r4], #-0
     4cc:	00000080 	andeq	r0, r0, r0, lsl #1
     4d0:	01030105 	tsteq	r3, r5, lsl #2
     4d4:	00218408 	eoreq	r8, r1, r8, lsl #8
     4d8:	09760600 	ldmdbeq	r6!, {r9, sl}^
     4dc:	14020001 	strne	r0, [r2], #-1
     4e0:	00003416 	andeq	r3, r0, r6, lsl r4
     4e4:	06010100 	streq	r0, [r1], -r0, lsl #2
     4e8:	00010897 	muleq	r1, r7, r8
     4ec:	34161502 	ldrcc	r1, [r6], #-1282	@ 0xfffffafe
     4f0:	01000000 	mrseq	r0, (UNDEF: 0)
     4f4:	01070701 	tsteq	r7, r1, lsl #14
     4f8:	00000050 	andeq	r0, r0, r0, asr r0
     4fc:	c6051003 	strgt	r1, [r5], -r3
     500:	08000000 	stmdaeq	r0, {}	@ <UNPREDICTABLE>
     504:	00010887 	andeq	r0, r1, r7, lsl #17
     508:	09b60800 	ldmibeq	r6!, {fp}
     50c:	08010001 	stmdaeq	r1, {r0}
     510:	00010924 	andeq	r0, r1, r4, lsr #18
     514:	37090002 	strcc	r0, [r9, -r2]
     518:	03000109 	movweq	r0, #265	@ 0x109
     51c:	00a50714 	adceq	r0, r5, r4, lsl r7
     520:	07070000 	streq	r0, [r7, -r0]
     524:	00005001 	andeq	r5, r0, r1
     528:	06210300 	strteq	r0, [r1], -r0, lsl #6
     52c:	000000f9 	strdeq	r0, [r0], -r9
     530:	0109fd08 	tsteq	r9, r8, lsl #26	@ <UNPREDICTABLE>
     534:	90080000 	andls	r0, r8, r0
     538:	01000109 	tsteq	r0, r9, lsl #2
     53c:	00d15f08 	sbcseq	r5, r1, r8, lsl #30
     540:	92080200 	andls	r0, r8, #0, 4
     544:	03000077 	movweq	r0, #119	@ 0x77
     548:	01070700 	tsteq	r7, r0, lsl #14
     54c:	00000050 	andeq	r0, r0, r0, asr r0
     550:	14072b03 	strne	r2, [r7], #-2819	@ 0xfffff4fd
     554:	08000001 	stmdaeq	r0, {r0}
     558:	000126f3 	strdeq	r2, [r1], -r3
     55c:	804f0800 	subhi	r0, pc, r0, lsl #16
     560:	00010000 	andeq	r0, r1, r0
     564:	2803080a 	stmdacs	r3, {r1, r3, fp}
     568:	00013c02 	andeq	r3, r1, r2, lsl #24
     56c:	ec5c0b00 	mrrc	11, 0, r0, ip, cr0
     570:	2e030000 	cdpcs	0, 0, cr0, cr3, cr0, {0}
     574:	0000f909 	andeq	pc, r0, r9, lsl #18
     578:	00230200 	eoreq	r0, r3, r0, lsl #4
     57c:	00c1e40b 	sbceq	lr, r1, fp, lsl #8
     580:	0c2f0300 	stceq	3, cr0, [pc], #-0	@ 588 <_Min_Stack_Size+0x188>
     584:	00000034 	andeq	r0, r0, r4, lsr r0
     588:	00042302 	andeq	r2, r4, r2, lsl #6
     58c:	1603440a 	strne	r4, [r3], -sl, lsl #8
     590:	0001dc09 	andeq	sp, r1, r9, lsl #24
     594:	76ae0b00 	strtvc	r0, [lr], r0, lsl #22
     598:	18030000 	stmdane	r3, {}	@ <UNPREDICTABLE>
     59c:	0000340b 	andeq	r3, r0, fp, lsl #8
     5a0:	00230200 	eoreq	r0, r3, r0, lsl #4
     5a4:	009ad40b 	addseq	sp, sl, fp, lsl #8
     5a8:	10190300 	andsne	r0, r9, r0, lsl #6
     5ac:	00000050 	andeq	r0, r0, r0, asr r0
     5b0:	0b042302 	bleq	1091c0 <_Min_Stack_Size+0x108dc0>
     5b4:	00005c15 	andeq	r5, r0, r5, lsl ip
     5b8:	7a091a03 	bvc	246dcc <_Min_Stack_Size+0x2469cc>
     5bc:	02000000 	andeq	r0, r0, #0
     5c0:	cb0b0823 	blgt	2c2654 <_Min_Stack_Size+0x2c2254>
     5c4:	030000f5 	movweq	r0, #245	@ 0xf5
     5c8:	01dc071b 	bicseq	r0, ip, fp, lsl r7
     5cc:	23020000 	movwcs	r0, #8192	@ 0x2000
     5d0:	3c180b0c 			@ <UNDEFINED> instruction: 0x3c180b0c
     5d4:	1c030000 	stcne	0, cr0, [r3], {-0}
     5d8:	0000340b 	andeq	r3, r0, fp, lsl #8
     5dc:	10230200 	eorne	r0, r3, r0, lsl #4
     5e0:	01027c0b 	tsteq	r2, fp, lsl #24
     5e4:	0b1d0300 	bleq	7411ec <_Min_Stack_Size+0x740dec>
     5e8:	00000034 	andeq	r0, r0, r4, lsr r0
     5ec:	0b142302 	bleq	5091fc <_Min_Stack_Size+0x508dfc>
     5f0:	00003a6c 	andeq	r3, r0, ip, ror #20
     5f4:	e30c1e03 	movw	r1, #52739	@ 0xce03
     5f8:	02000001 	andeq	r0, r0, #1
     5fc:	dd0b1823 	stcle	8, cr1, [fp, #-140]	@ 0xffffff74
     600:	0300005d 	movweq	r0, #93	@ 0x5d
     604:	01e9071f 	mvneq	r0, pc, lsl r7
     608:	23020000 	movwcs	r0, #8192	@ 0x2000
     60c:	b9b60b1c 	ldmiblt	r6!, {r2, r3, r4, r8, r9, fp}
     610:	26030000 	strcs	r0, [r3], -r0
     614:	0000d208 	andeq	sp, r0, r8, lsl #4
     618:	3a230200 	bcc	8c0e20 <_Min_Stack_Size+0x8c0a20>
     61c:	0072140b 	rsbseq	r1, r2, fp, lsl #8
     620:	08300300 	ldmdaeq	r0!, {r8, r9}
     624:	00000114 	andeq	r0, r0, r4, lsl r1
     628:	003c2302 	eorseq	r2, ip, r2, lsl #6
     62c:	29020103 	stmdbcs	r2, {r0, r1, r8}
     630:	040000f0 	streq	r0, [r0], #-240	@ 0xffffff10
     634:	00003404 	andeq	r3, r0, r4, lsl #8
     638:	00820c00 	addeq	r0, r2, r0, lsl #24
     63c:	01f90000 	mvnseq	r0, r0
     640:	340d0000 	strcc	r0, [sp], #-0
     644:	1d000000 	stcne	0, cr0, [r0, #-0]
     648:	9ee70900 	vfmals.f16	s1, s14, s0	@ <UNPREDICTABLE>
     64c:	32030000 	andcc	r0, r3, #0
     650:	00013c07 	andeq	r3, r1, r7, lsl #24
     654:	04140a00 	ldreq	r0, [r4], #-2560	@ 0xfffff600
     658:	025a0910 	subseq	r0, sl, #16, 18	@ 0x40000
     65c:	eb0b0000 	bl	2c0664 <_Min_Stack_Size+0x2c0264>
     660:	040000aa 	streq	r0, [r0], #-170	@ 0xffffff56
     664:	00340f11 	eorseq	r0, r4, r1, lsl pc
     668:	23020000 	movwcs	r0, #8192	@ 0x2000
     66c:	ddef0b00 			@ <UNDEFINED> instruction: 0xddef0b00
     670:	12040000 	andne	r0, r4, #0
     674:	00025a10 	andeq	r5, r2, r0, lsl sl
     678:	04230200 	strteq	r0, [r3], #-512	@ 0xfffffe00
     67c:	00d6490b 	sbcseq	r4, r6, fp, lsl #18
     680:	10130400 	andsne	r0, r3, r0, lsl #8
     684:	0000025a 	andeq	r0, r0, sl, asr r2
     688:	0b082302 	bleq	209298 <_Min_Stack_Size+0x208e98>
     68c:	0000e105 	andeq	lr, r0, r5, lsl #2
     690:	5a101404 	bpl	4056a8 <_Min_Stack_Size+0x4052a8>
     694:	02000002 	andeq	r0, r0, #2
     698:	d40b0c23 	strle	r0, [fp], #-3107	@ 0xfffff3dd
     69c:	0400003f 	streq	r0, [r0], #-63	@ 0xffffffc1
     6a0:	00341015 	eorseq	r1, r4, r5, lsl r0
     6a4:	23020000 	movwcs	r0, #8192	@ 0x2000
     6a8:	04040010 	streq	r0, [r4], #-16
     6ac:	00000260 	andeq	r0, r0, r0, ror #4
     6b0:	01f90404 	mvnseq	r0, r4, lsl #8
     6b4:	fd090000 	stc2	0, cr0, [r9, #-0]
     6b8:	040000c2 	streq	r0, [r0], #-194	@ 0xffffff3e
     6bc:	02050216 	andeq	r0, r5, #1610612737	@ 0x60000001
     6c0:	07070000 	streq	r0, [r7, -r0]
     6c4:	00005001 	andeq	r5, r0, r1
     6c8:	0d180400 	cfldrseq	mvf0, [r8, #-0]
     6cc:	00000299 	muleq	r0, r9, r2
     6d0:	00d81708 	sbcseq	r1, r8, r8, lsl #14
     6d4:	c6080000 	strgt	r0, [r8], -r0
     6d8:	01000077 	tsteq	r0, r7, ror r0
     6dc:	0031e208 	eorseq	lr, r1, r8, lsl #4
     6e0:	35080200 	strcc	r0, [r8, #-512]	@ 0xfffffe00
     6e4:	03000058 	movweq	r0, #88	@ 0x58
     6e8:	d06c0900 	rsble	r0, ip, r0, lsl #18
     6ec:	1e040000 	cdpne	0, 0, cr0, cr4, cr0, {0}
     6f0:	00027202 	andeq	r7, r2, r2, lsl #4
     6f4:	01070700 	tsteq	r7, r0, lsl #14
     6f8:	00000050 	andeq	r0, r0, r0, asr r0
     6fc:	c0061601 	andgt	r1, r6, r1, lsl #12
     700:	08000002 	stmdaeq	r0, {r1}
     704:	000109fa 	strdeq	r0, [r1], -sl
     708:	098d0800 	stmibeq	sp, {fp}
     70c:	00010001 	andeq	r0, r1, r1
     710:	0101ac0e 	tsteq	r1, lr, lsl #24
     714:	034a010c 	movteq	r0, #41228	@ 0xa10c
     718:	d30b0000 	movwle	r0, #45056	@ 0xb000
     71c:	01000108 	tsteq	r0, r8, lsl #2
     720:	034a0c0e 	movteq	r0, #44046	@ 0xac0e
     724:	23020000 	movwcs	r0, #8192	@ 0x2000
     728:	0a440b00 	beq	1103330 <_Min_Stack_Size+0x1102f30>
     72c:	0f010001 	svceq	0x00010001
     730:	0000340b 	andeq	r3, r0, fp, lsl #8
     734:	90230300 	eorls	r0, r3, r0, lsl #6
     738:	0a1a0b03 	beq	68334c <_Min_Stack_Size+0x682f4c>
     73c:	10010001 	andne	r0, r1, r1
     740:	0000340b 	andeq	r3, r0, fp, lsl #8
     744:	94230300 	strtls	r0, [r3], #-768	@ 0xfffffd00
     748:	09e90b03 	stmibeq	r9!, {r0, r1, r8, r9, fp}^
     74c:	11010001 	tstne	r1, r1
     750:	0000340b 	andeq	r3, r0, fp, lsl #8
     754:	98230300 	stmdals	r3!, {r8, r9}
     758:	09000b03 	stmdbeq	r0, {r0, r1, r8, r9, fp}
     75c:	12010001 	andne	r0, r1, #1
     760:	0000340b 	andeq	r3, r0, fp, lsl #8
     764:	9c230300 	stcls	3, cr0, [r3], #-0
     768:	089e0b03 	ldmeq	lr, {r0, r1, r8, r9, fp}
     76c:	13010001 	movwne	r0, #4097	@ 0x1001
     770:	0002600c 	andeq	r6, r2, ip
     774:	a0230300 	eorge	r0, r3, r0, lsl #6
     778:	09830b03 	stmibeq	r3, {r0, r1, r8, r9, fp}
     77c:	14010001 	strne	r0, [r1], #-1
     780:	0002600c 	andeq	r6, r2, ip
     784:	a4230300 	strtge	r0, [r3], #-768	@ 0xfffffd00
     788:	08c90b03 	stmiaeq	r9, {r0, r1, r8, r9, fp}^
     78c:	19010001 	stmdbne	r1, {r0}
     790:	0002a508 	andeq	sl, r2, r8, lsl #10
     794:	a8230300 	stmdage	r3!, {r8, r9}
     798:	600c0003 	andvs	r0, ip, r3
     79c:	5a000002 	bpl	7ac <_Min_Stack_Size+0x3ac>
     7a0:	0d000003 	stceq	0, cr0, [r0, #-12]
     7a4:	00000034 	andeq	r0, r0, r4, lsr r0
     7a8:	0f0f0063 	svceq	0x000f0063
     7ac:	0100010a 	tsteq	r0, sl, lsl #2
     7b0:	02c0071b 	sbceq	r0, r0, #7077888	@ 0x6c0000
     7b4:	05010000 	streq	r0, [r1, #-0]
     7b8:	00020403 	andeq	r0, r2, r3, lsl #8
     7bc:	09aa0f20 	stmibeq	sl!, {r5, r8, r9, sl, fp}
     7c0:	4c010001 	stcmi	0, cr0, [r1], {1}
     7c4:	0002660c 	andeq	r6, r2, ip, lsl #12
     7c8:	03050100 	movweq	r0, #20736	@ 0x5100
     7cc:	200001f0 	strdcs	r0, [r0], -r0	@ <UNPREDICTABLE>
     7d0:	0109130f 	tsteq	r9, pc, lsl #6
     7d4:	0b4d0100 	bleq	1340bdc <_Min_Stack_Size+0x13407dc>
     7d8:	0000034a 	andeq	r0, r0, sl, asr #6
     7dc:	60030501 	andvs	r0, r3, r1, lsl #10
     7e0:	0f200000 	svceq	0x00200000
     7e4:	00010a05 	andeq	r0, r1, r5, lsl #20
     7e8:	f90a4e01 			@ <UNDEFINED> instruction: 0xf90a4e01
     7ec:	01000001 	tsteq	r0, r1
     7f0:	001c0305 	andseq	r0, ip, r5, lsl #6
     7f4:	01102000 	tsteq	r0, r0
     7f8:	0000b35a 	andeq	fp, r0, sl, asr r3
     7fc:	010f2204 	tsteq	pc, r4, lsl #4
     800:	00000299 	muleq	r0, r9, r2
