NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     804:	0003c901 	andeq	ip, r3, r1, lsl #18
     808:	03c91100 	biceq	r1, r9, #0, 2
     80c:	5a110000 	bpl	440814 <_Min_Stack_Size+0x440414>
     810:	11000002 	tstne	r0, r2
     814:	00000034 	andeq	r0, r0, r4, lsr r0
     818:	66040400 	strvs	r0, [r4], -r0, lsl #8
     81c:	12000002 	andne	r0, r0, #2
     820:	0108b601 	tsteq	r8, r1, lsl #12
     824:	11940100 	orrsne	r0, r4, r0, lsl #2
     828:	0000c601 	andeq	ip, r0, r1, lsl #12
     82c:	00020c00 	andeq	r0, r2, r0, lsl #24
     830:	00024808 	andeq	r4, r2, r8, lsl #16
     834:	00021a08 	andeq	r1, r2, r8, lsl #20
     838:	04270100 	strteq	r0, [r7], #-256	@ 0xffffff00
     83c:	7e130000 	cdpvc	0, 1, cr0, cr3, cr0, {0}
     840:	01000109 	tsteq	r0, r9, lsl #2
     844:	02602e94 	rsbeq	r2, r0, #148, 28	@ 0x940
     848:	024e0000 	subeq	r0, lr, #0
     84c:	02460000 	subeq	r0, r6, #0
     850:	db140000 	blle	500858 <_Min_Stack_Size+0x500458>
     854:	01000108 	tsteq	r0, r8, lsl #2
     858:	00c61596 	smulleq	r1, r6, r6, r5
     85c:	02890000 	addeq	r0, r9, #0
     860:	02850000 	addeq	r0, r5, #0
     864:	34150000 	ldrcc	r0, [r5], #-0
     868:	27080002 	strcs	r0, [r8, -r2]
     86c:	16000004 	strne	r0, [r0], -r4
     870:	74025001 	strvc	r5, [r2], #-1
     874:	17000000 	strne	r0, [r0, -r0]
     878:	01099801 	tsteq	r9, r1, lsl #16
     87c:	06700100 	ldrbteq	r0, [r0], -r0, lsl #2
     880:	0001cc01 	andeq	ip, r1, r1, lsl #24
     884:	00020c08 	andeq	r0, r2, r8, lsl #24
     888:	0002a908 	andeq	sl, r2, r8, lsl #18
     88c:	04690100 	strbteq	r0, [r9], #-256	@ 0xffffff00
     890:	7e180000 	cdpvc	0, 1, cr0, cr8, cr0, {0}
     894:	01000109 	tsteq	r0, r9, lsl #2
     898:	02602270 	rsbeq	r2, r0, #112, 4
     89c:	50010000 	andpl	r0, r1, r0
     8a0:	00006819 	andeq	r6, r0, r9, lsl r8
     8a4:	006a1a00 	rsbeq	r1, sl, r0, lsl #20
     8a8:	2d0e8c01 	stccs	12, cr8, [lr, #-4]
     8ac:	dd000000 	stcle	0, cr0, [r0, #-0]
     8b0:	d5000002 	strle	r0, [r0, #-2]
     8b4:	00000002 	andeq	r0, r0, r2
     8b8:	cd011b00 	vstrgt	d1, [r1, #-0]
     8bc:	01000109 	tsteq	r0, r9, lsl #2
     8c0:	019e0669 	orrseq	r0, lr, r9, ror #12
     8c4:	01a20800 			@ <UNDEFINED> instruction: 0x01a20800
     8c8:	7d020800 	stcvc	8, cr0, [r2, #-0]
     8cc:	011c0100 	tsteq	ip, r0, lsl #2
     8d0:	00010a38 	andeq	r0, r1, r8, lsr sl
     8d4:	c6115101 	ldrgt	r5, [r1], -r1, lsl #2
     8d8:	48000000 	stmdami	r0, {}	@ <UNPREDICTABLE>
     8dc:	a8080002 	stmdage	r8, {r1}
     8e0:	1e080002 	cdpne	0, 0, cr0, cr8, cr2, {0}
     8e4:	01000003 	tsteq	r0, r3
     8e8:	000004f0 	strdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
     8ec:	0108db14 	tsteq	r8, r4, lsl fp
     8f0:	15550100 	ldrbne	r0, [r5, #-256]	@ 0xffffff00
     8f4:	000000c6 	andeq	r0, r0, r6, asr #1
     8f8:	00000344 	andeq	r0, r0, r4, asr #6
     8fc:	0000033e 	andeq	r0, r0, lr, lsr r3
     900:	0002561d 	andeq	r5, r2, sp, lsl r6
     904:	0004f008 	andeq	pc, r4, r8
     908:	02601e00 	rsbeq	r1, r0, #0, 28
     90c:	03a60800 			@ <UNDEFINED> instruction: 0x03a60800
     910:	04df0000 	ldrbeq	r0, [pc], #0	@ 918 <_Min_Stack_Size+0x518>
     914:	01160000 	tsteq	r6, r0
     918:	f0030550 			@ <UNDEFINED> instruction: 0xf0030550
     91c:	16200001 	strtne	r0, [r0], -r1
     920:	03055101 	movweq	r5, #20737	@ 0x5101
     924:	20000060 	andcs	r0, r0, r0, rrx
     928:	02520116 	subseq	r0, r2, #-2147483643	@ 0x80000005
     92c:	15006408 	strne	r6, [r0, #-1032]	@ 0xfffffbf8
     930:	08000286 	stmdaeq	r0, {r1, r2, r7, r9}
     934:	000003cf 	andeq	r0, r0, pc, asr #7
     938:	02500116 	subseq	r0, r0, #-2147483643	@ 0x80000005
     93c:	00006475 	andeq	r6, r0, r5, ror r4
     940:	08ec011b 	stmiaeq	ip!, {r0, r1, r3, r4, r8}^
     944:	45010001 	strmi	r0, [r1, #-1]
     948:	0001a806 	andeq	sl, r1, r6, lsl #16
     94c:	0001cc08 	andeq	ip, r1, r8, lsl #24
     950:	007d0208 	rsbseq	r0, sp, r8, lsl #4
     954:	de011f01 	cdple	15, 0, cr1, cr1, cr1, {0}
     958:	01000109 	tsteq	r0, r9, lsl #2
     95c:	0001062f 	andeq	r0, r1, pc, lsr #12
     960:	00000000 	andeq	r0, r0, r0
     964:	02000000 	andeq	r0, r0, #0
     968:	2e01007d 	mcrcs	0, 0, r0, cr1, cr13, {3}
     96c:	18000005 	stmdane	r0, {r0, r2}
     970:	00010890 	muleq	r1, r0, r8
     974:	2d152f01 	ldccs	15, cr2, [r5, #-4]
     978:	01000000 	mrseq	r0, (UNDEF: 0)
     97c:	01200050 	qsubeq	r0, r0, r0
     980:	0001095b 	andeq	r0, r1, fp, asr r9
     984:	01062a01 	tsteq	r6, r1, lsl #20
     988:	080001a4 	stmdaeq	r0, {r2, r5, r7, r8}
     98c:	080001a6 	stmdaeq	r0, {r1, r2, r5, r7, r8}
     990:	01007d02 	tsteq	r0, r2, lsl #26
     994:	08e5011f 	stmiaeq	r5!, {r0, r1, r2, r3, r4, r8}^
     998:	1d010001 	stcne	0, cr0, [r1, #-4]
     99c:	01a20106 			@ <UNDEFINED> instruction: 0x01a20106
     9a0:	01a40800 			@ <UNDEFINED> instruction: 0x01a40800
     9a4:	7d020800 	stcvc	8, cr0, [r2, #-0]
     9a8:	05810100 	streq	r0, [r1, #256]	@ 0x100
     9ac:	6a180000 	bvs	6009b4 <_Min_Stack_Size+0x6005b4>
     9b0:	01000109 	tsteq	r0, r9, lsl #2
     9b4:	0581121d 	streq	r1, [r1, #541]	@ 0x21d
     9b8:	50010000 	andpl	r0, r1, r0
     9bc:	0108ab14 	tsteq	r8, r4, lsl fp
     9c0:	13200100 	nopne	{0}	@ <UNPREDICTABLE>
     9c4:	00000050 	andeq	r0, r0, r0, asr r0
     9c8:	0000037f 	andeq	r0, r0, pc, ror r3
     9cc:	0000037d 	andeq	r0, r0, sp, ror r3
     9d0:	2d040400 	cfstrscs	mvf0, [r4, #-0]
     9d4:	00000000 	andeq	r0, r0, r0
     9d8:	00000580 	andeq	r0, r0, r0, lsl #11
     9dc:	03830002 	orreq	r0, r3, #2
     9e0:	01040000 	mrseq	r0, (UNDEF: 4)
     9e4:	00002e38 	andeq	r2, r0, r8, lsr lr
     9e8:	0117410c 	tsteq	r7, ip, lsl #2
     9ec:	00151100 	andseq	r1, r5, r0, lsl #2
     9f0:	0000c800 	andeq	ip, r0, r0, lsl #16
	...
     9fc:	00136900 	andseq	r6, r3, r0, lsl #18
     a00:	0017c100 	andseq	ip, r7, r0, lsl #2
     a04:	06010200 	streq	r0, [r1], -r0, lsl #4
     a08:	0000217d 	andeq	r2, r0, sp, ror r1
     a0c:	010db103 	tsteq	sp, r3, lsl #2
     a10:	182b0200 	stmdane	fp!, {r9}
     a14:	00000040 	andeq	r0, r0, r0, asr #32
     a18:	aa080102 	bge	200e28 <_Min_Stack_Size+0x200a28>
     a1c:	02000022 	andeq	r0, r0, #34	@ 0x22
     a20:	059b0502 	ldreq	r0, [fp, #1282]	@ 0x502
     a24:	7c030000 	stcvc	0, cr0, [r3], {-0}
     a28:	02000110 	andeq	r0, r0, #16, 2
     a2c:	005a1939 	subseq	r1, sl, r9, lsr r9
     a30:	02020000 	andeq	r0, r2, #0
     a34:	0026dd07 	eoreq	sp, r6, r7, lsl #26
     a38:	05040200 	streq	r0, [r4, #-512]	@ 0xfffffe00
     a3c:	00002001 	andeq	r2, r0, r1
     a40:	01142b03 	tsteq	r4, r3, lsl #22
     a44:	194f0200 	stmdbne	pc, {r9}^	@ <UNPREDICTABLE>
     a48:	00000074 	andeq	r0, r0, r4, ror r0
     a4c:	74070402 	strvc	r0, [r7], #-1026	@ 0xfffffbfe
     a50:	0200001d 	andeq	r0, r0, #29
     a54:	12220508 	eorne	r0, r2, #8, 10	@ 0x2000000
     a58:	08020000 	stmdaeq	r2, {}	@ <UNPREDICTABLE>
     a5c:	002bb607 	eoreq	fp, fp, r7, lsl #12
     a60:	05040400 	streq	r0, [r4, #-1024]	@ 0xfffffc00
     a64:	00746e69 	rsbseq	r6, r4, r9, ror #28
     a68:	61070402 	tstvs	r7, r2, lsl #8
     a6c:	02000020 	andeq	r0, r0, #32
     a70:	f0a60408 			@ <UNDEFINED> instruction: 0xf0a60408
     a74:	04050000 	streq	r0, [r5], #-0
     a78:	000000a4 	andeq	r0, r0, r4, lsr #1
     a7c:	01020106 	tsteq	r2, r6, lsl #2
     a80:	00218408 	eoreq	r8, r1, r8, lsl #8
     a84:	0db30300 	ldceq	3, cr0, [r3]
     a88:	18030001 	stmdane	r3, {r0}
     a8c:	00003413 	andeq	r3, r0, r3, lsl r4
     a90:	107e0300 	rsbsne	r0, lr, r0, lsl #6
     a94:	24030001 	strcs	r0, [r3], #-1
     a98:	00004e14 	andeq	r4, r0, r4, lsl lr
     a9c:	142d0300 	strtne	r0, [sp], #-768	@ 0xfffffd00
     aa0:	30030001 	andcc	r0, r3, r1
     aa4:	00006814 	andeq	r6, r0, r4, lsl r8
     aa8:	00c50700 	sbceq	r0, r5, r0, lsl #14
     aac:	1c080000 	stcne	0, cr0, [r8], {-0}
     ab0:	49093904 	stmdbmi	r9, {r2, r8, fp, ip, sp}
     ab4:	09000001 	stmdbeq	r0, {r0}
     ab8:	004c5243 	subeq	r5, ip, r3, asr #4
     abc:	d1173a04 	tstle	r7, r4, lsl #20
     ac0:	02000000 	andeq	r0, r0, #0
     ac4:	43090023 	movwmi	r0, #36899	@ 0x9023
     ac8:	04004852 	streq	r4, [r0], #-2130	@ 0xfffff7ae
     acc:	00d1173b 	sbcseq	r1, r1, fp, lsr r7
     ad0:	23020000 	movwcs	r0, #8192	@ 0x2000
     ad4:	44490904 	strbmi	r0, [r9], #-2308	@ 0xfffff6fc
     ad8:	3c040052 	stccc	0, cr0, [r4], {82}	@ 0x52
     adc:	0000d117 	andeq	sp, r0, r7, lsl r1
     ae0:	08230200 	stmdaeq	r3!, {r9}
     ae4:	52444f09 	subpl	r4, r4, #9, 30	@ 0x24
     ae8:	173d0400 	ldrne	r0, [sp, -r0, lsl #8]!
     aec:	000000d1 	ldrdeq	r0, [r0], -r1
     af0:	0a0c2302 	beq	309700 <_Min_Stack_Size+0x309300>
     af4:	00011cf3 	strdeq	r1, [r1], -r3
     af8:	d1173e04 	tstle	r7, r4, lsl #28
     afc:	02000000 	andeq	r0, r0, #0
     b00:	42091023 	andmi	r1, r9, #35	@ 0x23
     b04:	04005252 	streq	r5, [r0], #-594	@ 0xfffffdae
     b08:	00d1173f 	sbcseq	r1, r1, pc, lsr r7
     b0c:	23020000 	movwcs	r0, #8192	@ 0x2000
     b10:	143e0a14 	ldrtne	r0, [lr], #-2580	@ 0xfffff5ec
     b14:	40040001 	andmi	r0, r4, r1
     b18:	0000d117 	andeq	sp, r0, r7, lsl r1
     b1c:	18230200 	stmdane	r3!, {r9}
     b20:	1d1c0300 	ldcne	3, cr0, [ip, #-0]
     b24:	41040001 	tstmi	r4, r1
     b28:	0000d603 	andeq	sp, r0, r3, lsl #12
     b2c:	04180800 	ldreq	r0, [r8], #-2048	@ 0xfffff800
     b30:	01b80954 			@ <UNDEFINED> instruction: 0x01b80954
     b34:	49090000 	stmdbmi	r9, {}	@ <UNPREDICTABLE>
     b38:	0400524d 	streq	r5, [r0], #-589	@ 0xfffffdb3
     b3c:	00d11755 	sbcseq	r1, r1, r5, asr r7
     b40:	23020000 	movwcs	r0, #8192	@ 0x2000
     b44:	4d450900 	vstrmi.16	s1, [r5, #-0]	@ <UNPREDICTABLE>
     b48:	56040052 			@ <UNDEFINED> instruction: 0x56040052
     b4c:	0000d117 	andeq	sp, r0, r7, lsl r1
     b50:	04230200 	strteq	r0, [r3], #-512	@ 0xfffffe00
     b54:	010e6c0a 	tsteq	lr, sl, lsl #24
     b58:	17570400 	ldrbne	r0, [r7, -r0, lsl #8]
     b5c:	000000d1 	ldrdeq	r0, [r0], -r1
     b60:	0a082302 	beq	209770 <_Min_Stack_Size+0x209370>
     b64:	00010dac 	andeq	r0, r1, ip, lsr #27
     b68:	d1175804 	tstle	r7, r4, lsl #16
     b6c:	02000000 	andeq	r0, r0, #0
     b70:	c00a0c23 	andgt	r0, sl, r3, lsr #24
     b74:	04000119 	streq	r0, [r0], #-281	@ 0xfffffee7
     b78:	00d11759 	sbcseq	r1, r1, r9, asr r7
     b7c:	23020000 	movwcs	r0, #8192	@ 0x2000
     b80:	52500910 	subspl	r0, r0, #16, 18	@ 0x40000
     b84:	175a0400 	ldrbne	r0, [sl, -r0, lsl #8]
     b88:	000000d1 	ldrdeq	r0, [r0], -r1
     b8c:	00142302 	andseq	r2, r4, r2, lsl #6
     b90:	010e7103 	tsteq	lr, r3, lsl #2
     b94:	035b0400 	cmpeq	fp, #0, 8
     b98:	00000155 	andeq	r0, r0, r5, asr r1
     b9c:	5e042008 	cdppl	0, 0, cr2, cr4, cr8, {0}
     ba0:	00021909 	andeq	r1, r2, r9, lsl #18
     ba4:	14ce0a00 	strbne	r0, [lr], #2560	@ 0xa00
     ba8:	5f040001 	svcpl	0x00040001
     bac:	0000d117 	andeq	sp, r0, r7, lsl r1
     bb0:	00230200 	eoreq	r0, r3, r0, lsl #4
     bb4:	011a9b0a 	tsteq	sl, sl, lsl #22
     bb8:	17600400 	strbne	r0, [r0, -r0, lsl #8]!
     bbc:	000000d1 	ldrdeq	r0, [r0], -r1
     bc0:	0a042302 	beq	1097d0 <_Min_Stack_Size+0x1093d0>
     bc4:	00010ae5 	andeq	r0, r1, r5, ror #21
     bc8:	29176104 	ldmdbcs	r7, {r2, r8, sp, lr}
     bcc:	02000002 	andeq	r0, r0, #2
     bd0:	860a0823 	strhi	r0, [sl], -r3, lsr #16
     bd4:	0400010f 	streq	r0, [r0], #-271	@ 0xfffffef1
     bd8:	00c50e62 	sbceq	r0, r5, r2, ror #28
     bdc:	23020000 	movwcs	r0, #8192	@ 0x2000
     be0:	11340a18 	teqne	r4, r8, lsl sl
     be4:	63040001 	movwvs	r0, #16385	@ 0x4001
     be8:	0000d117 	andeq	sp, r0, r7, lsl r1
     bec:	1c230200 	sfmne	f0, 4, [r3], #-0
     bf0:	00d10b00 	sbcseq	r0, r1, r0, lsl #22
     bf4:	02290000 	eoreq	r0, r9, #0
     bf8:	900c0000 	andls	r0, ip, r0
     bfc:	03000000 	movweq	r0, #0
     c00:	02190700 	andseq	r0, r9, #0, 14
     c04:	c3030000 	movwgt	r0, #12288	@ 0x3000
     c08:	0400011c 	streq	r0, [r0], #-284	@ 0xfffffee4
     c0c:	01c40364 	biceq	r0, r4, r4, ror #6
     c10:	04080000 	streq	r0, [r8], #-0
     c14:	71091105 	tstvc	r9, r5, lsl #2
     c18:	0a000002 	beq	c28 <_Min_Stack_Size+0x828>
     c1c:	00011c2e 	andeq	r1, r1, lr, lsr #24
     c20:	b90b1305 	stmdblt	fp, {r0, r2, r8, r9, ip}
     c24:	02000000 	andeq	r0, r0, #0
     c28:	230a0023 	movwcs	r0, #40995	@ 0xa023
     c2c:	0500010f 	streq	r0, [r0, #-271]	@ 0xfffffef1
     c30:	00ad0a16 	adceq	r0, sp, r6, lsl sl
     c34:	23020000 	movwcs	r0, #8192	@ 0x2000
     c38:	0aec0a02 	beq	ffb03448 <_estack+0xdfb00c48>
     c3c:	19050001 	stmdbne	r5, {r0}
     c40:	0000ad0a 	andeq	sl, r0, sl, lsl #26
     c44:	03230200 			@ <UNDEFINED> instruction: 0x03230200
     c48:	10870300 	addne	r0, r7, r0, lsl #6
     c4c:	1c050001 	stcne	0, cr0, [r5], {1}
     c50:	00023a07 	andeq	r3, r2, r7, lsl #20
     c54:	060c0800 	streq	r0, [ip], -r0, lsl #16
     c58:	02c30911 	sbceq	r0, r3, #278528	@ 0x44000
     c5c:	0f0a0000 	svceq	0x000a0000
     c60:	0600011c 			@ <UNDEFINED> instruction: 0x0600011c
     c64:	00b90e13 	adcseq	r0, r9, r3, lsl lr
     c68:	23020000 	movwcs	r0, #8192	@ 0x2000
     c6c:	12620a00 	rsbne	r0, r2, #0, 20
     c70:	14060001 	strne	r0, [r6], #-1
     c74:	0002c313 	andeq	ip, r2, r3, lsl r3
     c78:	04230200 	strteq	r0, [r3], #-512	@ 0xfffffe00
     c7c:	011c250a 	tsteq	ip, sl, lsl #10
     c80:	0e150600 	cfmsub32eq	mvax0, mvfx0, mvfx5, mvfx0
     c84:	000000b9 	strheq	r0, [r0], -r9
     c88:	0a082302 	beq	209898 <_Min_Stack_Size+0x209498>
     c8c:	00011eb4 			@ <UNDEFINED> instruction: 0x00011eb4
     c90:	ad0d1606 	stcge	6, cr1, [sp, #-24]	@ 0xffffffe8
     c94:	02000000 	andeq	r0, r0, #0
     c98:	05000a23 	streq	r0, [r0, #-2595]	@ 0xfffff5dd
     c9c:	00014904 	andeq	r4, r1, r4, lsl #18
     ca0:	1d090300 	stcne	3, cr0, [r9, #-0]
     ca4:	17060001 	strne	r0, [r6, -r1]
     ca8:	00027d03 	andeq	r7, r2, r3, lsl #26
     cac:	06140800 	ldreq	r0, [r4], -r0, lsl #16
     cb0:	031b091d 	tsteq	fp, #475136	@ 0x74000
     cb4:	680a0000 	stmdavs	sl, {}	@ <UNPREDICTABLE>
     cb8:	0600010b 	streq	r0, [r0], -fp, lsl #2
     cbc:	02c9181f 	sbceq	r1, r9, #2031616	@ 0x1f0000
     cc0:	23020000 	movwcs	r0, #8192	@ 0x2000
     cc4:	12550a00 	subsne	r0, r5, #0, 20
     cc8:	20060001 	andcs	r0, r6, r1
     ccc:	0000ad0d 	andeq	sl, r0, sp, lsl #26
     cd0:	0c230200 	sfmeq	f0, 4, [r3], #-0
     cd4:	011a510a 	tsteq	sl, sl, lsl #2
     cd8:	0d210600 	stceq	6, cr0, [r1, #-0]
     cdc:	000000ad 	andeq	r0, r0, sp, lsr #1
     ce0:	0a0d2302 	beq	3498f0 <_Min_Stack_Size+0x3494f0>
     ce4:	00010c43 	andeq	r0, r1, r3, asr #24
     ce8:	9e0c2206 	cdpls	2, 0, cr2, cr12, cr6, {0}
     cec:	02000000 	andeq	r0, r0, #0
     cf0:	03001023 	movweq	r1, #35	@ 0x23
     cf4:	00011098 	muleq	r1, r8, r0
     cf8:	d5032306 	strle	r2, [r3, #-774]	@ 0xfffffcfa
     cfc:	0b000002 	bleq	d0c <_Min_Stack_Size+0x90c>
     d00:	0000009e 	muleq	r0, lr, r0
     d04:	00000337 	andeq	r0, r0, r7, lsr r3
     d08:	0000900c 	andeq	r9, r0, ip
     d0c:	0d000f00 	stceq	15, cr0, [r0, #-0]
     d10:	00011dc7 	andeq	r1, r1, r7, asr #27
     d14:	27091401 	strcs	r1, [r9, -r1, lsl #8]
     d18:	01000003 	tsteq	r0, r3
     d1c:	03b00305 	movseq	r0, #335544320	@ 0x14000000
     d20:	010e2000 	mrseq	r2, (UNDEF: 14)
     d24:	00010a93 	muleq	r1, r3, sl
     d28:	01066605 	tsteq	r6, r5, lsl #12
     d2c:	00036401 	andeq	r6, r3, r1, lsl #8
     d30:	02c30f00 	sbceq	r0, r3, #0, 30
     d34:	640f0000 	strvs	r0, [pc], #-0	@ d3c <_Min_Stack_Size+0x93c>
     d38:	00000003 	andeq	r0, r0, r3
     d3c:	02710405 	rsbseq	r0, r1, #83886080	@ 0x5000000
     d40:	01100000 	tsteq	r0, r0
     d44:	00011802 	andeq	r1, r1, r2, lsl #16
     d48:	0106d601 	tsteq	r6, r1, lsl #12
	...
     d54:	00000396 	muleq	r0, r6, r3
     d58:	ac011001 	stcge	0, cr1, [r1], {1}
     d5c:	0100011b 	tsteq	r0, fp, lsl r1
     d60:	340106b9 	strcc	r0, [r1], #-1721	@ 0xfffff947
     d64:	c4080003 	strgt	r0, [r8], #-3
     d68:	b6080003 	strlt	r0, [r8], -r3
     d6c:	01000003 	tsteq	r0, r3
     d70:	10280110 	eorne	r0, r8, r0, lsl r1
     d74:	b3010001 	movwlt	r0, #4097	@ 0x1001
     d78:	03180106 	tsteq	r8, #-2147483647	@ 0x80000001
     d7c:	03340800 	teqeq	r4, #0, 16
     d80:	03d60800 	bicseq	r0, r6, #0, 16
     d84:	10010000 	andne	r0, r1, r0
     d88:	011cd001 	tsteq	ip, r1
     d8c:	06ad0100 	strteq	r0, [sp], r0, lsl #2
     d90:	0002fc01 	andeq	pc, r2, r1, lsl #24
     d94:	00031808 	andeq	r1, r3, r8, lsl #16
     d98:	0003f608 	andeq	pc, r3, r8, lsl #12
     d9c:	01100100 	tsteq	r0, r0, lsl #2
     da0:	00011ae3 	andeq	r1, r1, r3, ror #21
     da4:	0106a701 	tsteq	r6, r1, lsl #14
     da8:	080002e0 	stmdaeq	r0, {r5, r6, r7, r9}
     dac:	080002fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9}
     db0:	00000416 	andeq	r0, r0, r6, lsl r4
     db4:	13011001 	movwne	r1, #4097	@ 0x1001
     db8:	0100011f 	tsteq	r0, pc, lsl r1
     dbc:	c40106a1 	strgt	r0, [r1], #-1697	@ 0xfffff95f
     dc0:	e0080002 	and	r0, r8, r2
     dc4:	36080002 	strcc	r0, [r8], -r2
     dc8:	01000004 	tsteq	r0, r4
     dcc:	1cf80110 	ldfnee	f0, [r8], #64	@ 0x40
     dd0:	9b010001 	blls	40ddc <_Min_Stack_Size+0x409dc>
     dd4:	02a80106 	adceq	r0, r8, #-2147483647	@ 0x80000001
     dd8:	02c40800 	sbceq	r0, r4, #0, 16
     ddc:	04560800 	ldrbeq	r0, [r6], #-2048	@ 0xfffff800
     de0:	11010000 	mrsne	r0, (UNDEF: 1)
     de4:	010e6001 	tsteq	lr, r1
     de8:	07680100 	strbeq	r0, [r8, -r0, lsl #2]!
     dec:	00000001 	andeq	r0, r0, r1
     df0:	00000000 	andeq	r0, r0, r0
     df4:	00047600 	andeq	r7, r4, r0, lsl #12
     df8:	04980100 	ldreq	r0, [r8], #256	@ 0x100
     dfc:	29120000 	ldmdbcs	r2, {}	@ <UNPREDICTABLE>
     e00:	0100011d 	tsteq	r0, sp, lsl r1
     e04:	04982568 	ldreq	r2, [r8], #1384	@ 0x568
     e08:	04be0000 	ldrteq	r0, [lr], #0
     e0c:	04ba0000 	ldrteq	r0, [sl], #0
     e10:	11130000 	tstne	r3, r0
     e14:	0100010e 	tsteq	r0, lr, lsl #2
     e18:	0271166b 	rsbseq	r1, r1, #112197632	@ 0x6b00000
     e1c:	91020000 	mrsls	r0, (UNDEF: 2)
     e20:	1ce1146c 	cfstrdne	mvd1, [r1], #432	@ 0x1b0
     e24:	71010001 	tstvc	r1, r1
     e28:	0000ad0d 	andeq	sl, r0, sp, lsl #26
     e2c:	0004e000 	andeq	lr, r4, r0
     e30:	0004dc00 	andeq	sp, r4, r0, lsl #24
     e34:	0d4a1400 	cfstrdeq	mvd1, [sl, #-0]
     e38:	72010001 	andvc	r0, r1, #1
     e3c:	0000ad0d 	andeq	sl, r0, sp, lsl #26
     e40:	00050c00 	andeq	r0, r5, r0, lsl #24
     e44:	00050800 	andeq	r0, r5, r0, lsl #16
     e48:	00001500 	andeq	r1, r0, r0, lsl #10
     e4c:	034a0000 	movteq	r0, #40960	@ 0xa000
     e50:	04850000 	streq	r0, [r5], #0
     e54:	01160000 	tsteq	r6, r0
     e58:	6c910251 	lfmvs	f0, 4, [r1], {81}	@ 0x51
     e5c:	00001700 	andeq	r1, r0, r0, lsl #14
     e60:	055e0000 	ldrbeq	r0, [lr, #-0]
     e64:	00170000 	andseq	r0, r7, r0
     e68:	35000000 	strcc	r0, [r0, #-0]
     e6c:	00000005 	andeq	r0, r0, r5
     e70:	031b0405 	tsteq	fp, #83886080	@ 0x5000000
     e74:	01180000 	tsteq	r8, r0
     e78:	000114e7 	andeq	r1, r1, r7, ror #9
     e7c:	00064f01 	andeq	r4, r6, r1, lsl #30
     e80:	00000000 	andeq	r0, r0, r0
     e84:	02000000 	andeq	r0, r0, #0
     e88:	1101007d 	tstne	r1, sp, ror r0
     e8c:	010ca401 	tsteq	ip, r1, lsl #8
     e90:	06450100 	strbeq	r0, [r5], -r0, lsl #2
     e94:	00000001 	andeq	r0, r0, r1
     e98:	00000000 	andeq	r0, r0, r0
     e9c:	00053400 	andeq	r3, r5, r0, lsl #8
     ea0:	04f40100 	ldrbteq	r0, [r4], #256	@ 0x100
     ea4:	29120000 	ldmdbcs	r2, {}	@ <UNPREDICTABLE>
     ea8:	0100011d 	tsteq	r0, sp, lsl r1
     eac:	04982e45 	ldreq	r2, [r8], #3653	@ 0xe45
     eb0:	05580000 	ldrbeq	r0, [r8, #-0]
     eb4:	05540000 	ldrbeq	r0, [r4, #-0]
     eb8:	00190000 	andseq	r0, r9, r0
     ebc:	0b000000 	bleq	ec4 <_Min_Stack_Size+0xac4>
     ec0:	16000004 	strne	r0, [r0], -r4
     ec4:	f3035001 	vhadd.u8	d5, d3, d1
     ec8:	00005001 	andeq	r5, r0, r1
     ecc:	14d30111 	ldrbne	r0, [r3], #273	@ 0x111
     ed0:	39010001 	stmdbcc	r1, {r0}
     ed4:	00000106 	andeq	r0, r0, r6, lsl #2
     ed8:	00000000 	andeq	r0, r0, r0
     edc:	05790000 	ldrbeq	r0, [r9, #-0]!
     ee0:	35010000 	strcc	r0, [r1, #-0]
     ee4:	12000005 	andne	r0, r0, #5
     ee8:	00011d29 	andeq	r1, r1, r9, lsr #26
     eec:	982c3901 	stmdals	ip!, {r0, r8, fp, ip, sp}
     ef0:	9d000004 	stcls	0, cr0, [r0, #-16]
     ef4:	99000005 	stmdbls	r0, {r0, r2}
     ef8:	19000005 	stmdbne	r0, {r0, r2}
     efc:	00000000 	andeq	r0, r0, r0
     f00:	0000040b 	andeq	r0, r0, fp, lsl #8
     f04:	03500116 	cmpeq	r0, #-2147483643	@ 0x80000005
     f08:	005001f3 	ldrsheq	r0, [r0], #-19	@ 0xffffffed
     f0c:	c3011a00 	movwgt	r1, #6656	@ 0x1a00
     f10:	0100011e 	tsteq	r0, lr, lsl r1
     f14:	00010624 	andeq	r0, r1, r4, lsr #12
     f18:	00000000 	andeq	r0, r0, r0
     f1c:	02000000 	andeq	r0, r0, #0
     f20:	5e01007d 	mcrpl	0, 0, r0, cr1, cr13, {3}
     f24:	1b000005 	blne	f40 <_Min_Stack_Size+0xb40>
     f28:	00515249 	subseq	r5, r1, r9, asr #4
     f2c:	ad1b2401 	cfldrsge	mvf2, [fp, #-4]
     f30:	01000000 	mrseq	r0, (UNDEF: 0)
     f34:	011c0050 	tsteq	ip, r0, asr r0
     f38:	00011f24 	andeq	r1, r1, r4, lsr #30
     f3c:	01061601 	tsteq	r6, r1, lsl #12
	...
     f48:	01007d02 	tsteq	r0, r2, lsl #26
     f4c:	5152491b 	cmppl	r2, fp, lsl r9
     f50:	1a160100 	bne	581358 <_Min_Stack_Size+0x580f58>
     f54:	000000ad 	andeq	r0, r0, sp, lsr #1
     f58:	00005001 	andeq	r5, r0, r1
     f5c:	00000ef1 	strdeq	r0, [r0], -r1
     f60:	05470002 	strbeq	r0, [r7, #-2]
     f64:	01040000 	mrseq	r0, (UNDEF: 4)
     f68:	00002e38 	andeq	r2, r0, r8, lsr lr
     f6c:	0121310c 			@ <UNDEFINED> instruction: 0x0121310c
     f70:	00151100 	andseq	r1, r5, r0, lsl #2
     f74:	00013800 	andeq	r3, r1, r0, lsl #16
	...
     f80:	001e5c00 	andseq	r5, lr, r0, lsl #24
     f84:	001b7200 	andseq	r7, fp, r0, lsl #4
     f88:	07040200 	streq	r0, [r4, -r0, lsl #4]
     f8c:	00002061 	andeq	r2, r0, r1, rrx
     f90:	7d060102 	stfvcs	f0, [r6, #-8]
     f94:	03000021 	movweq	r0, #33	@ 0x21
     f98:	00010db1 			@ <UNDEFINED> instruction: 0x00010db1
     f9c:	47182b02 	ldrmi	r2, [r8, -r2, lsl #22]
     fa0:	02000000 	andeq	r0, r0, #0
     fa4:	22aa0801 	adccs	r0, sl, #65536	@ 0x10000
     fa8:	02020000 	andeq	r0, r2, #0
     fac:	00059b05 	andeq	r9, r5, r5, lsl #22
     fb0:	107c0300 	rsbsne	r0, ip, r0, lsl #6
     fb4:	39020001 	stmdbcc	r2, {r0}
     fb8:	00006119 	andeq	r6, r0, r9, lsl r1
     fbc:	07020200 	streq	r0, [r2, -r0, lsl #4]
     fc0:	000026dd 	ldrdeq	r2, [r0], -sp
     fc4:	01050402 	tsteq	r5, r2, lsl #8
     fc8:	03000020 	movweq	r0, #32
     fcc:	0001142b 	andeq	r1, r1, fp, lsr #8
     fd0:	7b194f02 	blvc	654be0 <_Min_Stack_Size+0x6547e0>
     fd4:	02000000 	andeq	r0, r0, #0
     fd8:	1d740704 	ldclne	7, cr0, [r4, #-16]!
     fdc:	08020000 	stmdaeq	r2, {}	@ <UNPREDICTABLE>
     fe0:	00122205 	andseq	r2, r2, r5, lsl #4
     fe4:	07080200 	streq	r0, [r8, -r0, lsl #4]
     fe8:	00002bb6 			@ <UNDEFINED> instruction: 0x00002bb6
     fec:	69050404 	stmdbvs	r5, {r2, sl}
     ff0:	0200746e 	andeq	r7, r0, #1845493760	@ 0x6e000000
     ff4:	f0a60408 			@ <UNDEFINED> instruction: 0xf0a60408
     ff8:	01020000 	mrseq	r0, (UNDEF: 2)
     ffc:	00218408 	eoreq	r8, r1, r8, lsl #8
    1000:	0db30300 	ldceq	3, cr0, [r3]
    1004:	18030001 	stmdane	r3, {r0}
    1008:	00003b13 	andeq	r3, r0, r3, lsl fp
    100c:	107e0300 	rsbsne	r0, lr, r0, lsl #6
    1010:	24030001 	strcs	r0, [r3], #-1
    1014:	00005514 	andeq	r5, r0, r4, lsl r5
    1018:	142d0300 	strtne	r0, [sp], #-768	@ 0xfffffd00
    101c:	30030001 	andcc	r0, r3, r1
    1020:	00006f14 	andeq	r6, r0, r4, lsl pc
    1024:	00bd0500 	adcseq	r0, sp, r0, lsl #10
    1028:	1c060000 	stcne	0, cr0, [r6], {-0}
    102c:	41093904 	tstmi	r9, r4, lsl #18
    1030:	07000001 	streq	r0, [r0, -r1]
    1034:	004c5243 	subeq	r5, ip, r3, asr #4
    1038:	c9173a04 	ldmdbgt	r7, {r2, r9, fp, ip, sp}
    103c:	02000000 	andeq	r0, r0, #0
    1040:	43070023 	movwmi	r0, #28707	@ 0x7023
    1044:	04004852 	streq	r4, [r0], #-2130	@ 0xfffff7ae
    1048:	00c9173b 	sbceq	r1, r9, fp, lsr r7
    104c:	23020000 	movwcs	r0, #8192	@ 0x2000
    1050:	44490704 	strbmi	r0, [r9], #-1796	@ 0xfffff8fc
    1054:	3c040052 	stccc	0, cr0, [r4], {82}	@ 0x52
    1058:	0000c917 	andeq	ip, r0, r7, lsl r9
    105c:	08230200 	stmdaeq	r3!, {r9}
    1060:	52444f07 	subpl	r4, r4, #7, 30
