NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    1064:	173d0400 	ldrne	r0, [sp, -r0, lsl #8]!
    1068:	000000c9 	andeq	r0, r0, r9, asr #1
    106c:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    1070:	00011cf3 	strdeq	r1, [r1], -r3
    1074:	c9173e04 	ldmdbgt	r7, {r2, r9, sl, fp, ip, sp}
    1078:	02000000 	andeq	r0, r0, #0
    107c:	42071023 	andmi	r1, r7, #35	@ 0x23
    1080:	04005252 	streq	r5, [r0], #-594	@ 0xfffffdae
    1084:	00c9173f 	sbceq	r1, r9, pc, lsr r7
    1088:	23020000 	movwcs	r0, #8192	@ 0x2000
    108c:	143e0814 	ldrtne	r0, [lr], #-2068	@ 0xfffff7ec
    1090:	40040001 	andmi	r0, r4, r1
    1094:	0000c917 	andeq	ip, r0, r7, lsl r9
    1098:	18230200 	stmdane	r3!, {r9}
    109c:	1d1c0300 	ldcne	3, cr0, [ip, #-0]
    10a0:	41040001 	tstmi	r4, r1
    10a4:	0000ce03 	andeq	ip, r0, r3, lsl #28
    10a8:	04300600 	ldrteq	r0, [r0], #-1536	@ 0xfffffa00
    10ac:	020a0944 	andeq	r0, sl, #68, 18	@ 0x110000
    10b0:	43070000 	movwmi	r0, #28672	@ 0x7000
    10b4:	45040052 	strmi	r0, [r4, #-82]	@ 0xffffffae
    10b8:	0000c917 	andeq	ip, r0, r7, lsl r9
    10bc:	00230200 	eoreq	r0, r3, r0, lsl #4
    10c0:	0129c408 			@ <UNDEFINED> instruction: 0x0129c408
    10c4:	17460400 	strbne	r0, [r6, -r0, lsl #8]
    10c8:	000000c9 	andeq	r0, r0, r9, asr #1
    10cc:	07042302 	streq	r2, [r4, -r2, lsl #6]
    10d0:	00524943 	subseq	r4, r2, r3, asr #18
    10d4:	c9174704 	ldmdbgt	r7, {r2, r8, r9, sl, lr}
    10d8:	02000000 	andeq	r0, r0, #0
    10dc:	b0080823 	andlt	r0, r8, r3, lsr #16
    10e0:	04000123 	streq	r0, [r0], #-291	@ 0xfffffedd
    10e4:	00c91748 	sbceq	r1, r9, r8, asr #14
    10e8:	23020000 	movwcs	r0, #8192	@ 0x2000
    10ec:	24cd080c 	strbcs	r0, [sp], #2060	@ 0x80c
    10f0:	49040001 	stmdbmi	r4, {r0}
    10f4:	0000c917 	andeq	ip, r0, r7, lsl r9
    10f8:	10230200 	eorne	r0, r3, r0, lsl #4
    10fc:	01261208 			@ <UNDEFINED> instruction: 0x01261208
    1100:	174a0400 	strbne	r0, [sl, -r0, lsl #8]
    1104:	000000c9 	andeq	r0, r0, r9, asr #1
    1108:	08142302 	ldmdaeq	r4, {r1, r8, r9, sp}
    110c:	000120bf 	strheq	r2, [r1], -pc	@ <UNPREDICTABLE>
    1110:	c9174b04 	ldmdbgt	r7, {r2, r8, r9, fp, lr}
    1114:	02000000 	andeq	r0, r0, #0
    1118:	d6081823 	strle	r1, [r8], -r3, lsr #16
    111c:	04000124 	streq	r0, [r0], #-292	@ 0xfffffedc
    1120:	00c9174c 	sbceq	r1, r9, ip, asr #14
    1124:	23020000 	movwcs	r0, #8192	@ 0x2000
    1128:	224b081c 	subcs	r0, fp, #28, 16	@ 0x1c0000
    112c:	4d040001 	stcmi	0, cr0, [r4, #-4]
    1130:	0000c917 	andeq	ip, r0, r7, lsl r9
    1134:	20230200 	eorcs	r0, r3, r0, lsl #4
    1138:	52534307 	subspl	r4, r3, #469762048	@ 0x1c000000
    113c:	174e0400 	strbne	r0, [lr, -r0, lsl #8]
    1140:	000000c9 	andeq	r0, r0, r9, asr #1
    1144:	08242302 	stmdaeq	r4!, {r1, r8, r9, sp}
    1148:	00012619 	andeq	r2, r1, r9, lsl r6
    114c:	c9174f04 	ldmdbgt	r7, {r2, r8, r9, sl, fp, lr}
    1150:	02000000 	andeq	r0, r0, #0
    1154:	05082823 	streq	r2, [r8, #-2083]	@ 0xfffff7dd
    1158:	04000124 	streq	r0, [r0], #-292	@ 0xfffffedc
    115c:	00c91750 	sbceq	r1, r9, r0, asr r7
    1160:	23020000 	movwcs	r0, #8192	@ 0x2000
    1164:	d003002c 	andle	r0, r3, ip, lsr #32
    1168:	04000125 	streq	r0, [r0], #-293	@ 0xfffffedb
    116c:	014d0351 	cmpeq	sp, r1, asr r3
    1170:	24060000 	strcs	r0, [r6], #-0
    1174:	a7097f04 	strge	r7, [r9, -r4, lsl #30]
    1178:	08000002 	stmdaeq	r0, {r1}
    117c:	0001235d 	andeq	r2, r1, sp, asr r3
    1180:	c9178004 	ldmdbgt	r7, {r2, pc}
    1184:	02000000 	andeq	r0, r0, #0
    1188:	ce080023 	cdpgt	0, 0, cr0, cr8, cr3, {1}
    118c:	04000121 	streq	r0, [r0], #-289	@ 0xfffffedf
    1190:	00c91781 	sbceq	r1, r9, r1, lsl #15
    1194:	23020000 	movwcs	r0, #8192	@ 0x2000
    1198:	21180804 	tstcs	r8, r4, lsl #16
    119c:	82040001 	andhi	r0, r4, #1
    11a0:	0000c917 	andeq	ip, r0, r7, lsl r9
    11a4:	08230200 	stmdaeq	r3!, {r9}
    11a8:	01212108 			@ <UNDEFINED> instruction: 0x01212108
    11ac:	17830400 	strne	r0, [r3, r0, lsl #8]
    11b0:	000000c9 	andeq	r0, r0, r9, asr #1
    11b4:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    11b8:	000123fe 	strdeq	r2, [r1], -lr
    11bc:	c9178404 	ldmdbgt	r7, {r2, sl, pc}
    11c0:	02000000 	andeq	r0, r0, #0
    11c4:	12081023 	andne	r1, r8, #35	@ 0x23
    11c8:	04000125 	streq	r0, [r0], #-293	@ 0xfffffedb
    11cc:	00c91785 	sbceq	r1, r9, r5, lsl #15
    11d0:	23020000 	movwcs	r0, #8192	@ 0x2000
    11d4:	251a0814 	ldrcs	r0, [sl, #-2068]	@ 0xfffff7ec
    11d8:	86040001 	strhi	r0, [r4], -r1
    11dc:	0000c917 	andeq	ip, r0, r7, lsl r9
    11e0:	18230200 	stmdane	r3!, {r9}
    11e4:	01219b08 			@ <UNDEFINED> instruction: 0x01219b08
    11e8:	17870400 	strne	r0, [r7, r0, lsl #8]
    11ec:	000000c9 	andeq	r0, r0, r9, asr #1
    11f0:	081c2302 	ldmdaeq	ip, {r1, r8, r9, sp}
    11f4:	0001266c 	andeq	r2, r1, ip, ror #12
    11f8:	c9178804 	ldmdbgt	r7, {r2, fp, pc}
    11fc:	02000000 	andeq	r0, r0, #0
    1200:	03002023 	movweq	r2, #35	@ 0x23
    1204:	00012530 	andeq	r2, r1, r0, lsr r5
    1208:	16028a04 	strne	r8, [r2], -r4, lsl #20
    120c:	06000002 	streq	r0, [r0], -r2
    1210:	09110504 	ldmdbeq	r1, {r2, r8, sl}
    1214:	000002ea 	andeq	r0, r0, sl, ror #5
    1218:	011c2e08 	tsteq	ip, r8, lsl #28
    121c:	0b130500 	bleq	4c2624 <_Min_Stack_Size+0x4c2224>
    1220:	000000b1 	strheq	r0, [r0], -r1
    1224:	08002302 	stmdaeq	r0, {r1, r8, r9, sp}
    1228:	00010f23 	andeq	r0, r1, r3, lsr #30
    122c:	a50a1605 	strge	r1, [sl, #-1541]	@ 0xfffff9fb
    1230:	02000000 	andeq	r0, r0, #0
    1234:	ec080223 	sfm	f0, 4, [r8], {35}	@ 0x23
    1238:	0500010a 	streq	r0, [r0, #-266]	@ 0xfffffef6
    123c:	00a50a19 	adceq	r0, r5, r9, lsl sl
    1240:	23020000 	movwcs	r0, #8192	@ 0x2000
    1244:	87030003 	strhi	r0, [r3, -r3]
    1248:	05000110 	streq	r0, [r0, #-272]	@ 0xfffffef0
    124c:	02b3071c 	adcseq	r0, r3, #28, 14	@ 0x700000
    1250:	07090000 	streq	r0, [r9, -r0]
    1254:	00004701 	andeq	r4, r0, r1, lsl #14
    1258:	051c0600 	ldreq	r0, [ip, #-1536]	@ 0xfffffa00
    125c:	00000311 	andeq	r0, r0, r1, lsl r3
    1260:	0124af0a 			@ <UNDEFINED> instruction: 0x0124af0a
    1264:	f90a0000 			@ <UNDEFINED> instruction: 0xf90a0000
    1268:	01000125 	tsteq	r0, r5, lsr #2
    126c:	24de0300 	ldrbcs	r0, [lr], #768	@ 0x300
    1270:	1f060001 	svcne	0x00060001
    1274:	0002f607 	andeq	pc, r2, r7, lsl #12
    1278:	01070900 	tsteq	r7, r0, lsl #18
    127c:	00000047 	andeq	r0, r0, r7, asr #32
    1280:	38052106 	stmdacc	r5, {r1, r2, r8, sp}
    1284:	0a000003 	beq	1298 <_Min_Stack_Size+0xe98>
    1288:	000125ab 	andeq	r2, r1, fp, lsr #11
    128c:	45530b00 	ldrbmi	r0, [r3, #-2816]	@ 0xfffff500
    1290:	00010054 	andeq	r0, r1, r4, asr r0
    1294:	01239703 			@ <UNDEFINED> instruction: 0x01239703
    1298:	07240600 	streq	r0, [r4, -r0, lsl #12]!
    129c:	0000031d 	andeq	r0, r0, sp, lsl r3
    12a0:	47010709 	strmi	r0, [r1, -r9, lsl #14]
    12a4:	06000000 	streq	r0, [r0], -r0
    12a8:	035f0527 	cmpeq	pc, #163577856	@ 0x9c00000
    12ac:	520a0000 	andpl	r0, sl, #0
    12b0:	00000120 	andeq	r0, r0, r0, lsr #2
    12b4:	0121020a 			@ <UNDEFINED> instruction: 0x0121020a
    12b8:	03000100 	movweq	r0, #256	@ 0x100
    12bc:	00012522 	andeq	r2, r1, r2, lsr #10
    12c0:	44072a06 	strmi	r2, [r7], #-2566	@ 0xfffff5fa
    12c4:	09000003 	stmdbeq	r0, {r0, r1}
    12c8:	00470107 	subeq	r0, r7, r7, lsl #2
    12cc:	2e060000 	cdpcs	0, 0, cr0, cr6, cr0, {0}
    12d0:	00039805 	andeq	r9, r3, r5, lsl #16
    12d4:	24100a00 	ldrcs	r0, [r0], #-2560	@ 0xfffff600
    12d8:	0a000001 	beq	12e4 <_Min_Stack_Size+0xee4>
    12dc:	000126a7 	andeq	r2, r1, r7, lsr #13
    12e0:	24670a01 	strbtcs	r0, [r7], #-2561	@ 0xfffff5ff
    12e4:	0a020001 	beq	812f0 <_Min_Stack_Size+0x80ef0>
    12e8:	000122da 	ldrdeq	r2, [r1], -sl
    12ec:	21e90a03 	mvncs	r0, r3, lsl #20
    12f0:	00040001 	andeq	r0, r4, r1
    12f4:	0124c103 			@ <UNDEFINED> instruction: 0x0124c103
    12f8:	07340600 	ldreq	r0, [r4, -r0, lsl #12]!
    12fc:	0000036b 	andeq	r0, r0, fp, ror #6
    1300:	2d040709 	stccs	7, cr0, [r4, #-36]	@ 0xffffffdc
    1304:	06000000 	streq	r0, [r0], -r0
    1308:	03e00536 	mvneq	r0, #226492416	@ 0xd800000
    130c:	ca0a0000 	bgt	281314 <_Min_Stack_Size+0x280f14>
    1310:	0000011f 	andeq	r0, r0, pc, lsl r1
    1314:	3556450b 	ldrbcc	r4, [r6, #-1291]	@ 0xfffffaf5
    1318:	450b0100 	strmi	r0, [fp, #-256]	@ 0xffffff00
    131c:	02003656 	andeq	r3, r0, #90177536	@ 0x5600000
    1320:	3856450b 	ldmdacc	r6, {r0, r1, r3, r8, sl, lr}^
    1324:	a50a0300 	strge	r0, [sl, #-768]	@ 0xfffffd00
    1328:	04000125 	streq	r0, [r0], #-293	@ 0xfffffedb
    132c:	3756450b 	ldrbcc	r4, [r6, -fp, lsl #10]
    1330:	cc0c0500 	cfstr32gt	mvfx0, [ip], {-0}
    1334:	80000120 	andhi	r0, r0, r0, lsr #2
    1338:	00000700 	andeq	r0, r0, r0, lsl #14
    133c:	01239b03 			@ <UNDEFINED> instruction: 0x01239b03
    1340:	073f0600 	ldreq	r0, [pc, -r0, lsl #12]!
    1344:	000003a4 	andeq	r0, r0, r4, lsr #7
    1348:	40060c06 	andmi	r0, r6, r6, lsl #24
    134c:	00043209 	andeq	r3, r4, r9, lsl #4
    1350:	21770800 	cmncs	r7, r0, lsl #16
    1354:	42060001 	andmi	r0, r6, #1
    1358:	0000b10b 	andeq	fp, r0, fp, lsl #2
    135c:	00230200 	eoreq	r0, r3, r0, lsl #4
    1360:	0124ee08 			@ <UNDEFINED> instruction: 0x0124ee08
    1364:	0b430600 	bleq	10c2b6c <_Min_Stack_Size+0x10c276c>
    1368:	000000b1 	strheq	r0, [r0], -r1
    136c:	08022302 	stmdaeq	r2, {r1, r8, r9, sp}
    1370:	000123a2 	andeq	r2, r1, r2, lsr #7
    1374:	b10b4406 	tstlt	fp, r6, lsl #8
    1378:	02000000 	andeq	r0, r0, #0
    137c:	b4080423 	strlt	r0, [r8], #-1059	@ 0xfffffbdd
    1380:	06000126 	streq	r0, [r0], -r6, lsr #2
    1384:	00bd0b45 	adcseq	r0, sp, r5, asr #22
    1388:	23020000 	movwcs	r0, #8192	@ 0x2000
    138c:	c6030008 	strgt	r0, [r3], -r8
    1390:	06000123 	streq	r0, [r0], -r3, lsr #2
    1394:	03ec0746 	mvneq	r0, #18350080	@ 0x1180000
    1398:	24060000 	strcs	r0, [r6], #-0
    139c:	b1094706 	tstlt	r9, r6, lsl #14
    13a0:	08000004 	stmdaeq	r0, {r2}
    13a4:	0001262d 	andeq	r2, r1, sp, lsr #12
    13a8:	bd0b4906 	vstrlt.16	s8, [fp, #-12]	@ <UNPREDICTABLE>
    13ac:	02000000 	andeq	r0, r0, #0
    13b0:	50080023 	andpl	r0, r8, r3, lsr #32
    13b4:	06000122 	streq	r0, [r0], -r2, lsr #2
    13b8:	00a50a4a 	adceq	r0, r5, sl, asr #20
    13bc:	23020000 	movwcs	r0, #8192	@ 0x2000
    13c0:	200f0804 	andcs	r0, pc, r4, lsl #16
    13c4:	4b060001 	blmi	1813d0 <_Min_Stack_Size+0x180fd0>
    13c8:	0000bd0b 	andeq	fp, r0, fp, lsl #26
    13cc:	08230200 	stmdaeq	r3!, {r9}
    13d0:	0122c808 			@ <UNDEFINED> instruction: 0x0122c808
    13d4:	164c0600 	strbne	r0, [ip], -r0, lsl #12
    13d8:	00000432 	andeq	r0, r0, r2, lsr r4
    13dc:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    13e0:	000122ea 	andeq	r2, r1, sl, ror #5
    13e4:	b10b4d06 	tstlt	fp, r6, lsl #26
    13e8:	02000000 	andeq	r0, r0, #0
    13ec:	2b081823 	blcs	207480 <_Min_Stack_Size+0x207080>
    13f0:	06000123 	streq	r0, [r0], -r3, lsr #2
    13f4:	00bd0b4e 	adcseq	r0, sp, lr, asr #22
    13f8:	23020000 	movwcs	r0, #8192	@ 0x2000
    13fc:	247b081c 	ldrbtcs	r0, [fp], #-2076	@ 0xfffff7e4
    1400:	4f060001 	svcmi	0x00060001
    1404:	0004bd09 	andeq	fp, r4, r9, lsl #26
    1408:	20230200 	eorcs	r0, r3, r0, lsl #4
    140c:	bd010d00 	stclt	13, cr0, [r1, #-0]
    1410:	0e000004 	cdpeq	0, 0, cr0, cr0, cr4, {0}
    1414:	00000398 	muleq	r0, r8, r3
    1418:	b1040f00 	tstlt	r4, r0, lsl #30
    141c:	03000004 	movweq	r0, #4
    1420:	0001223b 	andeq	r2, r1, fp, lsr r2
    1424:	3e075006 	cdpcc	0, 0, cr5, cr7, cr6, {0}
    1428:	09000004 	stmdbeq	r0, {r2}
    142c:	00470107 	subeq	r0, r7, r7, lsl #2
    1430:	8a060000 	bhi	181438 <_Min_Stack_Size+0x181038>
    1434:	0004ea05 	andeq	lr, r4, r5, lsl #20
    1438:	24b70a00 	ldrtcs	r0, [r7], #2560	@ 0xa00
    143c:	0a000001 	beq	1448 <_Min_Stack_Size+0x1048>
    1440:	00012620 	andeq	r2, r1, r0, lsr #12
    1444:	8c030001 	stchi	0, cr0, [r3], {1}
    1448:	06000121 	streq	r0, [r0], -r1, lsr #2
    144c:	04cf078d 	strbeq	r0, [pc], #1933	@ 1454 <_Min_Stack_Size+0x1054>
    1450:	07090000 	streq	r0, [r9, -r0]
    1454:	00004701 	andeq	r4, r0, r1, lsl #14
    1458:	05900600 	ldreq	r0, [r0, #1536]	@ 0x600
    145c:	00000511 	andeq	r0, r0, r1, lsl r5
    1460:	0120750a 			@ <UNDEFINED> instruction: 0x0120750a
    1464:	3c0a0000 	stccc	0, cr0, [sl], {-0}
    1468:	01000126 	tsteq	r0, r6, lsr #2
    146c:	206c0300 	rsbcs	r0, ip, r0, lsl #6
    1470:	93060001 	movwls	r0, #24577	@ 0x6001
    1474:	0004f607 	andeq	pc, r4, r7, lsl #12
    1478:	04c31000 	strbeq	r1, [r3], #0
    147c:	052d0000 	streq	r0, [sp, #-0]!
    1480:	2d110000 	ldccs	0, cr0, [r1, #-0]
    1484:	01000000 	mrseq	r0, (UNDEF: 0)
    1488:	25591200 	ldrbcs	r1, [r9, #-512]	@ 0xfffffe00
    148c:	09010001 	stmdbeq	r1, {r0}
    1490:	00051d11 	andeq	r1, r5, r1, lsl sp
    1494:	03050100 	movweq	r0, #20736	@ 0x5100
    1498:	200003f0 	strdcs	r0, [r0], -r0	@ <UNPREDICTABLE>
    149c:	0a930113 	beq	fe4c18f0 <_estack+0xde4bf0f0>
    14a0:	66050001 	strvs	r0, [r5], -r1
    14a4:	5a010106 	bpl	418c4 <_Min_Stack_Size+0x414c4>
    14a8:	0e000005 	cdpeq	0, 0, cr0, cr0, cr5, {0}
    14ac:	0000055a 	andeq	r0, r0, sl, asr r5
    14b0:	0005600e 	andeq	r6, r5, lr
    14b4:	040f0000 	streq	r0, [pc], #-0	@ 14bc <_Min_Stack_Size+0x10bc>
    14b8:	00000141 	andeq	r0, r0, r1, asr #2
    14bc:	02ea040f 	rsceq	r0, sl, #251658240	@ 0xf000000
    14c0:	01140000 	tsteq	r4, r0
    14c4:	00011ff9 	strdeq	r1, [r1], -r9
    14c8:	010a1407 	tsteq	sl, r7, lsl #8
    14cc:	000000bd 	strheq	r0, [r0], -sp
    14d0:	dc011501 	cfstr32le	mvfx1, [r1], {1}
    14d4:	01000125 	tsteq	r0, r5, lsr #2
    14d8:	0106020e 	tsteq	r6, lr, lsl #4
    14dc:	080004f6 	stmdaeq	r0, {r1, r2, r4, r5, r6, r7, sl}
    14e0:	080004f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, sl}
    14e4:	01007d02 	tsteq	r0, r2, lsl #26
    14e8:	229e0115 	addscs	r0, lr, #1073741829	@ 0x40000005
    14ec:	09010001 	stmdbeq	r1, {r0}
    14f0:	f4010602 	vst1.8	{d0-d2}, [r1], r2
    14f4:	f6080004 			@ <UNDEFINED> instruction: 0xf6080004
    14f8:	02080004 	andeq	r0, r8, #4
    14fc:	1601007d 			@ <UNDEFINED> instruction: 0x1601007d
    1500:	0123b901 			@ <UNDEFINED> instruction: 0x0123b901
    1504:	01c80100 	biceq	r0, r8, r0, lsl #2
    1508:	03c80106 	biceq	r0, r8, #-2147483647	@ 0x80000001
    150c:	044c0800 	strbeq	r0, [ip], #-2048	@ 0xfffff800
    1510:	05be0800 	ldreq	r0, [lr, #2048]!	@ 0x800
    1514:	37010000 	strcc	r0, [r1, -r0]
    1518:	17000006 	strne	r0, [r0, -r6]
    151c:	00012187 	andeq	r2, r1, r7, lsl #3
    1520:	2001c801 	andcs	ip, r1, r1, lsl #16
    1524:	00000637 	andeq	r0, r0, r7, lsr r6
    1528:	000005f2 	strdeq	r0, [r0], -r2
    152c:	000005de 	ldrdeq	r0, [r0], -lr
    1530:	011ff317 	tsteq	pc, r7, lsl r3	@ <UNPREDICTABLE>
    1534:	01c80100 	biceq	r0, r8, r0, lsl #2
    1538:	00039832 	andeq	r9, r3, r2, lsr r8
    153c:	00068b00 	andeq	r8, r6, r0, lsl #22
    1540:	00067700 	andeq	r7, r6, r0, lsl #14
    1544:	1ced1800 	stclne	8, cr1, [sp]
    1548:	ca010001 	bgt	41554 <_Min_Stack_Size+0x41154>
    154c:	00a50d01 	adceq	r0, r5, r1, lsl #26
    1550:	072e0000 	streq	r0, [lr, -r0]!
    1554:	07100000 	ldreq	r0, [r0, -r0]
    1558:	fc190000 	ldc2	0, cr0, [r9], {-0}
    155c:	0d080003 	stceq	0, cr0, [r8, #-12]
    1560:	1a000006 	bne	1580 <_Min_Stack_Size+0x1180>
    1564:	30015001 	andcc	r5, r1, r1
    1568:	040e1900 	streq	r1, [lr], #-2304	@ 0xfffff700
    156c:	061c0800 	ldreq	r0, [ip], -r0, lsl #16
    1570:	011a0000 	tsteq	sl, r0
    1574:	00320150 	eorseq	r0, r2, r0, asr r1
    1578:	00042819 	andeq	r2, r4, r9, lsl r8
    157c:	00062b08 	andeq	r2, r6, r8, lsl #22
    1580:	50011a00 	andpl	r1, r1, r0, lsl #20
    1584:	1b003301 	blne	e190 <_Min_Stack_Size+0xdd90>
    1588:	08000442 	stmdaeq	r0, {r1, r6, sl}
    158c:	0150011a 	cmpeq	r0, sl, lsl r1
    1590:	0f000034 	svceq	0x00000034
    1594:	0002a704 	andeq	sl, r2, r4, lsl #14
    1598:	28011600 	stmdacs	r1, {r9, sl, ip}
    159c:	01000122 	tsteq	r0, r2, lsr #2
    15a0:	01060174 	tsteq	r6, r4, ror r1
    15a4:	0800044c 	stmdaeq	r0, {r2, r3, r6, sl}
    15a8:	080004f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, sl}
    15ac:	000008b7 			@ <UNDEFINED> instruction: 0x000008b7
    15b0:	00072601 	andeq	r2, r7, r1, lsl #12
    15b4:	22741c00 	rsbscs	r1, r4, #0, 24
    15b8:	76010001 	strvc	r0, [r1], -r1
    15bc:	00c91701 	sbceq	r1, r9, r1, lsl #14
    15c0:	91020000 	mrsls	r0, (UNDEF: 2)
    15c4:	21871d74 	orrcs	r1, r7, r4, ror sp
    15c8:	77010001 	strvc	r0, [r1, -r1]
    15cc:	06371201 	ldrteq	r1, [r7], -r1, lsl #4
    15d0:	54000000 	strpl	r0, [r0], #-0
    15d4:	55184000 	ldrpl	r4, [r8, #-0]
    15d8:	01000124 	tsteq	r0, r4, lsr #2
    15dc:	bd0e0179 	stflts	f0, [lr, #-484]	@ 0xfffffe1c
    15e0:	f5000000 			@ <UNDEFINED> instruction: 0xf5000000
    15e4:	ef000008 	svc	0x00000008
    15e8:	18000008 	stmdane	r0, {r3}
    15ec:	0001245b 	andeq	r2, r1, fp, asr r4
    15f0:	15017901 	strne	r7, [r1, #-2305]	@ 0xfffff6ff
    15f4:	000000bd 	strheq	r0, [r0], -sp
    15f8:	00000932 	andeq	r0, r0, r2, lsr r9
    15fc:	00000930 	andeq	r0, r0, r0, lsr r9
    1600:	01246118 			@ <UNDEFINED> instruction: 0x01246118
    1604:	01790100 	cmneq	r9, r0, lsl #2
    1608:	0000bd1c 	andeq	fp, r0, ip, lsl sp
    160c:	00095b00 	andeq	r5, r9, r0, lsl #22
    1610:	00094b00 	andeq	r4, r9, r0, lsl #22
    1614:	048e1e00 	streq	r1, [lr], #3584	@ 0xe00
    1618:	05a30800 	streq	r0, [r3, #2048]!	@ 0x800
    161c:	06d50000 	ldrbeq	r0, [r5], r0
    1620:	011a0000 	tsteq	sl, r0
    1624:	000c0550 	andeq	r0, ip, r0, asr r5
    1628:	1a400054 	bne	1001780 <_Min_Stack_Size+0x1001380>
    162c:	30015101 	andcc	r5, r1, r1, lsl #2
    1630:	04aa1e00 	strteq	r1, [sl], #3584	@ 0xe00
    1634:	05a30800 	streq	r0, [r3, #2048]!	@ 0x800
    1638:	06f10000 	ldrbteq	r0, [r1], r0
    163c:	011a0000 	tsteq	sl, r0
    1640:	000c0550 	andeq	r0, ip, r0, asr r5
    1644:	1a400054 	bne	100179c <_Min_Stack_Size+0x100139c>
    1648:	32015101 	andcc	r5, r1, #1073741824	@ 0x40000000
    164c:	04d81e00 	ldrbeq	r1, [r8], #3584	@ 0xe00
    1650:	05a30800 	streq	r0, [r3, #2048]!	@ 0x800
    1654:	070d0000 	streq	r0, [sp, -r0]
    1658:	011a0000 	tsteq	sl, r0
    165c:	000c0550 	andeq	r0, ip, r0, asr r5
    1660:	1a400054 	bne	10017b8 <_Min_Stack_Size+0x10013b8>
    1664:	34015101 	strcc	r5, [r1], #-257	@ 0xfffffeff
    1668:	04e21f00 	strbteq	r1, [r2], #3840	@ 0xf00
    166c:	05a30800 	streq	r0, [r3, #2048]!	@ 0x800
    1670:	011a0000 	tsteq	sl, r0
    1674:	000c0550 	andeq	r0, ip, r0, asr r5
    1678:	1a400054 	bne	10017d0 <_Min_Stack_Size+0x10013d0>
    167c:	33015101 	movwcc	r5, #4353	@ 0x1101
    1680:	01150000 	tsteq	r5, r0
    1684:	0001264b 	andeq	r2, r1, fp, asr #12
    1688:	06016f01 	streq	r6, [r1], -r1, lsl #30
    168c:	0003c401 	andeq	ip, r3, r1, lsl #8
    1690:	0003c608 	andeq	ip, r3, r8, lsl #12
    1694:	007d0208 	rsbseq	r0, sp, r8, lsl #4
    1698:	61012001 	tstvs	r1, r1
    169c:	01000121 	tsteq	r0, r1, lsr #2
    16a0:	01060161 	tsteq	r6, r1, ror #2
    16a4:	00076801 	andeq	r6, r7, r1, lsl #16
    16a8:	21872100 	orrcs	r2, r7, r0, lsl #2
    16ac:	61010001 	tstvs	r1, r1
    16b0:	06372901 	ldrteq	r2, [r7], -r1, lsl #18
    16b4:	f5210000 			@ <UNDEFINED> instruction: 0xf5210000
    16b8:	01000123 	tsteq	r0, r3, lsr #2
    16bc:	113f0161 	teqne	pc, r1, ror #2
    16c0:	00000003 	andeq	r0, r0, r3
    16c4:	24440120 	strbcs	r0, [r4], #-288	@ 0xfffffee0
    16c8:	54010001 	strpl	r0, [r1], #-1
    16cc:	01010601 	tsteq	r1, r1, lsl #12
    16d0:	00000793 	muleq	r0, r3, r7
    16d4:	01218721 			@ <UNDEFINED> instruction: 0x01218721
    16d8:	01540100 	cmpeq	r4, r0, lsl #2
    16dc:	00063724 	andeq	r3, r6, r4, lsr #14
    16e0:	23f52100 	mvnscs	r2, #0, 2
    16e4:	54010001 	strpl	r0, [r1], #-1
    16e8:	03113a01 	tsteq	r1, #4096	@ 0x1000
    16ec:	20000000 	andcs	r0, r0, r0
    16f0:	01226401 			@ <UNDEFINED> instruction: 0x01226401
    16f4:	01480100 	mrseq	r0, (UNDEF: 88)
    16f8:	cb010106 	blgt	41b18 <_Min_Stack_Size+0x41718>
    16fc:	21000007 	tstcs	r0, r7
    1700:	00012187 	andeq	r2, r1, r7, lsl #3
    1704:	23014801 	movwcs	r4, #6145	@ 0x1801
    1708:	00000637 	andeq	r0, r0, r7, lsr r6
    170c:	0123d221 			@ <UNDEFINED> instruction: 0x0123d221
    1710:	01480100 	mrseq	r0, (UNDEF: 88)
    1714:	0000b132 	andeq	fp, r0, r2, lsr r1
    1718:	25262100 	strcs	r2, [r6, #-256]!	@ 0xffffff00
    171c:	49010001 	stmdbmi	r1, {r0}
    1720:	035f1001 	cmpeq	pc, #1
    1724:	22000000 	andcs	r0, r0, #0
    1728:	01239001 			@ <UNDEFINED> instruction: 0x01239001
    172c:	0cea0100 	stfeqe	f0, [sl]
    1730:	00033801 	andeq	r3, r3, r1, lsl #16
	...
    173c:	007d0200 	rsbseq	r0, sp, r0, lsl #4
    1740:	00085c01 	andeq	r5, r8, r1, lsl #24
    1744:	21872300 	orrcs	r2, r7, r0, lsl #6
    1748:	ea010001 	b	41754 <_Min_Stack_Size+0x41354>
    174c:	0006372b 	andeq	r3, r6, fp, lsr #14
    1750:	0009fa00 	andeq	pc, r9, r0, lsl #20
    1754:	0009de00 	andeq	sp, r9, r0, lsl #28
    1758:	240b2400 	strcs	r2, [fp], #-1024	@ 0xfffffc00
    175c:	ea010001 	b	41768 <_Min_Stack_Size+0x41368>
    1760:	0003e038 	andeq	lr, r3, r8, lsr r0
    1764:	25510100 	ldrbcs	r0, [r1, #-256]	@ 0xffffff00
    1768:	00011fe5 	andeq	r1, r1, r5, ror #31
    176c:	bd0eec01 	stclt	12, cr14, [lr, #-4]
    1770:	b5000000 	strlt	r0, [r0, #-0]
    1774:	b100000a 	tstlt	r0, sl
    1778:	2500000a 	strcs	r0, [r0, #-10]
    177c:	000121a3 	andeq	r2, r1, r3, lsr #3
    1780:	bd19ec01 	ldclt	12, cr14, [r9, #-4]
    1784:	d9000000 	stmdble	r0, {}	@ <UNPREDICTABLE>
    1788:	d500000a 	strle	r0, [r0, #-10]
    178c:	2500000a 	strcs	r0, [r0, #-10]
    1790:	0001208f 	andeq	r2, r1, pc, lsl #1
    1794:	bd0eed01 	stclt	13, cr14, [lr, #-4]
    1798:	fd000000 	stc2	0, cr0, [r0, #-0]
    179c:	f900000a 			@ <UNDEFINED> instruction: 0xf900000a
    17a0:	2500000a 	strcs	r0, [r0, #-10]
    17a4:	000125ef 	andeq	r2, r1, pc, ror #11
    17a8:	3810ee01 	ldmdacc	r0, {r0, r9, sl, fp, sp, lr, pc}
    17ac:	23000003 	movwcs	r0, #3
    17b0:	1d00000b 	stcne	0, cr0, [r0, #-44]	@ 0xffffffd4
    17b4:	0000000b 	andeq	r0, r0, fp
    17b8:	26000126 	strcs	r0, [r0], -r6, lsr #2
    17bc:	cc010001 	stcgt	0, cr0, [r1], {1}
    17c0:	00000106 	andeq	r0, r0, r6, lsl #2
    17c4:	00000000 	andeq	r0, r0, r0
    17c8:	0b4e0000 	bleq	13817d0 <_Min_Stack_Size+0x13813d0>
    17cc:	ca010000 	bgt	417d4 <_Min_Stack_Size+0x413d4>
    17d0:	23000008 	movwcs	r0, #8
    17d4:	00012187 	andeq	r2, r1, r7, lsl #3
    17d8:	3725cc01 	strcc	ip, [r5, -r1, lsl #24]!
    17dc:	72000006 	andvc	r0, r0, #6
    17e0:	6e00000b 	cdpvs	0, 0, cr0, cr0, cr11, {0}
    17e4:	2300000b 	movwcs	r0, #11
    17e8:	000123f5 	strdeq	r2, [r1], -r5
    17ec:	113bcc01 	teqne	fp, r1, lsl #24
    17f0:	94000003 	strls	r0, [r0], #-3
    17f4:	9000000b 	andls	r0, r0, fp
    17f8:	2300000b 	movwcs	r0, #11
    17fc:	00012645 	andeq	r2, r1, r5, asr #12
    1800:	1111cd01 	tstne	r1, r1, lsl #26
    1804:	b9000005 	stmdblt	r0, {r0, r2}
    1808:	b500000b 	strlt	r0, [r0, #-11]
    180c:	1f00000b 	svcne	0x0000000b
    1810:	00000000 	andeq	r0, r0, r0
    1814:	000007cb 	andeq	r0, r0, fp, asr #15
    1818:	0250011a 	subseq	r0, r0, #-2147483642	@ 0x80000006
    181c:	011a0074 	tsteq	sl, r4, ror r0
    1820:	00750251 	rsbseq	r0, r5, r1, asr r2
    1824:	01220000 			@ <UNDEFINED> instruction: 0x01220000
    1828:	000124f8 	strdeq	r2, [r1], -r8
    182c:	0109c501 	tsteq	r9, r1, lsl #10
    1830:	000000a5 	andeq	r0, r0, r5, lsr #1
	...
    183c:	01007d02 	tsteq	r0, r2, lsl #26
    1840:	000008fd 	strdeq	r0, [r0], -sp
    1844:	01218723 			@ <UNDEFINED> instruction: 0x01218723
    1848:	30c50100 	sbccc	r0, r5, r0, lsl #2
    184c:	00000637 	andeq	r0, r0, r7, lsr r6
    1850:	00000bde 	ldrdeq	r0, [r0], -lr
    1854:	00000bda 	ldrdeq	r0, [r0], -sl
    1858:	b1012700 	tstlt	r1, r0, lsl #14
    185c:	01000122 	tsteq	r0, r2, lsr #2
    1860:	000106c0 	andeq	r0, r1, r0, asr #13
    1864:	00000000 	andeq	r0, r0, r0
    1868:	02000000 	andeq	r0, r0, #0
    186c:	3401007d 	strcc	r0, [r1], #-125	@ 0xffffff83
    1870:	24000009 	strcs	r0, [r0], #-9
    1874:	00012187 	andeq	r2, r1, r7, lsl #3
    1878:	372ac001 	strcc	ip, [sl, -r1]!
