NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    187c:	01000006 	tsteq	r0, r6
    1880:	30372450 	eorscc	r2, r7, r0, asr r4
    1884:	c0010001 	andgt	r0, r1, r1
    1888:	0000a538 	andeq	sl, r0, r8, lsr r5
    188c:	00510100 	subseq	r0, r1, r0, lsl #2
    1890:	21d60126 	bicscs	r0, r6, r6, lsr #2
    1894:	9c010001 	stcls	0, cr0, [r1], {1}
    1898:	00000106 	andeq	r0, r0, r6, lsl #2
    189c:	00000000 	andeq	r0, r0, r0
    18a0:	0bff0000 	bleq	fffc18a8 <_estack+0xdffbf0a8>
    18a4:	6a010000 	bvs	418ac <_Min_Stack_Size+0x414ac>
    18a8:	2300000b 	movwcs	r0, #11
    18ac:	00012187 	andeq	r2, r1, r7, lsl #3
    18b0:	37269c01 	strcc	r9, [r6, -r1, lsl #24]!
    18b4:	23000006 	movwcs	r0, #6
    18b8:	1f00000c 	svcne	0x0000000c
    18bc:	2300000c 	movwcs	r0, #12
    18c0:	000121a9 	andeq	r2, r1, r9, lsr #3
    18c4:	b1359c01 	teqlt	r5, r1, lsl #24
    18c8:	45000000 	strmi	r0, [r0, #-0]
    18cc:	4100000c 	tstmi	r0, ip
    18d0:	2300000c 	movwcs	r0, #12
    18d4:	00011feb 	andeq	r1, r1, fp, ror #31
    18d8:	6a479c01 	bvs	11e88e4 <_Min_Stack_Size+0x11e84e4>
    18dc:	6c00000b 	stcvs	0, cr0, [r0], {11}
    18e0:	6600000c 	strvs	r0, [r0], -ip
    18e4:	2300000c 	movwcs	r0, #12
    18e8:	00012099 	muleq	r1, r9, r0
    18ec:	bd0b9d01 	stclt	13, cr9, [fp, #-4]
    18f0:	9d000000 	stcls	0, cr0, [r0, #-0]
    18f4:	9500000c 	strls	r0, [r0, #-12]
    18f8:	2300000c 	movwcs	r0, #12
    18fc:	000124bc 			@ <UNDEFINED> instruction: 0x000124bc
    1900:	ea239d01 	b	8e8d0c <_Min_Stack_Size+0x8e890c>
    1904:	d8000004 	stmdale	r0, {r2}
    1908:	d400000c 	strle	r0, [r0], #-12
    190c:	2300000c 	movwcs	r0, #12
    1910:	00012645 	andeq	r2, r1, r5, asr #12
    1914:	11389d01 	teqne	r8, r1, lsl #26
    1918:	fc000005 	stc2	0, cr0, [r0], {5}
    191c:	f800000c 			@ <UNDEFINED> instruction: 0xf800000c
    1920:	2800000c 	stmdacs	r0, {r2, r3}
    1924:	9f010069 	svcls	0x00010069
    1928:	00009009 	andeq	r9, r0, r9
    192c:	000d2000 	andeq	r2, sp, r0
    1930:	000d1c00 	andeq	r1, sp, r0, lsl #24
    1934:	1ced2500 	cfstr64ne	mvdx2, [sp]
    1938:	b4010001 	strlt	r0, [r1], #-1
    193c:	00009009 	andeq	r9, r0, r9
    1940:	000d4700 	andeq	r4, sp, r0, lsl #14
    1944:	000d3f00 	andeq	r3, sp, r0, lsl #30
    1948:	07932900 	ldreq	r2, [r3, r0, lsl #18]
    194c:	00000000 	andeq	r0, r0, r0
    1950:	00010000 	andeq	r0, r1, r0
    1954:	00000000 	andeq	r0, r0, r0
    1958:	01000000 	mrseq	r0, (UNDEF: 0)
    195c:	0a2e05a3 	beq	b82ff0 <_Min_Stack_Size+0xb82bf0>
    1960:	bd2a0000 	stclt	0, cr0, [sl, #-0]
    1964:	a5000007 	strge	r0, [r0, #-7]
    1968:	a300000d 	movwge	r0, #13
    196c:	2a00000d 	bcs	19a8 <_Min_Stack_Size+0x15a8>
    1970:	000007b0 			@ <UNDEFINED> instruction: 0x000007b0
    1974:	00000dc1 	andeq	r0, r0, r1, asr #27
    1978:	00000db9 			@ <UNDEFINED> instruction: 0x00000db9
    197c:	0007a32a 	andeq	sl, r7, sl, lsr #6
    1980:	000e0100 	andeq	r0, lr, r0, lsl #2
    1984:	000dff00 	andeq	pc, sp, r0, lsl #30
    1988:	3d290000 	stccc	0, cr0, [r9, #-0]
    198c:	00000007 	andeq	r0, r0, r7
    1990:	01000000 	mrseq	r0, (UNDEF: 0)
	...
    199c:	6205a601 	andvs	sl, r5, #1048576	@ 0x100000
    19a0:	2a00000a 	bcs	19d0 <_Min_Stack_Size+0x15d0>
    19a4:	0000075a 	andeq	r0, r0, sl, asr r7
    19a8:	00000e16 	andeq	r0, r0, r6, lsl lr
    19ac:	00000e14 	andeq	r0, r0, r4, lsl lr
    19b0:	00074d2a 	andeq	r4, r7, sl, lsr #26
    19b4:	000e2c00 	andeq	r2, lr, r0, lsl #24
    19b8:	000e2a00 	andeq	r2, lr, r0, lsl #20
    19bc:	3d290000 	stccc	0, cr0, [r9, #-0]
    19c0:	00000007 	andeq	r0, r0, r7
    19c4:	01000000 	mrseq	r0, (UNDEF: 0)
	...
    19d0:	9602b201 	strls	fp, [r2], -r1, lsl #4
    19d4:	2a00000a 	bcs	1a04 <_Min_Stack_Size+0x1604>
    19d8:	0000075a 	andeq	r0, r0, sl, asr r7
    19dc:	00000e41 	andeq	r0, r0, r1, asr #28
    19e0:	00000e3f 	andeq	r0, r0, pc, lsr lr
    19e4:	00074d2a 	andeq	r4, r7, sl, lsr #26
    19e8:	000e5700 	andeq	r5, lr, r0, lsl #14
    19ec:	000e5500 	andeq	r5, lr, r0, lsl #10
    19f0:	68290000 	stmdavs	r9!, {}	@ <UNPREDICTABLE>
    19f4:	00000007 	andeq	r0, r0, r7
    19f8:	01000000 	mrseq	r0, (UNDEF: 0)
	...
    1a04:	ca02b701 	bgt	af610 <_Min_Stack_Size+0xaf210>
    1a08:	2a00000a 	bcs	1a38 <_Min_Stack_Size+0x1638>
    1a0c:	00000785 	andeq	r0, r0, r5, lsl #15
    1a10:	00000e6c 	andeq	r0, r0, ip, ror #28
    1a14:	00000e6a 	andeq	r0, r0, sl, ror #28
    1a18:	0007782a 	andeq	r7, r7, sl, lsr #16
    1a1c:	000e8200 	andeq	r8, lr, r0, lsl #4
    1a20:	000e8000 	andeq	r8, lr, r0
    1a24:	3d290000 	stccc	0, cr0, [r9, #-0]
    1a28:	00000007 	andeq	r0, r0, r7
    1a2c:	02000000 	andeq	r0, r0, #0
	...
    1a38:	fe02bb01 	vseleq.f64	d11, d2, d1
    1a3c:	2a00000a 	bcs	1a6c <_Min_Stack_Size+0x166c>
    1a40:	0000075a 	andeq	r0, r0, sl, asr r7
    1a44:	00000e97 	muleq	r0, r7, lr
    1a48:	00000e95 	muleq	r0, r5, lr
    1a4c:	00074d2a 	andeq	r4, r7, sl, lsr #26
    1a50:	000ead00 	andeq	sl, lr, r0, lsl #26
    1a54:	000eab00 	andeq	sl, lr, r0, lsl #22
    1a58:	001e0000 	andseq	r0, lr, r0
    1a5c:	5c000000 	stcpl	0, cr0, [r0], {-0}
    1a60:	1f000008 	svcne	0x00000008
    1a64:	1a00000b 	bne	1a98 <_Min_Stack_Size+0x1698>
    1a68:	74025001 	strvc	r5, [r2], #-1
    1a6c:	51011a00 	tstpl	r1, r0, lsl #20
    1a70:	011a3101 	tsteq	sl, r1, lsl #2
    1a74:	04910452 	ldreq	r0, [r1], #1106	@ 0x452
    1a78:	1e000194 	mcrne	1, 0, r0, cr0, cr4, {4}
    1a7c:	00000000 	andeq	r0, r0, r0
    1a80:	000007cb 	andeq	r0, r0, fp, asr #15
    1a84:	00000b39 	andeq	r0, r0, r9, lsr fp
    1a88:	0250011a 	subseq	r0, r0, #-2147483642	@ 0x80000006
    1a8c:	011a0074 	tsteq	sl, r4, ror r0
    1a90:	00750251 	rsbseq	r0, r5, r1, asr r2
    1a94:	00001e00 	andeq	r1, r0, r0, lsl #28
    1a98:	07cb0000 	strbeq	r0, [fp, r0]
    1a9c:	0b530000 	bleq	14c1aa4 <_Min_Stack_Size+0x14c16a4>
    1aa0:	011a0000 	tsteq	sl, r0
    1aa4:	00740250 	rsbseq	r0, r4, r0, asr r2
    1aa8:	0251011a 	subseq	r0, r1, #-2147483642	@ 0x80000006
    1aac:	1f000075 	svcne	0x00000075
    1ab0:	00000000 	andeq	r0, r0, r0
    1ab4:	000007cb 	andeq	r0, r0, fp, asr #15
    1ab8:	0250011a 	subseq	r0, r0, #-2147483642	@ 0x80000006
    1abc:	011a0074 	tsteq	sl, r4, ror r0
    1ac0:	00750251 	rsbseq	r0, r5, r1, asr r2
    1ac4:	040f0000 	streq	r0, [pc], #-0	@ 1acc <_Min_Stack_Size+0x16cc>
    1ac8:	000000a5 	andeq	r0, r0, r5, lsr #1
    1acc:	234a0126 	movtcs	r0, #41254	@ 0xa126
    1ad0:	84010001 	strhi	r0, [r1], #-1
    1ad4:	00000106 	andeq	r0, r0, r6, lsl #2
    1ad8:	00000000 	andeq	r0, r0, r0
    1adc:	0ec00000 	cdpeq	0, 12, cr0, cr0, cr0, {0}
    1ae0:	10010000 	andne	r0, r1, r0
    1ae4:	2300000d 	movwcs	r0, #13
    1ae8:	00012187 	andeq	r2, r1, r7, lsl #3
    1aec:	37268401 	strcc	r8, [r6, -r1, lsl #8]!
    1af0:	e4000006 	str	r0, [r0], #-6
    1af4:	e000000e 	and	r0, r0, lr
    1af8:	2300000e 	movwcs	r0, #14
    1afc:	000121a9 	andeq	r2, r1, r9, lsr #3
    1b00:	b1358401 	teqlt	r5, r1, lsl #8
    1b04:	06000000 	streq	r0, [r0], -r0
    1b08:	0200000f 	andeq	r0, r0, #15
    1b0c:	2300000f 	movwcs	r0, #15
    1b10:	00011feb 	andeq	r1, r1, fp, ror #31
    1b14:	6a478401 	bvs	11e2b20 <_Min_Stack_Size+0x11e2720>
    1b18:	2f00000b 	svccs	0x0000000b
    1b1c:	2700000f 	strcs	r0, [r0, -pc]
    1b20:	2300000f 	movwcs	r0, #15
    1b24:	00012099 	muleq	r1, r9, r0
    1b28:	bd0b8501 	cfstr32lt	mvfx8, [fp, #-4]
    1b2c:	6e000000 	cdpvs	0, 0, cr0, cr0, cr0, {0}
    1b30:	6800000f 	stmdavs	r0, {r0, r1, r2, r3}
    1b34:	2300000f 	movwcs	r0, #15
    1b38:	000124bc 			@ <UNDEFINED> instruction: 0x000124bc
    1b3c:	ea238501 	b	8e2f48 <_Min_Stack_Size+0x8e2b48>
    1b40:	9e000004 	cdpls	0, 0, cr0, cr0, cr4, {0}
    1b44:	9a00000f 	bls	1b88 <_Min_Stack_Size+0x1788>
    1b48:	2300000f 	movwcs	r0, #15
    1b4c:	00012645 	andeq	r2, r1, r5, asr #12
    1b50:	11388501 	teqne	r8, r1, lsl #10
    1b54:	c2000005 	andgt	r0, r0, #5
    1b58:	be00000f 	cdplt	0, 0, cr0, cr0, cr15, {0}
    1b5c:	2800000f 	stmdacs	r0, {r0, r1, r2, r3}
    1b60:	87010069 	strhi	r0, [r1, -r9, rrx]
    1b64:	00009009 	andeq	r9, r0, r9
    1b68:	000fea00 	andeq	lr, pc, r0, lsl #20
    1b6c:	000fe200 	andeq	lr, pc, r0, lsl #4
    1b70:	07932900 	ldreq	r2, [r3, r0, lsl #18]
    1b74:	00000000 	andeq	r0, r0, r0
    1b78:	00010000 	andeq	r0, r1, r0
    1b7c:	00000000 	andeq	r0, r0, r0
    1b80:	01000000 	mrseq	r0, (UNDEF: 0)
    1b84:	0c56058b 	cfldr64eq	mvdx0, [r6], {139}	@ 0x8b
    1b88:	bd2a0000 	stclt	0, cr0, [sl, #-0]
    1b8c:	37000007 	strcc	r0, [r0, -r7]
    1b90:	35000010 	strcc	r0, [r0, #-16]
    1b94:	2a000010 	bcs	1bdc <_Min_Stack_Size+0x17dc>
    1b98:	000007b0 			@ <UNDEFINED> instruction: 0x000007b0
    1b9c:	0000104f 	andeq	r1, r0, pc, asr #32
    1ba0:	0000104b 	andeq	r1, r0, fp, asr #32
    1ba4:	0007a32a 	andeq	sl, r7, sl, lsr #6
    1ba8:	00107300 	andseq	r7, r0, r0, lsl #6
    1bac:	00107100 	andseq	r7, r0, r0, lsl #2
    1bb0:	68290000 	stmdavs	r9!, {}	@ <UNPREDICTABLE>
    1bb4:	00000007 	andeq	r0, r0, r7
    1bb8:	01000000 	mrseq	r0, (UNDEF: 0)
	...
    1bc4:	8a029801 	bhi	a7bd0 <_Min_Stack_Size+0xa77d0>
    1bc8:	2a00000c 	bcs	1c00 <_Min_Stack_Size+0x1800>
    1bcc:	00000785 	andeq	r0, r0, r5, lsl #15
    1bd0:	00001088 	andeq	r1, r0, r8, lsl #1
    1bd4:	00001086 	andeq	r1, r0, r6, lsl #1
    1bd8:	0007782a 	andeq	r7, r7, sl, lsr #16
    1bdc:	00109e00 	andseq	r9, r0, r0, lsl #28
    1be0:	00109c00 	andseq	r9, r0, r0, lsl #24
    1be4:	001e0000 	andseq	r0, lr, r0
    1be8:	5c000000 	stcpl	0, cr0, [r0], {-0}
    1bec:	ab000008 	blge	1c14 <_Min_Stack_Size+0x1814>
    1bf0:	1a00000c 	bne	1c28 <_Min_Stack_Size+0x1828>
    1bf4:	74025001 	strvc	r5, [r2], #-1
    1bf8:	51011a00 	tstpl	r1, r0, lsl #20
    1bfc:	011a3101 	tsteq	sl, r1, lsl #2
    1c00:	04910452 	ldreq	r0, [r1], #1106	@ 0x452
    1c04:	1e000194 	mcrne	1, 0, r0, cr0, cr4, {4}
    1c08:	00000000 	andeq	r0, r0, r0
    1c0c:	000007cb 	andeq	r0, r0, fp, asr #15
    1c10:	00000cc5 	andeq	r0, r0, r5, asr #25
    1c14:	0250011a 	subseq	r0, r0, #-2147483642	@ 0x80000006
    1c18:	011a0074 	tsteq	sl, r4, ror r0
    1c1c:	00780251 	rsbseq	r0, r8, r1, asr r2
    1c20:	00001e00 	andeq	r1, r0, r0, lsl #28
    1c24:	07cb0000 	strbeq	r0, [fp, r0]
    1c28:	0cdf0000 	ldcleq	0, cr0, [pc], {0}
    1c2c:	011a0000 	tsteq	sl, r0
    1c30:	00740250 	rsbseq	r0, r4, r0, asr r2
    1c34:	0251011a 	subseq	r0, r1, #-2147483642	@ 0x80000006
    1c38:	1e000078 	mcrne	0, 0, r0, cr0, cr8, {3}
    1c3c:	00000000 	andeq	r0, r0, r0
    1c40:	000007cb 	andeq	r0, r0, fp, asr #15
    1c44:	00000cf9 	strdeq	r0, [r0], -r9
    1c48:	0250011a 	subseq	r0, r0, #-2147483642	@ 0x80000006
    1c4c:	011a0074 	tsteq	sl, r4, ror r0
    1c50:	00780251 	rsbseq	r0, r8, r1, asr r2
    1c54:	00001f00 	andeq	r1, r0, r0, lsl #30
    1c58:	07cb0000 	strbeq	r0, [fp, r0]
    1c5c:	011a0000 	tsteq	sl, r0
    1c60:	00740250 	rsbseq	r0, r4, r0, asr r2
    1c64:	0251011a 	subseq	r0, r1, #-2147483642	@ 0x80000006
    1c68:	00000075 	andeq	r0, r0, r5, ror r0
    1c6c:	23140126 	tstcs	r4, #-2147483639	@ 0x80000009
    1c70:	6c010001 	stcvs	0, cr0, [r1], {1}
    1c74:	00000106 	andeq	r0, r0, r6, lsl #2
    1c78:	00000000 	andeq	r0, r0, r0
    1c7c:	10b10000 	adcsne	r0, r1, r0
    1c80:	b3010000 	movwlt	r0, #4096	@ 0x1000
    1c84:	2300000d 	movwcs	r0, #13
    1c88:	00012187 	andeq	r2, r1, r7, lsl #3
    1c8c:	372a6c01 	strcc	r6, [sl, -r1, lsl #24]!
    1c90:	01000006 	tsteq	r0, r6
    1c94:	f5000011 			@ <UNDEFINED> instruction: 0xf5000011
    1c98:	2b000010 	blcs	1ce0 <_Min_Stack_Size+0x18e0>
    1c9c:	0001212a 	andeq	r2, r1, sl, lsr #2
    1ca0:	ea166f01 	b	59d8ac <_Min_Stack_Size+0x59d4ac>
    1ca4:	02000002 	andeq	r0, r0, #2
    1ca8:	001e7491 	mulseq	lr, r1, r4
    1cac:	40000000 	andmi	r0, r0, r0
    1cb0:	68000005 	stmdavs	r0, {r0, r2}
    1cb4:	1a00000d 	bne	1cf0 <_Min_Stack_Size+0x18f0>
    1cb8:	74025001 	strvc	r5, [r2], #-1
    1cbc:	51011a00 	tstpl	r1, r0, lsl #20
    1cc0:	00749102 	rsbseq	r9, r4, r2, lsl #2
    1cc4:	0000001e 	andeq	r0, r0, lr, lsl r0
    1cc8:	00054000 	andeq	r4, r5, r0
    1ccc:	000d8200 	andeq	r8, sp, r0, lsl #4
    1cd0:	50011a00 	andpl	r1, r1, r0, lsl #20
    1cd4:	1a007402 	bne	1ece4 <_Min_Stack_Size+0x1e8e4>
    1cd8:	91025101 	tstls	r2, r1, lsl #2
    1cdc:	001e0074 	andseq	r0, lr, r4, ror r0
    1ce0:	40000000 	andmi	r0, r0, r0
    1ce4:	9c000005 	stcls	0, cr0, [r0], {5}
    1ce8:	1a00000d 	bne	1d24 <_Min_Stack_Size+0x1924>
    1cec:	74025001 	strvc	r5, [r2], #-1
    1cf0:	51011a00 	tstpl	r1, r0, lsl #20
    1cf4:	00749102 	rsbseq	r9, r4, r2, lsl #2
    1cf8:	0000001f 	andeq	r0, r0, pc, lsl r0
    1cfc:	00054000 	andeq	r4, r5, r0
    1d00:	50011a00 	andpl	r1, r1, r0, lsl #20
    1d04:	1a007402 	bne	1ed14 <_Min_Stack_Size+0x1e914>
    1d08:	91025101 	tstls	r2, r1, lsl #2
    1d0c:	27000074 	smlsdxcs	r0, r4, r0, r0
    1d10:	01201801 			@ <UNDEFINED> instruction: 0x01201801
    1d14:	065d0100 	ldrbeq	r0, [sp], -r0, lsl #2
    1d18:	00000001 	andeq	r0, r0, r1
    1d1c:	00000000 	andeq	r0, r0, r0
    1d20:	007d0200 	rsbseq	r0, sp, r0, lsl #4
    1d24:	000ddc01 	andeq	sp, sp, r1, lsl #24
    1d28:	21872400 	orrcs	r2, r7, r0, lsl #8
    1d2c:	5d010001 	stcpl	0, cr0, [r1, #-4]
    1d30:	00063722 	andeq	r3, r6, r2, lsr #14
    1d34:	00500100 	subseq	r0, r0, r0, lsl #2
    1d38:	265e0126 	ldrbcs	r0, [lr], -r6, lsr #2
    1d3c:	16010001 	strne	r0, [r1], -r1
    1d40:	00000106 	andeq	r0, r0, r6, lsl #2
    1d44:	00000000 	andeq	r0, r0, r0
    1d48:	11540000 	cmpne	r4, r0
    1d4c:	79010000 	stmdbvc	r1, {}	@ <UNPREDICTABLE>
    1d50:	2300000e 	movwcs	r0, #14
    1d54:	00012187 	andeq	r2, r1, r7, lsl #3
    1d58:	37211601 	strcc	r1, [r1, -r1, lsl #12]!
    1d5c:	80000006 	andhi	r0, r0, r6
    1d60:	74000011 	strvc	r0, [r0], #-17	@ 0xffffffef
    1d64:	23000011 	movwcs	r0, #17
    1d68:	000126c8 	andeq	r2, r1, r8, asr #13
    1d6c:	79381601 	ldmdbvc	r8!, {r0, r9, sl, ip}
    1d70:	d600000e 	strle	r0, [r0], -lr
    1d74:	ca000011 	bgt	1dc0 <_Min_Stack_Size+0x19c0>
    1d78:	25000011 	strcs	r0, [r0, #-17]	@ 0xffffffef
    1d7c:	0001225c 	andeq	r2, r1, ip, asr r2
    1d80:	b10e1801 	tstlt	lr, r1, lsl #16
    1d84:	38000000 	stmdacc	r0, {}	@ <UNPREDICTABLE>
    1d88:	20000012 	andcs	r0, r0, r2, lsl r0
    1d8c:	25000012 	strcs	r0, [r0, #-18]	@ 0xffffffee
    1d90:	00012048 	andeq	r2, r1, r8, asr #32
    1d94:	b11b1801 	tstlt	fp, r1, lsl #16
    1d98:	11000000 	mrsne	r0, (UNDEF: 0)
    1d9c:	09000013 	stmdbeq	r0, {r0, r1, r4}
    1da0:	25000013 	strcs	r0, [r0, #-19]	@ 0xffffffed
    1da4:	00012088 	andeq	r2, r1, r8, lsl #1
    1da8:	b12a1801 			@ <UNDEFINED> instruction: 0xb12a1801
    1dac:	51000000 	mrspl	r0, (UNDEF: 0)
    1db0:	49000013 	stmdbmi	r0, {r0, r1, r4}
    1db4:	25000013 	strcs	r0, [r0, #-19]	@ 0xffffffed
    1db8:	000120c7 	andeq	r2, r1, r7, asr #1
    1dbc:	bd0e1901 	vstrlt.16	s2, [lr, #-2]	@ <UNPREDICTABLE>
    1dc0:	a8000000 	stmdage	r0, {}	@ <UNPREDICTABLE>
    1dc4:	a2000013 	andge	r0, r0, #19
    1dc8:	2c000013 	stccs	0, cr0, [r0], {19}
    1dcc:	00000000 	andeq	r0, r0, r0
    1dd0:	00000566 	andeq	r0, r0, r6, ror #10
    1dd4:	c3040f00 	movwgt	r0, #20224	@ 0x4f00
    1dd8:	2d000004 	stccs	0, cr0, [r0, #-16]
    1ddc:	00000793 	muleq	r0, r3, r7
	...
    1de8:	01007d02 	tsteq	r0, r2, lsl #26
    1dec:	00000eb0 			@ <UNDEFINED> instruction: 0x00000eb0
    1df0:	0007a32e 	andeq	sl, r7, lr, lsr #6
    1df4:	2a500100 	bcs	14021fc <_Min_Stack_Size+0x1401dfc>
    1df8:	000007b0 			@ <UNDEFINED> instruction: 0x000007b0
    1dfc:	000013e1 	andeq	r1, r0, r1, ror #7
    1e00:	000013db 	ldrdeq	r1, [r0], -fp
    1e04:	0007bd2e 	andeq	fp, r7, lr, lsr #26
    1e08:	00520100 	subseq	r0, r2, r0, lsl #2
    1e0c:	0007682d 	andeq	r6, r7, sp, lsr #16
	...
    1e18:	007d0200 	rsbseq	r0, sp, r0, lsl #4
    1e1c:	000ed401 	andeq	sp, lr, r1, lsl #8
    1e20:	07782e00 	ldrbeq	r2, [r8, -r0, lsl #28]!
    1e24:	50010000 	andpl	r0, r1, r0
    1e28:	0007852e 	andeq	r8, r7, lr, lsr #10
    1e2c:	00510100 	subseq	r0, r1, r0, lsl #2
    1e30:	00073d2f 	andeq	r3, r7, pc, lsr #26
	...
    1e3c:	007d0200 	rsbseq	r0, sp, r0, lsl #4
    1e40:	074d2e01 	strbeq	r2, [sp, -r1, lsl #28]
    1e44:	50010000 	andpl	r0, r1, r0
    1e48:	00075a2e 	andeq	r5, r7, lr, lsr #20
    1e4c:	00510100 	subseq	r0, r1, r0, lsl #2
    1e50:	0008c400 	andeq	ip, r8, r0, lsl #8
    1e54:	3d000200 	sfmcc	f0, 4, [r0, #-0]
    1e58:	04000008 	streq	r0, [r0], #-8
    1e5c:	002e3801 	eoreq	r3, lr, r1, lsl #16
    1e60:	2caa0c00 	stccs	12, cr0, [sl]
    1e64:	15110001 	ldrne	r0, [r1, #-1]
    1e68:	01c80000 	biceq	r0, r8, r0
	...
    1e74:	2c0f0000 	stccs	0, cr0, [pc], {-0}
    1e78:	1d970000 	ldcne	0, cr0, [r7]
    1e7c:	01020000 	mrseq	r0, (UNDEF: 2)
    1e80:	00217d06 	eoreq	r7, r1, r6, lsl #26
    1e84:	0db10300 	ldceq	3, cr0, [r1]
    1e88:	2b020001 	blcs	81e94 <_Min_Stack_Size+0x81a94>
    1e8c:	00004018 	andeq	r4, r0, r8, lsl r0
    1e90:	08010200 	stmdaeq	r1, {r9}
    1e94:	000022aa 	andeq	r2, r0, sl, lsr #5
    1e98:	9b050202 	blls	1426a8 <_Min_Stack_Size+0x1422a8>
    1e9c:	03000005 	movweq	r0, #5
    1ea0:	0001107c 	andeq	r1, r1, ip, ror r0
    1ea4:	5a193902 	bpl	6502b4 <_Min_Stack_Size+0x64feb4>
    1ea8:	02000000 	andeq	r0, r0, #0
    1eac:	26dd0702 	ldrbcs	r0, [sp], r2, lsl #14
    1eb0:	04020000 	streq	r0, [r2], #-0
    1eb4:	00200105 	eoreq	r0, r0, r5, lsl #2
    1eb8:	142b0300 	strtne	r0, [fp], #-768	@ 0xfffffd00
    1ebc:	4f020001 	svcmi	0x00020001
    1ec0:	00007419 	andeq	r7, r0, r9, lsl r4
    1ec4:	07040200 	streq	r0, [r4, -r0, lsl #4]
    1ec8:	00001d74 	andeq	r1, r0, r4, ror sp
    1ecc:	22050802 	andcs	r0, r5, #131072	@ 0x20000
    1ed0:	02000012 	andeq	r0, r0, #18
    1ed4:	2bb60708 	blcs	fed83afc <_estack+0xded812fc>
    1ed8:	04040000 	streq	r0, [r4], #-0
    1edc:	746e6905 	strbtvc	r6, [lr], #-2309	@ 0xfffff6fb
    1ee0:	07040200 	streq	r0, [r4, -r0, lsl #4]
    1ee4:	00002061 	andeq	r2, r0, r1, rrx
    1ee8:	a6040802 	strge	r0, [r4], -r2, lsl #16
    1eec:	020000f0 	andeq	r0, r0, #240	@ 0xf0
    1ef0:	21840801 	orrcs	r0, r4, r1, lsl #16
    1ef4:	b3030000 	movwlt	r0, #12288	@ 0x3000
    1ef8:	0300010d 	movweq	r0, #269	@ 0x10d
    1efc:	00341318 	eorseq	r1, r4, r8, lsl r3
    1f00:	7e030000 	cdpvc	0, 0, cr0, cr3, cr0, {0}
    1f04:	03000110 	movweq	r0, #272	@ 0x110
    1f08:	004e1424 	subeq	r1, lr, r4, lsr #8
    1f0c:	2d030000 	stccs	0, cr0, [r3, #-0]
    1f10:	03000114 	movweq	r0, #276	@ 0x114
    1f14:	00681430 	rsbeq	r1, r8, r0, lsr r4
    1f18:	bd050000 	stclt	0, cr0, [r5, #-0]
    1f1c:	06000000 	streq	r0, [r0], -r0
    1f20:	0939041c 	ldmdbeq	r9!, {r2, r3, r4, sl}
    1f24:	00000141 	andeq	r0, r0, r1, asr #2
    1f28:	4c524307 	mrrcmi	3, 0, r4, r2, cr7
    1f2c:	173a0400 	ldrne	r0, [sl, -r0, lsl #8]!
    1f30:	000000c9 	andeq	r0, r0, r9, asr #1
    1f34:	07002302 	streq	r2, [r0, -r2, lsl #6]
    1f38:	00485243 	subeq	r5, r8, r3, asr #4
    1f3c:	c9173b04 	ldmdbgt	r7, {r2, r8, r9, fp, ip, sp}
    1f40:	02000000 	andeq	r0, r0, #0
    1f44:	49070423 	stmdbmi	r7, {r0, r1, r5, sl}
    1f48:	04005244 	streq	r5, [r0], #-580	@ 0xfffffdbc
    1f4c:	00c9173c 	sbceq	r1, r9, ip, lsr r7
    1f50:	23020000 	movwcs	r0, #8192	@ 0x2000
    1f54:	444f0708 	strbmi	r0, [pc], #-1800	@ 1f5c <_Min_Stack_Size+0x1b5c>
    1f58:	3d040052 	stccc	0, cr0, [r4, #-328]	@ 0xfffffeb8
    1f5c:	0000c917 	andeq	ip, r0, r7, lsl r9
    1f60:	0c230200 	sfmeq	f0, 4, [r3], #-0
    1f64:	011cf308 	tsteq	ip, r8, lsl #6	@ <UNPREDICTABLE>
    1f68:	173e0400 	ldrne	r0, [lr, -r0, lsl #8]!
    1f6c:	000000c9 	andeq	r0, r0, r9, asr #1
    1f70:	07102302 	ldreq	r2, [r0, -r2, lsl #6]
    1f74:	00525242 	subseq	r5, r2, r2, asr #4
    1f78:	c9173f04 	ldmdbgt	r7, {r2, r8, r9, sl, fp, ip, sp}
    1f7c:	02000000 	andeq	r0, r0, #0
    1f80:	3e081423 	cdpcc	4, 0, cr1, cr8, cr3, {1}
    1f84:	04000114 	streq	r0, [r0], #-276	@ 0xfffffeec
    1f88:	00c91740 	sbceq	r1, r9, r0, asr #14
    1f8c:	23020000 	movwcs	r0, #8192	@ 0x2000
    1f90:	1c030018 	stcne	0, cr0, [r3], {24}
    1f94:	0400011d 	streq	r0, [r0], #-285	@ 0xfffffee3
    1f98:	00ce0341 	sbceq	r0, lr, r1, asr #6
    1f9c:	30060000 	andcc	r0, r6, r0
    1fa0:	0a094404 	beq	252fb8 <_Min_Stack_Size+0x252bb8>
    1fa4:	07000002 	streq	r0, [r0, -r2]
    1fa8:	04005243 	streq	r5, [r0], #-579	@ 0xfffffdbd
    1fac:	00c91745 	sbceq	r1, r9, r5, asr #14
    1fb0:	23020000 	movwcs	r0, #8192	@ 0x2000
    1fb4:	29c40800 	stmibcs	r4, {fp}^
    1fb8:	46040001 	strmi	r0, [r4], -r1
    1fbc:	0000c917 	andeq	ip, r0, r7, lsl r9
    1fc0:	04230200 	strteq	r0, [r3], #-512	@ 0xfffffe00
    1fc4:	52494307 	subpl	r4, r9, #469762048	@ 0x1c000000
    1fc8:	17470400 	strbne	r0, [r7, -r0, lsl #8]
    1fcc:	000000c9 	andeq	r0, r0, r9, asr #1
    1fd0:	08082302 	stmdaeq	r8, {r1, r8, r9, sp}
    1fd4:	000123b0 			@ <UNDEFINED> instruction: 0x000123b0
    1fd8:	c9174804 	ldmdbgt	r7, {r2, fp, lr}
    1fdc:	02000000 	andeq	r0, r0, #0
    1fe0:	cd080c23 	stcgt	12, cr0, [r8, #-140]	@ 0xffffff74
    1fe4:	04000124 	streq	r0, [r0], #-292	@ 0xfffffedc
    1fe8:	00c91749 	sbceq	r1, r9, r9, asr #14
    1fec:	23020000 	movwcs	r0, #8192	@ 0x2000
    1ff0:	26120810 			@ <UNDEFINED> instruction: 0x26120810
    1ff4:	4a040001 	bmi	102000 <_Min_Stack_Size+0x101c00>
    1ff8:	0000c917 	andeq	ip, r0, r7, lsl r9
    1ffc:	14230200 	strtne	r0, [r3], #-512	@ 0xfffffe00
    2000:	0120bf08 			@ <UNDEFINED> instruction: 0x0120bf08
    2004:	174b0400 	strbne	r0, [fp, -r0, lsl #8]
    2008:	000000c9 	andeq	r0, r0, r9, asr #1
    200c:	08182302 	ldmdaeq	r8, {r1, r8, r9, sp}
    2010:	000124d6 	ldrdeq	r2, [r1], -r6
    2014:	c9174c04 	ldmdbgt	r7, {r2, sl, fp, lr}
    2018:	02000000 	andeq	r0, r0, #0
    201c:	4b081c23 	blmi	2090b0 <_Min_Stack_Size+0x208cb0>
    2020:	04000122 	streq	r0, [r0], #-290	@ 0xfffffede
    2024:	00c9174d 	sbceq	r1, r9, sp, asr #14
    2028:	23020000 	movwcs	r0, #8192	@ 0x2000
    202c:	53430720 	movtpl	r0, #14112	@ 0x3720
    2030:	4e040052 	mcrmi	0, 0, r0, cr4, cr2, {2}
    2034:	0000c917 	andeq	ip, r0, r7, lsl r9
    2038:	24230200 	strtcs	r0, [r3], #-512	@ 0xfffffe00
    203c:	01261908 			@ <UNDEFINED> instruction: 0x01261908
    2040:	174f0400 	strbne	r0, [pc, -r0, lsl #8]
    2044:	000000c9 	andeq	r0, r0, r9, asr #1
    2048:	08282302 	stmdaeq	r8!, {r1, r8, r9, sp}
    204c:	00012405 	andeq	r2, r1, r5, lsl #8
    2050:	c9175004 	ldmdbgt	r7, {r2, ip, lr}
    2054:	02000000 	andeq	r0, r0, #0
    2058:	03002c23 	movweq	r2, #3107	@ 0xc23
    205c:	000125d0 	ldrdeq	r2, [r1], -r0
    2060:	4d035104 	stfmis	f5, [r3, #-16]
    2064:	06000001 	streq	r0, [r0], -r1
    2068:	09720424 	ldmdbeq	r2!, {r2, r5, sl}^
    206c:	000002a7 	andeq	r0, r0, r7, lsr #5
    2070:	012c9a08 			@ <UNDEFINED> instruction: 0x012c9a08
    2074:	17730400 	ldrbne	r0, [r3, -r0, lsl #8]!
    2078:	000000c9 	andeq	r0, r0, r9, asr #1
    207c:	08002302 	stmdaeq	r0, {r1, r8, r9, sp}
    2080:	00012ca2 	andeq	r2, r1, r2, lsr #25
    2084:	c9177404 	ldmdbgt	r7, {r2, sl, ip, sp, lr}
    2088:	02000000 	andeq	r0, r0, #0
    208c:	75080423 	strvc	r0, [r8, #-1059]	@ 0xfffffbdd
    2090:	0400012a 	streq	r0, [r0], #-298	@ 0xfffffed6
    2094:	00c91775 	sbceq	r1, r9, r5, ror r7
    2098:	23020000 	movwcs	r0, #8192	@ 0x2000
    209c:	270c0808 	strcs	r0, [ip, -r8, lsl #16]
    20a0:	76040001 	strvc	r0, [r4], -r1
    20a4:	0000c917 	andeq	ip, r0, r7, lsl r9
    20a8:	0c230200 	sfmeq	f0, 4, [r3], #-0
    20ac:	0127c108 			@ <UNDEFINED> instruction: 0x0127c108
    20b0:	17770400 	ldrbne	r0, [r7, -r0, lsl #8]!
    20b4:	000000c9 	andeq	r0, r0, r9, asr #1
    20b8:	08102302 	ldmdaeq	r0, {r1, r8, r9, sp}
    20bc:	000126d7 	ldrdeq	r2, [r1], -r7
    20c0:	c9177804 	ldmdbgt	r7, {r2, fp, ip, sp, lr}
    20c4:	02000000 	andeq	r0, r0, #0
    20c8:	39081423 	stmdbcc	r8, {r0, r1, r5, sl, ip}
    20cc:	0400012a 	streq	r0, [r0], #-298	@ 0xfffffed6
    20d0:	00c91779 	sbceq	r1, r9, r9, ror r7
    20d4:	23020000 	movwcs	r0, #8192	@ 0x2000
    20d8:	29bd0818 	ldmibcs	sp!, {r3, r4, fp}
    20dc:	7a040001 	bvc	1020e8 <_Min_Stack_Size+0x101ce8>
    20e0:	0000c917 	andeq	ip, r0, r7, lsl r9
    20e4:	1c230200 	sfmne	f0, 4, [r3], #-0
    20e8:	0128ab08 			@ <UNDEFINED> instruction: 0x0128ab08
    20ec:	177b0400 	ldrbne	r0, [fp, -r0, lsl #8]!
