NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    20f0:	000000c9 	andeq	r0, r0, r9, asr #1
    20f4:	00202302 	eoreq	r2, r0, r2, lsl #6
    20f8:	012c5d03 			@ <UNDEFINED> instruction: 0x012c5d03
    20fc:	037c0400 	cmneq	ip, #0, 8
    2100:	00000216 	andeq	r0, r0, r6, lsl r2
    2104:	11050406 	tstne	r5, r6, lsl #8
    2108:	0002ea09 	andeq	lr, r2, r9, lsl #20
    210c:	1c2e0800 	stcne	8, cr0, [lr], #-0
    2110:	13050001 	movwne	r0, #20481	@ 0x5001
    2114:	0000b10b 	andeq	fp, r0, fp, lsl #2
    2118:	00230200 	eoreq	r0, r3, r0, lsl #4
    211c:	010f2308 	tsteq	pc, r8, lsl #6
    2120:	0a160500 	beq	583528 <_Min_Stack_Size+0x583128>
    2124:	000000a5 	andeq	r0, r0, r5, lsr #1
    2128:	08022302 	stmdaeq	r2, {r1, r8, r9, sp}
    212c:	00010aec 	andeq	r0, r1, ip, ror #21
    2130:	a50a1905 	strge	r1, [sl, #-2309]	@ 0xfffff6fb
    2134:	02000000 	andeq	r0, r0, #0
    2138:	03000323 	movweq	r0, #803	@ 0x323
    213c:	00011087 	andeq	r1, r1, r7, lsl #1
    2140:	b3071c05 	movwlt	r1, #31749	@ 0x7c05
    2144:	09000002 	stmdbeq	r0, {r1}
    2148:	00012c90 	muleq	r1, r0, ip
    214c:	080e0601 	stmdaeq	lr, {r0, r9, sl}
    2150:	0000034c 	andeq	r0, r0, ip, asr #6
    2154:	4558540a 	ldrbmi	r5, [r8, #-1034]	@ 0xfffffbf6
    2158:	0a100600 	beq	403960 <_Min_Stack_Size+0x403560>
    215c:	000000a5 	andeq	r0, r0, r5, lsr #1
    2160:	02070101 	andeq	r0, r7, #1073741824	@ 0x40000000
    2164:	2f0b0023 	svccs	0x000b0023
    2168:	0600012b 	streq	r0, [r0], -fp, lsr #2
    216c:	00a50a11 	adceq	r0, r5, r1, lsl sl
    2170:	01010000 	mrseq	r0, (UNDEF: 1)
    2174:	00230206 	eoreq	r0, r3, r6, lsl #4
    2178:	0127bc0b 			@ <UNDEFINED> instruction: 0x0127bc0b
    217c:	0a120600 	beq	483984 <_Min_Stack_Size+0x483584>
    2180:	000000a5 	andeq	r0, r0, r5, lsr #1
    2184:	02050101 	andeq	r0, r5, #1073741824	@ 0x40000000
    2188:	de0b0023 	cdple	0, 0, cr0, cr11, cr3, {1}
    218c:	0600012a 	streq	r0, [r0], -sl, lsr #2
    2190:	00a50a13 	adceq	r0, r5, r3, lsl sl
    2194:	05010000 	streq	r0, [r1, #-0]
    2198:	00230200 	eoreq	r0, r3, r0, lsl #4
    219c:	06180600 	ldreq	r0, [r8], -r0, lsl #12
    21a0:	03ec0917 	mvneq	r0, #376832	@ 0x5c000
    21a4:	23080000 	movwcs	r0, #32768	@ 0x8000
    21a8:	0600012b 	streq	r0, [r0], -fp, lsr #2
    21ac:	00b1181a 	adcseq	r1, r1, sl, lsl r8
    21b0:	23020000 	movwcs	r0, #8192	@ 0x2000
    21b4:	28fa0800 	ldmcs	sl!, {fp}^
    21b8:	1c060001 	stcne	0, cr0, [r6], {1}
    21bc:	0000b116 	andeq	fp, r0, r6, lsl r1
    21c0:	02230200 	eoreq	r0, r3, #0, 4
    21c4:	012e1608 			@ <UNDEFINED> instruction: 0x012e1608
    21c8:	121e0600 	andsne	r0, lr, #0, 12
    21cc:	000000b1 	strheq	r0, [r0], -r1
    21d0:	08042302 	stmdaeq	r4, {r1, r8, r9, sp}
    21d4:	00012842 	andeq	r2, r1, r2, asr #16
    21d8:	b1122006 	tstlt	r2, r6
    21dc:	02000000 	andeq	r0, r0, #0
    21e0:	c5080623 	strgt	r0, [r8, #-1571]	@ 0xfffff9dd
    21e4:	0600012e 	streq	r0, [r0], -lr, lsr #2
    21e8:	00b11222 	adcseq	r1, r1, r2, lsr #4
    21ec:	23020000 	movwcs	r0, #8192	@ 0x2000
    21f0:	298d0808 	stmibcs	sp, {r3, fp}
    21f4:	24060001 	strcs	r0, [r6], #-1
    21f8:	0000b112 	andeq	fp, r0, r2, lsl r1
    21fc:	0a230200 	beq	8c2a04 <_Min_Stack_Size+0x8c2604>
    2200:	53534e07 	cmppl	r3, #7, 28	@ 0x70
    2204:	11260600 			@ <UNDEFINED> instruction: 0x11260600
    2208:	000000b1 	strheq	r0, [r0], -r1
    220c:	080c2302 	stmdaeq	ip, {r1, r8, r9, sp}
    2210:	00012e69 	andeq	r2, r1, r9, ror #28
    2214:	b1102a06 	tstlt	r0, r6, lsl #20
    2218:	02000000 	andeq	r0, r0, #0
    221c:	ef080e23 	svc	0x00080e23
    2220:	06000126 	streq	r0, [r0], -r6, lsr #2
    2224:	00b11131 	adcseq	r1, r1, r1, lsr r1
    2228:	23020000 	movwcs	r0, #8192	@ 0x2000
    222c:	0c430810 	mcrreq	8, 1, r0, r3, cr0
    2230:	33060001 	movwcc	r0, #24577	@ 0x6001
    2234:	0003f809 	andeq	pc, r3, r9, lsl #16
    2238:	14230200 	strtne	r0, [r3], #-512	@ 0xfffffe00
    223c:	f8010c00 			@ <UNDEFINED> instruction: 0xf8010c00
    2240:	0d000003 	stceq	0, cr0, [r0, #-12]
    2244:	000002f6 	strdeq	r0, [r0], -r6
    2248:	ec040e00 	stc	14, cr0, [r4], {-0}
    224c:	03000003 	movweq	r0, #3
    2250:	00012701 	andeq	r2, r1, r1, lsl #14
    2254:	4c023506 	cfstr32mi	mvfx3, [r2], {6}
    2258:	0f000003 	svceq	0x00000003
    225c:	0001288c 	andeq	r2, r1, ip, lsl #17
    2260:	00400107 	subeq	r0, r0, r7, lsl #2
    2264:	85060000 	strhi	r0, [r6, #-0]
    2268:	00042906 	andeq	r2, r4, r6, lsl #18
    226c:	27ae1000 	strcs	r1, [lr, r0]!
    2270:	10000001 	andne	r0, r0, r1
    2274:	000127fc 	strdeq	r2, [r1], -ip
    2278:	39110001 	ldmdbcc	r1, {r0}
    227c:	39000004 	stmdbcc	r0, {r2}
    2280:	12000004 	andne	r0, r0, #4
    2284:	00000090 	muleq	r0, r0, r0
    2288:	040e0001 	streq	r0, [lr], #-1
    228c:	000003fe 	strdeq	r0, [r0], -lr
    2290:	0126fa13 	msreq	LR_usr, r3
    2294:	0d0f0100 	stfeqs	f0, [pc, #-0]	@ 229c <_Min_Stack_Size+0x1e9c>
    2298:	00000429 	andeq	r0, r0, r9, lsr #8
    229c:	38030501 	stmdacc	r3, {r0, r8, sl}
    22a0:	13200004 			@ <UNDEFINED> instruction: 0x13200004
    22a4:	00012d99 	muleq	r1, r9, sp
    22a8:	fe0c1001 	cdp2	0, 0, cr1, cr12, cr1, {0}
    22ac:	01000003 	tsteq	r0, r3
    22b0:	00000305 	andeq	r0, r0, r5, lsl #6
    22b4:	ac130000 	ldcge	0, cr0, [r3], {-0}
    22b8:	0100012d 	tsteq	r0, sp, lsr #2
    22bc:	03fe0c11 	mvnseq	r0, #4352	@ 0x1100
    22c0:	05010000 	streq	r0, [r1, #-0]
    22c4:	00000003 	andeq	r0, r0, r3
    22c8:	93011400 	movwls	r1, #5120	@ 0x1400
    22cc:	0500010a 	streq	r0, [r0, #-266]	@ 0xfffffef6
    22d0:	01010666 	tsteq	r1, r6, ror #12
    22d4:	00000492 	muleq	r0, r2, r4
    22d8:	0004920d 	andeq	r9, r4, sp, lsl #4
    22dc:	04980d00 	ldreq	r0, [r8], #3328	@ 0xd00
    22e0:	0e000000 	cdpeq	0, 0, cr0, cr0, cr0, {0}
    22e4:	00014104 	andeq	r4, r1, r4, lsl #2
    22e8:	ea040e00 	b	105af0 <_Min_Stack_Size+0x1056f0>
    22ec:	15000002 	strne	r0, [r0, #-2]
    22f0:	012e5201 			@ <UNDEFINED> instruction: 0x012e5201
    22f4:	06ce0100 	strbeq	r0, [lr], r0, lsl #2
    22f8:	00000001 	andeq	r0, r0, r1
    22fc:	00000000 	andeq	r0, r0, r0
    2300:	00140d00 	andseq	r0, r4, r0, lsl #26
    2304:	06bf0100 	ldrteq	r0, [pc], r0, lsl #2
    2308:	70160000 	andsvc	r0, r6, r0
    230c:	0100012a 	tsteq	r0, sl, lsr #2
    2310:	06bf2ace 	ldrteq	r2, [pc], lr, asr #21
    2314:	14750000 	ldrbtne	r0, [r5], #-0
    2318:	14510000 	ldrbne	r0, [r1], #-0
    231c:	2a170000 	bcs	5c2324 <_Min_Stack_Size+0x5c1f24>
    2320:	01000121 	tsteq	r0, r1, lsr #2
    2324:	02ea16d0 	rsceq	r1, sl, #208, 12	@ 0xd000000
    2328:	91020000 	mrsls	r0, (UNDEF: 2)
    232c:	0000186c 	andeq	r1, r0, ip, ror #16
    2330:	04780000 	ldrbteq	r0, [r8], #-0
    2334:	04f60000 	ldrbteq	r0, [r6], #0
    2338:	01190000 	tsteq	r9, r0
    233c:	00740250 	rsbseq	r0, r4, r0, asr r2
    2340:	02510119 	subseq	r0, r1, #1073741830	@ 0x40000006
    2344:	18006c91 	stmdane	r0, {r0, r4, r7, sl, fp, sp, lr}
    2348:	00000000 	andeq	r0, r0, r0
    234c:	00000478 	andeq	r0, r0, r8, ror r4
    2350:	00000510 	andeq	r0, r0, r0, lsl r5
    2354:	02500119 	subseq	r0, r0, #1073741830	@ 0x40000006
    2358:	01190074 	tsteq	r9, r4, ror r0
    235c:	6c910251 	lfmvs	f0, 4, [r1], {81}	@ 0x51
    2360:	00001800 	andeq	r1, r0, r0, lsl #16
    2364:	04780000 	ldrbteq	r0, [r8], #-0
    2368:	052a0000 	streq	r0, [sl, #-0]!
    236c:	01190000 	tsteq	r9, r0
    2370:	00740250 	rsbseq	r0, r4, r0, asr r2
    2374:	02510119 	subseq	r0, r1, #1073741830	@ 0x40000006
    2378:	18006c91 	stmdane	r0, {r0, r4, r7, sl, fp, sp, lr}
    237c:	00000000 	andeq	r0, r0, r0
    2380:	00000478 	andeq	r0, r0, r8, ror r4
    2384:	00000547 	andeq	r0, r0, r7, asr #10
    2388:	05500119 	ldrbeq	r0, [r0, #-281]	@ 0xfffffee7
    238c:	0108000c 	tsteq	r8, ip
    2390:	51011940 	tstpl	r1, r0, asr #18
    2394:	006c9102 	rsbeq	r9, ip, r2, lsl #2
    2398:	00000018 	andeq	r0, r0, r8, lsl r0
    239c:	00047800 	andeq	r7, r4, r0, lsl #16
    23a0:	00056100 	andeq	r6, r5, r0, lsl #2
    23a4:	50011900 	andpl	r1, r1, r0, lsl #18
    23a8:	19007402 	stmdbne	r0, {r1, sl, ip, sp, lr}
    23ac:	91025101 	tstls	r2, r1, lsl #2
    23b0:	0018006c 	andseq	r0, r8, ip, rrx
    23b4:	78000000 	stmdavc	r0, {}	@ <UNPREDICTABLE>
    23b8:	7b000004 	blvc	23d0 <_Min_Stack_Size+0x1fd0>
    23bc:	19000005 	stmdbne	r0, {r0, r2}
    23c0:	74025001 	strvc	r5, [r2], #-1
    23c4:	51011900 	tstpl	r1, r0, lsl #18
    23c8:	006c9102 	rsbeq	r9, ip, r2, lsl #2
    23cc:	00000018 	andeq	r0, r0, r8, lsl r0
    23d0:	00047800 	andeq	r7, r4, r0, lsl #16
    23d4:	00059500 	andeq	r9, r5, r0, lsl #10
    23d8:	50011900 	andpl	r1, r1, r0, lsl #18
    23dc:	19007402 	stmdbne	r0, {r1, sl, ip, sp, lr}
    23e0:	91025101 	tstls	r2, r1, lsl #2
    23e4:	0018006c 	andseq	r0, r8, ip, rrx
    23e8:	78000000 	stmdavc	r0, {}	@ <UNPREDICTABLE>
    23ec:	b2000004 	andlt	r0, r0, #4
    23f0:	19000005 	stmdbne	r0, {r0, r2}
    23f4:	0c055001 	stceq	0, cr5, [r5], {1}
    23f8:	40010800 	andmi	r0, r1, r0, lsl #16
    23fc:	02510119 	subseq	r0, r1, #1073741830	@ 0x40000006
    2400:	18006c91 	stmdane	r0, {r0, r4, r7, sl, fp, sp, lr}
    2404:	00000000 	andeq	r0, r0, r0
    2408:	00000478 	andeq	r0, r0, r8, ror r4
    240c:	000005cf 	andeq	r0, r0, pc, asr #11
    2410:	05500119 	ldrbeq	r0, [r0, #-281]	@ 0xfffffee7
    2414:	0108000c 	tsteq	r8, ip
    2418:	51011940 	tstpl	r1, r0, asr #18
    241c:	006c9102 	rsbeq	r9, ip, r2, lsl #2
    2420:	00000018 	andeq	r0, r0, r8, lsl r0
    2424:	00047800 	andeq	r7, r4, r0, lsl #16
    2428:	0005e900 	andeq	lr, r5, r0, lsl #18
    242c:	50011900 	andpl	r1, r1, r0, lsl #18
    2430:	19007402 	stmdbne	r0, {r1, sl, ip, sp, lr}
    2434:	91025101 	tstls	r2, r1, lsl #2
    2438:	0018006c 	andseq	r0, r8, ip, rrx
    243c:	78000000 	stmdavc	r0, {}	@ <UNPREDICTABLE>
    2440:	03000004 	movweq	r0, #4
    2444:	19000006 	stmdbne	r0, {r1, r2}
    2448:	74025001 	strvc	r5, [r2], #-1
    244c:	51011900 	tstpl	r1, r0, lsl #18
    2450:	006c9102 	rsbeq	r9, ip, r2, lsl #2
    2454:	00000018 	andeq	r0, r0, r8, lsl r0
    2458:	00047800 	andeq	r7, r4, r0, lsl #16
    245c:	00061d00 	andeq	r1, r6, r0, lsl #26
    2460:	50011900 	andpl	r1, r1, r0, lsl #18
    2464:	19007402 	stmdbne	r0, {r1, sl, ip, sp, lr}
    2468:	91025101 	tstls	r2, r1, lsl #2
    246c:	0018006c 	andseq	r0, r8, ip, rrx
    2470:	78000000 	stmdavc	r0, {}	@ <UNPREDICTABLE>
    2474:	3a000004 	bcc	248c <_Min_Stack_Size+0x208c>
    2478:	19000006 	stmdbne	r0, {r1, r2}
    247c:	0c055001 	stceq	0, cr5, [r5], {1}
    2480:	40010c00 	andmi	r0, r1, r0, lsl #24
    2484:	02510119 	subseq	r0, r1, #1073741830	@ 0x40000006
    2488:	18006c91 	stmdane	r0, {r0, r4, r7, sl, fp, sp, lr}
    248c:	00000000 	andeq	r0, r0, r0
    2490:	00000478 	andeq	r0, r0, r8, ror r4
    2494:	00000654 	andeq	r0, r0, r4, asr r6
    2498:	02500119 	subseq	r0, r0, #1073741830	@ 0x40000006
    249c:	01190074 	tsteq	r9, r4, ror r0
    24a0:	6c910251 	lfmvs	f0, 4, [r1], {81}	@ 0x51
    24a4:	00001800 	andeq	r1, r0, r0, lsl #16
    24a8:	04780000 	ldrbteq	r0, [r8], #-0
    24ac:	066e0000 	strbteq	r0, [lr], -r0
    24b0:	01190000 	tsteq	r9, r0
    24b4:	00740250 	rsbseq	r0, r4, r0, asr r2
    24b8:	02510119 	subseq	r0, r1, #1073741830	@ 0x40000006
    24bc:	18006c91 	stmdane	r0, {r0, r4, r7, sl, fp, sp, lr}
    24c0:	00000000 	andeq	r0, r0, r0
    24c4:	00000478 	andeq	r0, r0, r8, ror r4
    24c8:	00000688 	andeq	r0, r0, r8, lsl #13
    24cc:	02500119 	subseq	r0, r0, #1073741830	@ 0x40000006
    24d0:	01190074 	tsteq	r9, r4, ror r0
    24d4:	6c910251 	lfmvs	f0, 4, [r1], {81}	@ 0x51
    24d8:	00001800 	andeq	r1, r0, r0, lsl #16
    24dc:	04780000 	ldrbteq	r0, [r8], #-0
    24e0:	06a50000 	strteq	r0, [r5], r0
    24e4:	01190000 	tsteq	r9, r0
    24e8:	000c0550 	andeq	r0, ip, r0, asr r5
    24ec:	1940010c 	stmdbne	r0, {r2, r3, r8}^
    24f0:	91025101 	tstls	r2, r1, lsl #2
    24f4:	001a006c 	andseq	r0, sl, ip, rrx
    24f8:	78000000 	stmdavc	r0, {}	@ <UNPREDICTABLE>
    24fc:	19000004 	stmdbne	r0, {r2}
    2500:	0c055001 	stceq	0, cr5, [r5], {1}
    2504:	40010c00 	andmi	r0, r1, r0, lsl #24
    2508:	02510119 	subseq	r0, r1, #1073741830	@ 0x40000006
    250c:	00006c91 	muleq	r0, r1, ip
    2510:	02a7040e 	adceq	r0, r7, #234881024	@ 0xe000000
    2514:	011b0000 	tsteq	fp, r0
    2518:	0001289b 	muleq	r1, fp, r8
    251c:	0106c401 	tsteq	r6, r1, lsl #8
    2520:	08000528 	stmdaeq	r0, {r3, r5, r8, sl}
    2524:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
    2528:	0000155e 	andeq	r1, r0, lr, asr r5
    252c:	0006f501 	andeq	pc, r6, r1, lsl #10
    2530:	284b1c00 	stmdacs	fp, {sl, fp, ip}^
    2534:	c6010001 	strgt	r0, [r1], -r1
    2538:	0002f616 	andeq	pc, r2, r6, lsl r6	@ <UNPREDICTABLE>
    253c:	00158000 	andseq	r8, r5, r0
    2540:	00157e00 	andseq	r7, r5, r0, lsl #28
    2544:	011b0000 	tsteq	fp, r0
    2548:	00012b34 	andeq	r2, r1, r4, lsr fp
    254c:	0106ba01 	tsteq	r6, r1, lsl #20
    2550:	080004f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, sl}
    2554:	08000528 	stmdaeq	r0, {r3, r5, r8, sl}
    2558:	00001593 	muleq	r0, r3, r5
    255c:	00072501 	andeq	r2, r7, r1, lsl #10
    2560:	284b1c00 	stmdacs	fp, {sl, fp, ip}^
    2564:	bc010001 	stclt	0, cr0, [r1], {1}
    2568:	0002f616 	andeq	pc, r2, r6, lsl r6	@ <UNPREDICTABLE>
    256c:	0015b500 	andseq	fp, r5, r0, lsl #10
    2570:	0015b300 	andseq	fp, r5, r0, lsl #6
    2574:	01150000 	tsteq	r5, r0
    2578:	00012e01 	andeq	r2, r1, r1, lsl #28
    257c:	0106a201 	tsteq	r6, r1, lsl #4
	...
    2588:	000015c8 	andeq	r1, r0, r8, asr #11
    258c:	00077f01 	andeq	r7, r7, r1, lsl #30
    2590:	2a701d00 	bcs	1c09998 <_Min_Stack_Size+0x1c09598>
    2594:	a2010001 	andge	r0, r1, #1
    2598:	0006bf28 	andeq	fp, r6, r8, lsr #30
    259c:	1d500100 	ldfnee	f0, [r0, #-0]
    25a0:	00012756 	andeq	r2, r1, r6, asr r7
    25a4:	7f38a201 	svcvc	0x0038a201
    25a8:	01000007 	tsteq	r0, r7
    25ac:	29711d51 	ldmdbcs	r1!, {r0, r4, r6, r8, sl, fp, ip}^
    25b0:	a2010001 	andge	r0, r1, #1
    25b4:	00040a57 	andeq	r0, r4, r7, asr sl
    25b8:	1c520100 	ldfnee	f0, [r2], {-0}
    25bc:	00011ced 	andeq	r1, r1, sp, ror #25
    25c0:	a50da401 	strge	sl, [sp, #-1025]	@ 0xfffffbff
    25c4:	f6000000 			@ <UNDEFINED> instruction: 0xf6000000
    25c8:	f4000015 	vst4.8	{d0-d3}, [r0 :64], r5
    25cc:	00000015 	andeq	r0, r0, r5, lsl r0
    25d0:	00b1040e 	adcseq	r0, r1, lr, lsl #8
    25d4:	01150000 	tsteq	r5, r0
    25d8:	0001297b 	andeq	r2, r1, fp, ror r9
    25dc:	01069001 	tsteq	r6, r1
	...
    25e8:	00001611 	andeq	r1, r0, r1, lsl r6
    25ec:	0007df01 	andeq	sp, r7, r1, lsl #30
    25f0:	2a701d00 	bcs	1c099f8 <_Min_Stack_Size+0x1c095f8>
    25f4:	90010001 	andls	r0, r1, r1
    25f8:	0006bf25 	andeq	fp, r6, r5, lsr #30
    25fc:	1d500100 	ldfnee	f0, [r0, #-0]
    2600:	00012756 	andeq	r2, r1, r6, asr r7
    2604:	7f359001 	svcvc	0x00359001
    2608:	01000007 	tsteq	r0, r7
    260c:	29711d51 	ldmdbcs	r1!, {r0, r4, r6, r8, sl, fp, ip}^
    2610:	90010001 	andls	r0, r1, r1
    2614:	00040a54 	andeq	r0, r4, r4, asr sl
    2618:	1c520100 	ldfnee	f0, [r2], {-0}
    261c:	00011ced 	andeq	r1, r1, sp, ror #25
    2620:	a50d9201 	strge	r9, [sp, #-513]	@ 0xfffffdff
    2624:	3f000000 	svccc	0x00000000
    2628:	3d000016 	stccc	0, cr0, [r0, #-88]	@ 0xffffffa8
    262c:	00000016 	andeq	r0, r0, r6, lsl r0
    2630:	2b14011e 	blcs	502ab0 <_Min_Stack_Size+0x5026b0>
    2634:	88010001 	stmdahi	r1, {r0}
    2638:	00000106 	andeq	r0, r0, r6, lsl #2
    263c:	00000000 	andeq	r0, r0, r0
    2640:	7d020000 	stcvc	0, cr0, [r2, #-0]
    2644:	08360100 	ldmdaeq	r6!, {r8}
    2648:	70160000 	andsvc	r0, r6, r0
    264c:	0100012a 	tsteq	r0, sl, lsr #2
    2650:	06bf2288 	ldrteq	r2, [pc], r8, lsl #5
    2654:	165c0000 	ldrbne	r0, [ip], -r0
    2658:	165a0000 	ldrbne	r0, [sl], -r0
    265c:	56160000 	ldrpl	r0, [r6], -r0
    2660:	01000127 	tsteq	r0, r7, lsr #2
    2664:	077f3288 	ldrbeq	r3, [pc, -r8, lsl #5]!
    2668:	16710000 	ldrbtne	r0, [r1], -r0
    266c:	166f0000 	strbtne	r0, [pc], -r0
    2670:	71160000 	tstvc	r6, r0
    2674:	01000129 	tsteq	r0, r9, lsr #2
    2678:	040a5188 	streq	r5, [sl], #-392	@ 0xfffffe78
    267c:	16860000 	strne	r0, [r6], r0
    2680:	16840000 	strne	r0, [r4], r0
    2684:	1e000000 	cdpne	0, 0, cr0, cr0, cr0, {0}
    2688:	01280b01 			@ <UNDEFINED> instruction: 0x01280b01
    268c:	06770100 	ldrbteq	r0, [r7], -r0, lsl #2
    2690:	00000001 	andeq	r0, r0, r1
    2694:	00000000 	andeq	r0, r0, r0
    2698:	007d0200 	rsbseq	r0, sp, r0, lsl #4
    269c:	00085f01 	andeq	r5, r8, r1, lsl #30
    26a0:	2a701d00 	bcs	1c09aa8 <_Min_Stack_Size+0x1c096a8>
    26a4:	77010001 	strvc	r0, [r1, -r1]
    26a8:	0006bf23 	andeq	fp, r6, r3, lsr #30
    26ac:	00500100 	subseq	r0, r0, r0, lsl #2
    26b0:	2e44011f 	mcrcs	1, 2, r0, cr4, cr15, {0}
    26b4:	2a010001 	bcs	426c0 <_Min_Stack_Size+0x422c0>
    26b8:	00000106 	andeq	r0, r0, r6, lsl #2
    26bc:	00000000 	andeq	r0, r0, r0
    26c0:	16990000 	ldrne	r0, [r9], r0
    26c4:	16010000 	strne	r0, [r1], -r0
    26c8:	00012a70 	andeq	r2, r1, r0, ror sl
    26cc:	bf212a01 	svclt	0x00212a01
    26d0:	c5000006 	strgt	r0, [r0, #-6]
    26d4:	b9000016 	stmdblt	r0, {r1, r2, r4}
    26d8:	16000016 			@ <UNDEFINED> instruction: 0x16000016
    26dc:	00012701 	andeq	r2, r1, r1, lsl #14
    26e0:	39332a01 	ldmdbcc	r3!, {r0, r9, fp, sp}
    26e4:	1b000004 	blne	26fc <_Min_Stack_Size+0x22fc>
    26e8:	0f000017 	svceq	0x00000017
    26ec:	1c000017 	stcne	0, cr0, [r0], {23}
    26f0:	00012b09 	andeq	r2, r1, r9, lsl #22
    26f4:	b10e2c01 	tstlt	lr, r1, lsl #24
    26f8:	79000000 	stmdbvc	r0, {}	@ <UNPREDICTABLE>
    26fc:	65000017 	strvs	r0, [r0, #-23]	@ 0xffffffe9
    2700:	1c000017 	stcne	0, cr0, [r0], {23}
    2704:	0001274b 	andeq	r2, r1, fp, asr #14
    2708:	b10e2d01 	tstlt	lr, r1, lsl #26
    270c:	50000000 	andpl	r0, r0, r0
    2710:	48000018 	stmdami	r0, {r3, r4}
    2714:	00000018 	andeq	r0, r0, r8, lsl r0
    2718:	00067900 	andeq	r7, r6, r0, lsl #18
    271c:	3f000200 	svccc	0x00000200
    2720:	0400000a 	streq	r0, [r0], #-10
    2724:	002e3801 	eoreq	r3, lr, r1, lsl #16
    2728:	30790c00 	rsbscc	r0, r9, r0, lsl #24
    272c:	15110001 	ldrne	r0, [r1, #-1]
    2730:	02100000 	andseq	r0, r0, #0
	...
    273c:	36c70000 	strbcc	r0, [r7], r0
    2740:	20170000 	andscs	r0, r7, r0
    2744:	01020000 	mrseq	r0, (UNDEF: 2)
    2748:	00217d06 	eoreq	r7, r1, r6, lsl #26
    274c:	0db10300 	ldceq	3, cr0, [r1]
    2750:	2b020001 	blcs	8275c <_Min_Stack_Size+0x8235c>
    2754:	00004018 	andeq	r4, r0, r8, lsl r0
    2758:	08010200 	stmdaeq	r1, {r9}
    275c:	000022aa 	andeq	r2, r0, sl, lsr #5
    2760:	9b050202 	blls	142f70 <_Min_Stack_Size+0x142b70>
    2764:	03000005 	movweq	r0, #5
    2768:	0001107c 	andeq	r1, r1, ip, ror r0
    276c:	5a193902 	bpl	650b7c <_Min_Stack_Size+0x65077c>
    2770:	02000000 	andeq	r0, r0, #0
    2774:	26dd0702 	ldrbcs	r0, [sp], r2, lsl #14
    2778:	04020000 	streq	r0, [r2], #-0
    277c:	00200105 	eoreq	r0, r0, r5, lsl #2
    2780:	142b0300 	strtne	r0, [fp], #-768	@ 0xfffffd00
    2784:	4f020001 	svcmi	0x00020001
    2788:	00007419 	andeq	r7, r0, r9, lsl r4
    278c:	07040200 	streq	r0, [r4, -r0, lsl #4]
    2790:	00001d74 	andeq	r1, r0, r4, ror sp
    2794:	22050802 	andcs	r0, r5, #131072	@ 0x20000
    2798:	02000012 	andeq	r0, r0, #18
    279c:	2bb60708 	blcs	fed843c4 <_estack+0xded81bc4>
    27a0:	04040000 	streq	r0, [r4], #-0
    27a4:	746e6905 	strbtvc	r6, [lr], #-2309	@ 0xfffff6fb
    27a8:	07040200 	streq	r0, [r4, -r0, lsl #4]
    27ac:	00002061 	andeq	r2, r0, r1, rrx
    27b0:	a6040802 	strge	r0, [r4], -r2, lsl #16
    27b4:	050000f0 	streq	r0, [r0, #-240]	@ 0xffffff10
    27b8:	0000a404 	andeq	sl, r0, r4, lsl #8
    27bc:	02010600 	andeq	r0, r1, #0, 12
    27c0:	21840801 	orrcs	r0, r4, r1, lsl #16
    27c4:	b3030000 	movwlt	r0, #12288	@ 0x3000
    27c8:	0300010d 	movweq	r0, #269	@ 0x10d
    27cc:	00341318 	eorseq	r1, r4, r8, lsl r3
    27d0:	7e030000 	cdpvc	0, 0, cr0, cr3, cr0, {0}
    27d4:	03000110 	movweq	r0, #272	@ 0x110
    27d8:	004e1424 	subeq	r1, lr, r4, lsr #8
    27dc:	2d030000 	stccs	0, cr0, [r3, #-0]
    27e0:	03000114 	movweq	r0, #276	@ 0x114
    27e4:	00681430 	rsbeq	r1, r8, r0, lsr r4
    27e8:	c5070000 	strgt	r0, [r7, #-0]
    27ec:	08000000 	stmdaeq	r0, {}	@ <UNPREDICTABLE>
    27f0:	0939041c 	ldmdbeq	r9!, {r2, r3, r4, sl}
    27f4:	00000149 	andeq	r0, r0, r9, asr #2
    27f8:	4c524309 	mrrcmi	3, 0, r4, r2, cr9
    27fc:	173a0400 	ldrne	r0, [sl, -r0, lsl #8]!
    2800:	000000d1 	ldrdeq	r0, [r0], -r1
    2804:	09002302 	stmdbeq	r0, {r1, r8, r9, sp}
    2808:	00485243 	subeq	r5, r8, r3, asr #4
    280c:	d1173b04 	tstle	r7, r4, lsl #22
    2810:	02000000 	andeq	r0, r0, #0
    2814:	49090423 	stmdbmi	r9, {r0, r1, r5, sl}
    2818:	04005244 	streq	r5, [r0], #-580	@ 0xfffffdbc
    281c:	00d1173c 	sbcseq	r1, r1, ip, lsr r7
    2820:	23020000 	movwcs	r0, #8192	@ 0x2000
    2824:	444f0908 	strbmi	r0, [pc], #-2312	@ 282c <_Min_Stack_Size+0x242c>
    2828:	3d040052 	stccc	0, cr0, [r4, #-328]	@ 0xfffffeb8
    282c:	0000d117 	andeq	sp, r0, r7, lsl r1
    2830:	0c230200 	sfmeq	f0, 4, [r3], #-0
    2834:	011cf30a 	tsteq	ip, sl, lsl #6	@ <UNPREDICTABLE>
    2838:	173e0400 	ldrne	r0, [lr, -r0, lsl #8]!
    283c:	000000d1 	ldrdeq	r0, [r0], -r1
    2840:	09102302 	ldmdbeq	r0, {r1, r8, r9, sp}
    2844:	00525242 	subseq	r5, r2, r2, asr #4
    2848:	d1173f04 	tstle	r7, r4, lsl #30
    284c:	02000000 	andeq	r0, r0, #0
    2850:	3e0a1423 	cdpcc	4, 0, cr1, cr10, cr3, {1}
    2854:	04000114 	streq	r0, [r0], #-276	@ 0xfffffeec
    2858:	00d11740 	sbcseq	r1, r1, r0, asr #14
    285c:	23020000 	movwcs	r0, #8192	@ 0x2000
    2860:	1c030018 	stcne	0, cr0, [r3], {24}
    2864:	0400011d 	streq	r0, [r0], #-285	@ 0xfffffee3
    2868:	00d60341 	sbcseq	r0, r6, r1, asr #6
    286c:	30080000 	andcc	r0, r8, r0
    2870:	12094404 	andne	r4, r9, #4, 8	@ 0x4000000
    2874:	09000002 	stmdbeq	r0, {r1}
    2878:	04005243 	streq	r5, [r0], #-579	@ 0xfffffdbd
    287c:	00d11745 	sbcseq	r1, r1, r5, asr #14
    2880:	23020000 	movwcs	r0, #8192	@ 0x2000
    2884:	29c40a00 	stmibcs	r4, {r9, fp}^
    2888:	46040001 	strmi	r0, [r4], -r1
    288c:	0000d117 	andeq	sp, r0, r7, lsl r1
    2890:	04230200 	strteq	r0, [r3], #-512	@ 0xfffffe00
    2894:	52494309 	subpl	r4, r9, #603979776	@ 0x24000000
    2898:	17470400 	strbne	r0, [r7, -r0, lsl #8]
    289c:	000000d1 	ldrdeq	r0, [r0], -r1
    28a0:	0a082302 	beq	20b4b0 <_Min_Stack_Size+0x20b0b0>
    28a4:	000123b0 			@ <UNDEFINED> instruction: 0x000123b0
    28a8:	d1174804 	tstle	r7, r4, lsl #16
    28ac:	02000000 	andeq	r0, r0, #0
    28b0:	cd0a0c23 	stcgt	12, cr0, [sl, #-140]	@ 0xffffff74
    28b4:	04000124 	streq	r0, [r0], #-292	@ 0xfffffedc
    28b8:	00d11749 	sbcseq	r1, r1, r9, asr #14
    28bc:	23020000 	movwcs	r0, #8192	@ 0x2000
    28c0:	26120a10 			@ <UNDEFINED> instruction: 0x26120a10
    28c4:	4a040001 	bmi	1028d0 <_Min_Stack_Size+0x1024d0>
    28c8:	0000d117 	andeq	sp, r0, r7, lsl r1
    28cc:	14230200 	strtne	r0, [r3], #-512	@ 0xfffffe00
    28d0:	0120bf0a 			@ <UNDEFINED> instruction: 0x0120bf0a
    28d4:	174b0400 	strbne	r0, [fp, -r0, lsl #8]
    28d8:	000000d1 	ldrdeq	r0, [r0], -r1
    28dc:	0a182302 	beq	60b4ec <_Min_Stack_Size+0x60b0ec>
    28e0:	000124d6 	ldrdeq	r2, [r1], -r6
    28e4:	d1174c04 	tstle	r7, r4, lsl #24
    28e8:	02000000 	andeq	r0, r0, #0
    28ec:	4b0a1c23 	blmi	289980 <_Min_Stack_Size+0x289580>
    28f0:	04000122 	streq	r0, [r0], #-290	@ 0xfffffede
    28f4:	00d1174d 	sbcseq	r1, r1, sp, asr #14
    28f8:	23020000 	movwcs	r0, #8192	@ 0x2000
    28fc:	53430920 	movtpl	r0, #14624	@ 0x3920
    2900:	4e040052 	mcrmi	0, 0, r0, cr4, cr2, {2}
    2904:	0000d117 	andeq	sp, r0, r7, lsl r1
    2908:	24230200 	strtcs	r0, [r3], #-512	@ 0xfffffe00
    290c:	0126190a 			@ <UNDEFINED> instruction: 0x0126190a
    2910:	174f0400 	strbne	r0, [pc, -r0, lsl #8]
    2914:	000000d1 	ldrdeq	r0, [r0], -r1
    2918:	0a282302 	beq	a0b528 <_Min_Stack_Size+0xa0b128>
    291c:	00012405 	andeq	r2, r1, r5, lsl #8
    2920:	d1175004 	tstle	r7, r4
    2924:	02000000 	andeq	r0, r0, #0
    2928:	03002c23 	movweq	r2, #3107	@ 0xc23
    292c:	000125d0 	ldrdeq	r2, [r1], -r0
