NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    2930:	55035104 	strpl	r5, [r3, #-260]	@ 0xfffffefc
    2934:	08000001 	stmdaeq	r0, {r0}
    2938:	0967041c 	stmdbeq	r7!, {r2, r3, r4, sl}^
    293c:	0000028f 	andeq	r0, r0, pc, lsl #5
    2940:	00525309 	subseq	r5, r2, r9, lsl #6
    2944:	d1176804 	tstle	r7, r4, lsl #16
    2948:	02000000 	andeq	r0, r0, #0
    294c:	44090023 	strmi	r0, [r9], #-35	@ 0xffffffdd
    2950:	69040052 	stmdbvs	r4, {r1, r4, r6}
    2954:	0000d117 	andeq	sp, r0, r7, lsl r1
    2958:	04230200 	strteq	r0, [r3], #-512	@ 0xfffffe00
    295c:	52524209 	subspl	r4, r2, #-1879048192	@ 0x90000000
    2960:	176a0400 	strbne	r0, [sl, -r0, lsl #8]!
    2964:	000000d1 	ldrdeq	r0, [r0], -r1
    2968:	09082302 	stmdbeq	r8, {r1, r8, r9, sp}
    296c:	00315243 	eorseq	r5, r1, r3, asr #4
    2970:	d1176b04 	tstle	r7, r4, lsl #22
    2974:	02000000 	andeq	r0, r0, #0
    2978:	43090c23 	movwmi	r0, #39971	@ 0x9c23
    297c:	04003252 	streq	r3, [r0], #-594	@ 0xfffffdae
    2980:	00d1176c 	sbcseq	r1, r1, ip, ror #14
    2984:	23020000 	movwcs	r0, #8192	@ 0x2000
    2988:	52430910 	subpl	r0, r3, #16, 18	@ 0x40000
    298c:	6d040033 	stcvs	0, cr0, [r4, #-204]	@ 0xffffff34
    2990:	0000d117 	andeq	sp, r0, r7, lsl r1
    2994:	14230200 	strtne	r0, [r3], #-512	@ 0xfffffe00
    2998:	0133b10a 	teqeq	r3, sl, lsl #2
    299c:	176e0400 	strbne	r0, [lr, -r0, lsl #8]!
    29a0:	000000d1 	ldrdeq	r0, [r0], -r1
    29a4:	00182302 	andseq	r2, r8, r2, lsl #6
    29a8:	0131a703 	teqeq	r1, r3, lsl #14
    29ac:	036f0400 	cmneq	pc, #0, 8
    29b0:	0000021e 	andeq	r0, r0, lr, lsl r2
    29b4:	11050408 	tstne	r5, r8, lsl #8
    29b8:	0002d209 	andeq	sp, r2, r9, lsl #4
    29bc:	1c2e0a00 			@ <UNDEFINED> instruction: 0x1c2e0a00
    29c0:	13050001 	movwne	r0, #20481	@ 0x5001
    29c4:	0000b90b 	andeq	fp, r0, fp, lsl #18
    29c8:	00230200 	eoreq	r0, r3, r0, lsl #4
    29cc:	010f230a 	tsteq	pc, sl, lsl #6
    29d0:	0a160500 	beq	583dd8 <_Min_Stack_Size+0x5839d8>
    29d4:	000000ad 	andeq	r0, r0, sp, lsr #1
    29d8:	0a022302 	beq	8b5e8 <_Min_Stack_Size+0x8b1e8>
    29dc:	00010aec 	andeq	r0, r1, ip, ror #21
    29e0:	ad0a1905 	vstrge.16	s2, [sl, #-10]	@ <UNPREDICTABLE>
    29e4:	02000000 	andeq	r0, r0, #0
    29e8:	03000323 	movweq	r0, #803	@ 0x323
    29ec:	00011087 	andeq	r1, r1, r7, lsl #1
    29f0:	9b071c05 	blls	1c9a0c <_Min_Stack_Size+0x1c960c>
    29f4:	08000002 	stmdaeq	r0, {r1}
    29f8:	090f0614 	stmdbeq	pc, {r2, r4, r9, sl}	@ <UNPREDICTABLE>
    29fc:	00000360 	andeq	r0, r0, r0, ror #6
    2a00:	0131ff0a 	teqeq	r1, sl, lsl #30	@ <UNPREDICTABLE>
    2a04:	0a120600 	beq	48420c <_Min_Stack_Size+0x483e0c>
    2a08:	000000ad 	andeq	r0, r0, sp, lsr #1
    2a0c:	0a002302 	beq	b61c <_Min_Stack_Size+0xb21c>
    2a10:	00012f80 	andeq	r2, r1, r0, lsl #31
    2a14:	c50b1506 	strgt	r1, [fp, #-1286]	@ 0xfffffafa
    2a18:	02000000 	andeq	r0, r0, #0
    2a1c:	c30a0423 	movwgt	r0, #42019	@ 0xa423
    2a20:	06000130 			@ <UNDEFINED> instruction: 0x06000130
    2a24:	00ad0a18 	adceq	r0, sp, r8, lsl sl
    2a28:	23020000 	movwcs	r0, #8192	@ 0x2000
    2a2c:	34800a08 	strcc	r0, [r0], #2568	@ 0xa08
    2a30:	1b060001 	blne	182a3c <_Min_Stack_Size+0x18263c>
    2a34:	0000ad0a 	andeq	sl, r0, sl, lsl #26
    2a38:	09230200 	stmdbeq	r3!, {r9}
    2a3c:	01300c0a 	teqeq	r0, sl, lsl #24
    2a40:	0a1e0600 	beq	784248 <_Min_Stack_Size+0x783e48>
    2a44:	000000ad 	andeq	r0, r0, sp, lsr #1
    2a48:	0a0a2302 	beq	28b658 <_Min_Stack_Size+0x28b258>
    2a4c:	00013245 	andeq	r3, r1, r5, asr #4
    2a50:	ad0a2106 	stfges	f2, [sl, #-24]	@ 0xffffffe8
    2a54:	02000000 	andeq	r0, r0, #0
    2a58:	ef0a0b23 	svc	0x000a0b23
    2a5c:	06000126 	streq	r0, [r0], -r6, lsr #2
    2a60:	00ad0a24 	adceq	r0, sp, r4, lsr #20
    2a64:	23020000 	movwcs	r0, #8192	@ 0x2000
    2a68:	0c430a0c 	mcrreq	10, 0, r0, r3, cr12
    2a6c:	27060001 	strcs	r0, [r6, -r1]
    2a70:	00009e09 	andeq	r9, r0, r9, lsl #28
    2a74:	10230200 	eorne	r0, r3, r0, lsl #4
    2a78:	31bc0300 			@ <UNDEFINED> instruction: 0x31bc0300
    2a7c:	29060001 	stmdbcs	r6, {r0}
    2a80:	0002de07 	andeq	sp, r2, r7, lsl #28
    2a84:	2f890b00 	svccs	0x00890b00
    2a88:	01070001 	tsteq	r7, r1
    2a8c:	00000040 	andeq	r0, r0, r0, asr #32
    2a90:	8b067106 	blhi	19eeb0 <_Min_Stack_Size+0x19eab0>
    2a94:	0c000003 	stceq	0, cr0, [r0], {3}
    2a98:	000127b5 			@ <UNDEFINED> instruction: 0x000127b5
    2a9c:	28030c00 	stmdacs	r3, {sl, fp}
    2aa0:	00010001 	andeq	r0, r1, r1
    2aa4:	0131b50d 	teqeq	r1, sp, lsl #10
    2aa8:	0e0f0100 	adfeqe	f0, f7, f0
    2aac:	0000039e 	muleq	r0, lr, r3
    2ab0:	40030501 	andmi	r0, r3, r1, lsl #10
    2ab4:	05200004 	streq	r0, [r0, #-4]!
    2ab8:	00036004 	andeq	r6, r3, r4
    2abc:	93010e00 	movwls	r0, #7680	@ 0x1e00
    2ac0:	0500010a 	streq	r0, [r0, #-266]	@ 0xfffffef6
    2ac4:	01010666 	tsteq	r1, r6, ror #12
    2ac8:	000003be 			@ <UNDEFINED> instruction: 0x000003be
    2acc:	0003be0f 	andeq	fp, r3, pc, lsl #28
    2ad0:	03c40f00 	biceq	r0, r4, #0, 30
    2ad4:	05000000 	streq	r0, [r0, #-0]
    2ad8:	00014904 	andeq	r4, r1, r4, lsl #18
    2adc:	d2040500 	andle	r0, r4, #0, 10
    2ae0:	10000002 	andne	r0, r0, r2
    2ae4:	011ff901 	tsteq	pc, r1, lsl #18	@ <UNPREDICTABLE>
    2ae8:	0a140700 	beq	5046f0 <_Min_Stack_Size+0x5042f0>
    2aec:	0000c501 	andeq	ip, r0, r1, lsl #10
    2af0:	01100100 	tsteq	r0, r0, lsl #2
    2af4:	00013619 	andeq	r3, r1, r9, lsl r6
    2af8:	010a1507 	tsteq	sl, r7, lsl #10
    2afc:	000000c5 	andeq	r0, r0, r5, asr #1
    2b00:	ed011101 	stfs	f1, [r1, #-4]
    2b04:	01000131 	tsteq	r0, r1, lsr r1
    2b08:	01060181 	smlabbeq	r6, r1, r1, r0
    2b0c:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
    2b10:	08000588 	stmdaeq	r0, {r3, r7, r8, sl}
    2b14:	00001886 	andeq	r1, r0, r6, lsl #17
    2b18:	2f011101 	svccs	0x00011101
    2b1c:	01000136 	tsteq	r0, r6, lsr r1
    2b20:	0106017c 	tsteq	r6, ip, ror r1
    2b24:	08000568 	stmdaeq	r0, {r3, r5, r6, r8, sl}
    2b28:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
    2b2c:	000018a6 	andeq	r1, r0, r6, lsr #17
    2b30:	9f011101 	svcls	0x00011101
    2b34:	01000133 	tsteq	r0, r3, lsr r1
    2b38:	01060175 	tsteq	r6, r5, ror r1
    2b3c:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
    2b40:	08000568 	stmdaeq	r0, {r3, r5, r6, r8, sl}
    2b44:	000018c6 	andeq	r1, r0, r6, asr #17
    2b48:	ab011201 	blge	47354 <_Min_Stack_Size+0x46f54>
    2b4c:	01000130 	tsteq	r0, r0, lsr r1
    2b50:	000106fe 	strdeq	r0, [r1], -lr
    2b54:	00000000 	andeq	r0, r0, r0
    2b58:	e6000000 	str	r0, [r0], -r0
    2b5c:	01000018 	tsteq	r0, r8, lsl r0
    2b60:	00000508 	andeq	r0, r0, r8, lsl #10
    2b64:	012f9913 			@ <UNDEFINED> instruction: 0x012f9913
    2b68:	2dfe0100 	ldfcse	f0, [lr]
    2b6c:	00000508 	andeq	r0, r0, r8, lsl #10
    2b70:	0000193a 	andeq	r1, r0, sl, lsr r9
    2b74:	0000192a 	andeq	r1, r0, sl, lsr #18
    2b78:	01212a14 			@ <UNDEFINED> instruction: 0x01212a14
    2b7c:	01000100 	mrseq	r0, (UNDEF: 16)
    2b80:	0002d216 	andeq	sp, r2, r6, lsl r2
    2b84:	74910200 	ldrvc	r0, [r1], #512	@ 0x200
    2b88:	00000015 	andeq	r0, r0, r5, lsl r0
    2b8c:	0003a400 	andeq	sl, r3, r0, lsl #8
    2b90:	00048900 	andeq	r8, r4, r0, lsl #18
    2b94:	50011600 	andpl	r1, r1, r0, lsl #12
    2b98:	16007402 	strne	r7, [r0], -r2, lsl #8
    2b9c:	91025101 	tstls	r2, r1, lsl #2
    2ba0:	00150074 	andseq	r0, r5, r4, ror r0
    2ba4:	a4000000 	strge	r0, [r0], #-0
    2ba8:	a3000003 	movwge	r0, #3
    2bac:	16000004 	strne	r0, [r0], -r4
    2bb0:	74025001 	strvc	r5, [r2], #-1
    2bb4:	51011600 	tstpl	r1, r0, lsl #12
    2bb8:	00749102 	rsbseq	r9, r4, r2, lsl #2
    2bbc:	00000015 	andeq	r0, r0, r5, lsl r0
    2bc0:	0003a400 	andeq	sl, r3, r0, lsl #8
    2bc4:	0004bd00 	andeq	fp, r4, r0, lsl #26
    2bc8:	50011600 	andpl	r1, r1, r0, lsl #12
    2bcc:	16007402 	strne	r7, [r0], -r2, lsl #8
    2bd0:	91025101 	tstls	r2, r1, lsl #2
    2bd4:	00150074 	andseq	r0, r5, r4, ror r0
    2bd8:	a4000000 	strge	r0, [r0], #-0
    2bdc:	d7000003 	strle	r0, [r0, -r3]
    2be0:	16000004 	strne	r0, [r0], -r4
    2be4:	74025001 	strvc	r5, [r2], #-1
    2be8:	51011600 	tstpl	r1, r0, lsl #12
    2bec:	00749102 	rsbseq	r9, r4, r2, lsl #2
    2bf0:	00000015 	andeq	r0, r0, r5, lsl r0
    2bf4:	0003a400 	andeq	sl, r3, r0, lsl #8
    2bf8:	0004f100 	andeq	pc, r4, r0, lsl #2
    2bfc:	50011600 	andpl	r1, r1, r0, lsl #12
    2c00:	16007402 	strne	r7, [r0], -r2, lsl #8
    2c04:	91025101 	tstls	r2, r1, lsl #2
    2c08:	00170074 	andseq	r0, r7, r4, ror r0
    2c0c:	a4000000 	strge	r0, [r0], #-0
    2c10:	16000003 	strne	r0, [r0], -r3
    2c14:	74025001 	strvc	r5, [r2], #-1
    2c18:	51011600 	tstpl	r1, r0, lsl #12
    2c1c:	00749102 	rsbseq	r9, r4, r2, lsl #2
    2c20:	8f040500 	svchi	0x00040500
    2c24:	18000002 	stmdane	r0, {r1}
    2c28:	012f4e01 			@ <UNDEFINED> instruction: 0x012f4e01
    2c2c:	06c80100 	strbeq	r0, [r8], r0, lsl #2
    2c30:	00000001 	andeq	r0, r0, r1
    2c34:	00000000 	andeq	r0, r0, r0
    2c38:	007d0200 	rsbseq	r0, sp, r0, lsl #4
    2c3c:	00055301 	andeq	r5, r5, r1, lsl #6
    2c40:	2f991900 	svccs	0x00991900
    2c44:	c8010001 	stmdagt	r1, {r0}
    2c48:	0005082b 	andeq	r0, r5, fp, lsr #16
    2c4c:	19500100 	ldmdbne	r0, {r8}^
    2c50:	000133f5 	strdeq	r3, [r1], -r5
    2c54:	533dc801 	teqpl	sp, #65536	@ 0x10000
    2c58:	01000005 	tsteq	r0, r5
    2c5c:	29711951 	ldmdbcs	r1!, {r0, r4, r6, r8, fp, ip}^
    2c60:	c9010001 	stmdbgt	r1, {r0}
    2c64:	00036c17 	andeq	r6, r3, r7, lsl ip
    2c68:	00520100 	subseq	r0, r2, r0, lsl #2
    2c6c:	00b90405 	adcseq	r0, r9, r5, lsl #8
    2c70:	01180000 	tsteq	r8, r0
    2c74:	00012feb 	andeq	r2, r1, fp, ror #31
    2c78:	0106c101 	tsteq	r6, r1, lsl #2
	...
    2c84:	01007d02 	tsteq	r0, r2, lsl #26
    2c88:	00000588 	andeq	r0, r0, r8, lsl #11
    2c8c:	012f9913 			@ <UNDEFINED> instruction: 0x012f9913
    2c90:	27c10100 	strbcs	r0, [r1, r0, lsl #2]
    2c94:	00000508 	andeq	r0, r0, r8, lsl #10
    2c98:	000019a8 	andeq	r1, r0, r8, lsr #19
    2c9c:	000019a6 	andeq	r1, r0, r6, lsr #19
    2ca0:	1c011800 	stcne	8, cr1, [r1], {-0}
    2ca4:	01000133 	tsteq	r0, r3, lsr r1
    2ca8:	000106a1 	andeq	r0, r1, r1, lsr #13
    2cac:	00000000 	andeq	r0, r0, r0
    2cb0:	02000000 	andeq	r0, r0, #0
    2cb4:	d901007d 	stmdble	r1, {r0, r2, r3, r4, r5, r6}
    2cb8:	19000005 	stmdbne	r0, {r0, r2}
    2cbc:	00012f99 	muleq	r1, r9, pc	@ <UNPREDICTABLE>
    2cc0:	0828a101 	stmdaeq	r8!, {r0, r8, sp, pc}
    2cc4:	01000005 	tsteq	r0, r5
    2cc8:	27561950 			@ <UNDEFINED> instruction: 0x27561950
    2ccc:	a1010001 	tstge	r1, r1
    2cd0:	0005533a 	andeq	r5, r5, sl, lsr r3
    2cd4:	19510100 	ldmdbne	r1, {r8}^
    2cd8:	00012971 	andeq	r2, r1, r1, ror r9
    2cdc:	6c17a201 	lfmvs	f2, 1, [r7], {1}
    2ce0:	01000003 	tsteq	r0, r3
    2ce4:	30361a52 	eorscc	r1, r6, r2, asr sl
    2ce8:	a4010001 	strge	r0, [r1], #-1
    2cec:	0005530f 	andeq	r5, r5, pc, lsl #6
    2cf0:	01180000 	tsteq	r8, r0
    2cf4:	0001303c 	andeq	r3, r1, ip, lsr r0
    2cf8:	01067401 	tsteq	r6, r1, lsl #8
	...
    2d04:	01007d02 	tsteq	r0, r2, lsl #26
    2d08:	00000602 	andeq	r0, r0, r2, lsl #12
    2d0c:	012f9919 			@ <UNDEFINED> instruction: 0x012f9919
    2d10:	26740100 	ldrbtcs	r0, [r4], -r0, lsl #2
    2d14:	00000508 	andeq	r0, r0, r8, lsl #10
    2d18:	1b005001 	blne	16d24 <_Min_Stack_Size+0x16924>
    2d1c:	012ffd01 	msreq	CPSR_fsxc, r1, lsl #26
    2d20:	06250100 	strteq	r0, [r5], -r0, lsl #2
    2d24:	00000001 	andeq	r0, r0, r1
    2d28:	00000000 	andeq	r0, r0, r0
    2d2c:	0019bb00 	andseq	fp, r9, r0, lsl #22
    2d30:	99130100 	ldmdbls	r3, {r8}
    2d34:	0100012f 	tsteq	r0, pc, lsr #2
    2d38:	05082425 	streq	r2, [r8, #-1061]	@ 0xfffffbdb
    2d3c:	19e30000 	stmibne	r3!, {}^	@ <UNPREDICTABLE>
    2d40:	19db0000 	ldmibne	fp, {}^	@ <UNPREDICTABLE>
    2d44:	bc130000 	ldclt	0, cr0, [r3], {-0}
    2d48:	01000131 	tsteq	r0, r1, lsr r1
    2d4c:	039e3925 	orrseq	r3, lr, #606208	@ 0x94000
    2d50:	1a1f0000 	bne	7c2d58 <_Min_Stack_Size+0x7c2958>
    2d54:	1a170000 	bne	5c2d5c <_Min_Stack_Size+0x5c295c>
    2d58:	c71c0000 	ldrgt	r0, [ip, -r0]
    2d5c:	01000120 	tsteq	r0, r0, lsr #2
    2d60:	00c50e28 	sbceq	r0, r5, r8, lsr #28
    2d64:	1a570000 	bne	15c2d6c <_Min_Stack_Size+0x15c296c>
    2d68:	1a530000 	bne	14c2d70 <_Min_Stack_Size+0x14c2970>
    2d6c:	421d0000 	andsmi	r0, sp, #0
    2d70:	01005252 	tsteq	r0, r2, asr r2
    2d74:	00c51428 	sbceq	r1, r5, r8, lsr #8
    2d78:	1a790000 	bne	1e42d80 <_Min_Stack_Size+0x1e42980>
    2d7c:	1a750000 	bne	1d42d84 <_Min_Stack_Size+0x1d42984>
    2d80:	001e0000 	andseq	r0, lr, r0
    2d84:	ca000000 	bgt	2d8c <_Min_Stack_Size+0x298c>
    2d88:	1e000003 	cdpne	0, 0, cr0, cr0, cr3, {0}
    2d8c:	00000000 	andeq	r0, r0, r0
    2d90:	000003d9 	ldrdeq	r0, [r0], -r9
    2d94:	031e0000 	tsteq	lr, #0
    2d98:	00020000 	andeq	r0, r2, r0
    2d9c:	00000c2f 	andeq	r0, r0, pc, lsr #24
    2da0:	2e380104 	rsfcse	f0, f0, f4
    2da4:	be0c0000 	cdplt	0, 0, cr0, cr12, cr0, {0}
    2da8:	11000136 	tstne	r0, r6, lsr r1
    2dac:	60000015 	andvs	r0, r0, r5, lsl r0
    2db0:	00000002 	andeq	r0, r0, r2
    2db4:	00000000 	andeq	r0, r0, r0
    2db8:	05000000 	streq	r0, [r0, #-0]
    2dbc:	ac000040 	stcge	0, cr0, [r0], {64}	@ 0x40
    2dc0:	02000022 	andeq	r0, r0, #34	@ 0x22
    2dc4:	6e690504 	cdpvs	5, 6, cr0, cr9, cr4, {0}
    2dc8:	04030074 	streq	r0, [r3], #-116	@ 0xffffff8c
    2dcc:	00206107 	eoreq	r6, r0, r7, lsl #2
    2dd0:	05080300 	streq	r0, [r8, #-768]	@ 0xfffffd00
    2dd4:	00001222 	andeq	r1, r0, r2, lsr #4
    2dd8:	a6040803 	strge	r0, [r4], -r3, lsl #16
    2ddc:	030000f0 	movweq	r0, #240	@ 0xf0
    2de0:	217d0601 	cmncs	sp, r1, lsl #12
    2de4:	01030000 	mrseq	r0, (UNDEF: 3)
    2de8:	0022aa08 	eoreq	sl, r2, r8, lsl #20
    2dec:	05020300 	streq	r0, [r2, #-768]	@ 0xfffffd00
    2df0:	0000059b 	muleq	r0, fp, r5
    2df4:	dd070203 	sfmle	f0, 4, [r7, #-12]
    2df8:	03000026 	movweq	r0, #38	@ 0x26
    2dfc:	20010504 	andcs	r0, r1, r4, lsl #10
    2e00:	04030000 	streq	r0, [r3], #-0
    2e04:	001d7407 	andseq	r7, sp, r7, lsl #8
    2e08:	07080300 	streq	r0, [r8, -r0, lsl #6]
    2e0c:	00002bb6 			@ <UNDEFINED> instruction: 0x00002bb6
    2e10:	00800404 	addeq	r0, r0, r4, lsl #8
    2e14:	01050000 	mrseq	r0, (UNDEF: 5)
    2e18:	84080103 	strhi	r0, [r8], #-259	@ 0xfffffefd
    2e1c:	06000021 	streq	r0, [r0], -r1, lsr #32
    2e20:	00500107 	subseq	r0, r0, r7, lsl #2
    2e24:	10020000 	andne	r0, r2, r0
    2e28:	0000aa05 	andeq	sl, r0, r5, lsl #20
    2e2c:	08870700 	stmeq	r7, {r8, r9, sl}
    2e30:	07000001 	streq	r0, [r0, -r1]
    2e34:	000109b6 			@ <UNDEFINED> instruction: 0x000109b6
    2e38:	09240701 	stmdbeq	r4!, {r0, r8, r9, sl}
    2e3c:	00020001 	andeq	r0, r2, r1
    2e40:	01093708 	tsteq	r9, r8, lsl #14
    2e44:	07140200 	ldreq	r0, [r4, -r0, lsl #4]
    2e48:	00000089 	andeq	r0, r0, r9, lsl #1
    2e4c:	50010706 	andpl	r0, r1, r6, lsl #14
    2e50:	02000000 	andeq	r0, r0, #0
    2e54:	00dd0621 	sbcseq	r0, sp, r1, lsr #12
    2e58:	fd070000 	stc2	0, cr0, [r7, #-0]
    2e5c:	00000109 	andeq	r0, r0, r9, lsl #2
    2e60:	01099007 	tsteq	r9, r7
    2e64:	5f070100 	svcpl	0x00070100
    2e68:	020000d1 	andeq	r0, r0, #209	@ 0xd1
    2e6c:	00779207 	rsbseq	r9, r7, r7, lsl #4
    2e70:	06000300 	streq	r0, [r0], -r0, lsl #6
    2e74:	00500107 	subseq	r0, r0, r7, lsl #2
    2e78:	2b020000 	blcs	82e80 <_Min_Stack_Size+0x82a80>
    2e7c:	0000f807 	andeq	pc, r0, r7, lsl #16
    2e80:	26f30700 	ldrbtcs	r0, [r3], r0, lsl #14
    2e84:	07000001 	streq	r0, [r0, -r1]
    2e88:	0000804f 	andeq	r8, r0, pc, asr #32
    2e8c:	08090001 	stmdaeq	r9, {r0}
    2e90:	20022802 	andcs	r2, r2, r2, lsl #16
    2e94:	0a000001 	beq	2ea0 <_Min_Stack_Size+0x2aa0>
    2e98:	0000ec5c 	andeq	lr, r0, ip, asr ip
    2e9c:	dd092e02 	stcle	14, cr2, [r9, #-8]
    2ea0:	02000000 	andeq	r0, r0, #0
    2ea4:	e40a0023 	str	r0, [sl], #-35	@ 0xffffffdd
    2ea8:	020000c1 	andeq	r0, r0, #193	@ 0xc1
    2eac:	00340c2f 	eorseq	r0, r4, pc, lsr #24
    2eb0:	23020000 	movwcs	r0, #8192	@ 0x2000
    2eb4:	44090004 	strmi	r0, [r9], #-4
    2eb8:	c0091602 	andgt	r1, r9, r2, lsl #12
    2ebc:	0a000001 	beq	2ec8 <_Min_Stack_Size+0x2ac8>
    2ec0:	000076ae 	andeq	r7, r0, lr, lsr #13
    2ec4:	340b1802 	strcc	r1, [fp], #-2050	@ 0xfffff7fe
    2ec8:	02000000 	andeq	r0, r0, #0
    2ecc:	d40a0023 	strle	r0, [sl], #-35	@ 0xffffffdd
    2ed0:	0200009a 	andeq	r0, r0, #154	@ 0x9a
    2ed4:	00501019 	subseq	r1, r0, r9, lsl r0
    2ed8:	23020000 	movwcs	r0, #8192	@ 0x2000
    2edc:	5c150a04 			@ <UNDEFINED> instruction: 0x5c150a04
    2ee0:	1a020000 	bne	82ee8 <_Min_Stack_Size+0x82ae8>
    2ee4:	00007a09 	andeq	r7, r0, r9, lsl #20
    2ee8:	08230200 	stmdaeq	r3!, {r9}
    2eec:	00f5cb0a 	rscseq	ip, r5, sl, lsl #22
    2ef0:	071b0200 	ldreq	r0, [fp, -r0, lsl #4]
    2ef4:	000001c0 	andeq	r0, r0, r0, asr #3
    2ef8:	0a0c2302 	beq	30bb08 <_Min_Stack_Size+0x30b708>
    2efc:	00003c18 	andeq	r3, r0, r8, lsl ip
    2f00:	340b1c02 	strcc	r1, [fp], #-3074	@ 0xfffff3fe
    2f04:	02000000 	andeq	r0, r0, #0
    2f08:	7c0a1023 	stcvc	0, cr1, [sl], {35}	@ 0x23
    2f0c:	02000102 	andeq	r0, r0, #-2147483648	@ 0x80000000
    2f10:	00340b1d 	eorseq	r0, r4, sp, lsl fp
    2f14:	23020000 	movwcs	r0, #8192	@ 0x2000
    2f18:	3a6c0a14 	bcc	1b05770 <_Min_Stack_Size+0x1b05370>
    2f1c:	1e020000 	cdpne	0, 0, cr0, cr2, cr0, {0}
    2f20:	0001c70c 	andeq	ip, r1, ip, lsl #14
    2f24:	18230200 	stmdane	r3!, {r9}
    2f28:	005ddd0a 	subseq	sp, sp, sl, lsl #26
    2f2c:	071f0200 	ldreq	r0, [pc, -r0, lsl #4]
    2f30:	000001cd 	andeq	r0, r0, sp, asr #3
    2f34:	0a1c2302 	beq	70bb44 <_Min_Stack_Size+0x70b744>
    2f38:	0000b9b6 			@ <UNDEFINED> instruction: 0x0000b9b6
    2f3c:	b6082602 	strlt	r2, [r8], -r2, lsl #12
    2f40:	02000000 	andeq	r0, r0, #0
    2f44:	140a3a23 	strne	r3, [sl], #-2595	@ 0xfffff5dd
    2f48:	02000072 	andeq	r0, r0, #114	@ 0x72
    2f4c:	00f80830 	rscseq	r0, r8, r0, lsr r8
    2f50:	23020000 	movwcs	r0, #8192	@ 0x2000
    2f54:	0103003c 	tsteq	r3, ip, lsr r0
    2f58:	00f02902 	rscseq	r2, r0, r2, lsl #18
    2f5c:	34040400 	strcc	r0, [r4], #-1024	@ 0xfffffc00
    2f60:	0b000000 	bleq	2f68 <_Min_Stack_Size+0x2b68>
    2f64:	00000082 	andeq	r0, r0, r2, lsl #1
    2f68:	000001dd 	ldrdeq	r0, [r0], -sp
    2f6c:	0000340c 	andeq	r3, r0, ip, lsl #8
    2f70:	08001d00 	stmdaeq	r0, {r8, sl, fp, ip}
    2f74:	00009ee7 	andeq	r9, r0, r7, ror #29
    2f78:	20073202 	andcs	r3, r7, r2, lsl #4
    2f7c:	0d000001 	stceq	0, cr0, [r0, #-4]
    2f80:	000136a6 	andeq	r3, r1, r6, lsr #13
    2f84:	dd0a0301 	stcle	3, cr0, [sl, #-4]
    2f88:	01000001 	tsteq	r0, r1
    2f8c:	04d00305 	ldrbeq	r0, [r0], #773	@ 0x305
    2f90:	ac0d2000 	stcge	0, cr2, [sp], {-0}
    2f94:	01000136 	tsteq	r0, r6, lsr r1
    2f98:	01dd1103 	bicseq	r1, sp, r3, lsl #2
    2f9c:	05010000 	streq	r0, [r1, #-0]
    2fa0:	00048c03 	andeq	r8, r4, r3, lsl #24
    2fa4:	36b20d20 	ldrtcc	r0, [r2], r0, lsr #26
    2fa8:	03010001 	movweq	r0, #4097	@ 0x1001
    2fac:	0001dd18 	andeq	sp, r1, r8, lsl sp
    2fb0:	03050100 	movweq	r0, #20736	@ 0x5100
    2fb4:	20000448 	andcs	r0, r0, r8, asr #8
    2fb8:	0136880d 	teqeq	r6, sp, lsl #16
    2fbc:	11040100 	mrsne	r0, (UNDEF: 20)
    2fc0:	000000aa 	andeq	r0, r0, sl, lsr #1
    2fc4:	00030501 	andeq	r0, r3, r1, lsl #10
    2fc8:	0d000000 	stceq	0, cr0, [r0, #-0]
    2fcc:	000136b8 			@ <UNDEFINED> instruction: 0x000136b8
    2fd0:	aa111a01 	bge	4497dc <_Min_Stack_Size+0x4493dc>
    2fd4:	01000000 	mrseq	r0, (UNDEF: 0)
    2fd8:	04440305 	strbeq	r0, [r4], #-773	@ 0xfffffcfb
    2fdc:	010e2000 	mrseq	r2, (UNDEF: 14)
    2fe0:	000108b6 			@ <UNDEFINED> instruction: 0x000108b6
    2fe4:	01113502 	tsteq	r1, r2, lsl #10
    2fe8:	000000aa 	andeq	r0, r0, sl, lsr #1
    2fec:	00026101 	andeq	r6, r2, r1, lsl #2
    2ff0:	02610f00 	rsbeq	r0, r1, #0, 30
    2ff4:	04000000 	streq	r0, [r0], #-0
    2ff8:	0001dd04 	andeq	sp, r1, r4, lsl #26
    2ffc:	38011000 	stmdacc	r1, {ip}
    3000:	0200010a 	andeq	r0, r0, #-2147483646	@ 0x80000002
    3004:	00aa1134 	adceq	r1, sl, r4, lsr r1
    3008:	7b010000 	blvc	43010 <_Min_Stack_Size+0x42c10>
    300c:	11000002 	tstne	r0, r2
    3010:	cc011200 	sfmgt	f1, 4, [r1], {-0}
    3014:	01000136 	tsteq	r0, r6, lsr r1
    3018:	2d01051b 	cfstr32cs	mvfx0, [r1, #-108]	@ 0xffffff94
    301c:	90000000 	andls	r0, r0, r0
    3020:	24080005 	strcs	r0, [r8], #-5
    3024:	98080006 	stmdals	r8, {r1, r2}
    3028:	0100001a 	tsteq	r0, sl, lsl r0
    302c:	000002df 	ldrdeq	r0, [r0], -pc	@ <UNPREDICTABLE>
    3030:	00059613 	andeq	r9, r5, r3, lsl r6
    3034:	00026708 	andeq	r6, r2, r8, lsl #14
    3038:	05e21400 	strbeq	r1, [r2, #1024]!	@ 0x400
    303c:	02480800 	subeq	r0, r8, #0, 16
    3040:	02ba0000 	adcseq	r0, sl, #0
    3044:	01150000 	tsteq	r5, r0
    3048:	d0030550 	andle	r0, r3, r0, asr r5
    304c:	00200004 	eoreq	r0, r0, r4
    3050:	0005f014 	andeq	pc, r5, r4, lsl r0	@ <UNPREDICTABLE>
    3054:	00024808 	andeq	r4, r2, r8, lsl #16
    3058:	0002ce00 	andeq	ip, r2, r0, lsl #28
    305c:	50011500 	andpl	r1, r1, r0, lsl #10
    3060:	00007602 	andeq	r7, r0, r2, lsl #12
    3064:	0005fc16 	andeq	pc, r5, r6, lsl ip	@ <UNPREDICTABLE>
    3068:	00024808 	andeq	r4, r2, r8, lsl #16
    306c:	50011500 	andpl	r1, r1, r0, lsl #10
    3070:	00007402 	andeq	r7, r0, r2, lsl #8
    3074:	9f011700 	svcls	0x00011700
    3078:	01000136 	tsteq	r0, r6, lsr r1
    307c:	8c010613 	stchi	6, cr0, [r1], {19}
    3080:	8e080005 	cdphi	0, 0, cr0, cr8, cr5, {0}
    3084:	02080005 	andeq	r0, r8, #5
    3088:	1701007d 	smlsdxne	r1, sp, r0, r0
    308c:	01369801 	teqeq	r6, r1, lsl #16
    3090:	060c0100 	streq	r0, [ip], -r0, lsl #2
    3094:	00058a01 	andeq	r8, r5, r1, lsl #20
    3098:	00058c08 	andeq	r8, r5, r8, lsl #24
    309c:	007d0208 	rsbseq	r0, sp, r8, lsl #4
    30a0:	91011701 	tstls	r1, r1, lsl #14
    30a4:	01000136 	tsteq	r0, r6, lsr r1
    30a8:	88010605 	stmdahi	r1, {r0, r2, r9, sl}
    30ac:	8a080005 	bhi	2030c8 <_Min_Stack_Size+0x202cc8>
    30b0:	02080005 	andeq	r0, r8, #5
    30b4:	0001007d 	andeq	r0, r1, sp, ror r0
    30b8:	0000002c 	andeq	r0, r0, ip, lsr #32
    30bc:	0d7d0002 	ldcleq	0, cr0, [sp, #-8]!
    30c0:	01040000 	mrseq	r0, (UNDEF: 4)
    30c4:	00004856 	andeq	r4, r0, r6, asr r8
    30c8:	00000288 	andeq	r0, r0, r8, lsl #5
    30cc:	000136d1 	ldrdeq	r3, [r1], -r1
    30d0:	00001511 	andeq	r1, r0, r1, lsl r5
    30d4:	000136f4 	strdeq	r3, [r1], -r4
    30d8:	02028001 	andeq	r8, r2, #1
    30dc:	25000137 	strcs	r0, [r0, #-311]	@ 0xfffffec9
    30e0:	5d080006 	stcpl	0, cr0, [r8, #-24]	@ 0xffffffe8
    30e4:	00080006 	andeq	r0, r8, r6

Disassembly of section .debug_abbrev:

