NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
00000000 <.debug_abbrev>:
   0:	25011101 	strcs	r1, [r1, #-257]	@ 0xfffffeff
   4:	030b130e 	movweq	r1, #45838	@ 0xb30e
   8:	550e1b0e 	strpl	r1, [lr, #-2830]	@ 0xfffff4f2
   c:	52011106 	andpl	r1, r1, #-2147483647	@ 0x80000001
  10:	99061001 	stmdbls	r6, {r0, ip}
  14:	00000642 	andeq	r0, r0, r2, asr #12
  18:	0b002402 	bleq	9028 <_Min_Stack_Size+0x8c28>
  1c:	030b3e0b 	movweq	r3, #48651	@ 0xbe0b
  20:	0300000e 	movweq	r0, #14
  24:	0c3f002e 	ldceq	0, cr0, [pc], #-184	@ ffffff74 <_estack+0xdfffd774>
  28:	0b3a0e03 	bleq	e8383c <_Min_Stack_Size+0xe8343c>
  2c:	0b390b3b 	bleq	e42d20 <_Min_Stack_Size+0xe42920>
  30:	01110c27 	tsteq	r1, r7, lsr #24
  34:	0a400112 	beq	1000484 <_Min_Stack_Size+0x1000084>
  38:	000c4297 	muleq	ip, r7, r2
  3c:	002e0400 	eoreq	r0, lr, r0, lsl #8
  40:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
  44:	0b3b0b3a 	bleq	ec2d34 <_Min_Stack_Size+0xec2934>
  48:	01110b39 	tsteq	r1, r9, lsr fp
  4c:	0a400112 	beq	100049c <_Min_Stack_Size+0x100009c>
  50:	000c4297 	muleq	ip, r7, r2
  54:	11010000 	mrsne	r0, (UNDEF: 1)
  58:	130e2501 	movwne	r2, #58625	@ 0xe501
  5c:	1b0e030b 	blne	380c90 <_Min_Stack_Size+0x380890>
  60:	1106550e 	tstne	r6, lr, lsl #10
  64:	10015201 	andne	r5, r1, r1, lsl #4
  68:	06429906 	strbeq	r9, [r2], -r6, lsl #18
  6c:	24020000 	strcs	r0, [r2], #-0
  70:	3e0b0b00 	vmlacc.f64	d0, d11, d0
  74:	000e030b 	andeq	r0, lr, fp, lsl #6
  78:	00240300 	eoreq	r0, r4, r0, lsl #6
  7c:	0b3e0b0b 	bleq	f82cb0 <_Min_Stack_Size+0xf828b0>
  80:	00000803 	andeq	r0, r0, r3, lsl #16
  84:	0b000f04 	bleq	3c9c <_Min_Stack_Size+0x389c>
  88:	0013490b 	andseq	r4, r3, fp, lsl #18
  8c:	00150500 	andseq	r0, r5, r0, lsl #10
  90:	00000c27 	andeq	r0, r0, r7, lsr #24
  94:	3e010406 	cdpcc	4, 0, cr0, cr1, cr6, {0}
  98:	490b0b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp}
  9c:	3b0b3a13 	blcc	2ce8f0 <_Min_Stack_Size+0x2ce4f0>
  a0:	010b390b 	tsteq	fp, fp, lsl #18
  a4:	07000013 	smladeq	r0, r3, r0, r0
  a8:	0e030028 	cdpeq	0, 0, cr0, cr3, cr8, {1}
  ac:	00000b1c 	andeq	r0, r0, ip, lsl fp
  b0:	0b011308 	bleq	44cd8 <_Min_Stack_Size+0x448d8>
  b4:	3b0b3a0b 	blcc	2ce8e8 <_Min_Stack_Size+0x2ce4e8>
  b8:	010b390b 	tsteq	fp, fp, lsl #18
  bc:	09000013 	stmdbeq	r0, {r0, r1, r4}
  c0:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
  c4:	0b3b0b3a 	bleq	ec2db4 <_Min_Stack_Size+0xec29b4>
  c8:	13490b39 	movtne	r0, #39737	@ 0x9b39
  cc:	00000a38 	andeq	r0, r0, r8, lsr sl
  d0:	4901010a 	stmdbmi	r1, {r1, r3, r8}
  d4:	00130113 	andseq	r0, r3, r3, lsl r1
  d8:	00210b00 	eoreq	r0, r1, r0, lsl #22
  dc:	0b2f1349 	bleq	bc4e08 <_Min_Stack_Size+0xbc4a08>
  e0:	160c0000 	strne	r0, [ip], -r0
  e4:	3a0e0300 	bcc	380cec <_Min_Stack_Size+0x3808ec>
  e8:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
  ec:	0013490b 	andseq	r4, r3, fp, lsl #18
  f0:	012e0d00 			@ <UNDEFINED> instruction: 0x012e0d00
  f4:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
  f8:	0b3b0b3a 	bleq	ec2de8 <_Min_Stack_Size+0xec29e8>
  fc:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 100:	01120111 	tsteq	r2, r1, lsl r1
 104:	42970a40 	addsmi	r0, r7, #64, 20	@ 0x40000
 108:	0013010c 	andseq	r0, r3, ip, lsl #2
 10c:	00050e00 	andeq	r0, r5, r0, lsl #28
 110:	0b3a0e03 	bleq	e83924 <_Min_Stack_Size+0xe83524>
 114:	0b390b3b 	bleq	e42e08 <_Min_Stack_Size+0xe42a08>
 118:	0a021349 	beq	84e44 <_Min_Stack_Size+0x84a44>
 11c:	2e0f0000 	cdpcs	0, 0, cr0, cr15, cr0, {0}
 120:	030c3f01 	movweq	r3, #52993	@ 0xcf01
 124:	3b0b3a0e 	blcc	2ce964 <_Min_Stack_Size+0x2ce564>
 128:	270b390b 	strcs	r3, [fp, -fp, lsl #18]
 12c:	1113490c 	tstne	r3, ip, lsl #18
 130:	40011201 	andmi	r1, r1, r1, lsl #4
 134:	0c42970a 	mcrreq	7, 0, r9, r2, cr10
 138:	00001301 	andeq	r1, r0, r1, lsl #6
 13c:	03000510 	movweq	r0, #1296	@ 0x510
 140:	3b0b3a0e 	blcc	2ce980 <_Min_Stack_Size+0x2ce580>
 144:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 148:	b7060213 	smladlt	r6, r3, r2, r0
 14c:	00000642 	andeq	r0, r0, r2, asr #12
 150:	3f012e11 	svccc	0x00012e11
 154:	3a0e030c 	bcc	380d8c <_Min_Stack_Size+0x38098c>
 158:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 15c:	490c270b 	stmdbmi	ip, {r0, r1, r3, r8, r9, sl, sp}
 160:	12011113 	andne	r1, r1, #-1073741820	@ 0xc0000004
 164:	970a4001 	strls	r4, [sl, -r1]
 168:	00000c42 	andeq	r0, r0, r2, asr #24
 16c:	01110100 	tsteq	r1, r0, lsl #2
 170:	0b130e25 	bleq	4c3a0c <_Min_Stack_Size+0x4c360c>
 174:	0e1b0e03 	cdpeq	14, 1, cr0, cr11, cr3, {0}
 178:	01110655 	tsteq	r1, r5, asr r6
 17c:	06100152 			@ <UNDEFINED> instruction: 0x06100152
 180:	00064299 	muleq	r6, r9, r2
 184:	00240200 	eoreq	r0, r4, r0, lsl #4
 188:	0b3e0b0b 	bleq	f82dbc <_Min_Stack_Size+0xf829bc>
 18c:	00000803 	andeq	r0, r0, r3, lsl #16
 190:	0b002403 	bleq	91a4 <_Min_Stack_Size+0x8da4>
 194:	030b3e0b 	movweq	r3, #48651	@ 0xbe0b
 198:	0400000e 	streq	r0, [r0], #-14
 19c:	0b0b000f 	bleq	2c01e0 <_Min_Stack_Size+0x2bfde0>
 1a0:	00001349 	andeq	r1, r0, r9, asr #6
 1a4:	27001505 	strcs	r1, [r0, -r5, lsl #10]
 1a8:	0600000c 	streq	r0, [r0], -ip
 1ac:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 1b0:	0b3b0b3a 	bleq	ec2ea0 <_Min_Stack_Size+0xec2aa0>
 1b4:	13490b39 	movtne	r0, #39737	@ 0x9b39
 1b8:	0c3c0c3f 	ldceq	12, cr0, [ip], #-252	@ 0xffffff04
 1bc:	04070000 	streq	r0, [r7], #-0
 1c0:	0b0b3e01 	bleq	2cf9cc <_Min_Stack_Size+0x2cf5cc>
 1c4:	3a13490b 	bcc	4d25f8 <_Min_Stack_Size+0x4d21f8>
 1c8:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 1cc:	0013010b 	andseq	r0, r3, fp, lsl #2
 1d0:	00280800 	eoreq	r0, r8, r0, lsl #16
 1d4:	0b1c0e03 	bleq	7039e8 <_Min_Stack_Size+0x7035e8>
 1d8:	16090000 	strne	r0, [r9], -r0
 1dc:	3a0e0300 	bcc	380de4 <_Min_Stack_Size+0x3809e4>
 1e0:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 1e4:	0013490b 	andseq	r4, r3, fp, lsl #18
 1e8:	01130a00 	tsteq	r3, r0, lsl #20
 1ec:	0b3a0b0b 	bleq	e82e20 <_Min_Stack_Size+0xe82a20>
 1f0:	0b390b3b 	bleq	e42ee4 <_Min_Stack_Size+0xe42ae4>
 1f4:	00001301 	andeq	r1, r0, r1, lsl #6
 1f8:	03000d0b 	movweq	r0, #3339	@ 0xd0b
 1fc:	3b0b3a0e 	blcc	2cea3c <_Min_Stack_Size+0x2ce63c>
 200:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 204:	000a3813 	andeq	r3, sl, r3, lsl r8
 208:	01010c00 	tsteq	r1, r0, lsl #24
 20c:	13011349 	movwne	r1, #4937	@ 0x1349
 210:	210d0000 	mrscs	r0, (UNDEF: 13)
 214:	2f134900 	svccs	0x00134900
 218:	0e00000b 	cdpeq	0, 0, cr0, cr0, cr11, {0}
 21c:	050b0113 	streq	r0, [fp, #-275]	@ 0xfffffeed
 220:	0b3b0b3a 	bleq	ec2f10 <_Min_Stack_Size+0xec2b10>
 224:	13010b39 	movwne	r0, #6969	@ 0x1b39
 228:	340f0000 	strcc	r0, [pc], #-0	@ 230 <_Min_Heap_Size+0x30>
 22c:	3a0e0300 	bcc	380e34 <_Min_Stack_Size+0x380a34>
 230:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 234:	3f13490b 	svccc	0x0013490b
 238:	000a020c 	andeq	r0, sl, ip, lsl #4
 23c:	012e1000 			@ <UNDEFINED> instruction: 0x012e1000
 240:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 244:	0b3b0b3a 	bleq	ec2f34 <_Min_Stack_Size+0xec2b34>
 248:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 24c:	0c3c1349 	ldceq	3, cr1, [ip], #-292	@ 0xfffffedc
 250:	00001301 	andeq	r1, r0, r1, lsl #6
 254:	49000511 	stmdbmi	r0, {r0, r4, r8, sl}
 258:	12000013 	andne	r0, r0, #19
 25c:	0c3f012e 	ldfeqs	f0, [pc], #-184	@ 1ac <_Min_Heap_Size-0x54>
 260:	0b3a0e03 	bleq	e83a74 <_Min_Stack_Size+0xe83674>
 264:	0b390b3b 	bleq	e42f58 <_Min_Stack_Size+0xe42b58>
 268:	13490c27 	movtne	r0, #39975	@ 0x9c27
 26c:	01120111 	tsteq	r2, r1, lsl r1
 270:	42970640 	addsmi	r0, r7, #64, 12	@ 0x4000000
 274:	0013010c 	andseq	r0, r3, ip, lsl #2
 278:	00051300 	andeq	r1, r5, r0, lsl #6
 27c:	0b3a0e03 	bleq	e83a90 <_Min_Stack_Size+0xe83690>
 280:	0b390b3b 	bleq	e42f74 <_Min_Stack_Size+0xe42b74>
 284:	06021349 	streq	r1, [r2], -r9, asr #6
 288:	000642b7 			@ <UNDEFINED> instruction: 0x000642b7
 28c:	00341400 	eorseq	r1, r4, r0, lsl #8
 290:	0b3a0e03 	bleq	e83aa4 <_Min_Stack_Size+0xe836a4>
 294:	0b390b3b 	bleq	e42f88 <_Min_Stack_Size+0xe42b88>
 298:	06021349 	streq	r1, [r2], -r9, asr #6
 29c:	000642b7 			@ <UNDEFINED> instruction: 0x000642b7
 2a0:	82891500 	addhi	r1, r9, #0, 10
 2a4:	01110101 	tsteq	r1, r1, lsl #2
 2a8:	00001331 	andeq	r1, r0, r1, lsr r3
 2ac:	01828a16 	orreq	r8, r2, r6, lsl sl
 2b0:	910a0200 	mrsls	r0, R10_fiq
 2b4:	00000a42 	andeq	r0, r0, r2, asr #20
 2b8:	3f012e17 	svccc	0x00012e17
 2bc:	3a0e030c 	bcc	380ef4 <_Min_Stack_Size+0x380af4>
 2c0:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 2c4:	110c270b 	tstne	ip, fp, lsl #14
 2c8:	40011201 	andmi	r1, r1, r1, lsl #4
 2cc:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 2d0:	00001301 	andeq	r1, r0, r1, lsl #6
 2d4:	03000518 	movweq	r0, #1304	@ 0x518
 2d8:	3b0b3a0e 	blcc	2ceb18 <_Min_Stack_Size+0x2ce718>
 2dc:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 2e0:	000a0213 	andeq	r0, sl, r3, lsl r2
 2e4:	010b1900 	tsteq	fp, r0, lsl #18
 2e8:	00000655 	andeq	r0, r0, r5, asr r6
 2ec:	0300341a 	movweq	r3, #1050	@ 0x41a
 2f0:	3b0b3a08 	blcc	2ceb18 <_Min_Stack_Size+0x2ce718>
 2f4:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 2f8:	b7060213 	smladlt	r6, r3, r2, r0
 2fc:	00000642 	andeq	r0, r0, r2, asr #12
 300:	3f002e1b 	svccc	0x00002e1b
 304:	3a0e030c 	bcc	380f3c <_Min_Stack_Size+0x380b3c>
 308:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 30c:	1201110b 	andne	r1, r1, #-1073741822	@ 0xc0000002
 310:	970a4001 	strls	r4, [sl, -r1]
 314:	00000c42 	andeq	r0, r0, r2, asr #24
 318:	3f012e1c 	svccc	0x00012e1c
 31c:	3a0e030c 	bcc	380f54 <_Min_Stack_Size+0x380b54>
 320:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 324:	1113490b 	tstne	r3, fp, lsl #18
 328:	40011201 	andmi	r1, r1, r1, lsl #4
 32c:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 330:	00001301 	andeq	r1, r0, r1, lsl #6
 334:	0182891d 	orreq	r8, r2, sp, lsl r9
 338:	31011100 	mrscc	r1, (UNDEF: 17)
 33c:	1e000013 	mcrne	0, 0, r0, cr0, cr3, {0}
 340:	01018289 	smlabbeq	r1, r9, r2, r8
 344:	13310111 	teqne	r1, #1073741828	@ 0x40000004
 348:	00001301 	andeq	r1, r0, r1, lsl #6
 34c:	3f012e1f 	svccc	0x00012e1f
 350:	3a0e030c 	bcc	380f88 <_Min_Stack_Size+0x380b88>
 354:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 358:	110c270b 	tstne	ip, fp, lsl #14
 35c:	40011201 	andmi	r1, r1, r1, lsl #4
 360:	0c42970a 	mcrreq	7, 0, r9, r2, cr10
 364:	00001301 	andeq	r1, r0, r1, lsl #6
 368:	3f002e20 	svccc	0x00002e20
 36c:	3a0e030c 	bcc	380fa4 <_Min_Stack_Size+0x380ba4>
 370:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 374:	110c270b 	tstne	ip, fp, lsl #14
 378:	40011201 	andmi	r1, r1, r1, lsl #4
 37c:	0c42970a 	mcrreq	7, 0, r9, r2, cr10
 380:	01000000 	mrseq	r0, (UNDEF: 0)
 384:	0e250111 	mcreq	1, 1, r0, cr5, cr1, {0}
 388:	0e030b13 	vmoveq.32	d3[0], r0
 38c:	06550e1b 			@ <UNDEFINED> instruction: 0x06550e1b
 390:	01520111 	cmpeq	r2, r1, lsl r1
 394:	42990610 	addsmi	r0, r9, #16, 12	@ 0x1000000
 398:	02000006 	andeq	r0, r0, #6
 39c:	0b0b0024 	bleq	2c0434 <_Min_Stack_Size+0x2c0034>
 3a0:	0e030b3e 	vmoveq.16	d3[0], r0
 3a4:	16030000 	strne	r0, [r3], -r0
 3a8:	3a0e0300 	bcc	380fb0 <_Min_Stack_Size+0x380bb0>
 3ac:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 3b0:	0013490b 	andseq	r4, r3, fp, lsl #18
 3b4:	00240400 	eoreq	r0, r4, r0, lsl #8
 3b8:	0b3e0b0b 	bleq	f82fec <_Min_Stack_Size+0xf82bec>
 3bc:	00000803 	andeq	r0, r0, r3, lsl #16
 3c0:	0b000f05 	bleq	3fdc <_Min_Stack_Size+0x3bdc>
 3c4:	0013490b 	andseq	r4, r3, fp, lsl #18
 3c8:	00150600 	andseq	r0, r5, r0, lsl #12
 3cc:	00000c27 	andeq	r0, r0, r7, lsr #24
 3d0:	49003507 	stmdbmi	r0, {r0, r1, r2, r8, sl, ip, sp}
 3d4:	08000013 	stmdaeq	r0, {r0, r1, r4}
 3d8:	0b0b0113 	bleq	2c082c <_Min_Stack_Size+0x2c042c>
 3dc:	0b3b0b3a 	bleq	ec30cc <_Min_Stack_Size+0xec2ccc>
 3e0:	13010b39 	movwne	r0, #6969	@ 0x1b39
 3e4:	0d090000 	stceq	0, cr0, [r9, #-0]
 3e8:	3a080300 	bcc	200ff0 <_Min_Stack_Size+0x200bf0>
 3ec:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 3f0:	3813490b 	ldmdacc	r3, {r0, r1, r3, r8, fp, lr}
 3f4:	0a00000a 	beq	424 <_Min_Stack_Size+0x24>
 3f8:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
 3fc:	0b3b0b3a 	bleq	ec30ec <_Min_Stack_Size+0xec2cec>
 400:	13490b39 	movtne	r0, #39737	@ 0x9b39
 404:	00000a38 	andeq	r0, r0, r8, lsr sl
 408:	4901010b 	stmdbmi	r1, {r0, r1, r3, r8}
 40c:	00130113 	andseq	r0, r3, r3, lsl r1
 410:	00210c00 	eoreq	r0, r1, r0, lsl #24
 414:	0b2f1349 	bleq	bc5140 <_Min_Stack_Size+0xbc4d40>
 418:	340d0000 	strcc	r0, [sp], #-0
 41c:	3a0e0300 	bcc	381024 <_Min_Stack_Size+0x380c24>
 420:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 424:	3f13490b 	svccc	0x0013490b
 428:	000a020c 	andeq	r0, sl, ip, lsl #4
 42c:	012e0e00 			@ <UNDEFINED> instruction: 0x012e0e00
 430:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 434:	0b3b0b3a 	bleq	ec3124 <_Min_Stack_Size+0xec2d24>
 438:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 43c:	13010c3c 	movwne	r0, #7228	@ 0x1c3c
 440:	050f0000 	streq	r0, [pc, #-0]	@ 448 <_Min_Stack_Size+0x48>
 444:	00134900 	andseq	r4, r3, r0, lsl #18
 448:	002e1000 	eoreq	r1, lr, r0
 44c:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 450:	0b3b0b3a 	bleq	ec3140 <_Min_Stack_Size+0xec2d40>
 454:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 458:	01120111 	tsteq	r2, r1, lsl r1
 45c:	42960640 	addsmi	r0, r6, #64, 12	@ 0x4000000
 460:	1100000c 	tstne	r0, ip
 464:	0c3f012e 	ldfeqs	f0, [pc], #-184	@ 3b4 <_Min_Heap_Size+0x1b4>
 468:	0b3a0e03 	bleq	e83c7c <_Min_Stack_Size+0xe8387c>
 46c:	0b390b3b 	bleq	e43160 <_Min_Stack_Size+0xe42d60>
 470:	01110c27 	tsteq	r1, r7, lsr #24
 474:	06400112 			@ <UNDEFINED> instruction: 0x06400112
 478:	010c4297 			@ <UNDEFINED> instruction: 0x010c4297
 47c:	12000013 	andne	r0, r0, #19
 480:	0e030005 	cdpeq	0, 0, cr0, cr3, cr5, {0}
 484:	0b3b0b3a 	bleq	ec3174 <_Min_Stack_Size+0xec2d74>
 488:	13490b39 	movtne	r0, #39737	@ 0x9b39
 48c:	42b70602 	adcsmi	r0, r7, #2097152	@ 0x200000
 490:	13000006 	movwne	r0, #6
 494:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 498:	0b3b0b3a 	bleq	ec3188 <_Min_Stack_Size+0xec2d88>
 49c:	13490b39 	movtne	r0, #39737	@ 0x9b39
 4a0:	00000a02 	andeq	r0, r0, r2, lsl #20
 4a4:	03003414 	movweq	r3, #1044	@ 0x414
 4a8:	3b0b3a0e 	blcc	2cece8 <_Min_Stack_Size+0x2ce8e8>
 4ac:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 4b0:	b7060213 	smladlt	r6, r3, r2, r0
 4b4:	00000642 	andeq	r0, r0, r2, asr #12
 4b8:	01828915 	orreq	r8, r2, r5, lsl r9
 4bc:	31011101 	tstcc	r1, r1, lsl #2
 4c0:	00130113 	andseq	r0, r3, r3, lsl r1
 4c4:	828a1600 	addhi	r1, sl, #0, 12
 4c8:	0a020001 	beq	804d4 <_Min_Stack_Size+0x800d4>
 4cc:	000a4291 	muleq	sl, r1, r2
 4d0:	82891700 	addhi	r1, r9, #0, 14
 4d4:	01110001 	tsteq	r1, r1
 4d8:	00001331 	andeq	r1, r0, r1, lsr r3
 4dc:	3f002e18 	svccc	0x00002e18
 4e0:	3a0e030c 	bcc	381118 <_Min_Stack_Size+0x380d18>
 4e4:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 4e8:	1201110b 	andne	r1, r1, #-1073741822	@ 0xc0000002
 4ec:	970a4001 	strls	r4, [sl, -r1]
 4f0:	00000c42 	andeq	r0, r0, r2, asr #24
 4f4:	01828919 	orreq	r8, r2, r9, lsl r9
 4f8:	31011101 	tstcc	r1, r1, lsl #2
 4fc:	1a000013 	bne	550 <_Min_Stack_Size+0x150>
 500:	0c3f012e 	ldfeqs	f0, [pc], #-184	@ 450 <_Min_Stack_Size+0x50>
 504:	0b3a0e03 	bleq	e83d18 <_Min_Stack_Size+0xe83918>
 508:	0b390b3b 	bleq	e431fc <_Min_Stack_Size+0xe42dfc>
 50c:	01110c27 	tsteq	r1, r7, lsr #24
 510:	0a400112 	beq	1000960 <_Min_Stack_Size+0x1000560>
 514:	010c4297 			@ <UNDEFINED> instruction: 0x010c4297
 518:	1b000013 	blne	56c <_Min_Stack_Size+0x16c>
 51c:	08030005 	stmdaeq	r3, {r0, r2}
 520:	0b3b0b3a 	bleq	ec3210 <_Min_Stack_Size+0xec2e10>
 524:	13490b39 	movtne	r0, #39737	@ 0x9b39
 528:	00000a02 	andeq	r0, r0, r2, lsl #20
 52c:	3f012e1c 	svccc	0x00012e1c
 530:	3a0e030c 	bcc	381168 <_Min_Stack_Size+0x380d68>
 534:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 538:	110c270b 	tstne	ip, fp, lsl #14
 53c:	40011201 	andmi	r1, r1, r1, lsl #4
 540:	0c42970a 	mcrreq	7, 0, r9, r2, cr10
 544:	01000000 	mrseq	r0, (UNDEF: 0)
 548:	0e250111 	mcreq	1, 1, r0, cr5, cr1, {0}
 54c:	0e030b13 	vmoveq.32	d3[0], r0
 550:	06550e1b 			@ <UNDEFINED> instruction: 0x06550e1b
 554:	01520111 	cmpeq	r2, r1, lsl r1
 558:	42990610 	addsmi	r0, r9, #16, 12	@ 0x1000000
 55c:	02000006 	andeq	r0, r0, #6
 560:	0b0b0024 	bleq	2c05f8 <_Min_Stack_Size+0x2c01f8>
 564:	0e030b3e 	vmoveq.16	d3[0], r0
 568:	16030000 	strne	r0, [r3], -r0
 56c:	3a0e0300 	bcc	381174 <_Min_Stack_Size+0x380d74>
 570:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 574:	0013490b 	andseq	r4, r3, fp, lsl #18
 578:	00240400 	eoreq	r0, r4, r0, lsl #8
 57c:	0b3e0b0b 	bleq	f831b0 <_Min_Stack_Size+0xf82db0>
 580:	00000803 	andeq	r0, r0, r3, lsl #16
 584:	49003505 	stmdbmi	r0, {r0, r2, r8, sl, ip, sp}
 588:	06000013 			@ <UNDEFINED> instruction: 0x06000013
 58c:	0b0b0113 	bleq	2c09e0 <_Min_Stack_Size+0x2c05e0>
 590:	0b3b0b3a 	bleq	ec3280 <_Min_Stack_Size+0xec2e80>
 594:	13010b39 	movwne	r0, #6969	@ 0x1b39
 598:	0d070000 	stceq	0, cr0, [r7, #-0]
 59c:	3a080300 	bcc	2011a4 <_Min_Stack_Size+0x200da4>
 5a0:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 5a4:	3813490b 	ldmdacc	r3, {r0, r1, r3, r8, fp, lr}
 5a8:	0800000a 	stmdaeq	r0, {r1, r3}
 5ac:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
 5b0:	0b3b0b3a 	bleq	ec32a0 <_Min_Stack_Size+0xec2ea0>
 5b4:	13490b39 	movtne	r0, #39737	@ 0x9b39
 5b8:	00000a38 	andeq	r0, r0, r8, lsr sl
 5bc:	3e010409 	cdpcc	4, 0, cr0, cr1, cr9, {0}
 5c0:	490b0b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp}
 5c4:	3b0b3a13 	blcc	2cee18 <_Min_Stack_Size+0x2cea18>
 5c8:	010b390b 	tsteq	fp, fp, lsl #18
 5cc:	0a000013 	beq	620 <_Min_Stack_Size+0x220>
 5d0:	0e030028 	cdpeq	0, 0, cr0, cr3, cr8, {1}
 5d4:	00000b1c 	andeq	r0, r0, ip, lsl fp
 5d8:	0300280b 	movweq	r2, #2059	@ 0x80b
 5dc:	000b1c08 	andeq	r1, fp, r8, lsl #24
 5e0:	00280c00 	eoreq	r0, r8, r0, lsl #24
 5e4:	061c0e03 	ldreq	r0, [ip], -r3, lsl #28
 5e8:	150d0000 	strne	r0, [sp, #-0]
 5ec:	010c2701 	tsteq	ip, r1, lsl #14
 5f0:	0e000013 	mcreq	0, 0, r0, cr0, cr3, {0}
 5f4:	13490005 	movtne	r0, #36869	@ 0x9005
 5f8:	0f0f0000 	svceq	0x000f0000
 5fc:	490b0b00 	stmdbmi	fp, {r8, r9, fp}
 600:	10000013 	andne	r0, r0, r3, lsl r0
 604:	13490101 	movtne	r0, #37121	@ 0x9101
 608:	00001301 	andeq	r1, r0, r1, lsl #6
 60c:	49002111 	stmdbmi	r0, {r0, r4, r8, sp}
 610:	000b2f13 	andeq	r2, fp, r3, lsl pc
 614:	00341200 	eorseq	r1, r4, r0, lsl #4
 618:	0b3a0e03 	bleq	e83e2c <_Min_Stack_Size+0xe83a2c>
 61c:	0b390b3b 	bleq	e43310 <_Min_Stack_Size+0xe42f10>
 620:	0c3f1349 	ldceq	3, cr1, [pc], #-292	@ 504 <_Min_Stack_Size+0x104>
 624:	00000a02 	andeq	r0, r0, r2, lsl #20
 628:	3f012e13 	svccc	0x00012e13
 62c:	3a0e030c 	bcc	381264 <_Min_Stack_Size+0x380e64>
 630:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 634:	3c0c270b 	stccc	7, cr2, [ip], {11}
 638:	0013010c 	andseq	r0, r3, ip, lsl #2
 63c:	002e1400 	eoreq	r1, lr, r0, lsl #8
 640:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 644:	0b3b0b3a 	bleq	ec3334 <_Min_Stack_Size+0xec2f34>
 648:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 64c:	0c3c1349 	ldceq	3, cr1, [ip], #-292	@ 0xfffffedc
 650:	2e150000 	cdpcs	0, 1, cr0, cr5, cr0, {0}
 654:	030c3f00 	movweq	r3, #52992	@ 0xcf00
 658:	3b0b3a0e 	blcc	2cee98 <_Min_Stack_Size+0x2cea98>
 65c:	270b3905 	strcs	r3, [fp, -r5, lsl #18]
 660:	1201110c 	andne	r1, r1, #12, 2
 664:	970a4001 	strls	r4, [sl, -r1]
 668:	00000c42 	andeq	r0, r0, r2, asr #24
 66c:	3f012e16 	svccc	0x00012e16
 670:	3a0e030c 	bcc	3812a8 <_Min_Stack_Size+0x380ea8>
 674:	39053b0b 	stmdbcc	r5, {r0, r1, r3, r8, r9, fp, ip, sp}
 678:	110c270b 	tstne	ip, fp, lsl #14
 67c:	40011201 	andmi	r1, r1, r1, lsl #4
 680:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 684:	00001301 	andeq	r1, r0, r1, lsl #6
 688:	03000517 	movweq	r0, #1303	@ 0x517
 68c:	3b0b3a0e 	blcc	2ceecc <_Min_Stack_Size+0x2ceacc>
 690:	490b3905 	stmdbmi	fp, {r0, r2, r8, fp, ip, sp}
 694:	b7060213 	smladlt	r6, r3, r2, r0
 698:	00000642 	andeq	r0, r0, r2, asr #12
 69c:	03003418 	movweq	r3, #1048	@ 0x418
 6a0:	3b0b3a0e 	blcc	2ceee0 <_Min_Stack_Size+0x2ceae0>
 6a4:	490b3905 	stmdbmi	fp, {r0, r2, r8, fp, ip, sp}
 6a8:	b7060213 	smladlt	r6, r3, r2, r0
 6ac:	00000642 	andeq	r0, r0, r2, asr #12
 6b0:	01828919 	orreq	r8, r2, r9, lsl r9
 6b4:	01011101 	tsteq	r1, r1, lsl #2
 6b8:	1a000013 	bne	70c <_Min_Stack_Size+0x30c>
 6bc:	0001828a 	andeq	r8, r1, sl, lsl #5
 6c0:	42910a02 	addsmi	r0, r1, #8192	@ 0x2000
 6c4:	1b00000a 	blne	6f4 <_Min_Stack_Size+0x2f4>
 6c8:	01018289 	smlabbeq	r1, r9, r2, r8
 6cc:	00000111 	andeq	r0, r0, r1, lsl r1
 6d0:	0300341c 	movweq	r3, #1052	@ 0x41c
 6d4:	3b0b3a0e 	blcc	2cef14 <_Min_Stack_Size+0x2ceb14>
 6d8:	490b3905 	stmdbmi	fp, {r0, r2, r8, fp, ip, sp}
 6dc:	000a0213 	andeq	r0, sl, r3, lsl r2
 6e0:	00341d00 	eorseq	r1, r4, r0, lsl #26
 6e4:	0b3a0e03 	bleq	e83ef8 <_Min_Stack_Size+0xe83af8>
 6e8:	0b39053b 	bleq	e41bdc <_Min_Stack_Size+0xe417dc>
 6ec:	061c1349 	ldreq	r1, [ip], -r9, asr #6
 6f0:	891e0000 	ldmdbhi	lr, {}	@ <UNPREDICTABLE>
 6f4:	11010182 	smlabbne	r1, r2, r1, r0
 6f8:	01133101 	tsteq	r3, r1, lsl #2
 6fc:	1f000013 	svcne	0x00000013
 700:	01018289 	smlabbeq	r1, r9, r2, r8
 704:	13310111 	teqne	r1, #1073741828	@ 0x40000004
 708:	2e200000 	cdpcs	0, 2, cr0, cr0, cr0, {0}
 70c:	030c3f01 	movweq	r3, #52993	@ 0xcf01
 710:	3b0b3a0e 	blcc	2cef50 <_Min_Stack_Size+0x2ceb50>
 714:	270b3905 	strcs	r3, [fp, -r5, lsl #18]
 718:	010b200c 	tsteq	fp, ip
 71c:	21000013 	tstcs	r0, r3, lsl r0
 720:	0e030005 	cdpeq	0, 0, cr0, cr3, cr5, {0}
 724:	053b0b3a 	ldreq	r0, [fp, #-2874]!	@ 0xfffff4c6
 728:	13490b39 	movtne	r0, #39737	@ 0x9b39
 72c:	2e220000 	cdpcs	0, 2, cr0, cr2, cr0, {0}
 730:	030c3f01 	movweq	r3, #52993	@ 0xcf01
 734:	3b0b3a0e 	blcc	2cef74 <_Min_Stack_Size+0x2ceb74>
 738:	270b390b 	strcs	r3, [fp, -fp, lsl #18]
 73c:	1113490c 	tstne	r3, ip, lsl #18
 740:	40011201 	andmi	r1, r1, r1, lsl #4
 744:	0c42970a 	mcrreq	7, 0, r9, r2, cr10
 748:	00001301 	andeq	r1, r0, r1, lsl #6
 74c:	03000523 	movweq	r0, #1315	@ 0x523
 750:	3b0b3a0e 	blcc	2cef90 <_Min_Stack_Size+0x2ceb90>
 754:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 758:	b7060213 	smladlt	r6, r3, r2, r0
 75c:	00000642 	andeq	r0, r0, r2, asr #12
 760:	03000524 	movweq	r0, #1316	@ 0x524
 764:	3b0b3a0e 	blcc	2cefa4 <_Min_Stack_Size+0x2ceba4>
 768:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 76c:	000a0213 	andeq	r0, sl, r3, lsl r2
 770:	00342500 	eorseq	r2, r4, r0, lsl #10
 774:	0b3a0e03 	bleq	e83f88 <_Min_Stack_Size+0xe83b88>
 778:	0b390b3b 	bleq	e4346c <_Min_Stack_Size+0xe4306c>
 77c:	06021349 	streq	r1, [r2], -r9, asr #6
 780:	000642b7 			@ <UNDEFINED> instruction: 0x000642b7
 784:	012e2600 			@ <UNDEFINED> instruction: 0x012e2600
 788:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 78c:	0b3b0b3a 	bleq	ec347c <_Min_Stack_Size+0xec307c>
 790:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 794:	01120111 	tsteq	r2, r1, lsl r1
 798:	42970640 	addsmi	r0, r7, #64, 12	@ 0x4000000
 79c:	0013010c 	andseq	r0, r3, ip, lsl #2
 7a0:	012e2700 			@ <UNDEFINED> instruction: 0x012e2700
 7a4:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 7a8:	0b3b0b3a 	bleq	ec3498 <_Min_Stack_Size+0xec3098>
 7ac:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 7b0:	01120111 	tsteq	r2, r1, lsl r1
 7b4:	42970a40 	addsmi	r0, r7, #64, 20	@ 0x40000
 7b8:	0013010c 	andseq	r0, r3, ip, lsl #2
 7bc:	00342800 	eorseq	r2, r4, r0, lsl #16
 7c0:	0b3a0803 	bleq	e827d4 <_Min_Stack_Size+0xe823d4>
 7c4:	0b390b3b 	bleq	e434b8 <_Min_Stack_Size+0xe430b8>
 7c8:	06021349 	streq	r1, [r2], -r9, asr #6
 7cc:	000642b7 			@ <UNDEFINED> instruction: 0x000642b7
 7d0:	011d2900 	tsteq	sp, r0, lsl #18
 7d4:	01521331 	cmpeq	r2, r1, lsr r3
 7d8:	110b42b8 			@ <UNDEFINED> instruction: 0x110b42b8
 7dc:	58011201 	stmdapl	r1, {r0, r9, ip}
 7e0:	570b590b 	strpl	r5, [fp, -fp, lsl #18]
 7e4:	0013010b 	andseq	r0, r3, fp, lsl #2
 7e8:	00052a00 	andeq	r2, r5, r0, lsl #20
 7ec:	06021331 			@ <UNDEFINED> instruction: 0x06021331
 7f0:	000642b7 			@ <UNDEFINED> instruction: 0x000642b7
 7f4:	00342b00 	eorseq	r2, r4, r0, lsl #22
 7f8:	0b3a0e03 	bleq	e8400c <_Min_Stack_Size+0xe83c0c>
 7fc:	0b390b3b 	bleq	e434f0 <_Min_Stack_Size+0xe430f0>
 800:	0a021349 	beq	8552c <_Min_Stack_Size+0x8512c>
 804:	892c0000 	stmdbhi	ip!, {}	@ <UNPREDICTABLE>
 808:	11000182 	smlabbne	r0, r2, r1, r0
 80c:	00133101 	andseq	r3, r3, r1, lsl #2
