NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
 810:	012e2d00 			@ <UNDEFINED> instruction: 0x012e2d00
 814:	01111331 	tsteq	r1, r1, lsr r3
 818:	0a400112 	beq	1000c68 <_Min_Stack_Size+0x1000868>
 81c:	010c4297 			@ <UNDEFINED> instruction: 0x010c4297
 820:	2e000013 	mcrcs	0, 0, r0, cr0, cr3, {0}
 824:	13310005 	teqne	r1, #5
 828:	00000a02 	andeq	r0, r0, r2, lsl #20
 82c:	31012e2f 	tstcc	r1, pc, lsr #28
 830:	12011113 	andne	r1, r1, #-1073741820	@ 0xc0000004
 834:	970a4001 	strls	r4, [sl, -r1]
 838:	00000c42 	andeq	r0, r0, r2, asr #24
 83c:	01110100 	tsteq	r1, r0, lsl #2
 840:	0b130e25 	bleq	4c40dc <_Min_Stack_Size+0x4c3cdc>
 844:	0e1b0e03 	cdpeq	14, 1, cr0, cr11, cr3, {0}
 848:	01110655 	tsteq	r1, r5, asr r6
 84c:	06100152 			@ <UNDEFINED> instruction: 0x06100152
 850:	00064299 	muleq	r6, r9, r2
 854:	00240200 	eoreq	r0, r4, r0, lsl #4
 858:	0b3e0b0b 	bleq	f8348c <_Min_Stack_Size+0xf8308c>
 85c:	00000e03 	andeq	r0, r0, r3, lsl #28
 860:	03001603 	movweq	r1, #1539	@ 0x603
 864:	3b0b3a0e 	blcc	2cf0a4 <_Min_Stack_Size+0x2ceca4>
 868:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 86c:	04000013 	streq	r0, [r0], #-19	@ 0xffffffed
 870:	0b0b0024 	bleq	2c0908 <_Min_Stack_Size+0x2c0508>
 874:	08030b3e 	stmdaeq	r3, {r1, r2, r3, r4, r5, r8, r9, fp}
 878:	35050000 	strcc	r0, [r5, #-0]
 87c:	00134900 	andseq	r4, r3, r0, lsl #18
 880:	01130600 	tsteq	r3, r0, lsl #12
 884:	0b3a0b0b 	bleq	e834b8 <_Min_Stack_Size+0xe830b8>
 888:	0b390b3b 	bleq	e4357c <_Min_Stack_Size+0xe4317c>
 88c:	00001301 	andeq	r1, r0, r1, lsl #6
 890:	03000d07 	movweq	r0, #3335	@ 0xd07
 894:	3b0b3a08 	blcc	2cf0bc <_Min_Stack_Size+0x2cecbc>
 898:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 89c:	000a3813 	andeq	r3, sl, r3, lsl r8
 8a0:	000d0800 	andeq	r0, sp, r0, lsl #16
 8a4:	0b3a0e03 	bleq	e840b8 <_Min_Stack_Size+0xe83cb8>
 8a8:	0b390b3b 	bleq	e4359c <_Min_Stack_Size+0xe4319c>
 8ac:	0a381349 	beq	e055d8 <_Min_Stack_Size+0xe051d8>
 8b0:	13090000 	movwne	r0, #36864	@ 0x9000
 8b4:	0b0e0301 	bleq	3814c0 <_Min_Stack_Size+0x3810c0>
 8b8:	3b0b3a0b 	blcc	2cf0ec <_Min_Stack_Size+0x2cecec>
 8bc:	010b390b 	tsteq	fp, fp, lsl #18
 8c0:	0a000013 	beq	914 <_Min_Stack_Size+0x514>
 8c4:	0803000d 	stmdaeq	r3, {r0, r2, r3}
 8c8:	0b3b0b3a 	bleq	ec35b8 <_Min_Stack_Size+0xec31b8>
 8cc:	13490b39 	movtne	r0, #39737	@ 0x9b39
 8d0:	0b0d0b0b 	bleq	343504 <_Min_Stack_Size+0x343104>
 8d4:	0a380b0c 	beq	e0350c <_Min_Stack_Size+0xe0310c>
 8d8:	0d0b0000 	stceq	0, cr0, [fp, #-0]
 8dc:	3a0e0300 	bcc	3814e4 <_Min_Stack_Size+0x3810e4>
 8e0:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 8e4:	0b13490b 	bleq	4d2d18 <_Min_Stack_Size+0x4d2918>
 8e8:	0c0b0d0b 	stceq	13, cr0, [fp], {11}
 8ec:	000a380b 	andeq	r3, sl, fp, lsl #16
 8f0:	01150c00 	tsteq	r5, r0, lsl #24
 8f4:	13010c27 	movwne	r0, #7207	@ 0x1c27
 8f8:	050d0000 	streq	r0, [sp, #-0]
 8fc:	00134900 	andseq	r4, r3, r0, lsl #18
 900:	000f0e00 	andeq	r0, pc, r0, lsl #28
 904:	13490b0b 	movtne	r0, #39691	@ 0x9b0b
 908:	040f0000 	streq	r0, [pc], #-0	@ 910 <_Min_Stack_Size+0x510>
 90c:	3e0e0301 	cdpcc	3, 0, cr0, cr14, cr1, {0}
 910:	490b0b0b 	stmdbmi	fp, {r0, r1, r3, r8, r9, fp}
 914:	3b0b3a13 	blcc	2cf168 <_Min_Stack_Size+0x2ced68>
 918:	010b390b 	tsteq	fp, fp, lsl #18
 91c:	10000013 	andne	r0, r0, r3, lsl r0
 920:	0e030028 	cdpeq	0, 0, cr0, cr3, cr8, {1}
 924:	00000b1c 	andeq	r0, r0, ip, lsl fp
 928:	49010111 	stmdbmi	r1, {r0, r4, r8}
 92c:	00130113 	andseq	r0, r3, r3, lsl r1
 930:	00211200 	eoreq	r1, r1, r0, lsl #4
 934:	0b2f1349 	bleq	bc5660 <_Min_Stack_Size+0xbc5260>
 938:	34130000 	ldrcc	r0, [r3], #-0
 93c:	3a0e0300 	bcc	381544 <_Min_Stack_Size+0x381144>
 940:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 944:	3f13490b 	svccc	0x0013490b
 948:	000a020c 	andeq	r0, sl, ip, lsl #4
 94c:	012e1400 			@ <UNDEFINED> instruction: 0x012e1400
 950:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 954:	0b3b0b3a 	bleq	ec3644 <_Min_Stack_Size+0xec3244>
 958:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 95c:	13010c3c 	movwne	r0, #7228	@ 0x1c3c
 960:	2e150000 	cdpcs	0, 1, cr0, cr5, cr0, {0}
 964:	030c3f01 	movweq	r3, #52993	@ 0xcf01
 968:	3b0b3a0e 	blcc	2cf1a8 <_Min_Stack_Size+0x2ceda8>
 96c:	270b390b 	strcs	r3, [fp, -fp, lsl #18]
 970:	1201110c 	andne	r1, r1, #12, 2
 974:	97064001 	strls	r4, [r6, -r1]
 978:	13010c42 	movwne	r0, #7234	@ 0x1c42
 97c:	05160000 	ldreq	r0, [r6, #-0]
 980:	3a0e0300 	bcc	381588 <_Min_Stack_Size+0x381188>
 984:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 988:	0213490b 	andseq	r4, r3, #180224	@ 0x2c000
 98c:	0642b706 	strbeq	fp, [r2], -r6, lsl #14
 990:	34170000 	ldrcc	r0, [r7], #-0
 994:	3a0e0300 	bcc	38159c <_Min_Stack_Size+0x38119c>
 998:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 99c:	0213490b 	andseq	r4, r3, #180224	@ 0x2c000
 9a0:	1800000a 	stmdane	r0, {r1, r3}
 9a4:	01018289 	smlabbeq	r1, r9, r2, r8
 9a8:	13310111 	teqne	r1, #1073741828	@ 0x40000004
 9ac:	00001301 	andeq	r1, r0, r1, lsl #6
 9b0:	01828a19 	orreq	r8, r2, r9, lsl sl
 9b4:	910a0200 	mrsls	r0, R10_fiq
 9b8:	00000a42 	andeq	r0, r0, r2, asr #20
 9bc:	0182891a 	orreq	r8, r2, sl, lsl r9
 9c0:	31011101 	tstcc	r1, r1, lsl #2
 9c4:	1b000013 	blne	a18 <_Min_Stack_Size+0x618>
 9c8:	0c3f012e 	ldfeqs	f0, [pc], #-184	@ 918 <_Min_Stack_Size+0x518>
 9cc:	0b3a0e03 	bleq	e841e0 <_Min_Stack_Size+0xe83de0>
 9d0:	0b390b3b 	bleq	e436c4 <_Min_Stack_Size+0xe432c4>
 9d4:	01110c27 	tsteq	r1, r7, lsr #24
 9d8:	06400112 			@ <UNDEFINED> instruction: 0x06400112
 9dc:	010c4296 			@ <UNDEFINED> instruction: 0x010c4296
 9e0:	1c000013 	stcne	0, cr0, [r0], {19}
 9e4:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 9e8:	0b3b0b3a 	bleq	ec36d8 <_Min_Stack_Size+0xec32d8>
 9ec:	13490b39 	movtne	r0, #39737	@ 0x9b39
 9f0:	42b70602 	adcsmi	r0, r7, #2097152	@ 0x200000
 9f4:	1d000006 	stcne	0, cr0, [r0, #-24]	@ 0xffffffe8
 9f8:	0e030005 	cdpeq	0, 0, cr0, cr3, cr5, {0}
 9fc:	0b3b0b3a 	bleq	ec36ec <_Min_Stack_Size+0xec32ec>
 a00:	13490b39 	movtne	r0, #39737	@ 0x9b39
 a04:	00000a02 	andeq	r0, r0, r2, lsl #20
 a08:	3f012e1e 	svccc	0x00012e1e
 a0c:	3a0e030c 	bcc	381644 <_Min_Stack_Size+0x381244>
 a10:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 a14:	110c270b 	tstne	ip, fp, lsl #14
 a18:	40011201 	andmi	r1, r1, r1, lsl #4
 a1c:	0c42970a 	mcrreq	7, 0, r9, r2, cr10
 a20:	00001301 	andeq	r1, r0, r1, lsl #6
 a24:	3f012e1f 	svccc	0x00012e1f
 a28:	3a0e030c 	bcc	381660 <_Min_Stack_Size+0x381260>
 a2c:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 a30:	110c270b 	tstne	ip, fp, lsl #14
 a34:	40011201 	andmi	r1, r1, r1, lsl #4
 a38:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 a3c:	01000000 	mrseq	r0, (UNDEF: 0)
 a40:	0e250111 	mcreq	1, 1, r0, cr5, cr1, {0}
 a44:	0e030b13 	vmoveq.32	d3[0], r0
 a48:	06550e1b 			@ <UNDEFINED> instruction: 0x06550e1b
 a4c:	01520111 	cmpeq	r2, r1, lsl r1
 a50:	42990610 	addsmi	r0, r9, #16, 12	@ 0x1000000
 a54:	02000006 	andeq	r0, r0, #6
 a58:	0b0b0024 	bleq	2c0af0 <_Min_Stack_Size+0x2c06f0>
 a5c:	0e030b3e 	vmoveq.16	d3[0], r0
 a60:	16030000 	strne	r0, [r3], -r0
 a64:	3a0e0300 	bcc	38166c <_Min_Stack_Size+0x38126c>
 a68:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 a6c:	0013490b 	andseq	r4, r3, fp, lsl #18
 a70:	00240400 	eoreq	r0, r4, r0, lsl #8
 a74:	0b3e0b0b 	bleq	f836a8 <_Min_Stack_Size+0xf832a8>
 a78:	00000803 	andeq	r0, r0, r3, lsl #16
 a7c:	0b000f05 	bleq	4698 <_Min_Stack_Size+0x4298>
 a80:	0013490b 	andseq	r4, r3, fp, lsl #18
 a84:	00150600 	andseq	r0, r5, r0, lsl #12
 a88:	00000c27 	andeq	r0, r0, r7, lsr #24
 a8c:	49003507 	stmdbmi	r0, {r0, r1, r2, r8, sl, ip, sp}
 a90:	08000013 	stmdaeq	r0, {r0, r1, r4}
 a94:	0b0b0113 	bleq	2c0ee8 <_Min_Stack_Size+0x2c0ae8>
 a98:	0b3b0b3a 	bleq	ec3788 <_Min_Stack_Size+0xec3388>
 a9c:	13010b39 	movwne	r0, #6969	@ 0x1b39
 aa0:	0d090000 	stceq	0, cr0, [r9, #-0]
 aa4:	3a080300 	bcc	2016ac <_Min_Stack_Size+0x2012ac>
 aa8:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 aac:	3813490b 	ldmdacc	r3, {r0, r1, r3, r8, fp, lr}
 ab0:	0a00000a 	beq	ae0 <_Min_Stack_Size+0x6e0>
 ab4:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
 ab8:	0b3b0b3a 	bleq	ec37a8 <_Min_Stack_Size+0xec33a8>
 abc:	13490b39 	movtne	r0, #39737	@ 0x9b39
 ac0:	00000a38 	andeq	r0, r0, r8, lsr sl
 ac4:	0301040b 	movweq	r0, #5131	@ 0x140b
 ac8:	0b0b3e0e 	bleq	2d0308 <_Min_Stack_Size+0x2cff08>
 acc:	3a13490b 	bcc	4d2f00 <_Min_Stack_Size+0x4d2b00>
 ad0:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 ad4:	0013010b 	andseq	r0, r3, fp, lsl #2
 ad8:	00280c00 	eoreq	r0, r8, r0, lsl #24
 adc:	0b1c0e03 	bleq	7042f0 <_Min_Stack_Size+0x703ef0>
 ae0:	340d0000 	strcc	r0, [sp], #-0
 ae4:	3a0e0300 	bcc	3816ec <_Min_Stack_Size+0x3812ec>
 ae8:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 aec:	3f13490b 	svccc	0x0013490b
 af0:	000a020c 	andeq	r0, sl, ip, lsl #4
 af4:	012e0e00 			@ <UNDEFINED> instruction: 0x012e0e00
 af8:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 afc:	0b3b0b3a 	bleq	ec37ec <_Min_Stack_Size+0xec33ec>
 b00:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 b04:	13010c3c 	movwne	r0, #7228	@ 0x1c3c
 b08:	050f0000 	streq	r0, [pc, #-0]	@ b10 <_Min_Stack_Size+0x710>
 b0c:	00134900 	andseq	r4, r3, r0, lsl #18
 b10:	002e1000 	eoreq	r1, lr, r0
 b14:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 b18:	0b3b0b3a 	bleq	ec3808 <_Min_Stack_Size+0xec3408>
 b1c:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 b20:	0c3c1349 	ldceq	3, cr1, [ip], #-292	@ 0xfffffedc
 b24:	2e110000 	cdpcs	0, 1, cr0, cr1, cr0, {0}
 b28:	030c3f00 	movweq	r3, #52992	@ 0xcf00
 b2c:	3b0b3a0e 	blcc	2cf36c <_Min_Stack_Size+0x2cef6c>
 b30:	270b3905 	strcs	r3, [fp, -r5, lsl #18]
 b34:	1201110c 	andne	r1, r1, #12, 2
 b38:	96064001 	strls	r4, [r6], -r1
 b3c:	00000c42 	andeq	r0, r0, r2, asr #24
 b40:	3f012e12 	svccc	0x00012e12
 b44:	3a0e030c 	bcc	38177c <_Min_Stack_Size+0x38137c>
 b48:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 b4c:	110c270b 	tstne	ip, fp, lsl #14
 b50:	40011201 	andmi	r1, r1, r1, lsl #4
 b54:	0c429706 	mcrreq	7, 0, r9, r2, cr6
 b58:	00001301 	andeq	r1, r0, r1, lsl #6
 b5c:	03000513 	movweq	r0, #1299	@ 0x513
 b60:	3b0b3a0e 	blcc	2cf3a0 <_Min_Stack_Size+0x2cefa0>
 b64:	490b390b 	stmdbmi	fp, {r0, r1, r3, r8, fp, ip, sp}
 b68:	b7060213 	smladlt	r6, r3, r2, r0
 b6c:	00000642 	andeq	r0, r0, r2, asr #12
 b70:	03003414 	movweq	r3, #1044	@ 0x414
 b74:	3b0b3a0e 	blcc	2cf3b4 <_Min_Stack_Size+0x2cefb4>
 b78:	490b3905 	stmdbmi	fp, {r0, r2, r8, fp, ip, sp}
 b7c:	000a0213 	andeq	r0, sl, r3, lsl r2
 b80:	82891500 	addhi	r1, r9, #0, 10
 b84:	01110101 	tsteq	r1, r1, lsl #2
 b88:	13011331 	movwne	r1, #4913	@ 0x1331
 b8c:	8a160000 	bhi	580b94 <_Min_Stack_Size+0x580794>
 b90:	02000182 	andeq	r0, r0, #-2147483616	@ 0x80000020
 b94:	0a42910a 	beq	10a4fc4 <_Min_Stack_Size+0x10a4bc4>
 b98:	89170000 	ldmdbhi	r7, {}	@ <UNPREDICTABLE>
 b9c:	11010182 	smlabbne	r1, r2, r1, r0
 ba0:	00133101 	andseq	r3, r3, r1, lsl #2
 ba4:	012e1800 			@ <UNDEFINED> instruction: 0x012e1800
 ba8:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 bac:	0b3b0b3a 	bleq	ec389c <_Min_Stack_Size+0xec349c>
 bb0:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 bb4:	01120111 	tsteq	r2, r1, lsl r1
 bb8:	42970a40 	addsmi	r0, r7, #64, 20	@ 0x40000
 bbc:	0013010c 	andseq	r0, r3, ip, lsl #2
 bc0:	00051900 	andeq	r1, r5, r0, lsl #18
 bc4:	0b3a0e03 	bleq	e843d8 <_Min_Stack_Size+0xe83fd8>
 bc8:	0b390b3b 	bleq	e438bc <_Min_Stack_Size+0xe434bc>
 bcc:	0a021349 	beq	858f8 <_Min_Stack_Size+0x854f8>
 bd0:	341a0000 	ldrcc	r0, [sl], #-0
 bd4:	3a0e0300 	bcc	3817dc <_Min_Stack_Size+0x3813dc>
 bd8:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 bdc:	0013490b 	andseq	r4, r3, fp, lsl #18
 be0:	012e1b00 			@ <UNDEFINED> instruction: 0x012e1b00
 be4:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 be8:	0b3b0b3a 	bleq	ec38d8 <_Min_Stack_Size+0xec34d8>
 bec:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 bf0:	01120111 	tsteq	r2, r1, lsl r1
 bf4:	42970640 	addsmi	r0, r7, #64, 12	@ 0x4000000
 bf8:	1c00000c 	stcne	0, cr0, [r0], {12}
 bfc:	0e030034 	mcreq	0, 0, r0, cr3, cr4, {1}
 c00:	0b3b0b3a 	bleq	ec38f0 <_Min_Stack_Size+0xec34f0>
 c04:	13490b39 	movtne	r0, #39737	@ 0x9b39
 c08:	42b70602 	adcsmi	r0, r7, #2097152	@ 0x200000
 c0c:	1d000006 	stcne	0, cr0, [r0, #-24]	@ 0xffffffe8
 c10:	08030034 	stmdaeq	r3, {r2, r4, r5}
 c14:	0b3b0b3a 	bleq	ec3904 <_Min_Stack_Size+0xec3504>
 c18:	13490b39 	movtne	r0, #39737	@ 0x9b39
 c1c:	42b70602 	adcsmi	r0, r7, #2097152	@ 0x200000
 c20:	1e000006 	cdpne	0, 0, cr0, cr0, cr6, {0}
 c24:	00018289 	andeq	r8, r1, r9, lsl #5
 c28:	13310111 	teqne	r1, #1073741828	@ 0x40000004
 c2c:	01000000 	mrseq	r0, (UNDEF: 0)
 c30:	0e250111 	mcreq	1, 1, r0, cr5, cr1, {0}
 c34:	0e030b13 	vmoveq.32	d3[0], r0
 c38:	06550e1b 			@ <UNDEFINED> instruction: 0x06550e1b
 c3c:	01520111 	cmpeq	r2, r1, lsl r1
 c40:	42990610 	addsmi	r0, r9, #16, 12	@ 0x1000000
 c44:	02000006 	andeq	r0, r0, #6
 c48:	0b0b0024 	bleq	2c0ce0 <_Min_Stack_Size+0x2c08e0>
 c4c:	08030b3e 	stmdaeq	r3, {r1, r2, r3, r4, r5, r8, r9, fp}
 c50:	24030000 	strcs	r0, [r3], #-0
 c54:	3e0b0b00 	vmlacc.f64	d0, d11, d0
 c58:	000e030b 	andeq	r0, lr, fp, lsl #6
 c5c:	000f0400 	andeq	r0, pc, r0, lsl #8
 c60:	13490b0b 	movtne	r0, #39691	@ 0x9b0b
 c64:	15050000 	strne	r0, [r5, #-0]
 c68:	000c2700 	andeq	r2, ip, r0, lsl #14
 c6c:	01040600 	tsteq	r4, r0, lsl #12
 c70:	0b0b0b3e 	bleq	2c3970 <_Min_Stack_Size+0x2c3570>
 c74:	0b3a1349 	bleq	e859a0 <_Min_Stack_Size+0xe855a0>
 c78:	0b390b3b 	bleq	e4396c <_Min_Stack_Size+0xe4356c>
 c7c:	00001301 	andeq	r1, r0, r1, lsl #6
 c80:	03002807 	movweq	r2, #2055	@ 0x807
 c84:	000b1c0e 	andeq	r1, fp, lr, lsl #24
 c88:	00160800 	andseq	r0, r6, r0, lsl #16
 c8c:	0b3a0e03 	bleq	e844a0 <_Min_Stack_Size+0xe840a0>
 c90:	0b390b3b 	bleq	e43984 <_Min_Stack_Size+0xe43584>
 c94:	00001349 	andeq	r1, r0, r9, asr #6
 c98:	0b011309 	bleq	458c4 <_Min_Stack_Size+0x454c4>
 c9c:	3b0b3a0b 	blcc	2cf4d0 <_Min_Stack_Size+0x2cf0d0>
 ca0:	010b390b 	tsteq	fp, fp, lsl #18
 ca4:	0a000013 	beq	cf8 <_Min_Stack_Size+0x8f8>
 ca8:	0e03000d 	cdpeq	0, 0, cr0, cr3, cr13, {0}
 cac:	0b3b0b3a 	bleq	ec399c <_Min_Stack_Size+0xec359c>
 cb0:	13490b39 	movtne	r0, #39737	@ 0x9b39
 cb4:	00000a38 	andeq	r0, r0, r8, lsr sl
 cb8:	4901010b 	stmdbmi	r1, {r0, r1, r3, r8}
 cbc:	00130113 	andseq	r0, r3, r3, lsl r1
 cc0:	00210c00 	eoreq	r0, r1, r0, lsl #24
 cc4:	0b2f1349 	bleq	bc59f0 <_Min_Stack_Size+0xbc55f0>
 cc8:	340d0000 	strcc	r0, [sp], #-0
 ccc:	3a0e0300 	bcc	3818d4 <_Min_Stack_Size+0x3814d4>
 cd0:	390b3b0b 	stmdbcc	fp, {r0, r1, r3, r8, r9, fp, ip, sp}
 cd4:	3f13490b 	svccc	0x0013490b
 cd8:	000a020c 	andeq	r0, sl, ip, lsl #4
 cdc:	012e0e00 			@ <UNDEFINED> instruction: 0x012e0e00
 ce0:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 ce4:	0b3b0b3a 	bleq	ec39d4 <_Min_Stack_Size+0xec35d4>
 ce8:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 cec:	0c3c1349 	ldceq	3, cr1, [ip], #-292	@ 0xfffffedc
 cf0:	00001301 	andeq	r1, r0, r1, lsl #6
 cf4:	4900050f 	stmdbmi	r0, {r0, r1, r2, r3, r8, sl}
 cf8:	10000013 	andne	r0, r0, r3, lsl r0
 cfc:	0c3f012e 	ldfeqs	f0, [pc], #-184	@ c4c <_Min_Stack_Size+0x84c>
 d00:	0b3a0e03 	bleq	e84514 <_Min_Stack_Size+0xe84114>
 d04:	0b390b3b 	bleq	e439f8 <_Min_Stack_Size+0xe435f8>
 d08:	0c3c1349 	ldceq	3, cr1, [ip], #-292	@ 0xfffffedc
 d0c:	00001301 	andeq	r1, r0, r1, lsl #6
 d10:	00001811 	andeq	r1, r0, r1, lsl r8
 d14:	012e1200 			@ <UNDEFINED> instruction: 0x012e1200
 d18:	0e030c3f 	mcreq	12, 0, r0, cr3, cr15, {1}
 d1c:	0b3b0b3a 	bleq	ec3a0c <_Min_Stack_Size+0xec360c>
 d20:	0c270b39 			@ <UNDEFINED> instruction: 0x0c270b39
 d24:	01111349 	tsteq	r1, r9, asr #6
 d28:	06400112 			@ <UNDEFINED> instruction: 0x06400112
 d2c:	010c4297 			@ <UNDEFINED> instruction: 0x010c4297
 d30:	13000013 	movwne	r0, #19
 d34:	00018289 	andeq	r8, r1, r9, lsl #5
 d38:	13310111 	teqne	r1, #1073741828	@ 0x40000004
 d3c:	89140000 	ldmdbhi	r4, {}	@ <UNPREDICTABLE>
 d40:	11010182 	smlabbne	r1, r2, r1, r0
 d44:	01133101 	tsteq	r3, r1, lsl #2
 d48:	15000013 	strne	r0, [r0, #-19]	@ 0xffffffed
 d4c:	0001828a 	andeq	r8, r1, sl, lsl #5
 d50:	42910a02 	addsmi	r0, r1, #8192	@ 0x2000
 d54:	1600000a 	strne	r0, [r0], -sl
 d58:	01018289 	smlabbeq	r1, r9, r2, r8
 d5c:	13310111 	teqne	r1, #1073741828	@ 0x40000004
 d60:	2e170000 	cdpcs	0, 1, cr0, cr7, cr0, {0}
 d64:	030c3f00 	movweq	r3, #52992	@ 0xcf00
 d68:	3b0b3a0e 	blcc	2cf5a8 <_Min_Stack_Size+0x2cf1a8>
 d6c:	270b390b 	strcs	r3, [fp, -fp, lsl #18]
 d70:	1201110c 	andne	r1, r1, #12, 2
 d74:	970a4001 	strls	r4, [sl, -r1]
 d78:	00000c42 	andeq	r0, r0, r2, asr #24
 d7c:	01110100 	tsteq	r1, r0, lsl #2
 d80:	06550610 			@ <UNDEFINED> instruction: 0x06550610
 d84:	0e1b0e03 	cdpeq	14, 1, cr0, cr11, cr3, {0}
 d88:	05130e25 	ldreq	r0, [r3, #-3621]	@ 0xfffff1db
 d8c:	2e020000 	cdpcs	0, 0, cr0, cr2, cr0, {0}
 d90:	110e0300 	mrsne	r0, ELR_hyp
 d94:	00011201 	andeq	r1, r1, r1, lsl #4
	...

