NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
Disassembly of section .debug_aranges:

00000000 <.debug_aranges>:
   0:	00000044 	andeq	r0, r0, r4, asr #32
   4:	00000002 	andeq	r0, r0, r2
   8:	00040000 	andeq	r0, r4, r0
   c:	00000000 	andeq	r0, r0, r0
  10:	08000170 	stmdaeq	r0, {r4, r5, r6, r8}
  14:	00000002 	andeq	r0, r0, r2
  18:	08000172 	stmdaeq	r0, {r1, r4, r5, r6, r8}
  1c:	00000002 	andeq	r0, r0, r2
  20:	08000174 	stmdaeq	r0, {r2, r4, r5, r6, r8}
  24:	00000002 	andeq	r0, r0, r2
  28:	00000000 	andeq	r0, r0, r0
  2c:	00000002 	andeq	r0, r0, r2
  30:	08000176 	stmdaeq	r0, {r1, r2, r4, r5, r6, r8}
  34:	00000012 	andeq	r0, r0, r2, lsl r0
  38:	00000000 	andeq	r0, r0, r0
  3c:	00000002 	andeq	r0, r0, r2
	...
  48:	0000003c 	andeq	r0, r0, ip, lsr r0
  4c:	00b80002 	adcseq	r0, r8, r2
  50:	00040000 	andeq	r0, r4, r0
  54:	00000000 	andeq	r0, r0, r0
  58:	08000188 	stmdaeq	r0, {r3, r7, r8}
  5c:	00000016 	andeq	r0, r0, r6, lsl r0
  60:	00000000 	andeq	r0, r0, r0
  64:	00000048 	andeq	r0, r0, r8, asr #32
  68:	00000000 	andeq	r0, r0, r0
  6c:	00000040 	andeq	r0, r0, r0, asr #32
  70:	00000000 	andeq	r0, r0, r0
  74:	00000026 	andeq	r0, r0, r6, lsr #32
  78:	00000000 	andeq	r0, r0, r0
  7c:	00000002 	andeq	r0, r0, r2
	...
  88:	00000054 	andeq	r0, r0, r4, asr r0
  8c:	04500002 	ldrbeq	r0, [r0], #-2
  90:	00040000 	andeq	r0, r4, r0
  94:	00000000 	andeq	r0, r0, r0
  98:	0800019e 	stmdaeq	r0, {r1, r2, r3, r4, r7, r8}
  9c:	00000004 	andeq	r0, r0, r4
  a0:	080001a2 	stmdaeq	r0, {r1, r5, r7, r8}
  a4:	00000002 	andeq	r0, r0, r2
  a8:	080001a4 	stmdaeq	r0, {r2, r5, r7, r8}
  ac:	00000002 	andeq	r0, r0, r2
  b0:	00000000 	andeq	r0, r0, r0
  b4:	00000022 	andeq	r0, r0, r2, lsr #32
  b8:	080001a8 	stmdaeq	r0, {r3, r5, r7, r8}
  bc:	00000024 	andeq	r0, r0, r4, lsr #32
  c0:	080001cc 	stmdaeq	r0, {r2, r3, r6, r7, r8}
  c4:	00000040 	andeq	r0, r0, r0, asr #32
  c8:	0800020c 	stmdaeq	r0, {r2, r3, r9}
  cc:	0000003c 	andeq	r0, r0, ip, lsr r0
  d0:	08000248 	stmdaeq	r0, {r3, r6, r9}
  d4:	00000060 	andeq	r0, r0, r0, rrx
	...
  e0:	0000007c 	andeq	r0, r0, ip, ror r0
  e4:	09d80002 	ldmibeq	r8, {r1}^
  e8:	00040000 	andeq	r0, r4, r0
	...
  f4:	00000096 	muleq	r0, r6, r0
  f8:	00000000 	andeq	r0, r0, r0
  fc:	00000096 	muleq	r0, r6, r0
 100:	00000000 	andeq	r0, r0, r0
 104:	00000074 	andeq	r0, r0, r4, ror r0
 108:	00000000 	andeq	r0, r0, r0
 10c:	00000120 	andeq	r0, r0, r0, lsr #2
 110:	00000000 	andeq	r0, r0, r0
 114:	00000008 	andeq	r0, r0, r8
 118:	00000000 	andeq	r0, r0, r0
 11c:	00000008 	andeq	r0, r0, r8
 120:	080002a8 	stmdaeq	r0, {r3, r5, r7, r9}
 124:	0000001c 	andeq	r0, r0, ip, lsl r0
 128:	080002c4 	stmdaeq	r0, {r2, r6, r7, r9}
 12c:	0000001c 	andeq	r0, r0, ip, lsl r0
 130:	080002e0 	stmdaeq	r0, {r5, r6, r7, r9}
 134:	0000001c 	andeq	r0, r0, ip, lsl r0
 138:	080002fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9}
 13c:	0000001c 	andeq	r0, r0, ip, lsl r0
 140:	08000318 	stmdaeq	r0, {r3, r4, r8, r9}
 144:	0000001c 	andeq	r0, r0, ip, lsl r0
 148:	08000334 	stmdaeq	r0, {r2, r4, r5, r8, r9}
 14c:	00000090 	muleq	r0, r0, r0
 150:	00000000 	andeq	r0, r0, r0
 154:	000000a8 	andeq	r0, r0, r8, lsr #1
	...
 160:	0000009c 	muleq	r0, ip, r0
 164:	0f5c0002 	svceq	0x005c0002
 168:	00040000 	andeq	r0, r4, r0
	...
 174:	00000158 	andeq	r0, r0, r8, asr r1
 178:	00000000 	andeq	r0, r0, r0
 17c:	0000006c 	andeq	r0, r0, ip, rrx
 180:	00000000 	andeq	r0, r0, r0
 184:	00000070 	andeq	r0, r0, r0, ror r0
 188:	00000000 	andeq	r0, r0, r0
 18c:	00000004 	andeq	r0, r0, r4
 190:	00000000 	andeq	r0, r0, r0
 194:	00000006 	andeq	r0, r0, r6
 198:	00000000 	andeq	r0, r0, r0
 19c:	00000050 	andeq	r0, r0, r0, asr r0
 1a0:	00000000 	andeq	r0, r0, r0
 1a4:	0000002e 	andeq	r0, r0, lr, lsr #32
 1a8:	00000000 	andeq	r0, r0, r0
 1ac:	00000088 	andeq	r0, r0, r8, lsl #1
 1b0:	00000000 	andeq	r0, r0, r0
 1b4:	000000bc 	strheq	r0, [r0], -ip
 1b8:	00000000 	andeq	r0, r0, r0
 1bc:	0000000e 	andeq	r0, r0, lr
 1c0:	00000000 	andeq	r0, r0, r0
 1c4:	00000016 	andeq	r0, r0, r6, lsl r0
 1c8:	00000000 	andeq	r0, r0, r0
 1cc:	00000016 	andeq	r0, r0, r6, lsl r0
 1d0:	080003c4 	stmdaeq	r0, {r2, r6, r7, r8, r9}
 1d4:	00000002 	andeq	r0, r0, r2
 1d8:	080003c8 	stmdaeq	r0, {r3, r6, r7, r8, r9}
 1dc:	00000084 	andeq	r0, r0, r4, lsl #1
 1e0:	0800044c 	stmdaeq	r0, {r2, r3, r6, sl}
 1e4:	000000a8 	andeq	r0, r0, r8, lsr #1
 1e8:	080004f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, sl}
 1ec:	00000002 	andeq	r0, r0, r2
 1f0:	080004f6 	stmdaeq	r0, {r1, r2, r4, r5, r6, r7, sl}
 1f4:	00000002 	andeq	r0, r0, r2
	...
 200:	00000054 	andeq	r0, r0, r4, asr r0
 204:	1e510002 	cdpne	0, 5, cr0, cr1, cr2, {0}
 208:	00040000 	andeq	r0, r4, r0
	...
 214:	000000ec 	andeq	r0, r0, ip, ror #1
 218:	00000000 	andeq	r0, r0, r0
 21c:	0000005c 	andeq	r0, r0, ip, asr r0
 220:	00000000 	andeq	r0, r0, r0
 224:	0000001a 	andeq	r0, r0, sl, lsl r0
 228:	00000000 	andeq	r0, r0, r0
 22c:	00000034 	andeq	r0, r0, r4, lsr r0
 230:	00000000 	andeq	r0, r0, r0
 234:	00000034 	andeq	r0, r0, r4, lsr r0
 238:	080004f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, sl}
 23c:	00000030 	andeq	r0, r0, r0, lsr r0
 240:	08000528 	stmdaeq	r0, {r3, r5, r8, sl}
 244:	00000030 	andeq	r0, r0, r0, lsr r0
 248:	00000000 	andeq	r0, r0, r0
 24c:	00000214 	andeq	r0, r0, r4, lsl r2
	...
 258:	0000005c 	andeq	r0, r0, ip, asr r0
 25c:	27190002 	ldrcs	r0, [r9, -r2]
 260:	00040000 	andeq	r0, r4, r0
	...
 26c:	0000011c 	andeq	r0, r0, ip, lsl r1
 270:	00000000 	andeq	r0, r0, r0
 274:	00000078 	andeq	r0, r0, r8, ror r0
 278:	00000000 	andeq	r0, r0, r0
 27c:	00000010 	andeq	r0, r0, r0, lsl r0
 280:	00000000 	andeq	r0, r0, r0
 284:	0000000a 	andeq	r0, r0, sl
 288:	00000000 	andeq	r0, r0, r0
 28c:	00000028 	andeq	r0, r0, r8, lsr #32
 290:	00000000 	andeq	r0, r0, r0
 294:	000000cc 	andeq	r0, r0, ip, asr #1
 298:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
 29c:	00000010 	andeq	r0, r0, r0, lsl r0
 2a0:	08000568 	stmdaeq	r0, {r3, r5, r6, r8, sl}
 2a4:	00000010 	andeq	r0, r0, r0, lsl r0
 2a8:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
 2ac:	00000010 	andeq	r0, r0, r0, lsl r0
	...
 2b8:	00000034 	andeq	r0, r0, r4, lsr r0
 2bc:	2d960002 	ldccs	0, cr0, [r6, #8]
 2c0:	00040000 	andeq	r0, r4, r0
 2c4:	00000000 	andeq	r0, r0, r0
 2c8:	08000588 	stmdaeq	r0, {r3, r7, r8, sl}
 2cc:	00000002 	andeq	r0, r0, r2
 2d0:	0800058a 	stmdaeq	r0, {r1, r3, r7, r8, sl}
 2d4:	00000002 	andeq	r0, r0, r2
 2d8:	0800058c 	stmdaeq	r0, {r2, r3, r7, r8, sl}
 2dc:	00000002 	andeq	r0, r0, r2
 2e0:	08000590 	stmdaeq	r0, {r4, r7, r8, sl}
 2e4:	00000094 	muleq	r0, r4, r0
	...
 2f0:	00000024 	andeq	r0, r0, r4, lsr #32
 2f4:	30b80002 	adcscc	r0, r8, r2
 2f8:	00040000 	andeq	r0, r4, r0
 2fc:	00000000 	andeq	r0, r0, r0
 300:	08000624 	stmdaeq	r0, {r2, r5, r9, sl}
 304:	00000050 	andeq	r0, r0, r0, asr r0
 308:	08000674 	stmdaeq	r0, {r2, r4, r5, r6, r9, sl}
 30c:	00000002 	andeq	r0, r0, r2
	...

Disassembly of section .debug_ranges:

00000000 <.debug_ranges>:
   0:	08000170 	stmdaeq	r0, {r4, r5, r6, r8}
   4:	08000172 	stmdaeq	r0, {r1, r4, r5, r6, r8}
   8:	08000172 	stmdaeq	r0, {r1, r4, r5, r6, r8}
   c:	08000174 	stmdaeq	r0, {r2, r4, r5, r6, r8}
  10:	08000174 	stmdaeq	r0, {r2, r4, r5, r6, r8}
  14:	08000176 	stmdaeq	r0, {r1, r2, r4, r5, r6, r8}
  18:	00000001 	andeq	r0, r0, r1
  1c:	00000001 	andeq	r0, r0, r1
  20:	08000176 	stmdaeq	r0, {r1, r2, r4, r5, r6, r8}
  24:	08000188 	stmdaeq	r0, {r3, r7, r8}
  28:	00000001 	andeq	r0, r0, r1
  2c:	00000001 	andeq	r0, r0, r1
	...
  38:	08000188 	stmdaeq	r0, {r3, r7, r8}
  3c:	0800019e 	stmdaeq	r0, {r1, r2, r3, r4, r7, r8}
  40:	00000001 	andeq	r0, r0, r1
  44:	00000001 	andeq	r0, r0, r1
  48:	00000001 	andeq	r0, r0, r1
  4c:	00000001 	andeq	r0, r0, r1
  50:	00000001 	andeq	r0, r0, r1
  54:	00000001 	andeq	r0, r0, r1
  58:	00000001 	andeq	r0, r0, r1
  5c:	00000001 	andeq	r0, r0, r1
	...
  68:	080001f6 	stmdaeq	r0, {r1, r2, r4, r5, r6, r7, r8}
  6c:	080001f6 	stmdaeq	r0, {r1, r2, r4, r5, r6, r7, r8}
  70:	080001f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, r8}
  74:	08000208 	stmdaeq	r0, {r3, r9}
	...
  80:	0800019e 	stmdaeq	r0, {r1, r2, r3, r4, r7, r8}
  84:	080001a2 	stmdaeq	r0, {r1, r5, r7, r8}
  88:	080001a2 	stmdaeq	r0, {r1, r5, r7, r8}
  8c:	080001a4 	stmdaeq	r0, {r2, r5, r7, r8}
  90:	080001a4 	stmdaeq	r0, {r2, r5, r7, r8}
  94:	080001a6 	stmdaeq	r0, {r1, r2, r5, r7, r8}
  98:	00000001 	andeq	r0, r0, r1
  9c:	00000001 	andeq	r0, r0, r1
  a0:	080001a8 	stmdaeq	r0, {r3, r5, r7, r8}
  a4:	080001cc 	stmdaeq	r0, {r2, r3, r6, r7, r8}
  a8:	080001cc 	stmdaeq	r0, {r2, r3, r6, r7, r8}
  ac:	0800020c 	stmdaeq	r0, {r2, r3, r9}
  b0:	0800020c 	stmdaeq	r0, {r2, r3, r9}
  b4:	08000248 	stmdaeq	r0, {r3, r6, r9}
  b8:	08000248 	stmdaeq	r0, {r3, r6, r9}
  bc:	080002a8 	stmdaeq	r0, {r3, r5, r7, r9}
	...
  c8:	00000001 	andeq	r0, r0, r1
  cc:	00000001 	andeq	r0, r0, r1
  d0:	00000001 	andeq	r0, r0, r1
  d4:	00000001 	andeq	r0, r0, r1
  d8:	00000001 	andeq	r0, r0, r1
  dc:	00000001 	andeq	r0, r0, r1
  e0:	00000001 	andeq	r0, r0, r1
  e4:	00000001 	andeq	r0, r0, r1
  e8:	00000001 	andeq	r0, r0, r1
  ec:	00000001 	andeq	r0, r0, r1
  f0:	00000001 	andeq	r0, r0, r1
  f4:	00000001 	andeq	r0, r0, r1
  f8:	080002a8 	stmdaeq	r0, {r3, r5, r7, r9}
  fc:	080002c4 	stmdaeq	r0, {r2, r6, r7, r9}
 100:	080002c4 	stmdaeq	r0, {r2, r6, r7, r9}
 104:	080002e0 	stmdaeq	r0, {r5, r6, r7, r9}
 108:	080002e0 	stmdaeq	r0, {r5, r6, r7, r9}
 10c:	080002fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9}
 110:	080002fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9}
 114:	08000318 	stmdaeq	r0, {r3, r4, r8, r9}
 118:	08000318 	stmdaeq	r0, {r3, r4, r8, r9}
 11c:	08000334 	stmdaeq	r0, {r2, r4, r5, r8, r9}
 120:	08000334 	stmdaeq	r0, {r2, r4, r5, r8, r9}
 124:	080003c4 	stmdaeq	r0, {r2, r6, r7, r8, r9}
 128:	00000001 	andeq	r0, r0, r1
 12c:	00000001 	andeq	r0, r0, r1
	...
 138:	00000001 	andeq	r0, r0, r1
 13c:	00000001 	andeq	r0, r0, r1
 140:	00000001 	andeq	r0, r0, r1
 144:	00000001 	andeq	r0, r0, r1
 148:	00000001 	andeq	r0, r0, r1
 14c:	00000001 	andeq	r0, r0, r1
 150:	00000001 	andeq	r0, r0, r1
 154:	00000001 	andeq	r0, r0, r1
 158:	00000001 	andeq	r0, r0, r1
 15c:	00000001 	andeq	r0, r0, r1
 160:	00000001 	andeq	r0, r0, r1
 164:	00000001 	andeq	r0, r0, r1
 168:	00000001 	andeq	r0, r0, r1
 16c:	00000001 	andeq	r0, r0, r1
 170:	00000001 	andeq	r0, r0, r1
 174:	00000001 	andeq	r0, r0, r1
 178:	00000001 	andeq	r0, r0, r1
 17c:	00000001 	andeq	r0, r0, r1
 180:	00000001 	andeq	r0, r0, r1
 184:	00000001 	andeq	r0, r0, r1
 188:	00000001 	andeq	r0, r0, r1
 18c:	00000001 	andeq	r0, r0, r1
 190:	00000001 	andeq	r0, r0, r1
 194:	00000001 	andeq	r0, r0, r1
 198:	080003c4 	stmdaeq	r0, {r2, r6, r7, r8, r9}
 19c:	080003c6 	stmdaeq	r0, {r1, r2, r6, r7, r8, r9}
 1a0:	080003c8 	stmdaeq	r0, {r3, r6, r7, r8, r9}
 1a4:	0800044c 	stmdaeq	r0, {r2, r3, r6, sl}
 1a8:	0800044c 	stmdaeq	r0, {r2, r3, r6, sl}
 1ac:	080004f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, sl}
 1b0:	080004f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, sl}
 1b4:	080004f6 	stmdaeq	r0, {r1, r2, r4, r5, r6, r7, sl}
 1b8:	080004f6 	stmdaeq	r0, {r1, r2, r4, r5, r6, r7, sl}
 1bc:	080004f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, sl}
	...
 1c8:	00000001 	andeq	r0, r0, r1
 1cc:	00000001 	andeq	r0, r0, r1
 1d0:	00000001 	andeq	r0, r0, r1
 1d4:	00000001 	andeq	r0, r0, r1
 1d8:	00000001 	andeq	r0, r0, r1
 1dc:	00000001 	andeq	r0, r0, r1
 1e0:	00000001 	andeq	r0, r0, r1
 1e4:	00000001 	andeq	r0, r0, r1
 1e8:	00000001 	andeq	r0, r0, r1
 1ec:	00000001 	andeq	r0, r0, r1
 1f0:	080004f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, sl}
 1f4:	08000528 	stmdaeq	r0, {r3, r5, r8, sl}
 1f8:	08000528 	stmdaeq	r0, {r3, r5, r8, sl}
 1fc:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
 200:	00000001 	andeq	r0, r0, r1
 204:	00000001 	andeq	r0, r0, r1
	...
 210:	00000001 	andeq	r0, r0, r1
 214:	00000001 	andeq	r0, r0, r1
 218:	00000001 	andeq	r0, r0, r1
 21c:	00000001 	andeq	r0, r0, r1
 220:	00000001 	andeq	r0, r0, r1
 224:	00000001 	andeq	r0, r0, r1
 228:	00000001 	andeq	r0, r0, r1
 22c:	00000001 	andeq	r0, r0, r1
 230:	00000001 	andeq	r0, r0, r1
 234:	00000001 	andeq	r0, r0, r1
 238:	00000001 	andeq	r0, r0, r1
 23c:	00000001 	andeq	r0, r0, r1
 240:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
 244:	08000568 	stmdaeq	r0, {r3, r5, r6, r8, sl}
 248:	08000568 	stmdaeq	r0, {r3, r5, r6, r8, sl}
 24c:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
 250:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
 254:	08000588 	stmdaeq	r0, {r3, r7, r8, sl}
	...
 260:	08000588 	stmdaeq	r0, {r3, r7, r8, sl}
 264:	0800058a 	stmdaeq	r0, {r1, r3, r7, r8, sl}
 268:	0800058a 	stmdaeq	r0, {r1, r3, r7, r8, sl}
 26c:	0800058c 	stmdaeq	r0, {r2, r3, r7, r8, sl}
 270:	0800058c 	stmdaeq	r0, {r2, r3, r7, r8, sl}
 274:	0800058e 	stmdaeq	r0, {r1, r2, r3, r7, r8, sl}
 278:	08000590 	stmdaeq	r0, {r4, r7, r8, sl}
 27c:	08000624 	stmdaeq	r0, {r2, r5, r9, sl}
	...
 288:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
 28c:	00000000 	andeq	r0, r0, r0
 290:	08000624 	stmdaeq	r0, {r2, r5, r9, sl}
 294:	08000674 	stmdaeq	r0, {r2, r4, r5, r6, r9, sl}
 298:	08000674 	stmdaeq	r0, {r2, r4, r5, r6, r9, sl}
 29c:	08000676 	stmdaeq	r0, {r1, r2, r4, r5, r6, r9, sl}
	...

Disassembly of section .debug_macro:

