NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
00000000 <.debug_macro>:
       0:	00020004 	andeq	r0, r2, r4
       4:	07000000 	streq	r0, [r0, -r0]
       8:	00000000 	andeq	r0, r0, r0
       c:	03010003 	movweq	r0, #4099	@ 0x1003
      10:	1a070208 	bne	1c0838 <_Min_Stack_Size+0x1c0438>
      14:	04000000 	streq	r0, [r0], #-0
      18:	00040004 	andeq	r0, r4, r4
      1c:	2e090500 	cfsh32cs	mvfx0, mvfx9, #0
      20:	05000009 	streq	r0, [r0, #-9]
      24:	001bf20b 	andseq	pc, fp, fp, lsl #4
      28:	580c0500 	stmdapl	ip, {r8, sl}
      2c:	05000025 	streq	r0, [r0, #-37]	@ 0xffffffdb
      30:	0027430e 	eoreq	r4, r7, lr, lsl #6
      34:	000f0500 	andeq	r0, pc, r0, lsl #10
      38:	05000000 	streq	r0, [r0, #-0]
      3c:	00036811 	andeq	r6, r3, r1, lsl r8
      40:	d3120500 	tstle	r2, #0, 10
      44:	05000022 	streq	r0, [r0, #-34]	@ 0xffffffde
      48:	0029e516 	eoreq	lr, r9, r6, lsl r5
      4c:	00040000 	andeq	r0, r4, r0
      50:	00012f02 	andeq	r2, r1, r2, lsl #30
      54:	00000700 	andeq	r0, r0, r0, lsl #14
      58:	00030000 	andeq	r0, r3, r0
      5c:	03090301 	movweq	r0, #37633	@ 0x9301
      60:	9a630905 	bls	18c247c <_Min_Stack_Size+0x18c207c>
      64:	0b030000 	bleq	c006c <_Min_Stack_Size+0xbfc6c>
      68:	3b1b0504 	blcc	6c1480 <_Min_Stack_Size+0x6c1080>
      6c:	030000a5 	movweq	r0, #165	@ 0xa5
      70:	0805051d 	stmdaeq	r5, {r0, r2, r3, r4, r8, sl}
      74:	00005398 	muleq	r0, r8, r3
      78:	05060a03 	streq	r0, [r6, #-2563]	@ 0xfffff5fd
      7c:	00c36c07 	sbceq	r6, r3, r7, lsl #24
      80:	070a0300 	streq	r0, [sl, -r0, lsl #6]
      84:	00000007 	andeq	r0, r0, r7
      88:	00070400 	andeq	r0, r7, r0, lsl #8
      8c:	04000000 	streq	r0, [r0], #-0
      90:	05080b03 	streq	r0, [r8, #-2819]	@ 0xfffff4fd
      94:	00a6c502 	adceq	ip, r6, r2, lsl #10
      98:	09040300 	stmdbeq	r4, {r8, r9}
      9c:	00000007 	andeq	r0, r0, r7
      a0:	05030400 	streq	r0, [r3, #-1024]	@ 0xfffffc00
      a4:	0000070a 	andeq	r0, r0, sl, lsl #14
      a8:	07040000 	streq	r0, [r4, -r0]
      ac:	00000000 	andeq	r0, r0, r0
      b0:	00000704 	andeq	r0, r0, r4, lsl #14
      b4:	07040000 	streq	r0, [r4, -r0]
      b8:	00000000 	andeq	r0, r0, r0
      bc:	050b2303 	streq	r2, [fp, #-771]	@ 0xfffffcfd
      c0:	00c5522b 	sbceq	r5, r5, fp, lsr #4
      c4:	0c2d0300 	stceq	3, cr0, [sp], #-0
      c8:	00000007 	andeq	r0, r0, r7
      cc:	2f030400 	svccs	0x00030400
      d0:	0000070d 	andeq	r0, r0, sp, lsl #14
      d4:	07040000 	streq	r0, [r4, -r0]
      d8:	00000000 	andeq	r0, r0, r0
      dc:	0d240304 	stceq	3, cr0, [r4, #-16]!
      e0:	00000007 	andeq	r0, r0, r7
      e4:	27050400 	strcs	r0, [r5, -r0, lsl #8]
      e8:	00007705 	andeq	r7, r0, r5, lsl #14
      ec:	070e2803 	streq	r2, [lr, -r3, lsl #16]
      f0:	00000000 	andeq	r0, r0, r0
      f4:	7a2f0504 	bvc	bc150c <_Min_Stack_Size+0xbc110c>
      f8:	03000043 	movweq	r0, #67	@ 0x43
      fc:	0b050f3c 	bleq	143df4 <_Min_Stack_Size+0x1439f4>
     100:	0000e3fa 	strdeq	lr, [r0], -sl
     104:	04050d03 	streq	r0, [r5], #-3331	@ 0xfffff2fd
     108:	040d0e03 	streq	r0, [sp], #-3587	@ 0xfffff1fd
     10c:	07100f03 	ldreq	r0, [r0, -r3, lsl #30]
     110:	00000000 	andeq	r0, r0, r0
     114:	070d1803 	streq	r1, [sp, -r3, lsl #16]
     118:	00000000 	andeq	r0, r0, r0
     11c:	111b0304 	tstne	fp, r4, lsl #6
     120:	038c0605 	orreq	r0, ip, #5242880	@ 0x500000
     124:	07040001 	streq	r0, [r4, -r1]
     128:	00000000 	andeq	r0, r0, r0
     12c:	00000704 	andeq	r0, r0, r4, lsl #14
     130:	22030000 	andcs	r0, r3, #0
     134:	00000712 	andeq	r0, r0, r2, lsl r7
     138:	07040000 	streq	r0, [r4, -r0]
     13c:	00000000 	andeq	r0, r0, r0
     140:	1303ca03 	movwne	ip, #14851	@ 0x3a03
     144:	00000007 	andeq	r0, r0, r7
     148:	00070400 	andeq	r0, r7, r0, lsl #8
     14c:	04000000 	streq	r0, [r0], #-0
     150:	00000007 	andeq	r0, r0, r7
     154:	14550300 	ldrbne	r0, [r5], #-768	@ 0xfffffd00
     158:	00000007 	andeq	r0, r0, r7
     15c:	00070400 	andeq	r0, r7, r0, lsl #8
     160:	04000000 	streq	r0, [r0], #-0
     164:	03150c03 	tsteq	r5, #768	@ 0x300
     168:	0a051609 	beq	145994 <_Min_Stack_Size+0x145594>
     16c:	0000897c 	andeq	r8, r0, ip, ror r9
     170:	07170d03 	ldreq	r0, [r7, -r3, lsl #26]
     174:	00000000 	andeq	r0, r0, r0
     178:	180e0304 	stmdane	lr, {r2, r8, r9}
     17c:	00000007 	andeq	r0, r0, r7
     180:	00070400 	andeq	r0, r7, r0, lsl #8
     184:	04000000 	streq	r0, [r0], #-0
     188:	89730d05 	ldmdbhi	r3!, {r0, r2, r8, sl, fp}^
     18c:	03040000 	movweq	r0, #16384	@ 0x4000
     190:	0905020d 	stmdbeq	r5, {r0, r2, r3, r9}
     194:	0000a3dc 	ldrdeq	sl, [r0], -ip
     198:	07190a03 	ldreq	r0, [r9, -r3, lsl #20]
     19c:	0000028e 	andeq	r0, r0, lr, lsl #5
     1a0:	070d1103 	streq	r1, [sp, -r3, lsl #2]
     1a4:	00000000 	andeq	r0, r0, r0
     1a8:	1a140304 	bne	500dc0 <_Min_Stack_Size+0x5009c0>
     1ac:	80d90405 	sbcshi	r0, r9, r5, lsl #8
     1b0:	03040000 	movweq	r0, #16384	@ 0x4000
     1b4:	1e051b18 	vmovne.32	d5[0], r1
     1b8:	0000f25d 	andeq	pc, r0, sp, asr r2	@ <UNPREDICTABLE>
     1bc:	02a40704 	adceq	r0, r4, #4, 14	@ 0x100000
     1c0:	bd030000 	stclt	0, cr0, [r3, #-0]
     1c4:	04041c01 	streq	r1, [r4], #-3073	@ 0xfffff3ff
     1c8:	051d0b03 	ldreq	r0, [sp, #-2819]	@ 0xfffff4fd
     1cc:	00c1b209 	sbceq	fp, r1, r9, lsl #4
     1d0:	1e0a0300 	cdpne	3, 0, cr0, cr10, cr0, {0}
     1d4:	00000007 	andeq	r0, r0, r7
     1d8:	0c030400 	cfstrseq	mvf0, [r3], {-0}
     1dc:	b709051f 	smladlt	r9, pc, r5, r0	@ <UNPREDICTABLE>
     1e0:	030000e2 	movweq	r0, #226	@ 0xe2
     1e4:	0805200d 	stmdaeq	r5, {r0, r2, r3, sp}
     1e8:	0000412d 	andeq	r4, r0, sp, lsr #2
     1ec:	04090a03 	streq	r0, [r9], #-2563	@ 0xfffff5fd
     1f0:	00000007 	andeq	r0, r0, r7
     1f4:	0d100300 	ldceq	3, cr0, [r0, #-0]
     1f8:	00000007 	andeq	r0, r0, r7
     1fc:	14030400 	strne	r0, [r3], #-1024	@ 0xfffffc00
     200:	c2020521 	andgt	r0, r2, #138412032	@ 0x8400000
     204:	0400004e 	streq	r0, [r0], #-78	@ 0xffffffb2
     208:	07221603 	streq	r1, [r2, -r3, lsl #12]!
     20c:	00000000 	andeq	r0, r0, r0
     210:	00000704 	andeq	r0, r0, r4, lsl #14
     214:	07040000 	streq	r0, [r4, -r0]
     218:	00000000 	andeq	r0, r0, r0
     21c:	00000704 	andeq	r0, r0, r4, lsl #14
     220:	03040000 	movweq	r0, #16384	@ 0x4000
     224:	c407230c 	strgt	r2, [r7], #-780	@ 0xfffffcf4
     228:	03000002 	movweq	r0, #2
     22c:	20052463 	andcs	r2, r5, r3, ror #8
     230:	000066e6 	andeq	r6, r0, r6, ror #13
     234:	07253f03 	streq	r3, [r5, -r3, lsl #30]!
     238:	000002ec 	andeq	r0, r0, ip, ror #5
     23c:	03080704 	movweq	r0, #34564	@ 0x8704
     240:	78030000 	stmdavc	r3, {}	@ <UNPREDICTABLE>
     244:	631a0526 	tstvs	sl, #159383552	@ 0x9800000
     248:	0300004b 	movweq	r0, #75	@ 0x4b
     24c:	2a07273b 	bcs	1c9f40 <_Min_Stack_Size+0x1c9b40>
     250:	04000003 	streq	r0, [r0], #-3
     254:	04150704 	ldreq	r0, [r5], #-1796	@ 0xfffff8fc
     258:	9a030000 	bls	c0260 <_Min_Stack_Size+0xbfe60>
     25c:	8907280e 	stmdbhi	r7, {r1, r2, r3, fp, sp}
     260:	04000012 	streq	r0, [r0], #-18	@ 0xffffffee
     264:	400eed05 	andmi	lr, lr, r5, lsl #26
     268:	04000066 	streq	r0, [r0], #-102	@ 0xffffff9a
     26c:	05296403 	streq	r6, [r9, #-1027]!	@ 0xfffffbfd
     270:	00a1901b 	adceq	r9, r1, fp, lsl r0
     274:	03040400 	movweq	r0, #17408	@ 0x4400
     278:	0304240d 	movweq	r2, #17421	@ 0x440d
     27c:	1a072a0e 	bne	1caabc <_Min_Stack_Size+0x1ca6bc>
     280:	04000000 	streq	r0, [r0], #-0
     284:	040f0504 	streq	r0, [pc], #-1284	@ 28c <_Min_Heap_Size+0x8c>
     288:	04000073 	streq	r0, [r0], #-115	@ 0xffffff8d
     28c:	00040004 	andeq	r0, r4, r4
     290:	c2080500 	andgt	r0, r8, #0, 10
     294:	050000a9 	streq	r0, [r0, #-169]	@ 0xffffff57
     298:	0085030f 	addeq	r0, r5, pc, lsl #6
     29c:	c9100500 	ldmdbgt	r0, {r8, sl}
     2a0:	000000c8 	andeq	r0, r0, r8, asr #1
     2a4:	05000004 	streq	r0, [r0, #-4]
     2a8:	5e6701b1 	mcrpl	1, 3, r0, cr7, cr1, {5}
     2ac:	b4050000 	strlt	r0, [r5], #-0
     2b0:	00567301 	subseq	r7, r6, r1, lsl #6
     2b4:	01b70500 			@ <UNDEFINED> instruction: 0x01b70500
     2b8:	000044c3 	andeq	r4, r0, r3, asr #9
     2bc:	f901ba05 			@ <UNDEFINED> instruction: 0xf901ba05
     2c0:	0000003a 	andeq	r0, r0, sl, lsr r0
     2c4:	05000004 	streq	r0, [r0, #-4]
     2c8:	00a1971b 	adceq	r9, r1, fp, lsl r7
     2cc:	f85d0500 			@ <UNDEFINED> instruction: 0xf85d0500
     2d0:	050000cc 	streq	r0, [r0, #-204]	@ 0xffffff34
     2d4:	0089625e 	addeq	r6, r9, lr, asr r2
     2d8:	7a5f0500 	bvc	17c16e0 <_Min_Stack_Size+0x17c12e0>
     2dc:	050000f3 	streq	r0, [r0, #-243]	@ 0xffffff0d
     2e0:	00917960 	addseq	r7, r1, r0, ror #18
     2e4:	60610500 	rsbvs	r0, r1, r0, lsl #10
     2e8:	00000039 	andeq	r0, r0, r9, lsr r0
     2ec:	05000004 	streq	r0, [r0, #-4]
     2f0:	0044fa20 	subeq	pc, r4, r0, lsr #20
     2f4:	3f230500 	svccc	0x00230500
     2f8:	05000058 	streq	r0, [r0, #-88]	@ 0xffffffa8
     2fc:	00c34f24 	sbceq	r4, r3, r4, lsr #30
     300:	08250500 	stmdaeq	r5!, {r8, sl}
     304:	000000ff 	strdeq	r0, [r0], -pc	@ <UNPREDICTABLE>
     308:	05000004 	streq	r0, [r0, #-4]
     30c:	00a3e742 	adceq	lr, r3, r2, asr #14
     310:	ff430500 			@ <UNDEFINED> instruction: 0xff430500
     314:	05000052 	streq	r0, [r0, #-82]	@ 0xffffffae
     318:	0097c944 	addseq	ip, r7, r4, asr #18
     31c:	8c470500 	cfstr64hi	mvdx0, [r7], {-0}
     320:	050000ec 	streq	r0, [r0, #-236]	@ 0xffffff14
     324:	00cc284c 	sbceq	r2, ip, ip, asr #16
     328:	00040000 	andeq	r0, r4, r0
     32c:	091a0500 	ldmdbeq	sl, {r8, sl}
     330:	050000e4 	streq	r0, [r0, #-228]	@ 0xffffff1c
     334:	00f9aa29 	rscseq	sl, r9, r9, lsr #20
     338:	ac2c0500 	cfstr32ge	mvfx0, [ip], #-0
     33c:	05000036 	streq	r0, [r0, #-54]	@ 0xffffffca
     340:	00ffe82f 	rscseq	lr, pc, pc, lsr #16
     344:	1b320500 	blne	c8174c <_Min_Stack_Size+0xc8134c>
     348:	050000f2 	streq	r0, [r0, #-242]	@ 0xffffff0e
     34c:	00fede35 	rscseq	sp, lr, r5, lsr lr
     350:	9a380500 	bls	e01758 <_Min_Stack_Size+0xe01358>
     354:	050000c4 	streq	r0, [r0, #-196]	@ 0xffffff3c
     358:	00cd0a3b 	sbceq	r0, sp, fp, lsr sl
     35c:	883e0500 	ldmdahi	lr!, {r8, sl}
     360:	0500004a 	streq	r0, [r0, #-74]	@ 0xffffffb6
     364:	0039d341 	eorseq	sp, r9, r1, asr #6
     368:	fa440500 	blx	1101770 <_Min_Stack_Size+0x1101370>
     36c:	05000032 	streq	r0, [r0, #-50]	@ 0xffffffce
     370:	008a394c 	addeq	r3, sl, ip, asr #18
     374:	0c540500 	cfldr64eq	mvdx0, [r4], {-0}
     378:	050000db 	streq	r0, [r0, #-219]	@ 0xffffff25
     37c:	00e4e45c 	rsceq	lr, r4, ip, asr r4
     380:	85640500 	strbhi	r0, [r4, #-1280]!	@ 0xfffffb00
     384:	05000099 	streq	r0, [r0, #-153]	@ 0xffffff67
     388:	00cb386c 	sbceq	r3, fp, ip, ror #16
     38c:	746f0500 	strbtvc	r0, [pc], #-1280	@ 394 <_Min_Heap_Size+0x194>
     390:	0500003f 	streq	r0, [r0, #-63]	@ 0xffffffc1
     394:	0080e972 	addeq	lr, r0, r2, ror r9
     398:	00750500 	rsbseq	r0, r5, r0, lsl #10
     39c:	05000042 	streq	r0, [r0, #-66]	@ 0xffffffbe
     3a0:	005d4e78 	subseq	r4, sp, r8, ror lr
     3a4:	067b0500 	ldrbteq	r0, [fp], -r0, lsl #10
     3a8:	05000100 	streq	r0, [r0, #-256]	@ 0xffffff00
     3ac:	368e01ac 	strcc	r0, [lr], ip, lsr #3
     3b0:	b0050000 	andlt	r0, r5, r0
     3b4:	00a2e501 	adceq	lr, r2, r1, lsl #10
     3b8:	01b40500 			@ <UNDEFINED> instruction: 0x01b40500
     3bc:	0000eeda 	ldrdeq	lr, [r0], -sl
     3c0:	a301b805 	movwge	fp, #6149	@ 0x1805
     3c4:	05000096 	streq	r0, [r0, #-150]	@ 0xffffff6a
     3c8:	ce3901bc 	mrcgt	1, 1, r0, cr9, cr12, {5}
     3cc:	e1050000 	mrs	r0, (UNDEF: 5)
     3d0:	009fc101 	addseq	ip, pc, r1, lsl #2
     3d4:	01e20500 	mvneq	r0, r0, lsl #10
     3d8:	00008987 	andeq	r8, r0, r7, lsl #19
     3dc:	8c01e305 	stchi	3, cr14, [r1], {5}
     3e0:	05000030 	streq	r0, [r0, #-48]	@ 0xffffffd0
     3e4:	83c201ea 	bichi	r0, r2, #-2147483590	@ 0x8000003a
     3e8:	f0050000 			@ <UNDEFINED> instruction: 0xf0050000
     3ec:	006f3c01 	rsbeq	r3, pc, r1, lsl #24
     3f0:	01f80500 	mvnseq	r0, r0, lsl #10
     3f4:	00008611 	andeq	r8, r0, r1, lsl r6
     3f8:	9201ff05 	andls	pc, r1, #5, 30
     3fc:	0500005f 	streq	r0, [r0, #-95]	@ 0xffffffa1
     400:	922102f2 	eorls	r0, r1, #536870927	@ 0x2000000f
     404:	b7050000 	strlt	r0, [r5, -r0]
     408:	00fa8204 	rscseq	r8, sl, r4, lsl #4
     40c:	04c70500 	strbeq	r0, [r7], #1280	@ 0x500
     410:	000037fb 	strdeq	r3, [r0], -fp
     414:	00000400 	andeq	r0, r0, r0, lsl #8
     418:	eb018405 	bl	61434 <_Min_Stack_Size+0x61034>
     41c:	05000090 	streq	r0, [r0, #-144]	@ 0xffffff70
     420:	379001b1 			@ <UNDEFINED> instruction: 0x379001b1
     424:	b3050000 	movwlt	r0, #20480	@ 0x5000
     428:	00beeb01 	adcseq	lr, lr, r1, lsl #22
     42c:	01b40500 			@ <UNDEFINED> instruction: 0x01b40500
     430:	0000403b 	andeq	r4, r0, fp, lsr r0
     434:	a301b705 	movwge	fp, #5893	@ 0x1705
     438:	05000064 	streq	r0, [r0, #-100]	@ 0xffffff9c
     43c:	66d801b8 			@ <UNDEFINED> instruction: 0x66d801b8
     440:	b9050000 	stmdblt	r5, {}	@ <UNPREDICTABLE>
     444:	007b6601 	rsbseq	r6, fp, r1, lsl #12
     448:	01e70500 	mvneq	r0, r0, lsl #10
     44c:	0000afb5 			@ <UNDEFINED> instruction: 0x0000afb5
     450:	9b01e805 	blls	7a46c <_Min_Stack_Size+0x7a06c>
     454:	050000ee 	streq	r0, [r0, #-238]	@ 0xffffff12
     458:	b30801ea 	movwlt	r0, #33258	@ 0x81ea
     45c:	eb050000 	bl	140464 <_Min_Stack_Size+0x140064>
     460:	00354901 	eorseq	r4, r5, r1, lsl #18
     464:	01ed0500 	mvneq	r0, r0, lsl #10
     468:	0000b107 	andeq	fp, r0, r7, lsl #2
     46c:	d301ee05 	movwle	lr, #7685	@ 0x1e05
     470:	050000f0 	streq	r0, [r0, #-240]	@ 0xffffff10
     474:	b78a01f0 			@ <UNDEFINED> instruction: 0xb78a01f0
     478:	f1050000 			@ <UNDEFINED> instruction: 0xf1050000
     47c:	00b60901 	adcseq	r0, r6, r1, lsl #18
     480:	01f30500 	mvnseq	r0, r0, lsl #10
     484:	0000b23f 	andeq	fp, r0, pc, lsr r2
     488:	3101f405 	tstcc	r1, r5, lsl #8	@ <UNPREDICTABLE>
     48c:	05000054 	streq	r0, [r0, #-84]	@ 0xffffffac
     490:	6c230285 	sfmvs	f0, 4, [r3], #-532	@ 0xfffffdec
     494:	86050000 	strhi	r0, [r5], -r0
     498:	00d29e02 	sbcseq	r9, r2, r2, lsl #28
     49c:	02a00500 	adceq	r0, r0, #0, 10
     4a0:	00005752 	andeq	r5, r0, r2, asr r7
     4a4:	4602a105 	strmi	sl, [r2], -r5, lsl #2
     4a8:	050000a5 	streq	r0, [r0, #-165]	@ 0xffffff5b
     4ac:	5ae102a3 	bpl	ff840f40 <_estack+0xdf83e740>
     4b0:	a4050000 	strge	r0, [r5], #-0
     4b4:	00bbc702 	adcseq	ip, fp, r2, lsl #14
     4b8:	02a60500 	adceq	r0, r6, #0, 10
     4bc:	0000587c 	andeq	r5, r0, ip, ror r8
     4c0:	fa02a705 	blx	aa0dc <_Min_Stack_Size+0xa9cdc>
     4c4:	0500006d 	streq	r0, [r0, #-109]	@ 0xffffff93
     4c8:	5fd602a9 	svcpl	0x00d602a9
     4cc:	aa050000 	bge	1404d4 <_Min_Stack_Size+0x1400d4>
     4d0:	00702b02 	rsbseq	r2, r0, r2, lsl #22
     4d4:	02ac0500 	adceq	r0, ip, #0, 10
     4d8:	00005985 	andeq	r5, r0, r5, lsl #19
     4dc:	8902ad05 	stmdbhi	r2, {r0, r2, r8, sl, fp, sp, pc}
     4e0:	0500003d 	streq	r0, [r0, #-61]	@ 0xffffffc3
     4e4:	894c02af 	stmdbhi	ip, {r0, r1, r2, r3, r5, r7, r9}^
     4e8:	b0050000 	andlt	r0, r5, r0
     4ec:	0058eb02 	subseq	lr, r8, r2, lsl #22
     4f0:	02b20500 	adcseq	r0, r2, #0, 10
     4f4:	00004cc3 	andeq	r4, r0, r3, asr #25
     4f8:	0102b305 	tsteq	r2, r5, lsl #6
     4fc:	050000b0 	streq	r0, [r0, #-176]	@ 0xffffff50
     500:	623b02b5 	eorsvs	r0, fp, #1342177291	@ 0x5000000b
     504:	b6050000 	strlt	r0, [r5], -r0
     508:	00f84102 	rscseq	r4, r8, r2, lsl #2
     50c:	02b80500 	adcseq	r0, r8, #0, 10
     510:	0000e1b2 			@ <UNDEFINED> instruction: 0x0000e1b2
     514:	5e02b905 	vmlapl.f16	s22, s4, s10	@ <UNPREDICTABLE>
     518:	050000e0 	streq	r0, [r0, #-224]	@ 0xffffff20
     51c:	fbd602cb 	blx	ff581052 <_estack+0xdf57e852>
     520:	cc050000 	stcgt	0, cr0, [r5], {-0}
     524:	007a0202 	rsbseq	r0, sl, r2, lsl #4
     528:	02ce0500 	sbceq	r0, lr, #0, 10
     52c:	0000559d 	muleq	r0, sp, r5
     530:	b202cf05 	andlt	ip, r2, #5, 30
     534:	05000055 	streq	r0, [r0, #-85]	@ 0xffffffab
     538:	717802f0 	ldrshvc	r0, [r8, #-32]!	@ 0xffffffe0
     53c:	f1050000 			@ <UNDEFINED> instruction: 0xf1050000
     540:	0030ab02 	eorseq	sl, r0, r2, lsl #22
     544:	039a0500 	orrseq	r0, sl, #0, 10
     548:	000061cf 	andeq	r6, r0, pc, asr #3
     54c:	4f039b05 	svcmi	0x00039b05
     550:	05000032 	streq	r0, [r0, #-50]	@ 0xffffffce
     554:	bc21039d 	stclt	3, cr0, [r1], #-628	@ 0xfffffd8c
     558:	9e050000 	cdpls	0, 0, cr0, cr5, cr0, {0}
     55c:	00c30803 	sbceq	r0, r3, r3, lsl #16
     560:	03a00500 	moveq	r0, #0, 10
     564:	00006e32 	andeq	r6, r0, r2, lsr lr
     568:	5903a105 	stmdbpl	r3, {r0, r2, r8, sp, pc}
     56c:	05000076 	streq	r0, [r0, #-118]	@ 0xffffff8a
     570:	af4803a3 	svcge	0x004803a3
     574:	a4050000 	strge	r0, [r5], #-0
     578:	00696b03 	rsbeq	r6, r9, r3, lsl #22
     57c:	03a60500 			@ <UNDEFINED> instruction: 0x03a60500
     580:	00008839 	andeq	r8, r0, r9, lsr r8
     584:	dc03a705 	stcle	7, cr10, [r3], {5}
     588:	05000096 	streq	r0, [r0, #-150]	@ 0xffffff6a
     58c:	ffcc03aa 			@ <UNDEFINED> instruction: 0xffcc03aa
     590:	ab050000 	blge	140598 <_Min_Stack_Size+0x140198>
     594:	00da4903 	sbcseq	r4, sl, r3, lsl #18
     598:	03ad0500 			@ <UNDEFINED> instruction: 0x03ad0500
     59c:	00004b99 	muleq	r0, r9, fp
     5a0:	ed03ae05 	stc	14, cr10, [r3, #-20]	@ 0xffffffec
     5a4:	050000ef 	streq	r0, [r0, #-239]	@ 0xffffff11
     5a8:	48de03b0 	ldmmi	lr, {r4, r5, r7, r8, r9}^
     5ac:	b1050000 	mrslt	r0, (UNDEF: 5)
     5b0:	00bdfd03 	adcseq	pc, sp, r3, lsl #26
     5b4:	03b30500 			@ <UNDEFINED> instruction: 0x03b30500
     5b8:	000105af 	andeq	r0, r1, pc, lsr #11
     5bc:	ea03b405 	b	ed5d8 <_Min_Stack_Size+0xed1d8>
     5c0:	050000df 	streq	r0, [r0, #-223]	@ 0xffffff21
     5c4:	a47003b6 	ldrbtge	r0, [r0], #-950	@ 0xfffffc4a
     5c8:	b7050000 	strlt	r0, [r5, -r0]
     5cc:	00553e03 	subseq	r3, r5, r3, lsl #28
     5d0:	03b90500 			@ <UNDEFINED> instruction: 0x03b90500
     5d4:	000095c6 	andeq	r9, r0, r6, asr #11
     5d8:	a203ba05 	andge	fp, r3, #20480	@ 0x5000
     5dc:	050000aa 	streq	r0, [r0, #-170]	@ 0xffffff56
     5e0:	f72a03bc 			@ <UNDEFINED> instruction: 0xf72a03bc
     5e4:	bd050000 	stclt	0, cr0, [r5, #-0]
     5e8:	008c7e03 	addeq	r7, ip, r3, lsl #28
     5ec:	03bf0500 			@ <UNDEFINED> instruction: 0x03bf0500
     5f0:	00003aa0 	andeq	r3, r0, r0, lsr #21
     5f4:	d903c005 	stmdble	r3, {r0, r2, lr, pc}
     5f8:	0500003b 	streq	r0, [r0, #-59]	@ 0xffffffc5
     5fc:	6c4803c2 	mcrrvs	3, 12, r0, r8, cr2
     600:	c3050000 	movwgt	r0, #20480	@ 0x5000
     604:	00ee0c03 	rsceq	r0, lr, r3, lsl #24
     608:	03c50500 	biceq	r0, r5, #0, 10
     60c:	00003a85 	andeq	r3, r0, r5, lsl #21
     610:	9003c605 	andls	ip, r3, r5, lsl #12
     614:	0500005a 	streq	r0, [r0, #-90]	@ 0xffffffa6
     618:	838703d0 	orrhi	r0, r7, #208, 6	@ 0x40000003
     61c:	d1050000 	mrsle	r0, (UNDEF: 5)
     620:	00b54103 	adcseq	r4, r5, r3, lsl #2
     624:	03d50500 	bicseq	r0, r5, #0, 10
     628:	00007504 	andeq	r7, r0, r4, lsl #10
     62c:	fb03d605 	blx	f5e4a <_Min_Stack_Size+0xf5a4a>
     630:	05000057 	streq	r0, [r0, #-87]	@ 0xffffffa9
     634:	361103d8 			@ <UNDEFINED> instruction: 0x361103d8
     638:	d9050000 	stmdble	r5, {}	@ <UNPREDICTABLE>
     63c:	01044803 	tsteq	r4, r3, lsl #16
     640:	03db0500 	bicseq	r0, fp, #0, 10
     644:	0000da2d 	andeq	sp, r0, sp, lsr #20
     648:	7303dc05 	movwvc	sp, #15365	@ 0x3c05
     64c:	05000079 	streq	r0, [r0, #-121]	@ 0xffffff87
     650:	660f03de 			@ <UNDEFINED> instruction: 0x660f03de
     654:	df050000 	svcle	0x00050000
     658:	0101ed03 	tsteq	r1, r3, lsl #26
     65c:	03e10500 	mvneq	r0, #0, 10
     660:	0000a98b 	andeq	sl, r0, fp, lsl #19
     664:	2c03e205 	sfmcs	f6, 1, [r3], {5}
     668:	0500008d 	streq	r0, [r0, #-141]	@ 0xffffff73
     66c:	3ba703e4 	blcc	fe9c1604 <_estack+0xde9bee04>
     670:	e5050000 	str	r0, [r5, #-0]
     674:	00c95a03 	sbceq	r5, r9, r3, lsl #20
     678:	03e70500 	mvneq	r0, #0, 10
     67c:	0000b453 	andeq	fp, r0, r3, asr r4
     680:	b703e805 	strlt	lr, [r3, -r5, lsl #16]
     684:	050000c4 	streq	r0, [r0, #-196]	@ 0xffffff3c
     688:	854403eb 	strbhi	r0, [r4, #-1003]	@ 0xfffffc15
     68c:	ec050000 	stc	0, cr0, [r5], {-0}
     690:	00d1d803 	sbcseq	sp, r1, r3, lsl #16
     694:	03ee0500 	mvneq	r0, #0, 10
     698:	0000d045 	andeq	sp, r0, r5, asr #32
     69c:	0403ef05 	streq	lr, [r3], #-3845	@ 0xfffff0fb
     6a0:	05000088 	streq	r0, [r0, #-136]	@ 0xffffff78
     6a4:	fd6003f1 	stc2l	3, cr0, [r0, #-964]!	@ 0xfffffc3c
     6a8:	f2050000 	vhadd.s8	d0, d5, d0
     6ac:	00c02f03 	sbceq	r2, r0, r3, lsl #30
     6b0:	03f50500 	mvnseq	r0, #0, 10
     6b4:	00010258 	andeq	r0, r1, r8, asr r2
     6b8:	0903f605 	stmdbeq	r3, {r0, r2, r9, sl, ip, sp, lr, pc}
     6bc:	0500004f 	streq	r0, [r0, #-79]	@ 0xffffffb1
     6c0:	5c2e03f8 	stcpl	3, cr0, [lr], #-992	@ 0xfffffc20
     6c4:	f9050000 			@ <UNDEFINED> instruction: 0xf9050000
     6c8:	0081ba03 	addeq	fp, r1, r3, lsl #20
     6cc:	03fb0500 	mvnseq	r0, #0, 10
     6d0:	00003f2e 	andeq	r3, r0, lr, lsr #30
     6d4:	1703fc05 	strne	pc, [r3, -r5, lsl #24]
     6d8:	05000077 	streq	r0, [r0, #-119]	@ 0xffffff89
     6dc:	d76b03fe 			@ <UNDEFINED> instruction: 0xd76b03fe
     6e0:	ff050000 			@ <UNDEFINED> instruction: 0xff050000
     6e4:	00cf5703 	sbceq	r5, pc, r3, lsl #14
     6e8:	04810500 	streq	r0, [r1], #1280	@ 0x500
     6ec:	0000757f 	andeq	r7, r0, pc, ror r5
     6f0:	40048205 	andmi	r8, r4, r5, lsl #4
     6f4:	0500007e 	streq	r0, [r0, #-126]	@ 0xffffff82
     6f8:	94f80484 	ldrbtls	r0, [r8], #1156	@ 0x484
     6fc:	85050000 	strhi	r0, [r5, #-0]
     700:	009ef004 	addseq	pc, lr, r4
     704:	04880500 	streq	r0, [r8], #1280	@ 0x500
     708:	00003772 	andeq	r3, r0, r2, ror r7
     70c:	ed048905 	vstr.16	s16, [r4, #-10]
     710:	050000f6 	streq	r0, [r0, #-246]	@ 0xffffff0a
     714:	58a0048b 	stmiapl	r0!, {r0, r1, r3, r7, sl}
     718:	8c050000 	stchi	0, cr0, [r5], {-0}
     71c:	00d53504 	sbcseq	r3, r5, r4, lsl #10
     720:	048e0500 	streq	r0, [lr], #1280	@ 0x500
     724:	00009e0a 	andeq	r9, r0, sl, lsl #28
     728:	8d048f05 	stchi	15, cr8, [r4, #-20]	@ 0xffffffec
     72c:	05000091 	streq	r0, [r0, #-145]	@ 0xffffff6f
     730:	fb450491 	blx	114197e <_Min_Stack_Size+0x114157e>
     734:	92050000 	andls	r0, r5, #0
     738:	00e0a904 	rsceq	sl, r0, r4, lsl #18
     73c:	04940500 	ldreq	r0, [r4], #1280	@ 0x500
     740:	000095a5 	andeq	r9, r0, r5, lsr #11
     744:	6f049505 	svcvs	0x00049505
     748:	050000c1 	streq	r0, [r0, #-193]	@ 0xffffff3f
     74c:	eb360497 	bl	d819b0 <_Min_Stack_Size+0xd815b0>
     750:	98050000 	stmdals	r5, {}	@ <UNPREDICTABLE>
     754:	00c6bb04 	sbceq	fp, r6, r4, lsl #22
     758:	049a0500 	ldreq	r0, [sl], #1280	@ 0x500
     75c:	0000ad6a 	andeq	sl, r0, sl, ror #26
     760:	13049b05 	movwne	r9, #19205	@ 0x4b05
     764:	050000e3 	streq	r0, [r0, #-227]	@ 0xffffff1d
     768:	30ca049d 	smullcc	r0, sl, sp, r4
     76c:	9e050000 	cdpls	0, 0, cr0, cr5, cr0, {0}
     770:	0046fc04 	subeq	pc, r6, r4, lsl #24
     774:	04a00500 	strteq	r0, [r0], #1280	@ 0x500
     778:	0000a625 	andeq	sl, r0, r5, lsr #12
     77c:	0f04a105 	svceq	0x0004a105
     780:	050000af 	streq	r0, [r0, #-175]	@ 0xffffff51
     784:	44a704a3 	strtmi	r0, [r7], #1187	@ 0x4a3
     788:	a4050000 	strge	r0, [r5], #-0
     78c:	00c63d04 	sbceq	r3, r6, r4, lsl #26
     790:	04a60500 	strteq	r0, [r6], #1280	@ 0x500
     794:	0000cd36 	andeq	ip, r0, r6, lsr sp
     798:	3c04a705 	stccc	7, cr10, [r4], {5}
     79c:	050000ed 	streq	r0, [r0, #-237]	@ 0xffffff13
     7a0:	c7e804a9 	strbgt	r0, [r8, r9, lsr #9]!
     7a4:	aa050000 	bge	1407ac <_Min_Stack_Size+0x1403ac>
     7a8:	0083f604 	addeq	pc, r3, r4, lsl #12
     7ac:	04ac0500 	strteq	r0, [ip], #1280	@ 0x500
     7b0:	00007dc8 	andeq	r7, r0, r8, asr #27
     7b4:	7a04ad05 	bvc	12bbd0 <_Min_Stack_Size+0x12b7d0>
     7b8:	05000039 	streq	r0, [r0, #-57]	@ 0xffffffc7
     7bc:	c8d604af 	ldmgt	r6, {r0, r1, r2, r3, r5, r7, sl}^
     7c0:	b0050000 	andlt	r0, r5, r0
