NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     7c4:	00573104 	subseq	r3, r7, r4, lsl #2
     7c8:	04b30500 	ldrteq	r0, [r3], #1280	@ 0x500
     7cc:	0000f2ac 	andeq	pc, r0, ip, lsr #5
     7d0:	6504b405 	strvs	fp, [r4, #-1029]	@ 0xfffffbfb
     7d4:	0500008e 	streq	r0, [r0, #-142]	@ 0xffffff72
     7d8:	eeff04b6 	mrc	4, 7, r0, cr15, cr6, {5}
     7dc:	b7050000 	strlt	r0, [r5, -r0]
     7e0:	00a79004 	adceq	r9, r7, r4
     7e4:	04b90500 	ldrteq	r0, [r9], #1280	@ 0x500
     7e8:	00010529 	andeq	r0, r1, r9, lsr #10
     7ec:	9404ba05 	strls	fp, [r4], #-2565	@ 0xfffff5fb
     7f0:	050000ea 	streq	r0, [r0, #-234]	@ 0xffffff16
     7f4:	3c9204bd 	cfldrscc	mvf0, [r2], {189}	@ 0xbd
     7f8:	be050000 	cdplt	0, 0, cr0, cr5, cr0, {0}
     7fc:	009add04 	addseq	sp, sl, r4, lsl #26
     800:	04c00500 	strbeq	r0, [r0], #1280	@ 0x500
     804:	0000fdbe 			@ <UNDEFINED> instruction: 0x0000fdbe
     808:	4604c105 	strmi	ip, [r4], -r5, lsl #2
     80c:	0500007d 	streq	r0, [r0, #-125]	@ 0xffffff83
     810:	906304c3 	rsbls	r0, r3, r3, asr #9
     814:	c4050000 	strgt	r0, [r5], #-0
     818:	00b3b504 	adcseq	fp, r3, r4, lsl #10
     81c:	04c60500 	strbeq	r0, [r6], #1280	@ 0x500
     820:	0000bef8 	strdeq	fp, [r0], -r8
     824:	bb04c705 	bllt	132440 <_Min_Stack_Size+0x132040>
     828:	05000102 	streq	r0, [r0, #-258]	@ 0xfffffefe
     82c:	64b704c9 	ldrtvs	r0, [r7], #1225	@ 0x4c9
     830:	ca050000 	bgt	140838 <_Min_Stack_Size+0x140438>
     834:	00c13204 	sbceq	r3, r1, r4, lsl #4
     838:	04cd0500 	strbeq	r0, [sp], #1280	@ 0x500
     83c:	0000f489 	andeq	pc, r0, r9, lsl #9
     840:	4104ce05 	tstmi	r4, r5, lsl #28
     844:	0500004e 	streq	r0, [r0, #-78]	@ 0xffffffb2
     848:	a8e004d0 	stmiage	r0!, {r4, r6, r7, sl}^
     84c:	d1050000 	mrsle	r0, (UNDEF: 5)
     850:	00e89104 	rsceq	r9, r8, r4, lsl #2
     854:	04d30500 	ldrbeq	r0, [r3], #1280	@ 0x500
     858:	0000ab76 	andeq	sl, r0, r6, ror fp
     85c:	6704d405 	strvs	sp, [r4, -r5, lsl #8]
     860:	05000041 	streq	r0, [r0, #-65]	@ 0xffffffbf
     864:	ae8204d6 	mcrge	4, 4, r0, cr2, cr6, {6}
     868:	d7050000 	strle	r0, [r5, -r0]
     86c:	0033f304 	eorseq	pc, r3, r4, lsl #6
     870:	04d90500 	ldrbeq	r0, [r9], #1280	@ 0x500
     874:	00009b77 	andeq	r9, r0, r7, ror fp
     878:	0904da05 	stmdbeq	r4, {r0, r2, r9, fp, ip, lr, pc}
     87c:	050000f3 	streq	r0, [r0, #-243]	@ 0xffffff0d
     880:	642c04dc 	strtvs	r0, [ip], #-1244	@ 0xfffffb24
     884:	dd050000 	stcle	0, cr0, [r5, #-0]
     888:	00d01204 	sbcseq	r1, r0, r4, lsl #4
     88c:	04e00500 	strbteq	r0, [r0], #1280	@ 0x500
     890:	0000d60b 	andeq	sp, r0, fp, lsl #12
     894:	6404e105 	strvs	lr, [r4], #-261	@ 0xfffffefb
     898:	050000b3 	streq	r0, [r0, #-179]	@ 0xffffff4d
     89c:	d26804e3 	rsble	r0, r8, #-486539264	@ 0xe3000000
     8a0:	e4050000 	str	r0, [r5], #-0
     8a4:	00867d04 	addeq	r7, r6, r4, lsl #26
     8a8:	04e60500 	strbteq	r0, [r6], #1280	@ 0x500
     8ac:	0000357c 	andeq	r3, r0, ip, ror r5
     8b0:	dc04e705 	stcle	7, cr14, [r4], {5}
     8b4:	050000b5 	streq	r0, [r0, #-181]	@ 0xffffff4b
     8b8:	eda004e9 	cfstrs	mvf0, [r0, #932]!	@ 0x3a4
     8bc:	ea050000 	b	1408c4 <_Min_Stack_Size+0x1404c4>
     8c0:	00848e04 	addeq	r8, r4, r4, lsl #28
     8c4:	04ec0500 	strbteq	r0, [ip], #1280	@ 0x500
     8c8:	0000cca4 	andeq	ip, r0, r4, lsr #25
     8cc:	4404ed05 	strmi	lr, [r4], #-3333	@ 0xfffff2fb
     8d0:	050000bc 	streq	r0, [r0, #-188]	@ 0xffffff44
     8d4:	3f9d04ef 	svccc	0x009d04ef
     8d8:	f0050000 			@ <UNDEFINED> instruction: 0xf0050000
     8dc:	00a50204 	adceq	r0, r5, r4, lsl #4
     8e0:	04f30500 	ldrbteq	r0, [r3], #1280	@ 0x500
     8e4:	00006eeb 	andeq	r6, r0, fp, ror #29
     8e8:	8a04f405 	bhi	13d904 <_Min_Stack_Size+0x13d504>
     8ec:	05000100 	streq	r0, [r0, #-256]	@ 0xffffff00
     8f0:	6fd804f6 	svcvs	0x00d804f6
     8f4:	f7050000 			@ <UNDEFINED> instruction: 0xf7050000
     8f8:	00f9b604 	rscseq	fp, r9, r4, lsl #12
     8fc:	04f90500 	ldrbteq	r0, [r9], #1280	@ 0x500
     900:	000047fa 	strdeq	r4, [r0], -sl
     904:	a504fa05 	strge	pc, [r4, #-2565]	@ 0xfffff5fb
     908:	0500006f 	streq	r0, [r0, #-111]	@ 0xffffff91
     90c:	b77104fd 			@ <UNDEFINED> instruction: 0xb77104fd
     910:	fe050000 	cdp2	0, 0, cr0, cr5, cr0, {0}
     914:	00801a04 	addeq	r1, r0, r4, lsl #20
     918:	05800500 	streq	r0, [r0, #1280]	@ 0x500
     91c:	0000c716 	andeq	ip, r0, r6, lsl r7
     920:	26058105 	strcs	r8, [r5], -r5, lsl #2
     924:	050000cf 	streq	r0, [r0, #-207]	@ 0xffffff31
     928:	48180583 	ldmdami	r8, {r0, r1, r7, r8, sl}
     92c:	84050000 	strhi	r0, [r5], #-0
     930:	004cfa05 	subeq	pc, ip, r5, lsl #20
     934:	05860500 	streq	r0, [r6, #1280]	@ 0x500
     938:	0000cad1 	ldrdeq	ip, [r0], -r1
     93c:	ae058705 	cdpge	7, 0, cr8, cr5, cr5, {0}
     940:	05000075 	streq	r0, [r0, #-117]	@ 0xffffff8b
     944:	d5c50589 	strble	r0, [r5, #1417]	@ 0x589
     948:	8a050000 	bhi	140950 <_Min_Stack_Size+0x140550>
     94c:	00d0d905 	sbcseq	sp, r0, r5, lsl #18
     950:	05a50500 	streq	r0, [r5, #1280]!	@ 0x500
     954:	00006a2f 	andeq	r6, r0, pc, lsr #20
     958:	2305a605 	movwcs	sl, #22021	@ 0x5605
     95c:	050000a1 	streq	r0, [r0, #-161]	@ 0xffffff5f
     960:	352d05aa 	strcc	r0, [sp, #-1450]!	@ 0xfffffa56
     964:	ab050000 	blge	14096c <_Min_Stack_Size+0x14056c>
     968:	00328f05 	eorseq	r8, r2, r5, lsl #30
     96c:	05ad0500 	streq	r0, [sp, #1280]!	@ 0x500
     970:	000042d1 	ldrdeq	r4, [r0], -r1
     974:	8705ae05 	strhi	sl, [r5, -r5, lsl #28]
     978:	0500006c 	streq	r0, [r0, #-108]	@ 0xffffff94
     97c:	f97a05b0 			@ <UNDEFINED> instruction: 0xf97a05b0
     980:	b1050000 	mrslt	r0, (UNDEF: 5)
     984:	00bcc905 	adcseq	ip, ip, r5, lsl #18
     988:	05b30500 	ldreq	r0, [r3, #1280]!	@ 0x500
     98c:	0000ccd9 	ldrdeq	ip, [r0], -r9
     990:	cb05b405 	blgt	16d9ac <_Min_Stack_Size+0x16d5ac>
     994:	05000040 	streq	r0, [r0, #-64]	@ 0xffffffc0
     998:	d43705b6 	ldrtle	r0, [r7], #-1462	@ 0xfffffa4a
     99c:	b7050000 	strlt	r0, [r5, -r0]
     9a0:	00f26a05 	rscseq	r6, r2, r5, lsl #20
     9a4:	05d00500 	ldrbeq	r0, [r0, #1280]	@ 0x500
     9a8:	0000b686 	andeq	fp, r0, r6, lsl #13
     9ac:	6605d105 	strvs	sp, [r5], -r5, lsl #2
     9b0:	0500006f 	streq	r0, [r0, #-111]	@ 0xffffff91
     9b4:	602105d3 	ldrdvs	r0, [r1], -r3	@ <UNPREDICTABLE>
     9b8:	d4050000 	strle	r0, [r5], #-0
     9bc:	00b9c305 	adcseq	ip, r9, r5, lsl #6
     9c0:	05d60500 	ldrbeq	r0, [r6, #1280]	@ 0x500
     9c4:	0000c2e1 	andeq	ip, r0, r1, ror #5
     9c8:	e305d705 	movw	sp, #22277	@ 0x5705
     9cc:	050000e1 	streq	r0, [r0, #-225]	@ 0xffffff1f
     9d0:	89bf05d9 	ldmibhi	pc!, {r0, r3, r4, r6, r7, r8, sl}	@ <UNPREDICTABLE>
     9d4:	da050000 	ble	1409dc <_Min_Stack_Size+0x1405dc>
     9d8:	006b6a05 	rsbeq	r6, fp, r5, lsl #20
     9dc:	05dd0500 	ldrbeq	r0, [sp, #1280]	@ 0x500
     9e0:	00004ab5 			@ <UNDEFINED> instruction: 0x00004ab5
     9e4:	4305de05 	movwmi	sp, #24069	@ 0x5e05
     9e8:	0500003e 	streq	r0, [r0, #-62]	@ 0xffffffc2
     9ec:	ae6705e1 	cdpge	5, 6, cr0, cr7, cr1, {7}
     9f0:	e2050000 	and	r0, r5, #0
     9f4:	0086b405 	addeq	fp, r6, r5, lsl #8
     9f8:	05e50500 	strbeq	r0, [r5, #1280]!	@ 0x500
     9fc:	000070ae 	andeq	r7, r0, lr, lsr #1
     a00:	fa05e605 	blx	17a21c <_Min_Stack_Size+0x179e1c>
     a04:	050000b7 	streq	r0, [r0, #-183]	@ 0xffffff49
     a08:	b8fa05e8 	ldmlt	sl!, {r3, r5, r6, r7, r8, sl}^
     a0c:	e9050000 	stmdb	r5, {}	@ <UNPREDICTABLE>
     a10:	00aded05 	adceq	lr, sp, r5, lsl #26
     a14:	05eb0500 	strbeq	r0, [fp, #1280]!	@ 0x500
     a18:	00010553 	andeq	r0, r1, r3, asr r5
     a1c:	4f05ec05 	svcmi	0x0005ec05
     a20:	050000a6 	streq	r0, [r0, #-166]	@ 0xffffff5a
     a24:	8c66069d 	stclhi	6, cr0, [r6], #-628	@ 0xfffffd8c
     a28:	9e050000 	cdpls	0, 0, cr0, cr5, cr0, {0}
     a2c:	003c2406 	eorseq	r2, ip, r6, lsl #8
     a30:	06a10500 	strteq	r0, [r1], r0, lsl #10
     a34:	00006460 	andeq	r6, r0, r0, ror #8
     a38:	ca06a205 	bgt	1a9254 <_Min_Stack_Size+0x1a8e54>
     a3c:	05000070 	streq	r0, [r0, #-112]	@ 0xffffff90
     a40:	5cf806a4 	ldclpl	6, cr0, [r8], #656	@ 0x290
     a44:	a5050000 	strge	r0, [r5, #-0]
     a48:	00827306 	addeq	r7, r2, r6, lsl #6
     a4c:	06a70500 	strteq	r0, [r7], r0, lsl #10
     a50:	0000b841 	andeq	fp, r0, r1, asr #16
     a54:	bb06a805 	bllt	1aaa70 <_Min_Stack_Size+0x1aa670>
     a58:	050000f8 	streq	r0, [r0, #-248]	@ 0xffffff08
     a5c:	93b306aa 			@ <UNDEFINED> instruction: 0x93b306aa
     a60:	ab050000 	blge	140a68 <_Min_Stack_Size+0x140668>
     a64:	00efb606 	rsceq	fp, pc, r6, lsl #12
     a68:	06ad0500 	strteq	r0, [sp], r0, lsl #10
     a6c:	0000f82b 	andeq	pc, r0, fp, lsr #16
     a70:	4b06ae05 	blmi	1ac28c <_Min_Stack_Size+0x1abe8c>
     a74:	05000043 	streq	r0, [r0, #-67]	@ 0xffffffbd
     a78:	a6ef06b0 			@ <UNDEFINED> instruction: 0xa6ef06b0
     a7c:	b1050000 	mrslt	r0, (UNDEF: 5)
     a80:	00845f06 	addeq	r5, r4, r6, lsl #30
     a84:	06b30500 	ldrteq	r0, [r3], r0, lsl #10
     a88:	00006348 	andeq	r6, r0, r8, asr #6
     a8c:	bb06b405 	bllt	1adaa8 <_Min_Stack_Size+0x1ad6a8>
     a90:	050000d3 	streq	r0, [r0, #-211]	@ 0xffffff2d
     a94:	a03706b6 	ldrhtge	r0, [r7], -r6
     a98:	b7050000 	strlt	r0, [r5, -r0]
     a9c:	0058be06 	subseq	fp, r8, r6, lsl #28
     aa0:	06b90500 	ldrteq	r0, [r9], r0, lsl #10
     aa4:	000033dd 	ldrdeq	r3, [r0], -sp
     aa8:	5406ba05 	strpl	fp, [r6], #-2565	@ 0xfffff5fb
     aac:	050000de 	streq	r0, [r0, #-222]	@ 0xffffff22
     ab0:	d57206bd 	ldrble	r0, [r2, #-1725]!	@ 0xfffff943
     ab4:	be050000 	cdplt	0, 0, cr0, cr5, cr0, {0}
     ab8:	00accc06 	adceq	ip, ip, r6, lsl #24
     abc:	06c00500 	strbeq	r0, [r0], r0, lsl #10
     ac0:	00009bc7 	andeq	r9, r0, r7, asr #23
     ac4:	9f06c105 	svcls	0x0006c105
     ac8:	050000f3 	streq	r0, [r0, #-243]	@ 0xffffff0d
     acc:	e35b06c3 	cmp	fp, #204472320	@ 0xc300000
     ad0:	c4050000 	strgt	r0, [r5], #-0
     ad4:	00d8e106 	sbcseq	lr, r8, r6, lsl #2
     ad8:	06ef0500 	strbteq	r0, [pc], r0, lsl #10
     adc:	000089a6 	andeq	r8, r0, r6, lsr #19
     ae0:	5006f005 	andpl	pc, r6, r5
     ae4:	05000059 	streq	r0, [r0, #-89]	@ 0xffffffa7
     ae8:	080606f2 	stmdaeq	r6, {r1, r4, r5, r6, r7, r9, sl}
     aec:	f3050001 	vhadd.u8	d0, d5, d1
     af0:	01035506 	tsteq	r3, r6, lsl #10
     af4:	06f50500 	ldrbteq	r0, [r5], r0, lsl #10
     af8:	000060ca 	andeq	r6, r0, sl, asr #1
     afc:	bf06f605 	svclt	0x0006f605
     b00:	050000f7 	streq	r0, [r0, #-247]	@ 0xffffff09
     b04:	448d06f8 	strmi	r0, [sp], #1784	@ 0x6f8
     b08:	f9050000 			@ <UNDEFINED> instruction: 0xf9050000
     b0c:	00a41a06 	adceq	r1, r4, r6, lsl #20
     b10:	06fb0500 	ldrbteq	r0, [fp], r0, lsl #10
     b14:	00004bb4 			@ <UNDEFINED> instruction: 0x00004bb4
     b18:	0506fc05 	streq	pc, [r6, #-3077]	@ 0xfffff3fb
     b1c:	0500006b 	streq	r0, [r0, #-107]	@ 0xffffff95
     b20:	6ddf06fe 	ldclvs	6, cr0, [pc, #1016]	@ f20 <_Min_Stack_Size+0xb20>
     b24:	ff050000 			@ <UNDEFINED> instruction: 0xff050000
     b28:	007a7a06 	rsbseq	r7, sl, r6, lsl #20
     b2c:	07810500 	streq	r0, [r1, r0, lsl #10]
     b30:	0000afc4 	andeq	sl, r0, r4, asr #31
     b34:	b4078205 	strlt	r8, [r7], #-517	@ 0xfffffdfb
     b38:	05000071 	streq	r0, [r0, #-113]	@ 0xffffff8f
     b3c:	38da0784 	ldmcc	sl, {r2, r7, r8, r9, sl}^
     b40:	85050000 	strhi	r0, [r5, #-0]
     b44:	003ef507 	eorseq	pc, lr, r7, lsl #10
     b48:	07870500 	streq	r0, [r7, r0, lsl #10]
     b4c:	00008f5e 	andeq	r8, r0, lr, asr pc
     b50:	00078805 	andeq	r8, r7, r5, lsl #16
     b54:	050000c6 	streq	r0, [r0, #-198]	@ 0xffffff3a
     b58:	fc58078a 	mrrc2	7, 8, r0, r8, cr10
     b5c:	8b050000 	blhi	140b64 <_Min_Stack_Size+0x140764>
     b60:	00346907 	eorseq	r6, r4, r7, lsl #18
     b64:	078d0500 	streq	r0, [sp, r0, lsl #10]
     b68:	0000d98d 	andeq	sp, r0, sp, lsl #19
     b6c:	ea078e05 	b	1e4388 <_Min_Stack_Size+0x1e3f88>
     b70:	0500009c 	streq	r0, [r0, #-156]	@ 0xffffff64
     b74:	36bc0790 	ssatcc	r0, #29, r0, lsl #15
     b78:	91050000 	mrsls	r0, (UNDEF: 5)
     b7c:	00762007 	rsbseq	r2, r6, r7
     b80:	07930500 	ldreq	r0, [r3, r0, lsl #10]
     b84:	0000ecd2 	ldrdeq	lr, [r0], -r2
     b88:	f0079405 			@ <UNDEFINED> instruction: 0xf0079405
     b8c:	0500006f 	streq	r0, [r0, #-111]	@ 0xffffff91
     b90:	bc790796 	ldcllt	7, cr0, [r9], #-600	@ 0xfffffda8
     b94:	97050000 	strls	r0, [r5, -r0]
     b98:	006d7e07 	rsbeq	r7, sp, r7, lsl #28
     b9c:	07990500 	ldreq	r0, [r9, r0, lsl #10]
     ba0:	0000443c 	andeq	r4, r0, ip, lsr r4
     ba4:	7e079a05 	vmlavc.f32	s18, s14, s10
     ba8:	050000ba 	streq	r0, [r0, #-186]	@ 0xffffff46
     bac:	6e19079c 	mrcvs	7, 0, r0, cr9, cr12, {4}
     bb0:	9d050000 	stcls	0, cr0, [r5, #-0]
     bb4:	00f51f07 	rscseq	r1, r5, r7, lsl #30
     bb8:	079f0500 	ldreq	r0, [pc, r0, lsl #10]
     bbc:	0000f450 	andeq	pc, r0, r0, asr r4	@ <UNPREDICTABLE>
     bc0:	5707a005 	strpl	sl, [r7, -r5]
     bc4:	050000eb 	streq	r0, [r0, #-235]	@ 0xffffff15
     bc8:	8eea07a2 	cdphi	7, 14, cr0, cr10, cr2, {5}
     bcc:	a3050000 	movwge	r0, #20480	@ 0x5000
     bd0:	0063b407 	rsbeq	fp, r3, r7, lsl #8
     bd4:	07a60500 	streq	r0, [r6, r0, lsl #10]!
     bd8:	000066fc 	strdeq	r6, [r0], -ip
     bdc:	2b07a705 	blcs	1ea7f8 <_Min_Stack_Size+0x1ea3f8>
     be0:	05000043 	streq	r0, [r0, #-67]	@ 0xffffffbd
     be4:	533007aa 	teqpl	r0, #44564480	@ 0x2a80000
     be8:	ab050000 	blge	140bf0 <_Min_Stack_Size+0x1407f0>
     bec:	00f55607 	rscseq	r5, r5, r7, lsl #12
     bf0:	07ae0500 	streq	r0, [lr, r0, lsl #10]!
     bf4:	00005d21 	andeq	r5, r0, r1, lsr #26
     bf8:	5d07af05 	stcpl	15, cr10, [r7, #-20]	@ 0xffffffec
     bfc:	05000081 	streq	r0, [r0, #-129]	@ 0xffffff7f
     c00:	e5b007b2 	ldr	r0, [r0, #1970]!	@ 0x7b2
     c04:	b3050000 	movwlt	r0, #20480	@ 0x5000
     c08:	00a06607 	adceq	r6, r0, r7, lsl #12
     c0c:	07b60500 	ldreq	r0, [r6, r0, lsl #10]!
     c10:	0000d64e 	andeq	sp, r0, lr, asr #12
     c14:	6c07b705 	stcvs	7, cr11, [r7], {5}
     c18:	050000e6 	streq	r0, [r0, #-230]	@ 0xffffff1a
     c1c:	f42107ba 	vld1.32	{d0}, [r1 :256], sl
     c20:	bb050000 	bllt	140c28 <_Min_Stack_Size+0x140828>
     c24:	00b3ec07 	adcseq	lr, r3, r7, lsl #24
     c28:	07be0500 	ldreq	r0, [lr, r0, lsl #10]!
     c2c:	00009763 	andeq	r9, r0, r3, ror #14
     c30:	9407bf05 	strls	fp, [r7], #-3845	@ 0xfffff0fb
     c34:	050000ca 	streq	r0, [r0, #-202]	@ 0xffffff36
     c38:	318107c1 	orrcc	r0, r1, r1, asr #15
     c3c:	c2050000 	andgt	r0, r5, #0
     c40:	01077807 	tsteq	r7, r7, lsl #16
     c44:	07c40500 	strbeq	r0, [r4, r0, lsl #10]
     c48:	0000fb25 	andeq	pc, r0, r5, lsr #22
     c4c:	9e07c505 	cfsh32ls	mvfx12, mvfx7, #5
     c50:	050000c2 	streq	r0, [r0, #-194]	@ 0xffffff3e
     c54:	a33f07c7 	teqge	pc, #52166656	@ 0x31c0000
     c58:	c8050000 	stmdagt	r5, {}	@ <UNPREDICTABLE>
     c5c:	01056e07 	tsteq	r5, r7, lsl #28
     c60:	07ca0500 	strbeq	r0, [sl, r0, lsl #10]
     c64:	00008aef 	andeq	r8, r0, pc, ror #21
     c68:	3607cb05 	strcc	ip, [r7], -r5, lsl #22
     c6c:	050000c4 	streq	r0, [r0, #-196]	@ 0xffffff3c
     c70:	c40307cd 	strgt	r0, [r3], #-1997	@ 0xfffff833
     c74:	ce050000 	cdpgt	0, 0, cr0, cr5, cr0, {0}
     c78:	007b2307 	rsbseq	r2, fp, r7, lsl #6
     c7c:	07d00500 	ldrbeq	r0, [r0, r0, lsl #10]
     c80:	000036ea 	andeq	r3, r0, sl, ror #13
     c84:	6c07d105 	stfvsd	f5, [r7], {5}
     c88:	05000046 	streq	r0, [r0, #-70]	@ 0xffffffba
     c8c:	8ffd07d3 	svchi	0x00fd07d3
     c90:	d4050000 	strle	r0, [r5], #-0
     c94:	00b02007 	adcseq	r2, r0, r7
     c98:	07d60500 	ldrbeq	r0, [r6, r0, lsl #10]
     c9c:	0000c79c 	muleq	r0, ip, r7
     ca0:	f007d705 			@ <UNDEFINED> instruction: 0xf007d705
     ca4:	05000102 	streq	r0, [r0, #-258]	@ 0xfffffefe
     ca8:	56120883 	ldrpl	r0, [r2], -r3, lsl #17
     cac:	84050000 	strhi	r0, [r5], #-0
     cb0:	00a27c08 	adceq	r7, r2, r8, lsl #24
     cb4:	08870500 	stmeq	r7, {r8, sl}
     cb8:	00008f99 	muleq	r0, r9, pc	@ <UNPREDICTABLE>
     cbc:	bd088805 	stclt	8, cr8, [r8, #-20]	@ 0xffffffec
     cc0:	05000085 	streq	r0, [r0, #-133]	@ 0xffffff7b
     cc4:	e7cd088b 	strb	r0, [sp, fp, lsl #17]
     cc8:	8c050000 	stchi	0, cr0, [r5], {-0}
     ccc:	00f91708 	rscseq	r1, r9, r8, lsl #14
     cd0:	088e0500 	stmeq	lr, {r8, sl}
     cd4:	0000715e 	andeq	r7, r0, lr, asr r1
     cd8:	c8088f05 	stmdagt	r8, {r0, r2, r8, r9, sl, fp, pc}
     cdc:	05000062 	streq	r0, [r0, #-98]	@ 0xffffff9e
     ce0:	7d180891 	ldcvc	8, cr0, [r8, #-580]	@ 0xfffffdbc
     ce4:	92050000 	andls	r0, r5, #0
     ce8:	0046c308 	subeq	ip, r6, r8, lsl #6
     cec:	08940500 	ldmeq	r4, {r8, sl}
     cf0:	00003f5b 	andeq	r3, r0, fp, asr pc
     cf4:	c4089505 	strgt	r9, [r8], #-1285	@ 0xfffffafb
     cf8:	050000cf 	streq	r0, [r0, #-207]	@ 0xffffff31
     cfc:	92e10898 	rscls	r0, r1, #152, 16	@ 0x980000
     d00:	99050000 	stmdbls	r5, {}	@ <UNPREDICTABLE>
     d04:	00aa6f08 	adceq	r6, sl, r8, lsl #30
     d08:	089b0500 	ldmeq	fp, {r8, sl}
     d0c:	000082ed 	andeq	r8, r0, sp, ror #5
     d10:	f7089c05 			@ <UNDEFINED> instruction: 0xf7089c05
     d14:	0500008c 	streq	r0, [r0, #-140]	@ 0xffffff74
     d18:	b715089f 			@ <UNDEFINED> instruction: 0xb715089f
     d1c:	a0050000 	andge	r0, r5, r0
     d20:	00ff9008 	rscseq	r9, pc, r8
     d24:	08a30500 	stmiaeq	r3!, {r8, sl}
     d28:	0000a172 	andeq	sl, r0, r2, ror r1
     d2c:	2f08a405 	svccs	0x0008a405
     d30:	050000ea 	streq	r0, [r0, #-234]	@ 0xffffff16
     d34:	691e08a6 	ldmdbvs	lr, {r1, r2, r5, r7, fp}
     d38:	a7050000 	strge	r0, [r5, -r0]
     d3c:	00ef2a08 	rsceq	r2, pc, r8, lsl #20
     d40:	08a90500 	stmiaeq	r9!, {r8, sl}
     d44:	0000694d 	andeq	r6, r0, sp, asr #18
     d48:	e608aa05 	str	sl, [r8], -r5, lsl #20
     d4c:	050000a5 	streq	r0, [r0, #-165]	@ 0xffffff5b
     d50:	711e08ac 	tstvc	lr, ip, lsr #17
     d54:	ad050000 	stcge	0, cr0, [r5, #-0]
     d58:	01071408 	tsteq	r7, r8, lsl #8
     d5c:	08af0500 	stmiaeq	pc!, {r8, sl}	@ <UNPREDICTABLE>
     d60:	00004ed2 	ldrdeq	r4, [r0], -r2
     d64:	5008b005 	andpl	fp, r8, r5
     d68:	050000e8 	streq	r0, [r0, #-232]	@ 0xffffff18
     d6c:	b52b08b2 	strlt	r0, [fp, #-2226]!	@ 0xfffff74e
     d70:	b3050000 	movwlt	r0, #20480	@ 0x5000
     d74:	00727508 	rsbseq	r7, r2, r8, lsl #10
     d78:	08b50500 	ldmeq	r5!, {r8, sl}
     d7c:	000104ce 	andeq	r0, r1, lr, asr #9
     d80:	2e08b605 	cfmadd32cs	mvax0, mvfx11, mvfx8, mvfx5
     d84:	05000034 	streq	r0, [r0, #-52]	@ 0xffffffcc
     d88:	82ad08b9 	adchi	r0, sp, #12124160	@ 0xb90000
     d8c:	ba050000 	blt	140d94 <_Min_Stack_Size+0x140994>
     d90:	00da0908 	sbcseq	r0, sl, r8, lsl #18
     d94:	08bc0500 	ldmeq	ip!, {r8, sl}
     d98:	00007d79 	andeq	r7, r0, r9, ror sp
     d9c:	b408bd05 	strlt	fp, [r8], #-3333	@ 0xfffff2fb
     da0:	0500009c 	streq	r0, [r0, #-156]	@ 0xffffff64
     da4:	ced508c0 	cdpgt	8, 13, cr0, cr5, cr0, {6}
     da8:	c1050000 	mrsgt	r0, (UNDEF: 5)
     dac:	00dacd08 	sbcseq	ip, sl, r8, lsl #26
     db0:	08c30500 	stmiaeq	r3, {r8, sl}^
     db4:	0000a8a2 	andeq	sl, r0, r2, lsr #17
     db8:	4908c405 	stmdbmi	r8, {r0, r2, sl, lr, pc}
     dbc:	0500009d 	streq	r0, [r0, #-157]	@ 0xffffff63
     dc0:	4c2908c6 	stcmi	8, cr0, [r9], #-792	@ 0xfffffce8
     dc4:	c7050000 	strgt	r0, [r5, -r0]
     dc8:	00ddf408 	sbcseq	pc, sp, r8, lsl #8
     dcc:	08c90500 	stmiaeq	r9, {r8, sl}^
     dd0:	00004ee9 	andeq	r4, r0, r9, ror #29
     dd4:	c108ca05 	tstgt	r8, r5, lsl #20
     dd8:	05000072 	streq	r0, [r0, #-114]	@ 0xffffff8e
     ddc:	462308cc 	strtmi	r0, [r3], -ip, asr #17
     de0:	cd050000 	stcgt	0, cr0, [r5, #-0]
     de4:	0052cd08 	subseq	ip, r2, r8, lsl #26
     de8:	08cf0500 	stmiaeq	pc, {r8, sl}^	@ <UNPREDICTABLE>
     dec:	0000aa0f 	andeq	sl, r0, pc, lsl #20
     df0:	8308d005 	movwhi	sp, #32773	@ 0x8005
     df4:	050000af 	streq	r0, [r0, #-175]	@ 0xffffff51
     df8:	8b6a08d2 	blhi	1a83148 <_Min_Stack_Size+0x1a82d48>
     dfc:	d3050000 	movwle	r0, #20480	@ 0x5000
     e00:	0031c508 	eorseq	ip, r1, r8, lsl #10
     e04:	08d60500 	ldmeq	r6, {r8, sl}^
     e08:	00006ae7 	andeq	r6, r0, r7, ror #21
     e0c:	c908d705 	stmdbgt	r8, {r0, r2, r8, r9, sl, ip, lr, pc}
     e10:	050000e5 	streq	r0, [r0, #-229]	@ 0xffffff1b
     e14:	f46b08d9 	vld2.<illegal width 64>	{d16-d17}, [fp :64], r9
     e18:	da050000 	ble	140e20 <_Min_Stack_Size+0x140a20>
     e1c:	01033108 	tsteq	r3, r8, lsl #2
     e20:	08dd0500 	ldmeq	sp, {r8, sl}^
     e24:	0000db6e 	andeq	sp, r0, lr, ror #22
     e28:	f808de05 			@ <UNDEFINED> instruction: 0xf808de05
     e2c:	050000a0 	streq	r0, [r0, #-160]	@ 0xffffff60
     e30:	541608e1 	ldrpl	r0, [r6], #-2273	@ 0xfffff71f
     e34:	e2050000 	and	r0, r5, #0
     e38:	00972a08 	addseq	r2, r7, r8, lsl #20
     e3c:	08e40500 	stmiaeq	r4!, {r8, sl}^
     e40:	00007baa 	andeq	r7, r0, sl, lsr #23
     e44:	2d08e505 	cfstr32cs	mvfx14, [r8, #-20]	@ 0xffffffec
     e48:	050000bf 	streq	r0, [r0, #-191]	@ 0xffffff41
     e4c:	d3ec08e7 	mvnle	r0, #15138816	@ 0xe70000
     e50:	e8050000 	stmda	r5, {}	@ <UNPREDICTABLE>
     e54:	00bbe608 	adcseq	lr, fp, r8, lsl #12
     e58:	08ea0500 	stmiaeq	sl!, {r8, sl}^
     e5c:	00005fec 	andeq	r5, r0, ip, ror #31
     e60:	db08eb05 	blle	23ba7c <_Min_Stack_Size+0x23b67c>
     e64:	05000106 	streq	r0, [r0, #-262]	@ 0xfffffefa
     e68:	3d2808ed 	stccc	8, cr0, [r8, #-948]!	@ 0xfffffc4c
     e6c:	ee050000 	cdp	0, 0, cr0, cr5, cr0, {0}
     e70:	00809e08 	addeq	r9, r0, r8, lsl #28
     e74:	08f00500 	ldmeq	r0!, {r8, sl}^
     e78:	000053a6 	andeq	r5, r0, r6, lsr #7
     e7c:	db08f105 	blle	23d298 <_Min_Stack_Size+0x23ce98>
     e80:	05000075 	streq	r0, [r0, #-117]	@ 0xffffff8b
     e84:	704a08f4 	strdvc	r0, [sl], #-132	@ 0xffffff7c
     e88:	f5050000 			@ <UNDEFINED> instruction: 0xf5050000
     e8c:	00410c08 	subeq	r0, r1, r8, lsl #24
     e90:	08f70500 	ldmeq	r7!, {r8, sl}^
     e94:	00008e48 	andeq	r8, r0, r8, asr #28
     e98:	8808f805 	stmdahi	r8, {r0, r2, fp, ip, sp, lr, pc}
     e9c:	05000106 	streq	r0, [r0, #-262]	@ 0xfffffefa
     ea0:	91ca0997 			@ <UNDEFINED> instruction: 0x91ca0997
     ea4:	9a050000 	bls	140eac <_Min_Stack_Size+0x140aac>
     ea8:	009df109 	addseq	pc, sp, r9, lsl #2
     eac:	099b0500 	ldmibeq	fp, {r8, sl}
     eb0:	0000a92b 	andeq	sl, r0, fp, lsr #18
     eb4:	eb099d05 	bl	2682d0 <_Min_Stack_Size+0x267ed0>
     eb8:	050000fb 	streq	r0, [r0, #-251]	@ 0xffffff05
     ebc:	7c34099e 			@ <UNDEFINED> instruction: 0x7c34099e
     ec0:	a0050000 	andge	r0, r5, r0
     ec4:	00e72f09 	rsceq	r2, r7, r9, lsl #30
     ec8:	09a10500 	stmibeq	r1!, {r8, sl}
     ecc:	0000ba57 	andeq	fp, r0, r7, asr sl
     ed0:	7d09a405 	cfstrsvc	mvf10, [r9, #-20]	@ 0xffffffec
     ed4:	05000062 	streq	r0, [r0, #-98]	@ 0xffffff9e
     ed8:	cc6b09a5 			@ <UNDEFINED> instruction: 0xcc6b09a5
     edc:	a7050000 	strge	r0, [r5, -r0]
     ee0:	00a56509 	adceq	r6, r5, r9, lsl #10
     ee4:	09a80500 	stmibeq	r8!, {r8, sl}
     ee8:	0000d6e3 	andeq	sp, r0, r3, ror #13
     eec:	6309aa05 	movwvs	sl, #39429	@ 0x9a05
     ef0:	0500007a 	streq	r0, [r0, #-122]	@ 0xffffff86
     ef4:	6b8909ab 	blvs	fe2435a8 <_estack+0xde240da8>
     ef8:	ae050000 	cdpge	0, 0, cr0, cr5, cr0, {0}
     efc:	00ed0909 	rsceq	r0, sp, r9, lsl #18
     f00:	09af0500 	stmibeq	pc!, {r8, sl}	@ <UNPREDICTABLE>
     f04:	0000c1c7 	andeq	ip, r0, r7, asr #3
     f08:	e709b205 	str	fp, [r9, -r5, lsl #4]
     f0c:	050000e7 	streq	r0, [r0, #-231]	@ 0xffffff19
     f10:	bfd709b3 	svclt	0x00d709b3
     f14:	b5050000 	strlt	r0, [r5, #-0]
     f18:	003a5609 	eorseq	r5, sl, r9, lsl #12
     f1c:	09b60500 	ldmibeq	r6!, {r8, sl}
     f20:	0000e2e4 	andeq	lr, r0, r4, ror #5
     f24:	e309b805 	movw	fp, #38917	@ 0x9805
     f28:	050000b8 	streq	r0, [r0, #-184]	@ 0xffffff48
     f2c:	637709b9 	cmnvs	r7, #3031040	@ 0x2e4000
     f30:	bc050000 	stclt	0, cr0, [r5], {-0}
     f34:	0105e909 	tsteq	r5, r9, lsl #18
     f38:	09bd0500 	ldmibeq	sp!, {r8, sl}
     f3c:	0000cf90 	muleq	r0, r0, pc	@ <UNPREDICTABLE>
     f40:	bf09bf05 	svclt	0x0009bf05
     f44:	050000f4 	streq	r0, [r0, #-244]	@ 0xffffff0c
     f48:	3b0e09c0 	blcc	383650 <_Min_Stack_Size+0x383250>
     f4c:	c2050000 	andgt	r0, r5, #0
     f50:	00a73509 	adceq	r3, r7, r9, lsl #10
     f54:	09c30500 	stmibeq	r3, {r8, sl}^
