NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     f58:	000053e6 	andeq	r5, r0, r6, ror #7
     f5c:	f209c505 	vrshl.s8	d12, d5, d9
     f60:	0500006c 	streq	r0, [r0, #-108]	@ 0xffffff94
     f64:	064809c6 	strbeq	r0, [r8], -r6, asr #19
     f68:	c8050001 	stmdagt	r5, {r0}
     f6c:	01067509 	tsteq	r6, r9, lsl #10
     f70:	09c90500 	stmibeq	r9, {r8, sl}^
     f74:	000052a6 	andeq	r5, r0, r6, lsr #5
     f78:	6709cb05 	strvs	ip, [r9, -r5, lsl #22]
     f7c:	050000f9 	streq	r0, [r0, #-249]	@ 0xffffff07
     f80:	322809cc 	eorcc	r0, r8, #204, 18	@ 0x330000
     f84:	ce050000 	cdpgt	0, 0, cr0, cr5, cr0, {0}
     f88:	00968609 	addseq	r8, r6, r9, lsl #12
     f8c:	09cf0500 	stmibeq	pc, {r8, sl}^	@ <UNPREDICTABLE>
     f90:	00007e19 	andeq	r7, r0, r9, lsl lr
     f94:	fc09d105 	stc2	1, cr13, [r9], {5}
     f98:	050000e7 	streq	r0, [r0, #-231]	@ 0xffffff19
     f9c:	489509d2 	ldmmi	r5, {r1, r4, r6, r7, r8, fp}
     fa0:	d4050000 	strle	r0, [r5], #-0
     fa4:	00f8a609 	rscseq	sl, r8, r9, lsl #12
     fa8:	09d50500 	ldmibeq	r5, {r8, sl}^
     fac:	0000d857 	andeq	sp, r0, r7, asr r8
     fb0:	9009d705 	andls	sp, r9, r5, lsl #14
     fb4:	0500003b 	streq	r0, [r0, #-59]	@ 0xffffffc5
     fb8:	65cb09d8 	strbvs	r0, [fp, #2520]	@ 0x9d8
     fbc:	f1050000 			@ <UNDEFINED> instruction: 0xf1050000
     fc0:	00756009 	rsbseq	r6, r5, r9
     fc4:	09f20500 	ldmibeq	r2!, {r8, sl}^
     fc8:	0000a681 	andeq	sl, r0, r1, lsl #13
     fcc:	0209f405 	andeq	pc, r9, #83886080	@ 0x5000000
     fd0:	050000ba 	streq	r0, [r0, #-186]	@ 0xffffff46
     fd4:	630109f5 	movwvs	r0, #6645	@ 0x19f5
     fd8:	f7050000 			@ <UNDEFINED> instruction: 0xf7050000
     fdc:	004d2d09 	subeq	r2, sp, r9, lsl #26
     fe0:	09f80500 	ldmibeq	r8!, {r8, sl}^
     fe4:	0000cda3 	andeq	ip, r0, r3, lsr #27
     fe8:	1e09fa05 	vmlane.f32	s30, s18, s10
     fec:	050000e2 	streq	r0, [r0, #-226]	@ 0xffffff1e
     ff0:	db9509fb 	blle	fe5437e4 <_estack+0xde540fe4>
     ff4:	fd050000 	stc2	0, cr0, [r5, #-0]
     ff8:	00e02109 	rsceq	r2, r0, r9, lsl #2
     ffc:	09fe0500 	ldmibeq	lr!, {r8, sl}^
    1000:	00008314 	andeq	r8, r0, r4, lsl r3
    1004:	5a0a8005 	bpl	2a1020 <_Min_Stack_Size+0x2a0c20>
    1008:	05000091 	streq	r0, [r0, #-145]	@ 0xffffff6f
    100c:	82000a81 	andhi	r0, r0, #528384	@ 0x81000
    1010:	83050000 	movwhi	r0, #20480	@ 0x5000
    1014:	00fc730a 	rscseq	r7, ip, sl, lsl #6
    1018:	0a840500 	beq	fe102420 <_estack+0xde0ffc20>
    101c:	0000f6aa 	andeq	pc, r0, sl, lsr #13
    1020:	810a8605 	tsthi	sl, r5, lsl #12
    1024:	05000088 	streq	r0, [r0, #-136]	@ 0xffffff78
    1028:	97800a87 	strls	r0, [r0, r7, lsl #21]
    102c:	89050000 	stmdbhi	r5, {}	@ <UNPREDICTABLE>
    1030:	0082cb0a 	addeq	ip, r2, sl, lsl #22
    1034:	0a8a0500 	beq	fe28243c <_estack+0xde27fc3c>
    1038:	000076be 			@ <UNDEFINED> instruction: 0x000076be
    103c:	130a8c05 	movwne	r8, #44037	@ 0xac05
    1040:	05000103 	streq	r0, [r0, #-259]	@ 0xfffffefd
    1044:	d6690a8d 	strbtle	r0, [r9], -sp, lsl #21
    1048:	8f050000 	svchi	0x00050000
    104c:	00f62f0a 	rscseq	r2, r6, sl, lsl #30
    1050:	0a900500 	beq	fe402458 <_estack+0xde3ffc58>
    1054:	0000b2b8 			@ <UNDEFINED> instruction: 0x0000b2b8
    1058:	f50a9205 			@ <UNDEFINED> instruction: 0xf50a9205
    105c:	050000e9 	streq	r0, [r0, #-233]	@ 0xffffff17
    1060:	b20d0a93 	andlt	r0, sp, #602112	@ 0x93000
    1064:	96050000 	strls	r0, [r5], -r0
    1068:	00c3e40a 	sbceq	lr, r3, sl, lsl #8
    106c:	0a970500 	beq	fe5c2474 <_estack+0xde5bfc74>
    1070:	0000f746 	andeq	pc, r0, r6, asr #14
    1074:	670a9905 	strvs	r9, [sl, -r5, lsl #18]
    1078:	05000099 	streq	r0, [r0, #-153]	@ 0xffffff67
    107c:	5fb10a9a 	svcpl	0x00b10a9a
    1080:	9d050000 	stcls	0, cr0, [r5, #-0]
    1084:	00f28d0a 	rscseq	r8, r2, sl, lsl #26
    1088:	0a9e0500 	beq	fe782490 <_estack+0xde77fc90>
    108c:	0000d31a 	andeq	sp, r0, sl, lsl r3
    1090:	fa0aa005 	blx	2a90ac <_Min_Stack_Size+0x2a8cac>
    1094:	050000de 	streq	r0, [r0, #-222]	@ 0xffffff22
    1098:	9f520aa1 	svcls	0x00520aa1
    109c:	a3050000 	movwge	r0, #20480	@ 0x5000
    10a0:	00eafd0a 	rsceq	pc, sl, sl, lsl #26
    10a4:	0aa40500 	beq	fe9024ac <_estack+0xde8ffcac>
    10a8:	0000e3a1 	andeq	lr, r0, r1, lsr #7
    10ac:	ab0aa605 	blge	2aa8c8 <_Min_Stack_Size+0x2aa4c8>
    10b0:	050000bf 	streq	r0, [r0, #-191]	@ 0xffffff41
    10b4:	b3170aa7 	tstlt	r7, #684032	@ 0xa7000
    10b8:	a9050000 	stmdbge	r5, {}	@ <UNPREDICTABLE>
    10bc:	007be20a 	rsbseq	lr, fp, sl, lsl #4
    10c0:	0aaa0500 	beq	fea824c8 <_estack+0xdea7fcc8>
    10c4:	0000546f 	andeq	r5, r0, pc, ror #8
    10c8:	1e0aac05 	cdpne	12, 0, cr10, cr10, cr5, {0}
    10cc:	05000075 	streq	r0, [r0, #-117]	@ 0xffffff8b
    10d0:	a7490aad 	strbge	r0, [r9, -sp, lsr #21]
    10d4:	af050000 	svcge	0x00050000
    10d8:	00c99b0a 	sbceq	r9, r9, sl, lsl #22
    10dc:	0ab00500 	beq	fec024e4 <_estack+0xdebffce4>
    10e0:	00003dfe 	strdeq	r3, [r0], -lr
    10e4:	950ab205 	strls	fp, [sl, #-517]	@ 0xfffffdfb
    10e8:	0500008b 	streq	r0, [r0, #-139]	@ 0xffffff75
    10ec:	98730ab3 	ldmdals	r3!, {r0, r1, r4, r5, r7, r9, fp}^
    10f0:	b5050000 	strlt	r0, [r5, #-0]
    10f4:	004b770a 	subeq	r7, fp, sl, lsl #14
    10f8:	0ab60500 	beq	fed82500 <_estack+0xded7fd00>
    10fc:	00004c47 	andeq	r4, r0, r7, asr #24
    1100:	e40ab805 	str	fp, [sl], #-2053	@ 0xfffff7fb
    1104:	050000a9 	streq	r0, [r0, #-169]	@ 0xffffff57
    1108:	04e40ab9 	strbteq	r0, [r4], #2745	@ 0xab9
    110c:	bb050001 	bllt	141118 <_Min_Stack_Size+0x140d18>
    1110:	0053c40a 	subseq	ip, r3, sl, lsl #8
    1114:	0abc0500 	beq	fef0251c <_estack+0xdeeffd1c>
    1118:	0000c212 	andeq	ip, r0, r2, lsl r2
    111c:	480abe05 	stmdami	sl, {r0, r2, r9, sl, fp, ip, sp, pc}
    1120:	0500004f 	streq	r0, [r0, #-79]	@ 0xffffffb1
    1124:	fc030abf 	stc2	10, cr0, [r3], {191}	@ 0xbf	@ <UNPREDICTABLE>
    1128:	c1050000 	mrsgt	r0, (UNDEF: 5)
    112c:	00e4a30a 	rsceq	sl, r4, sl, lsl #6
    1130:	0ac20500 	beq	ff082538 <_estack+0xdf07fd38>
    1134:	00004cd2 	ldrdeq	r4, [r0], -r2
    1138:	ad0ad405 	cfstrsge	mvf13, [sl, #-20]	@ 0xffffffec
    113c:	050000de 	streq	r0, [r0, #-222]	@ 0xffffff22
    1140:	5e870adc 			@ <UNDEFINED> instruction: 0x5e870adc
    1144:	e9050000 	stmdb	r5, {}	@ <UNPREDICTABLE>
    1148:	00eb1e0a 	rsceq	r1, fp, sl, lsl #28
    114c:	0aea0500 	beq	ffa82554 <_estack+0xdfa7fd54>
    1150:	000057cd 	andeq	r5, r0, sp, asr #15
    1154:	fe0aeb05 	vseleq.f64	d14, d10, d5
    1158:	050000c6 	streq	r0, [r0, #-198]	@ 0xffffff3a
    115c:	46ab0aec 	strtmi	r0, [fp], ip, ror #21
    1160:	ed050000 	stc	0, cr0, [r5, #-0]
    1164:	00d39d0a 	sbcseq	r9, r3, sl, lsl #26
    1168:	0aee0500 	beq	ffb82570 <_estack+0xdfb7fd70>
    116c:	0000c094 	muleq	r0, r4, r0
    1170:	710aef05 	tstvc	sl, r5, lsl #30
    1174:	050000f8 	streq	r0, [r0, #-248]	@ 0xffffff08
    1178:	5ca40af0 	vstmiapl	r4!, {s0-s239}
    117c:	f2050000 	vhadd.s8	d0, d5, d0
    1180:	00fbb30a 	rscseq	fp, fp, sl, lsl #6
    1184:	0af30500 	beq	ffcc258c <_estack+0xdfcbfd8c>
    1188:	0000ed1f 	andeq	lr, r0, pc, lsl sp
    118c:	750af405 	strvc	pc, [sl, #-1029]	@ 0xfffffbfb
    1190:	050000c2 	streq	r0, [r0, #-194]	@ 0xffffff3e
    1194:	c14f0af5 	strdgt	r0, [pc, #-165]	@ 10f7 <_Min_Stack_Size+0xcf7>
    1198:	f6050000 			@ <UNDEFINED> instruction: 0xf6050000
    119c:	00e5ed0a 	rsceq	lr, r5, sl, lsl #26
    11a0:	0af70500 	beq	ffdc25a8 <_estack+0xdfdbfda8>
    11a4:	0000e041 	andeq	lr, r0, r1, asr #32
    11a8:	c70af805 	strgt	pc, [sl, -r5, lsl #16]
    11ac:	050000e4 	streq	r0, [r0, #-228]	@ 0xffffff1c
    11b0:	9f930af9 	svcls	0x00930af9
    11b4:	fc050000 	stc2	0, cr0, [r5], {-0}
    11b8:	0095860a 	addseq	r8, r5, sl, lsl #12
    11bc:	0afd0500 	beq	fff425c4 <_estack+0xdff3fdc4>
    11c0:	00003cdf 	ldrdeq	r3, [r0], -pc	@ <UNPREDICTABLE>
    11c4:	3e0b8d05 	cdpcc	13, 0, cr8, cr11, cr5, {0}
    11c8:	05000042 	streq	r0, [r0, #-66]	@ 0xffffffbe
    11cc:	bebb0b8e 			@ <UNDEFINED> instruction: 0xbebb0b8e
    11d0:	90050000 	andls	r0, r5, r0
    11d4:	006e610b 	rsbeq	r6, lr, fp, lsl #2
    11d8:	0b910500 	bleq	fe4425e0 <_estack+0xde43fde0>
    11dc:	0000ac38 	andeq	sl, r0, r8, lsr ip
    11e0:	d10b9405 	tstle	fp, r5, lsl #8
    11e4:	05000037 	streq	r0, [r0, #-55]	@ 0xffffffc9
    11e8:	e24a0b95 	sub	r0, sl, #152576	@ 0x25400
    11ec:	97050000 	strls	r0, [r5, -r0]
    11f0:	005e1b0b 	subseq	r1, lr, fp, lsl #22
    11f4:	0b980500 	bleq	fe6025fc <_estack+0xde5ffdfc>
    11f8:	00009f12 	andeq	r9, r0, r2, lsl pc
    11fc:	0f0b9a05 	svceq	0x000b9a05
    1200:	050000ce 	streq	r0, [r0, #-206]	@ 0xffffff32
    1204:	c8f30b9b 	ldmgt	r3!, {r0, r1, r3, r4, r7, r8, r9, fp}^
    1208:	bd050000 	stclt	0, cr0, [r5, #-0]
    120c:	0048300b 	subeq	r3, r8, fp
    1210:	0bbe0500 	bleq	fef82618 <_estack+0xdef7fe18>
    1214:	00006a85 	andeq	r6, r0, r5, lsl #21
    1218:	e70bbf05 	str	fp, [fp, -r5, lsl #30]
    121c:	0500005d 	streq	r0, [r0, #-93]	@ 0xffffffa3
    1220:	e47d0bc0 	ldrbt	r0, [sp], #-3008	@ 0xfffff440
    1224:	c1050000 	mrsgt	r0, (UNDEF: 5)
    1228:	00c1f00b 	sbceq	pc, r1, fp
    122c:	0bc20500 	bleq	ff082634 <_estack+0xdf07fe34>
    1230:	0000d375 	andeq	sp, r0, r5, ror r3
    1234:	c50bc305 	strgt	ip, [fp, #-773]	@ 0xfffffcfb
    1238:	05000069 	streq	r0, [r0, #-105]	@ 0xffffff97
    123c:	98470bc4 	stmdals	r7, {r2, r6, r7, r8, r9, fp}^
    1240:	c5050000 	strgt	r0, [r5, #-0]
    1244:	00e68e0b 	rsceq	r8, r6, fp, lsl #28
    1248:	0bc60500 	bleq	ff182650 <_estack+0xdf17fe50>
    124c:	000031a1 	andeq	r3, r0, r1, lsr #3
    1250:	b90bc705 	stmdblt	fp, {r0, r2, r8, r9, sl, lr, pc}
    1254:	0500009a 	streq	r0, [r0, #-154]	@ 0xffffff66
    1258:	839e0bc8 	orrshi	r0, lr, #200, 22	@ 0x32000
    125c:	d1050000 	mrsle	r0, (UNDEF: 5)
    1260:	00446d0b 	subeq	r6, r4, fp, lsl #26
    1264:	0bd20500 	bleq	ff48266c <_estack+0xdf47fe6c>
    1268:	0000960d 	andeq	r9, r0, sp, lsl #12
    126c:	f00bd505 			@ <UNDEFINED> instruction: 0xf00bd505
    1270:	050000f9 	streq	r0, [r0, #-249]	@ 0xffffff07
    1274:	32d80bd9 	sbcscc	r0, r8, #222208	@ 0x36400
    1278:	da050000 	ble	141280 <_Min_Stack_Size+0x140e80>
    127c:	0054ae0b 	subseq	sl, r4, fp, lsl #28
    1280:	0bdb0500 	bleq	ff6c2688 <_estack+0xdf6bfe88>
    1284:	00004a63 	andeq	r4, r0, r3, ror #20
    1288:	00000400 	andeq	r0, r0, r0, lsl #8
    128c:	f7ae2005 			@ <UNDEFINED> instruction: 0xf7ae2005
    1290:	22050000 	andcs	r0, r5, #0
    1294:	0000c9bc 			@ <UNDEFINED> instruction: 0x0000c9bc
    1298:	c5792305 	ldrbgt	r2, [r9, #-773]!	@ 0xfffffcfb
    129c:	24050000 	strcs	r0, [r5], #-0
    12a0:	0000e97e 	andeq	lr, r0, lr, ror r9
    12a4:	b1672505 	cmnlt	r7, r5, lsl #10
    12a8:	26050000 	strcs	r0, [r5], -r0
    12ac:	00003a2c 	andeq	r3, r0, ip, lsr #20
    12b0:	b8ba2705 	ldmlt	sl!, {r0, r2, r8, r9, sl, sp}
    12b4:	28050000 	stmdacs	r5, {}	@ <UNPREDICTABLE>
    12b8:	00004ad0 	ldrdeq	r4, [r0], -r0
    12bc:	b7992905 	ldrlt	r2, [r9, r5, lsl #18]
    12c0:	2a050000 	bcs	1412c8 <_Min_Stack_Size+0x140ec8>
    12c4:	0000ef8d 	andeq	lr, r0, sp, lsl #31
    12c8:	99e72b05 	stmibls	r7!, {r0, r2, r8, r9, fp, sp}^
    12cc:	2c050000 	stccs	0, cr0, [r5], {-0}
    12d0:	0000b191 	muleq	r0, r1, r1
    12d4:	f2df2d05 	vqdmull.s16	q9, d15, d5
    12d8:	2e050000 	cdpcs	0, 0, cr0, cr5, cr0, {0}
    12dc:	00008a6d 	andeq	r8, r0, sp, ror #20
    12e0:	73d82f05 	bicsvc	r2, r8, #5, 30
    12e4:	30050000 	andcc	r0, r5, r0
    12e8:	0000cb90 	muleq	r0, r0, fp
    12ec:	b5983105 	ldrlt	r3, [r8, #261]	@ 0x105
    12f0:	32050000 	andcc	r0, r5, #0
    12f4:	00008fbe 			@ <UNDEFINED> instruction: 0x00008fbe
    12f8:	454e3305 	strbmi	r3, [lr, #-773]	@ 0xfffffcfb
    12fc:	34050000 	strcc	r0, [r5], #-0
    1300:	0000652b 	andeq	r6, r0, fp, lsr #10
    1304:	a80f3505 	stmdage	pc, {r0, r2, r8, sl, ip, sp}	@ <UNPREDICTABLE>
    1308:	36050000 	strcc	r0, [r5], -r0
    130c:	0000d94e 	andeq	sp, r0, lr, asr #18
    1310:	a48b3705 	strge	r3, [fp], #1797	@ 0x705
    1314:	38050000 	stmdacc	r5, {}	@ <UNPREDICTABLE>
    1318:	0000aca1 	andeq	sl, r0, r1, lsr #25
    131c:	cbbb3905 	blgt	feecf738 <_estack+0xdeeccf38>
    1320:	3a050000 	bcc	141328 <_Min_Stack_Size+0x140f28>
    1324:	00003739 	andeq	r3, r0, r9, lsr r7
    1328:	f5d63b05 			@ <UNDEFINED> instruction: 0xf5d63b05
    132c:	3c050000 	stccc	0, cr0, [r5], {-0}
    1330:	0000d59c 	muleq	r0, ip, r5
    1334:	85da3d05 	ldrbhi	r3, [sl, #3333]	@ 0xd05
    1338:	3f050000 	svccc	0x00050000
    133c:	0000edd2 	ldrdeq	lr, [r0], -r2
    1340:	f9044005 			@ <UNDEFINED> instruction: 0xf9044005
    1344:	41050000 	mrsmi	r0, (UNDEF: 5)
    1348:	00006cc2 	andeq	r6, r0, r2, asr #25
    134c:	f38c4205 	vsubl.u8	q2, d12, d5
    1350:	43050000 	movwmi	r0, #20480	@ 0x5000
    1354:	00009cd8 	ldrdeq	r9, [r0], -r8
    1358:	df1a4405 	svcle	0x001a4405
    135c:	4b050000 	blmi	141364 <_Min_Stack_Size+0x140f64>
    1360:	000098e6 	andeq	r9, r0, r6, ror #17
    1364:	5af05805 	bpl	ffc17380 <_estack+0xdfc14b80>
    1368:	67050000 	strvs	r0, [r5, -r0]
    136c:	0000dc30 	andeq	sp, r0, r0, lsr ip
    1370:	f0f27b05 			@ <UNDEFINED> instruction: 0xf0f27b05
    1374:	85050000 	strhi	r0, [r5, #-0]
    1378:	008eb301 	addeq	fp, lr, r1, lsl #6
    137c:	01900500 	orrseq	r0, r0, r0, lsl #10
    1380:	00006554 	andeq	r6, r0, r4, asr r5
    1384:	03019d05 	movweq	r9, #7429	@ 0x1d05
    1388:	05000074 	streq	r0, [r0, #-116]	@ 0xffffff8c
    138c:	4b4901a2 	blmi	1241a1c <_Min_Stack_Size+0x124161c>
    1390:	a7050000 	strge	r0, [r5, -r0]
    1394:	008f0401 	addeq	r0, pc, r1, lsl #8
    1398:	01ac0500 			@ <UNDEFINED> instruction: 0x01ac0500
    139c:	0000c473 	andeq	ip, r0, r3, ror r4
    13a0:	2f01b105 	svccs	0x0001b105
    13a4:	0000008e 	andeq	r0, r0, lr, lsl #1
    13a8:	24020004 	strcs	r0, [r2], #-4
    13ac:	0700000a 	streq	r0, [r0, -sl]
    13b0:	00000000 	andeq	r0, r0, r0
    13b4:	03010003 	movweq	r0, #4099	@ 0x1003
    13b8:	08050507 	stmdaeq	r5, {r0, r1, r2, r8, sl}
    13bc:	0000a9c2 	andeq	sl, r0, r2, asr #19
    13c0:	05060a03 	streq	r0, [r6, #-2563]	@ 0xfffff5fd
    13c4:	00539808 	subseq	r9, r3, r8, lsl #16
    13c8:	070a0300 	streq	r0, [sl, -r0, lsl #6]
    13cc:	c36c0705 	cmngt	ip, #1310720	@ 0x140000
    13d0:	0a030000 	beq	c13d8 <_Min_Stack_Size+0xc0fd8>
    13d4:	00000708 	andeq	r0, r0, r8, lsl #14
    13d8:	07040000 	streq	r0, [r4, -r0]
    13dc:	00000000 	andeq	r0, r0, r0
    13e0:	090b0304 	stmdbeq	fp, {r2, r8, r9}
    13e4:	a6c50205 	strbge	r0, [r5], r5, lsl #4
    13e8:	04030000 	streq	r0, [r3], #-0
    13ec:	0000070a 	andeq	r0, r0, sl, lsl #14
    13f0:	03040000 	movweq	r0, #16384	@ 0x4000
    13f4:	00070b05 	andeq	r0, r7, r5, lsl #22
    13f8:	04000000 	streq	r0, [r0], #-0
    13fc:	00000007 	andeq	r0, r0, r7
    1400:	00070400 	andeq	r0, r7, r0, lsl #8
    1404:	04000000 	streq	r0, [r0], #-0
    1408:	050c0b03 	streq	r0, [ip, #-2819]	@ 0xfffff4fd
    140c:	00e3fa0b 	rsceq	pc, r3, fp, lsl #20
    1410:	060d0300 	streq	r0, [sp], -r0, lsl #6
    1414:	0d0e0304 	stceq	3, cr0, [lr, #-16]
    1418:	0015f007 	andseq	pc, r5, r7
    141c:	0f030400 	svceq	0x00030400
    1420:	0000070e 	andeq	r0, r0, lr, lsl #14
    1424:	18030000 	stmdane	r3, {}	@ <UNPREDICTABLE>
    1428:	0000070d 	andeq	r0, r0, sp, lsl #14
    142c:	03040000 	movweq	r0, #16384	@ 0x4000
    1430:	06050f1b 			@ <UNDEFINED> instruction: 0x06050f1b
    1434:	0001038c 	andeq	r0, r1, ip, lsl #7
    1438:	07100703 	ldreq	r0, [r0, -r3, lsl #14]
    143c:	00000000 	andeq	r0, r0, r0
    1440:	00070404 	andeq	r0, r7, r4, lsl #8
    1444:	04000000 	streq	r0, [r0], #-0
    1448:	00000007 	andeq	r0, r0, r7
    144c:	11220300 			@ <UNDEFINED> instruction: 0x11220300
    1450:	00000007 	andeq	r0, r0, r7
    1454:	00070400 	andeq	r0, r7, r0, lsl #8
    1458:	03000000 	movweq	r0, #0
    145c:	071203ca 	ldreq	r0, [r2, -sl, asr #7]
    1460:	00000000 	andeq	r0, r0, r0
    1464:	00000704 	andeq	r0, r0, r4, lsl #14
    1468:	03040000 	movweq	r0, #16384	@ 0x4000
    146c:	2b05130c 	blcs	1460a4 <_Min_Stack_Size+0x145ca4>
    1470:	0000c552 	andeq	ip, r0, r2, asr r5
    1474:	040d2f03 	streq	r2, [sp], #-3843	@ 0xfffff0fd
    1478:	00000007 	andeq	r0, r0, r7
    147c:	79070400 	stmdbvc	r7, {sl}
    1480:	03000017 	movweq	r0, #23
    1484:	00070d11 	andeq	r0, r7, r1, lsl sp
    1488:	04000000 	streq	r0, [r0], #-0
    148c:	05141403 	ldreq	r1, [r4, #-1027]	@ 0xfffffbfd
    1490:	0080d904 	addeq	sp, r0, r4, lsl #18
    1494:	18030400 	stmdane	r3, {sl}
    1498:	5d1e0515 	cfldr32pl	mvfx0, [lr, #-84]	@ 0xffffffac
    149c:	040000f2 	streq	r0, [r0], #-242	@ 0xffffff0e
    14a0:	0002a407 	andeq	sl, r2, r7, lsl #8
    14a4:	01bd0300 			@ <UNDEFINED> instruction: 0x01bd0300
    14a8:	03040416 	movweq	r0, #17430	@ 0x4416
    14ac:	09050308 	stmdbeq	r5, {r3, r8, r9}
    14b0:	0000a3dc 	ldrdeq	sl, [r0], -ip
    14b4:	05170b03 	ldreq	r0, [r7, #-2819]	@ 0xfffff4fd
    14b8:	00c1b209 	sbceq	fp, r1, r9, lsl #4
    14bc:	180a0300 	stmdane	sl, {r8, r9}
    14c0:	00000007 	andeq	r0, r0, r7
    14c4:	0c030400 	cfstrseq	mvf0, [r3], {-0}
    14c8:	b7090519 	smladlt	r9, r9, r5, r0
    14cc:	030000e2 	movweq	r0, #226	@ 0xe2
    14d0:	89071a0c 	stmdbhi	r7, {r2, r3, r9, fp, ip}
    14d4:	03000017 	movweq	r0, #23
    14d8:	00070d24 	andeq	r0, r7, r4, lsr #26
    14dc:	04000000 	streq	r0, [r0], #-0
    14e0:	77052705 	strvc	r2, [r5, -r5, lsl #14]
    14e4:	28030000 	stmdacs	r3, {}	@ <UNPREDICTABLE>
    14e8:	0000071b 	andeq	r0, r0, fp, lsl r7
    14ec:	07040000 	streq	r0, [r4, -r0]
    14f0:	000017a5 	andeq	r1, r0, r5, lsr #15
    14f4:	071c5503 	ldreq	r5, [ip, -r3, lsl #10]
    14f8:	00000000 	andeq	r0, r0, r0
    14fc:	00000704 	andeq	r0, r0, r4, lsl #14
    1500:	03040000 	movweq	r0, #16384	@ 0x4000
    1504:	08051d0d 	stmdaeq	r5, {r0, r2, r3, r8, sl, fp, ip}
    1508:	0000412d 	andeq	r4, r0, sp, lsr #2
    150c:	040a0a03 	streq	r0, [sl], #-2563	@ 0xfffff5fd
    1510:	00000007 	andeq	r0, r0, r7
    1514:	0d100300 	ldceq	3, cr0, [r0, #-0]
    1518:	00000007 	andeq	r0, r0, r7
    151c:	14030400 	strne	r0, [r3], #-1024	@ 0xfffffc00
    1520:	c202051e 	andgt	r0, r2, #125829120	@ 0x7800000
    1524:	0400004e 	streq	r0, [r0], #-78	@ 0xffffffb2
    1528:	071f1603 	ldreq	r1, [pc, -r3, lsl #12]
    152c:	00000000 	andeq	r0, r0, r0
    1530:	00000704 	andeq	r0, r0, r4, lsl #14
    1534:	03040000 	movweq	r0, #16384	@ 0x4000
    1538:	0903200e 	stmdbeq	r3, {r1, r2, r3, sp}
    153c:	7c0a0521 	cfstr32vc	mvfx0, [sl], {33}	@ 0x21
    1540:	03000089 	movweq	r0, #137	@ 0x89
    1544:	0007220d 	andeq	r2, r7, sp, lsl #4
    1548:	04000000 	streq	r0, [r0], #-0
    154c:	07230e03 	streq	r0, [r3, -r3, lsl #28]!
    1550:	00000000 	andeq	r0, r0, r0
    1554:	00000704 	andeq	r0, r0, r4, lsl #14
    1558:	05040000 	streq	r0, [r4, #-0]
    155c:	0089730d 	addeq	r7, r9, sp, lsl #6
    1560:	00070400 	andeq	r0, r7, r0, lsl #8
    1564:	04000000 	streq	r0, [r0], #-0
    1568:	00000007 	andeq	r0, r0, r7
    156c:	0c030400 	cfstrseq	mvf0, [r3], {-0}
    1570:	02c40724 	sbceq	r0, r4, #36, 14	@ 0x900000
    1574:	63030000 	movwvs	r0, #12288	@ 0x3000
    1578:	e6200525 	strt	r0, [r0], -r5, lsr #10
    157c:	03000066 	movweq	r0, #102	@ 0x66
    1580:	ec07263f 	stc	6, cr2, [r7], {63}	@ 0x3f
    1584:	04000002 	streq	r0, [r0], #-2
    1588:	00030807 	andeq	r0, r3, r7, lsl #16
    158c:	27780300 	ldrbcs	r0, [r8, -r0, lsl #6]!
    1590:	4b631a05 	blmi	18c7dac <_Min_Stack_Size+0x18c79ac>
    1594:	3b030000 	blcc	c159c <_Min_Stack_Size+0xc119c>
    1598:	032a0728 			@ <UNDEFINED> instruction: 0x032a0728
    159c:	04040000 	streq	r0, [r4], #-0
    15a0:	00041507 	andeq	r1, r4, r7, lsl #10
    15a4:	0e9a0300 	cdpeq	3, 9, cr0, cr10, cr0, {0}
    15a8:	12890729 	addne	r0, r9, #10747904	@ 0xa40000
    15ac:	05040000 	streq	r0, [r4, #-0]
    15b0:	66400eed 	strbvs	r0, [r0], -sp, ror #29
    15b4:	03040000 	movweq	r0, #16384	@ 0x4000
    15b8:	1b052a64 	blne	14bf50 <_Min_Stack_Size+0x14bb50>
    15bc:	0000a190 	muleq	r0, r0, r1
    15c0:	0d030404 	cfstrseq	mvf0, [r3, #-16]
    15c4:	0e030425 	cdpeq	4, 0, cr0, cr3, cr5, {1}
    15c8:	001a0702 	andseq	r0, sl, r2, lsl #14
    15cc:	04040000 	streq	r0, [r4], #-0
    15d0:	04020903 	streq	r0, [r2], #-2307	@ 0xfffff6fd
    15d4:	05040a03 	streq	r0, [r4, #-2563]	@ 0xfffff5fd
    15d8:	009a6309 	addseq	r6, sl, r9, lsl #6
    15dc:	030d0300 	movweq	r0, #54016	@ 0xd300
    15e0:	040f0504 	streq	r0, [pc], #-1284	@ 15e8 <_Min_Stack_Size+0x11e8>
    15e4:	04000073 	streq	r0, [r0], #-115	@ 0xffffff8d
    15e8:	0a260b05 	beq	984204 <_Min_Stack_Size+0x983e04>
    15ec:	00040001 	andeq	r0, r4, r1
    15f0:	05000004 	streq	r0, [r0, #-4]
    15f4:	00abfc27 	adceq	pc, fp, r7, lsr #24
    15f8:	e8280500 	stmda	r8!, {r8, sl}
    15fc:	050000e0 	streq	r0, [r0, #-224]	@ 0xffffff20
    1600:	00abf72a 	adceq	pc, fp, sl, lsr #14
    1604:	01840500 	orreq	r0, r4, r0, lsl #10
    1608:	00006015 	andeq	r6, r0, r5, lsl r0
    160c:	be018505 	cfsh32lt	mvfx8, mvfx1, #5
    1610:	05000040 	streq	r0, [r0, #-64]	@ 0xffffffc0
    1614:	cd6b0186 	stfgte	f0, [fp, #-536]!	@ 0xfffffde8
    1618:	87050000 	strhi	r0, [r5, -r0]
    161c:	00b70801 	adcseq	r0, r7, r1, lsl #16
    1620:	01880500 	orreq	r0, r8, r0, lsl #10
    1624:	0000e41c 	andeq	lr, r0, ip, lsl r4
    1628:	18018905 	stmdane	r1, {r0, r2, r8, fp, pc}
    162c:	050000e4 	streq	r0, [r0, #-228]	@ 0xffffff1c
    1630:	d887018a 	stmle	r7, {r1, r3, r7, r8}
    1634:	8b050000 	blhi	14163c <_Min_Stack_Size+0x14123c>
    1638:	00601101 	rsbeq	r1, r0, r1, lsl #2
    163c:	018c0500 	orreq	r0, ip, r0, lsl #10
    1640:	00006c33 	andeq	r6, r0, r3, lsr ip
    1644:	63018d05 	movwvs	r8, #7429	@ 0x1d05
    1648:	06000107 	streq	r0, [r0], -r7, lsl #2
    164c:	b2f7019e 	rscslt	r0, r7, #-2147483609	@ 0x80000027
    1650:	b9050000 	stmdblt	r5, {}	@ <UNPREDICTABLE>
    1654:	00a67501 	adceq	r7, r6, r1, lsl #10
    1658:	01ba0500 			@ <UNDEFINED> instruction: 0x01ba0500
    165c:	0000fd7b 	andeq	pc, r0, fp, ror sp	@ <UNPREDICTABLE>
    1660:	bd01bb05 	vstrlt	d11, [r1, #-20]	@ 0xffffffec
    1664:	050000c7 	streq	r0, [r0, #-199]	@ 0xffffff39
    1668:	9db901bc 	ldflss	f0, [r9, #752]!	@ 0x2f0
    166c:	bd050000 	stclt	0, cr0, [r5, #-0]
    1670:	00545001 	subseq	r5, r4, r1
    1674:	01be0500 			@ <UNDEFINED> instruction: 0x01be0500
    1678:	0000bc3b 	andeq	fp, r0, fp, lsr ip
    167c:	7401bf05 	strvc	fp, [r1], #-3845	@ 0xfffff0fb
    1680:	050000ba 	streq	r0, [r0, #-186]	@ 0xffffff46
    1684:	a96501c0 	stmdbge	r5!, {r6, r7, r8}^
    1688:	c1050000 	mrsgt	r0, (UNDEF: 5)
    168c:	00a96101 	adceq	r6, r9, r1, lsl #2
    1690:	01c20500 	biceq	r0, r2, r0, lsl #10
    1694:	000047c5 	andeq	r4, r0, r5, asr #15
    1698:	5501c305 	strpl	ip, [r1, #-773]	@ 0xfffffcfb
    169c:	050000c7 	streq	r0, [r0, #-199]	@ 0xffffff39
    16a0:	47c101c4 	strbmi	r0, [r1, r4, asr #3]
    16a4:	c5050000 	strgt	r0, [r5, #-0]
    16a8:	005c5d01 	subseq	r5, ip, r1, lsl #26
    16ac:	01c60500 	biceq	r0, r6, r0, lsl #10
    16b0:	0000f576 	andeq	pc, r0, r6, ror r5	@ <UNPREDICTABLE>
    16b4:	3401c705 	strcc	ip, [r1], #-1797	@ 0xfffff8fb
    16b8:	0500007f 	streq	r0, [r0, #-127]	@ 0xffffff81
    16bc:	c7b901c8 	ldrgt	r0, [r9, r8, asr #3]!
    16c0:	c9050000 	stmdbgt	r5, {}	@ <UNPREDICTABLE>
    16c4:	00dfe101 	sbcseq	lr, pc, r1, lsl #2
    16c8:	01d00500 	bicseq	r0, r0, r0, lsl #10
    16cc:	0000636d 	andeq	r6, r0, sp, ror #6
    16d0:	0301ed06 	movweq	lr, #7430	@ 0x1d06
    16d4:	05000086 	streq	r0, [r0, #-134]	@ 0xffffff7a
    16d8:	9388028b 	orrls	r0, r8, #-1342177272	@ 0xb0000008
    16dc:	8c050000 	stchi	0, cr0, [r5], {-0}
    16e0:	003a7802 	eorseq	r7, sl, r2, lsl #16
    16e4:	028d0500 	addeq	r0, sp, #0, 10
    16e8:	00008359 	andeq	r8, r0, r9, asr r3
    16ec:	cc028e05 	stcgt	14, cr8, [r2], {5}
    16f0:	050000bf 	streq	r0, [r0, #-191]	@ 0xffffff41
    16f4:	dfd7028f 	svcle	0x00d7028f
    16f8:	90050000 	andls	r0, r5, r0
    16fc:	00e42902 	rsceq	r2, r4, r2, lsl #18
    1700:	02910500 	addseq	r0, r1, #0, 10
    1704:	0000d900 	andeq	sp, r0, r0, lsl #18
    1708:	fc029205 	stc2	2, cr9, [r2], {5}
    170c:	050000d8 	streq	r0, [r0, #-216]	@ 0xffffff28
    1710:	71a10293 			@ <UNDEFINED> instruction: 0x71a10293
    1714:	94050000 	strls	r0, [r5], #-0
