NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    1718:	00b44102 	adcseq	r4, r4, r2, lsl #2
    171c:	02950500 	addseq	r0, r5, #0, 10
    1720:	000061f2 	strdeq	r6, [r0], -r2
    1724:	c6029605 	strgt	r9, [r2], -r5, lsl #12
    1728:	05000049 	streq	r0, [r0, #-73]	@ 0xffffffb7
    172c:	61ed0297 			@ <UNDEFINED> instruction: 0x61ed0297
    1730:	98050000 	stmdals	r5, {}	@ <UNPREDICTABLE>
    1734:	00835502 	addeq	r5, r3, r2, lsl #10
    1738:	02990500 	addseq	r0, r9, #0, 10
    173c:	00003abd 			@ <UNDEFINED> instruction: 0x00003abd
    1740:	1f029a05 	svcne	0x00029a05
    1744:	060000c1 	streq	r0, [r0], -r1, asr #1
    1748:	855d02a7 	ldrbhi	r0, [sp, #-679]	@ 0xfffffd59
    174c:	dd060000 	stcle	0, cr0, [r6, #-0]
    1750:	00cd2702 	sbceq	r2, sp, r2, lsl #14
    1754:	038f0600 	orreq	r0, pc, #0, 12
    1758:	0000583a 	andeq	r5, r0, sl, lsr r8
    175c:	f5039405 			@ <UNDEFINED> instruction: 0xf5039405
    1760:	060000c9 	streq	r0, [r0], -r9, asr #1
    1764:	a0b4039a 	umlalsge	r0, r4, sl, r3
    1768:	9f050000 	svcls	0x00050000
    176c:	00a0c003 	adceq	ip, r0, r3
    1770:	03a40500 			@ <UNDEFINED> instruction: 0x03a40500
    1774:	0000fc46 	andeq	pc, r0, r6, asr #24
    1778:	00000400 	andeq	r0, r0, r0, lsl #8
    177c:	85030f05 	strhi	r0, [r3, #-3845]	@ 0xfffff0fb
    1780:	10050000 	andne	r0, r5, r0
    1784:	0000c8c9 	andeq	ip, r0, r9, asr #17
    1788:	00000400 	andeq	r0, r0, r0, lsl #8
    178c:	a53b1b05 	ldrge	r1, [fp, #-2821]!	@ 0xfffff4fb
    1790:	1f050000 	svcne	0x00050000
    1794:	000060e5 	andeq	r6, r0, r5, ror #1
    1798:	85032105 	strhi	r2, [r3, #-261]	@ 0xfffffefb
    179c:	22050000 	andcs	r0, r5, #0
    17a0:	0000c8c9 	andeq	ip, r0, r9, asr #17
    17a4:	00000400 	andeq	r0, r0, r0, lsl #8
    17a8:	437a2f05 	cmnmi	sl, #5, 30
    17ac:	43050000 	movwmi	r0, #20480	@ 0x5000
    17b0:	000092d1 	ldrdeq	r9, [r0], -r1
    17b4:	e59f4d05 	ldr	r4, [pc, #3333]	@ 24c1 <_Min_Stack_Size+0x20c1>
    17b8:	52050000 	andpl	r0, r5, #0
    17bc:	0000d9a8 	andeq	sp, r0, r8, lsr #19
    17c0:	02000400 	andeq	r0, r0, #0, 8
    17c4:	00001369 	andeq	r1, r0, r9, ror #6
    17c8:	00000007 	andeq	r0, r0, r7
    17cc:	01000300 	mrseq	r0, LR_irq
    17d0:	05060c03 	streq	r0, [r6, #-3075]	@ 0xfffff3fd
    17d4:	011b8409 	tsteq	fp, r9, lsl #8
    17d8:	050b0300 	streq	r0, [fp, #-768]	@ 0xfffffd00
    17dc:	c1b20905 			@ <UNDEFINED> instruction: 0xc1b20905
    17e0:	0a030000 	beq	c17e8 <_Min_Stack_Size+0xc13e8>
    17e4:	00000707 	andeq	r0, r0, r7, lsl #14
    17e8:	03040000 	movweq	r0, #16384	@ 0x4000
    17ec:	0905040c 	stmdbeq	r5, {r2, r3, sl}
    17f0:	0000e2b7 			@ <UNDEFINED> instruction: 0x0000e2b7
    17f4:	05080c03 	streq	r0, [r8, #-3075]	@ 0xfffff3fd
    17f8:	00a53b1b 	adceq	r3, r5, fp, lsl fp
    17fc:	091d0300 	ldmdbeq	sp, {r8, r9}
    1800:	53980805 	orrspl	r0, r8, #327680	@ 0x50000
    1804:	0a030000 	beq	c180c <_Min_Stack_Size+0xc140c>
    1808:	6c07050a 	cfstr32vs	mvfx0, [r7], {10}
    180c:	030000c3 	movweq	r0, #195	@ 0xc3
    1810:	00070b0a 	andeq	r0, r7, sl, lsl #22
    1814:	04000000 	streq	r0, [r0], #-0
    1818:	00000007 	andeq	r0, r0, r7
    181c:	0b030400 	bleq	c2824 <_Min_Stack_Size+0xc2424>
    1820:	c502050c 	strgt	r0, [r2, #-1292]	@ 0xfffffaf4
    1824:	030000a6 	movweq	r0, #166	@ 0xa6
    1828:	00070d04 	andeq	r0, r7, r4, lsl #26
    182c:	04000000 	streq	r0, [r0], #-0
    1830:	070e0503 	streq	r0, [lr, -r3, lsl #10]
    1834:	00000000 	andeq	r0, r0, r0
    1838:	00000704 	andeq	r0, r0, r4, lsl #14
    183c:	07040000 	streq	r0, [r4, -r0]
    1840:	00000000 	andeq	r0, r0, r0
    1844:	00000704 	andeq	r0, r0, r4, lsl #14
    1848:	23030000 	movwcs	r0, #12288	@ 0x3000
    184c:	522b050f 	eorpl	r0, fp, #62914560	@ 0x3c00000
    1850:	030000c5 	movweq	r0, #197	@ 0xc5
    1854:	0007022d 	andeq	r0, r7, sp, lsr #4
    1858:	04000000 	streq	r0, [r0], #-0
    185c:	07102f03 	ldreq	r2, [r0, -r3, lsl #30]
    1860:	00000000 	andeq	r0, r0, r0
    1864:	00000704 	andeq	r0, r0, r4, lsl #14
    1868:	03040000 	movweq	r0, #16384	@ 0x4000
    186c:	00071024 	andeq	r1, r7, r4, lsr #32
    1870:	04000000 	streq	r0, [r0], #-0
    1874:	77052705 	strvc	r2, [r5, -r5, lsl #14]
    1878:	28030000 	stmdacs	r3, {}	@ <UNPREDICTABLE>
    187c:	00000711 	andeq	r0, r0, r1, lsl r7
    1880:	05040000 	streq	r0, [r4, #-0]
    1884:	00437a2f 	subeq	r7, r3, pc, lsr #20
    1888:	123c0300 	eorsne	r0, ip, #0, 6
    188c:	e3fa0b05 	mvns	r0, #5120	@ 0x1400
    1890:	0d030000 	stceq	0, cr0, [r3, #-0]
    1894:	0e030409 	cdpeq	4, 0, cr0, cr3, cr9, {0}
    1898:	0f030410 	svceq	0x00030410
    189c:	00000713 	andeq	r0, r0, r3, lsl r7
    18a0:	18030000 	stmdane	r3, {}	@ <UNPREDICTABLE>
    18a4:	00000710 	andeq	r0, r0, r0, lsl r7
    18a8:	03040000 	movweq	r0, #16384	@ 0x4000
    18ac:	0605141b 			@ <UNDEFINED> instruction: 0x0605141b
    18b0:	0001038c 	andeq	r0, r1, ip, lsl #7
    18b4:	00000704 	andeq	r0, r0, r4, lsl #14
    18b8:	07040000 	streq	r0, [r4, -r0]
    18bc:	00000000 	andeq	r0, r0, r0
    18c0:	07152203 	ldreq	r2, [r5, -r3, lsl #4]
    18c4:	00000000 	andeq	r0, r0, r0
    18c8:	00000704 	andeq	r0, r0, r4, lsl #14
    18cc:	ca030000 	bgt	c18d4 <_Min_Stack_Size+0xc14d4>
    18d0:	00071603 	andeq	r1, r7, r3, lsl #12
    18d4:	04000000 	streq	r0, [r0], #-0
    18d8:	00000007 	andeq	r0, r0, r7
    18dc:	00070400 	andeq	r0, r7, r0, lsl #8
    18e0:	03000000 	movweq	r0, #0
    18e4:	00071755 	andeq	r1, r7, r5, asr r7
    18e8:	04000000 	streq	r0, [r0], #-0
    18ec:	00000007 	andeq	r0, r0, r7
    18f0:	0d030400 	cfstrseq	mvf0, [r3, #-0]
    18f4:	2d080518 	cfstr32cs	mvfx0, [r8, #-96]	@ 0xffffffa0
    18f8:	03000041 	movweq	r0, #65	@ 0x41
    18fc:	07040d0a 	streq	r0, [r4, -sl, lsl #26]
    1900:	00000000 	andeq	r0, r0, r0
    1904:	07101003 	ldreq	r1, [r0, -r3]
    1908:	00000000 	andeq	r0, r0, r0
    190c:	19140304 	ldmdbne	r4, {r2, r8, r9}
    1910:	4ec20205 	cdpmi	2, 12, cr0, cr2, cr5, {0}
    1914:	03040000 	movweq	r0, #16384	@ 0x4000
    1918:	00071a16 	andeq	r1, r7, r6, lsl sl
    191c:	04000000 	streq	r0, [r0], #-0
    1920:	00000007 	andeq	r0, r0, r7
    1924:	0e030400 	cfcpyseq	mvf0, mvf3
    1928:	1c09031b 	stcne	3, cr0, [r9], {27}
    192c:	897c0a05 	ldmdbhi	ip!, {r0, r2, r9, fp}^
    1930:	0d030000 	stceq	0, cr0, [r3, #-0]
    1934:	0000071d 	andeq	r0, r0, sp, lsl r7
    1938:	03040000 	movweq	r0, #16384	@ 0x4000
    193c:	0007030e 	andeq	r0, r7, lr, lsl #6
    1940:	04000000 	streq	r0, [r0], #-0
    1944:	00000007 	andeq	r0, r0, r7
    1948:	0d050400 	cfstrseq	mvf0, [r5, #-0]
    194c:	00008973 	andeq	r8, r0, r3, ror r9
    1950:	00000704 	andeq	r0, r0, r4, lsl #14
    1954:	07040000 	streq	r0, [r4, -r0]
    1958:	00000000 	andeq	r0, r0, r0
    195c:	196b0704 	stmdbne	fp!, {r2, r8, r9, sl}^
    1960:	05040000 	streq	r0, [r4, #-0]
    1964:	010afe0e 	tsteq	sl, lr, lsl #28	@ <UNPREDICTABLE>
    1968:	04000400 	streq	r0, [r0], #-1024	@ 0xfffffc00
    196c:	26050000 	strcs	r0, [r5], -r0
    1970:	000112b0 			@ <UNDEFINED> instruction: 0x000112b0
    1974:	1bbf2705 	blne	fefcb590 <_estack+0xdefc8d90>
    1978:	28050001 	stmdacs	r5, {r0}
    197c:	00011ba4 	andeq	r1, r1, r4, lsr #23
    1980:	1ea42905 	vfmane.f16	s4, s8, s10	@ <UNPREDICTABLE>
    1984:	2a050001 	bcs	141990 <_Min_Stack_Size+0x141590>
    1988:	00011928 	andeq	r1, r1, r8, lsr #18
    198c:	12fb2b05 	rscsne	r2, fp, #5120	@ 0x1400
    1990:	2c050001 	stccs	0, cr0, [r5], {1}
    1994:	00011436 	andeq	r1, r1, r6, lsr r4
    1998:	0f902d05 	svceq	0x00902d05
    199c:	2e050001 	cdpcs	0, 0, cr0, cr5, cr1, {0}
    19a0:	00011eac 	andeq	r1, r1, ip, lsr #29
    19a4:	0e7e2f05 	cdpeq	15, 7, cr2, cr14, cr5, {0}
    19a8:	30050001 	andcc	r0, r5, r1
    19ac:	00010c9a 	muleq	r1, sl, ip
    19b0:	19733105 	ldmdbne	r3!, {r0, r2, r8, ip, sp}^
    19b4:	32050001 	andcc	r0, r5, #1
    19b8:	00010cfd 	strdeq	r0, [r1], -sp
    19bc:	13893305 	orrne	r3, r9, #335544320	@ 0x14000000
    19c0:	34050001 	strcc	r0, [r5], #-1
    19c4:	00010da2 	andeq	r0, r1, r2, lsr #27
    19c8:	1dbd3505 	cfldr32ne	mvfx3, [sp, #20]!
    19cc:	38050001 	stmdacc	r5, {r0}
    19d0:	00011212 	andeq	r1, r1, r2, lsl r2
    19d4:	0d073905 	vstreq.16	s6, [r7, #-10]	@ <UNPREDICTABLE>
    19d8:	3a050001 	bcc	1419e4 <_Min_Stack_Size+0x1415e4>
    19dc:	00010ec9 	andeq	r0, r1, r9, asr #29
    19e0:	10393b05 	eorsne	r3, r9, r5, lsl #22
    19e4:	3c050001 	stccc	0, cr0, [r5], {1}
    19e8:	000118e5 	andeq	r1, r1, r5, ror #17
    19ec:	1f303d05 	svcne	0x00303d05
    19f0:	3e050001 	cdpcc	0, 0, cr0, cr5, cr1, {0}
    19f4:	000115ed 	andeq	r1, r1, sp, ror #11
    19f8:	0f433f05 	svceq	0x00433f05
    19fc:	40050001 	andmi	r0, r5, r1
    1a00:	00011930 	andeq	r1, r1, r0, lsr r9
    1a04:	0e864105 	rmfeqs	f4, f6, f5
    1a08:	42050001 	andmi	r0, r5, #1
    1a0c:	00011182 	andeq	r1, r1, r2, lsl #3
    1a10:	11ca4305 	bicne	r4, sl, r5, lsl #6
    1a14:	44050001 	strmi	r0, [r5], #-1
    1a18:	00011dd6 	ldrdeq	r1, [r1], -r6
    1a1c:	12684505 	rsbne	r4, r8, #20971520	@ 0x1400000
    1a20:	46050001 	strmi	r0, [r5], -r1
    1a24:	00010c52 	andeq	r0, r1, r2, asr ip
    1a28:	17724705 	ldrbne	r4, [r2, -r5, lsl #14]!
    1a2c:	4a050001 	bmi	141a38 <_Min_Stack_Size+0x141638>
    1a30:	00011817 	andeq	r1, r1, r7, lsl r8
    1a34:	10f14b05 	rscsne	r4, r1, r5, lsl #22
    1a38:	4c050001 	stcmi	0, cr0, [r5], {1}
    1a3c:	00011e61 	andeq	r1, r1, r1, ror #28
    1a40:	13e84d05 	mvnne	r4, #320	@ 0x140
    1a44:	4e050001 	cdpmi	0, 0, cr0, cr5, cr1, {0}
    1a48:	000114fd 	strdeq	r1, [r1], -sp
    1a4c:	19c64f05 	stmibne	r6, {r0, r2, r8, r9, sl, fp, lr}^
    1a50:	50050001 	andpl	r0, r5, r1
    1a54:	00011346 	andeq	r1, r1, r6, asr #6
    1a58:	1aa05105 	bne	fe815e74 <_estack+0xde813674>
    1a5c:	52050001 	andpl	r0, r5, #1
    1a60:	00011e1e 	andeq	r1, r1, lr, lsl lr
    1a64:	0aa25305 	beq	fe896680 <_estack+0xde893e80>
    1a68:	54050001 	strpl	r0, [r5], #-1
    1a6c:	00011630 	andeq	r1, r1, r0, lsr r6
    1a70:	0bfb5505 	bleq	ffed6e8c <_estack+0xdfed468c>
    1a74:	56050001 	strpl	r0, [r5], -r1
    1a78:	00011bc7 	andeq	r1, r1, r7, asr #23
    1a7c:	0fe05705 	svceq	0x00e05705
    1a80:	58050001 	stmdapl	r5, {r0}
    1a84:	00011a09 	andeq	r1, r1, r9, lsl #20
    1a88:	113a5905 	teqne	sl, r5, lsl #18
    1a8c:	5c050001 	stcpl	0, cr0, [r5], {1}
    1a90:	000116fe 	strdeq	r1, [r1], -lr
    1a94:	0dbb5d05 	ldceq	13, cr5, [fp, #20]!
    1a98:	5e050001 	cdppl	0, 0, cr0, cr5, cr1, {0}
    1a9c:	0001197d 	andeq	r1, r1, sp, ror r9
    1aa0:	15aa5f05 	strne	r5, [sl, #3845]!	@ 0xf05
    1aa4:	60050001 	andvs	r0, r5, r1
    1aa8:	00010cba 			@ <UNDEFINED> instruction: 0x00010cba
    1aac:	13936105 	orrsne	r6, r3, #1073741825	@ 0x40000001
    1ab0:	62050001 	andvs	r0, r5, #1
    1ab4:	0001148b 	andeq	r1, r1, fp, lsl #9
    1ab8:	16bb6305 	ldrtne	r6, [fp], r5, lsl #6
    1abc:	64050001 	strvs	r0, [r5], #-1
    1ac0:	00010b70 	andeq	r0, r1, r0, ror fp
    1ac4:	1c806505 	cfstr32ne	mvfx6, [r0], {5}
    1ac8:	66050001 	strvs	r0, [r5], -r1
    1acc:	000117ba 			@ <UNDEFINED> instruction: 0x000117ba
    1ad0:	15626705 	strbne	r6, [r2, #-1797]!	@ 0xfffff8fb
    1ad4:	68050001 	stmdavs	r5, {r0}
    1ad8:	00011b3c 	andeq	r1, r1, ip, lsr fp
    1adc:	14436905 	strbne	r6, [r3], #-2309	@ 0xfffff6fb
    1ae0:	6a050001 	bvs	141aec <_Min_Stack_Size+0x1416ec>
    1ae4:	00010e18 	andeq	r0, r1, r8, lsl lr
    1ae8:	1d326b05 	fldmdbxne	r2!, {d6-d7}	@ Deprecated
    1aec:	6e050001 	cdpvs	0, 0, cr0, cr5, cr1, {0}
    1af0:	000118a2 	andeq	r1, r1, r2, lsr #17
    1af4:	1a586f05 	bne	161d710 <_Min_Stack_Size+0x161d310>
    1af8:	70050001 	andvc	r0, r5, r1
    1afc:	00011c3d 	andeq	r1, r1, sp, lsr ip
    1b00:	13037105 	movwne	r7, #12549	@ 0x3105
    1b04:	72050001 	andvc	r0, r5, #1
    1b08:	00011d7a 	andeq	r1, r1, sl, ror sp
    1b0c:	12b87305 	adcsne	r7, r8, #335544320	@ 0x14000000
    1b10:	74050001 	strvc	r0, [r5], #-1
    1b14:	00010a50 	andeq	r0, r1, r0, asr sl
    1b18:	16787505 	ldrbtne	r7, [r8], -r5, lsl #10
    1b1c:	76050001 	strvc	r0, [r5], -r1
    1b20:	00010d5f 	andeq	r0, r1, pc, asr sp
    1b24:	1ed07705 	cdpne	7, 13, cr7, cr0, cr5, {0}
    1b28:	78050001 	stmdavc	r5, {r0}
    1b2c:	00011f73 	andeq	r1, r1, r3, ror pc
    1b30:	0f987905 	svceq	0x00987905
    1b34:	7a050001 	bvc	141b40 <_Min_Stack_Size+0x141740>
    1b38:	00010bb3 			@ <UNDEFINED> instruction: 0x00010bb3
    1b3c:	1af47b05 	bne	ffd20758 <_estack+0xdfd1df58>
    1b40:	7c050001 	stcvc	0, cr0, [r5], {1}
    1b44:	0001185a 	andeq	r1, r1, sl, asr r8
    1b48:	10a97d05 	adcne	r7, r9, r5, lsl #26
    1b4c:	80050001 	andhi	r0, r5, r1
    1b50:	010f2d01 	tsteq	pc, r1, lsl #26
    1b54:	01810500 	orreq	r0, r1, r0, lsl #10
    1b58:	00010f0c 	andeq	r0, r1, ip, lsl #30
    1b5c:	40018205 	andmi	r8, r1, r5, lsl #4
    1b60:	05000115 	streq	r0, [r0, #-277]	@ 0xfffffeeb
    1b64:	13d60185 	bicsne	r0, r6, #1073741857	@ 0x40000021
    1b68:	86050001 	strhi	r0, [r5], -r1
    1b6c:	010dfe01 	tsteq	sp, r1, lsl #28	@ <UNPREDICTABLE>
    1b70:	00040000 	andeq	r0, r4, r0
    1b74:	001e5c02 	andseq	r5, lr, r2, lsl #24
    1b78:	00000700 	andeq	r0, r0, r0, lsl #14
    1b7c:	00030000 	andeq	r0, r3, r0
    1b80:	06070301 	streq	r0, [r7], -r1, lsl #6
    1b84:	227f0905 	rsbscs	r0, pc, #81920	@ 0x14000
    1b88:	0a030001 	beq	c1b94 <_Min_Stack_Size+0xc1794>
    1b8c:	b2090505 	andlt	r0, r9, #20971520	@ 0x1400000
    1b90:	030000c1 	movweq	r0, #193	@ 0xc1
    1b94:	0007080a 	andeq	r0, r7, sl, lsl #16
    1b98:	04000000 	streq	r0, [r0], #-0
    1b9c:	05040c03 	streq	r0, [r4, #-3075]	@ 0xfffff3fd
    1ba0:	00e2b709 	rsceq	fp, r2, r9, lsl #14
    1ba4:	090c0300 	stmdbeq	ip, {r8, r9}
    1ba8:	a53b1b05 	ldrge	r1, [fp, #-2821]!	@ 0xfffff4fb
    1bac:	1d030000 	stcne	0, cr0, [r3, #-0]
    1bb0:	9808050a 	stmdals	r8, {r1, r3, r8, sl}
    1bb4:	03000053 	movweq	r0, #83	@ 0x53
    1bb8:	07050b0a 	streq	r0, [r5, -sl, lsl #22]
    1bbc:	0000c36c 	andeq	ip, r0, ip, ror #6
    1bc0:	070c0a03 	streq	r0, [ip, -r3, lsl #20]
    1bc4:	00000000 	andeq	r0, r0, r0
    1bc8:	00000704 	andeq	r0, r0, r4, lsl #14
    1bcc:	03040000 	movweq	r0, #16384	@ 0x4000
    1bd0:	02050d0b 	andeq	r0, r5, #704	@ 0x2c0
    1bd4:	0000a6c5 	andeq	sl, r0, r5, asr #13
    1bd8:	070e0403 	streq	r0, [lr, -r3, lsl #8]
    1bdc:	00000000 	andeq	r0, r0, r0
    1be0:	0f050304 	svceq	0x00050304
    1be4:	00000007 	andeq	r0, r0, r7
    1be8:	00070400 	andeq	r0, r7, r0, lsl #8
    1bec:	04000000 	streq	r0, [r0], #-0
    1bf0:	00000007 	andeq	r0, r0, r7
    1bf4:	00070400 	andeq	r0, r7, r0, lsl #8
    1bf8:	03000000 	movweq	r0, #0
    1bfc:	2b051023 	blcs	145c90 <_Min_Stack_Size+0x145890>
    1c00:	0000c552 	andeq	ip, r0, r2, asr r5
    1c04:	07022d03 	streq	r2, [r2, -r3, lsl #26]
    1c08:	00000000 	andeq	r0, r0, r0
    1c0c:	112f0304 			@ <UNDEFINED> instruction: 0x112f0304
    1c10:	00000007 	andeq	r0, r0, r7
    1c14:	00070400 	andeq	r0, r7, r0, lsl #8
    1c18:	04000000 	streq	r0, [r0], #-0
    1c1c:	07112403 	ldreq	r2, [r1, -r3, lsl #8]
    1c20:	00000000 	andeq	r0, r0, r0
    1c24:	05270504 	streq	r0, [r7, #-1284]!	@ 0xfffffafc
    1c28:	03000077 	movweq	r0, #119	@ 0x77
    1c2c:	00071228 	andeq	r1, r7, r8, lsr #4
    1c30:	04000000 	streq	r0, [r0], #-0
    1c34:	437a2f05 	cmnmi	sl, #5, 30
    1c38:	3c030000 	stccc	0, cr0, [r3], {-0}
    1c3c:	fa0b0513 	blx	2c3090 <_Min_Stack_Size+0x2c2c90>
    1c40:	030000e3 	movweq	r0, #227	@ 0xe3
    1c44:	03040a0d 	movweq	r0, #18957	@ 0x4a0d
    1c48:	0304110e 	movweq	r1, #16654	@ 0x410e
    1c4c:	0007140f 	andeq	r1, r7, pc, lsl #8
    1c50:	03000000 	movweq	r0, #0
    1c54:	00071118 	andeq	r1, r7, r8, lsl r1
    1c58:	04000000 	streq	r0, [r0], #-0
    1c5c:	05151b03 	ldreq	r1, [r5, #-2819]	@ 0xfffff4fd
    1c60:	01038c06 	tsteq	r3, r6, lsl #24
    1c64:	00070400 	andeq	r0, r7, r0, lsl #8
    1c68:	04000000 	streq	r0, [r0], #-0
    1c6c:	00000007 	andeq	r0, r0, r7
    1c70:	16220300 	strtne	r0, [r2], -r0, lsl #6
    1c74:	00000007 	andeq	r0, r0, r7
    1c78:	00070400 	andeq	r0, r7, r0, lsl #8
    1c7c:	03000000 	movweq	r0, #0
    1c80:	071703ca 	ldreq	r0, [r7, -sl, asr #7]
    1c84:	00000000 	andeq	r0, r0, r0
    1c88:	00000704 	andeq	r0, r0, r4, lsl #14
    1c8c:	07040000 	streq	r0, [r4, -r0]
    1c90:	00000000 	andeq	r0, r0, r0
    1c94:	07185503 	ldreq	r5, [r8, -r3, lsl #10]
    1c98:	00000000 	andeq	r0, r0, r0
    1c9c:	00000704 	andeq	r0, r0, r4, lsl #14
    1ca0:	03040000 	movweq	r0, #16384	@ 0x4000
    1ca4:	0805190d 	stmdaeq	r5, {r0, r2, r3, r8, fp, ip}
    1ca8:	0000412d 	andeq	r4, r0, sp, lsr #2
    1cac:	040e0a03 	streq	r0, [lr], #-2563	@ 0xfffff5fd
    1cb0:	00000007 	andeq	r0, r0, r7
    1cb4:	11100300 	tstne	r0, r0, lsl #6
    1cb8:	00000007 	andeq	r0, r0, r7
    1cbc:	14030400 	strne	r0, [r3], #-1024	@ 0xfffffc00
    1cc0:	c202051a 	andgt	r0, r2, #109051904	@ 0x6800000
    1cc4:	0400004e 	streq	r0, [r0], #-78	@ 0xffffffb2
    1cc8:	071b1603 	ldreq	r1, [fp, -r3, lsl #12]
    1ccc:	00000000 	andeq	r0, r0, r0
    1cd0:	00000704 	andeq	r0, r0, r4, lsl #14
    1cd4:	03040000 	movweq	r0, #16384	@ 0x4000
    1cd8:	09031c0e 	stmdbeq	r3, {r1, r2, r3, sl, fp, ip}
    1cdc:	7c0a051d 	cfstr32vc	mvfx0, [sl], {29}
    1ce0:	03000089 	movweq	r0, #137	@ 0x89
    1ce4:	00071e0d 	andeq	r1, r7, sp, lsl #28
    1ce8:	04000000 	streq	r0, [r0], #-0
    1cec:	07030e03 	streq	r0, [r3, -r3, lsl #28]
    1cf0:	00000000 	andeq	r0, r0, r0
    1cf4:	00000704 	andeq	r0, r0, r4, lsl #14
    1cf8:	05040000 	streq	r0, [r4, #-0]
    1cfc:	0089730d 	addeq	r7, r9, sp, lsl #6
    1d00:	00070400 	andeq	r0, r7, r0, lsl #8
    1d04:	04000000 	streq	r0, [r0], #-0
    1d08:	00000007 	andeq	r0, r0, r7
    1d0c:	0b030400 	bleq	c2d14 <_Min_Stack_Size+0xc2914>
    1d10:	1d2b0707 	stcne	7, cr0, [fp, #-28]!	@ 0xffffffe4
    1d14:	07040000 	streq	r0, [r4, -r0]
    1d18:	00001d41 	andeq	r1, r0, r1, asr #26
    1d1c:	7b130504 	blvc	4c3134 <_Min_Stack_Size+0x4c2d34>
    1d20:	05000120 	streq	r0, [r0, #-288]	@ 0xfffffee0
    1d24:	011fd814 	tsteq	pc, r4, lsl r8	@ <UNPREDICTABLE>
    1d28:	04000400 	streq	r0, [r0], #-1024	@ 0xfffffc00
    1d2c:	09050000 	stmdbeq	r5, {}	@ <UNPREDICTABLE>
    1d30:	000125b1 			@ <UNDEFINED> instruction: 0x000125b1
    1d34:	20e50e05 	rsccs	r0, r5, r5, lsl #28
    1d38:	0f050001 	svceq	0x00050001
    1d3c:	000121b1 			@ <UNDEFINED> instruction: 0x000121b1
    1d40:	00000400 	andeq	r0, r0, r0, lsl #8
    1d44:	256b2c05 	strbcs	r2, [fp, #-3077]!	@ 0xfffff3fb
    1d48:	62050001 	andvs	r0, r5, #1
    1d4c:	000123da 	ldrdeq	r2, [r1], -sl
    1d50:	24926305 	ldrcs	r6, [r2], #773	@ 0x305
    1d54:	6c050001 	stcvs	0, cr0, [r5], {1}
    1d58:	000122fa 	strdeq	r2, [r1], -sl
    1d5c:	23656d05 	cmncs	r5, #320	@ 0x140
    1d60:	71050001 	tstvc	r5, r1
    1d64:	00011fbb 			@ <UNDEFINED> instruction: 0x00011fbb
    1d68:	220b7205 	andcs	r7, fp, #1342177280	@ 0x50000000
    1d6c:	79050001 	stmdbvc	r5, {r0}
    1d70:	00012027 	andeq	r2, r1, r7, lsr #32
    1d74:	26767a05 	ldrbtcs	r7, [r6], -r5, lsl #20
    1d78:	80050001 	andhi	r0, r5, r1
    1d7c:	01253c01 			@ <UNDEFINED> instruction: 0x01253c01
    1d80:	01810500 	orreq	r0, r1, r0, lsl #10
    1d84:	000121f9 	strdeq	r2, [r1], -r9
    1d88:	1c018605 	stcne	6, cr8, [r1], {5}
    1d8c:	05000124 	streq	r0, [r0, #-292]	@ 0xfffffedc
    1d90:	20a10187 	adccs	r0, r1, r7, lsl #3
    1d94:	04000001 	streq	r0, [r0], #-1
    1d98:	2c0f0200 	sfmcs	f0, 4, [pc], {-0}
    1d9c:	00070000 	andeq	r0, r7, r0
    1da0:	03000000 	movweq	r0, #0
    1da4:	08030100 	stmdaeq	r3, {r8}
    1da8:	7f090506 	svcvc	0x00090506
    1dac:	0300012e 	movweq	r0, #302	@ 0x12e
    1db0:	0905050b 	stmdbeq	r5, {r0, r1, r3, r8, sl}
    1db4:	0000c1b2 			@ <UNDEFINED> instruction: 0x0000c1b2
    1db8:	07070a03 	streq	r0, [r7, -r3, lsl #20]
    1dbc:	00000000 	andeq	r0, r0, r0
    1dc0:	040c0304 	streq	r0, [ip], #-772	@ 0xfffffcfc
    1dc4:	e2b70905 	adcs	r0, r7, #81920	@ 0x14000
    1dc8:	0c030000 	stceq	0, cr0, [r3], {-0}
    1dcc:	3b1b0508 	blcc	6c31f4 <_Min_Stack_Size+0x6c2df4>
    1dd0:	030000a5 	movweq	r0, #165	@ 0xa5
    1dd4:	0805091d 	stmdaeq	r5, {r0, r2, r3, r4, r8, fp}
    1dd8:	00005398 	muleq	r0, r8, r3
    1ddc:	050a0a03 	streq	r0, [sl, #-2563]	@ 0xfffff5fd
    1de0:	00c36c07 	sbceq	r6, r3, r7, lsl #24
    1de4:	0b0a0300 	bleq	2829ec <_Min_Stack_Size+0x2825ec>
    1de8:	00000007 	andeq	r0, r0, r7
    1dec:	00070400 	andeq	r0, r7, r0, lsl #8
    1df0:	04000000 	streq	r0, [r0], #-0
    1df4:	050c0b03 	streq	r0, [ip, #-2819]	@ 0xfffff4fd
    1df8:	00a6c502 	adceq	ip, r6, r2, lsl #10
    1dfc:	0d040300 	stceq	3, cr0, [r4, #-0]
    1e00:	00000007 	andeq	r0, r0, r7
    1e04:	05030400 	streq	r0, [r3, #-1024]	@ 0xfffffc00
    1e08:	0000070e 	andeq	r0, r0, lr, lsl #14
    1e0c:	07040000 	streq	r0, [r4, -r0]
    1e10:	00000000 	andeq	r0, r0, r0
    1e14:	00000704 	andeq	r0, r0, r4, lsl #14
    1e18:	07040000 	streq	r0, [r4, -r0]
    1e1c:	00000000 	andeq	r0, r0, r0
    1e20:	050f2303 	streq	r2, [pc, #-771]	@ 1b25 <_Min_Stack_Size+0x1725>
    1e24:	00c5522b 	sbceq	r5, r5, fp, lsr #4
    1e28:	022d0300 	eoreq	r0, sp, #0, 6
    1e2c:	00000007 	andeq	r0, r0, r7
    1e30:	2f030400 	svccs	0x00030400
    1e34:	00000710 	andeq	r0, r0, r0, lsl r7
    1e38:	07040000 	streq	r0, [r4, -r0]
    1e3c:	00000000 	andeq	r0, r0, r0
    1e40:	10240304 	eorne	r0, r4, r4, lsl #6
    1e44:	00000007 	andeq	r0, r0, r7
    1e48:	27050400 	strcs	r0, [r5, -r0, lsl #8]
    1e4c:	00007705 	andeq	r7, r0, r5, lsl #14
    1e50:	07112803 	ldreq	r2, [r1, -r3, lsl #16]
    1e54:	00000000 	andeq	r0, r0, r0
    1e58:	7a2f0504 	bvc	bc3270 <_Min_Stack_Size+0xbc2e70>
    1e5c:	03000043 	movweq	r0, #67	@ 0x43
    1e60:	0b05123c 	bleq	146758 <_Min_Stack_Size+0x146358>
    1e64:	0000e3fa 	strdeq	lr, [r0], -sl
    1e68:	04090d03 	streq	r0, [r9], #-3331	@ 0xfffff2fd
    1e6c:	04100e03 	ldreq	r0, [r0], #-3587	@ 0xfffff1fd
    1e70:	07130f03 	ldreq	r0, [r3, -r3, lsl #30]
    1e74:	00000000 	andeq	r0, r0, r0
    1e78:	07101803 	ldreq	r1, [r0, -r3, lsl #16]
    1e7c:	00000000 	andeq	r0, r0, r0
    1e80:	141b0304 	ldrne	r0, [fp], #-772	@ 0xfffffcfc
    1e84:	038c0605 	orreq	r0, ip, #5242880	@ 0x500000
    1e88:	07040001 	streq	r0, [r4, -r1]
    1e8c:	00000000 	andeq	r0, r0, r0
    1e90:	00000704 	andeq	r0, r0, r4, lsl #14
    1e94:	22030000 	andcs	r0, r3, #0
    1e98:	00000715 	andeq	r0, r0, r5, lsl r7
    1e9c:	07040000 	streq	r0, [r4, -r0]
    1ea0:	00000000 	andeq	r0, r0, r0
    1ea4:	1603ca03 	strne	ip, [r3], -r3, lsl #20
    1ea8:	00000007 	andeq	r0, r0, r7
    1eac:	00070400 	andeq	r0, r7, r0, lsl #8
    1eb0:	04000000 	streq	r0, [r0], #-0
    1eb4:	00000007 	andeq	r0, r0, r7
    1eb8:	17550300 	ldrbne	r0, [r5, -r0, lsl #6]
    1ebc:	00000007 	andeq	r0, r0, r7
    1ec0:	00070400 	andeq	r0, r7, r0, lsl #8
    1ec4:	04000000 	streq	r0, [r0], #-0
    1ec8:	05180d03 	ldreq	r0, [r8, #-3331]	@ 0xfffff2fd
    1ecc:	00412d08 	subeq	r2, r1, r8, lsl #26
    1ed0:	0d0a0300 	stceq	3, cr0, [sl, #-0]
    1ed4:	00000704 	andeq	r0, r0, r4, lsl #14
    1ed8:	10030000 	andne	r0, r3, r0
    1edc:	00000710 	andeq	r0, r0, r0, lsl r7
    1ee0:	03040000 	movweq	r0, #16384	@ 0x4000
    1ee4:	02051914 	andeq	r1, r5, #20, 18	@ 0x50000
    1ee8:	00004ec2 	andeq	r4, r0, r2, asr #29
    1eec:	1a160304 	bne	582b04 <_Min_Stack_Size+0x582704>
    1ef0:	00000007 	andeq	r0, r0, r7
    1ef4:	00070400 	andeq	r0, r7, r0, lsl #8
    1ef8:	04000000 	streq	r0, [r0], #-0
    1efc:	031b0e03 	tsteq	fp, #3, 28	@ 0x30
    1f00:	0a051c09 	beq	148f2c <_Min_Stack_Size+0x148b2c>
    1f04:	0000897c 	andeq	r8, r0, ip, ror r9
    1f08:	071d0d03 	ldreq	r0, [sp, -r3, lsl #26]
    1f0c:	00000000 	andeq	r0, r0, r0
    1f10:	030e0304 	movweq	r0, #58116	@ 0xe304
    1f14:	00000007 	andeq	r0, r0, r7
    1f18:	00070400 	andeq	r0, r7, r0, lsl #8
    1f1c:	04000000 	streq	r0, [r0], #-0
    1f20:	89730d05 	ldmdbhi	r3!, {r0, r2, r8, sl, fp}^
    1f24:	07040000 	streq	r0, [r4, -r0]
    1f28:	00000000 	andeq	r0, r0, r0
    1f2c:	00000704 	andeq	r0, r0, r4, lsl #14
    1f30:	07040000 	streq	r0, [r4, -r0]
    1f34:	00001f55 	andeq	r1, r0, r5, asr pc
    1f38:	2c180504 	cfldr32cs	mvfx0, [r8], {4}
    1f3c:	0500012a 	streq	r0, [r0, #-298]	@ 0xfffffed6
    1f40:	0126e219 			@ <UNDEFINED> instruction: 0x0126e219
