NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    1f44:	01850500 	orreq	r0, r5, r0, lsl #10
    1f48:	00012b44 	andeq	r2, r1, r4, asr #22
    1f4c:	bf018605 	svclt	0x00018605
    1f50:	0400012d 	streq	r0, [r0], #-301	@ 0xfffffed3
    1f54:	00000400 	andeq	r0, r0, r0, lsl #8
    1f58:	2b5f4105 	blcs	17d2374 <_Min_Stack_Size+0x17d1f74>
    1f5c:	42050001 	andmi	r0, r5, #1
    1f60:	00012e23 	andeq	r2, r1, r3, lsr #28
    1f64:	2c114505 	cfldr32cs	mvfx4, [r1], {5}
    1f68:	46050001 	strmi	r0, [r5], -r1
    1f6c:	00012c69 	andeq	r2, r1, r9, ror #24
    1f70:	2be24705 	blcs	ff893b8c <_estack+0xdf89138c>
    1f74:	48050001 	stmdami	r5, {r0}
    1f78:	00012cda 	ldrdeq	r2, [r1], -sl
    1f7c:	2d644c05 	stclcs	12, cr4, [r4, #-20]!	@ 0xffffffec
    1f80:	4d050001 	stcmi	0, cr0, [r5, #-4]
    1f84:	000127cb 	andeq	r2, r1, fp, asr #15
    1f88:	29c95105 	stmibcs	r9, {r0, r2, r8, ip, lr}^
    1f8c:	52050001 	andpl	r0, r5, #1
    1f90:	000128b5 			@ <UNDEFINED> instruction: 0x000128b5
    1f94:	2a445905 	bcs	11183b0 <_Min_Stack_Size+0x1117fb0>
    1f98:	5a050001 	bpl	141fa4 <_Min_Stack_Size+0x141ba4>
    1f9c:	00012948 	andeq	r2, r1, r8, asr #18
    1fa0:	2a7c6105 	bcs	1f1a3bc <_Min_Stack_Size+0x1f19fbc>
    1fa4:	62050001 	andvs	r0, r5, #1
    1fa8:	00012713 	andeq	r2, r1, r3, lsl r7
    1fac:	2ddb6705 	ldclcs	7, cr6, [fp, #20]
    1fb0:	68050001 	stmdavs	r5, {r0}
    1fb4:	00012853 	andeq	r2, r1, r3, asr r8
    1fb8:	290d6905 	stmdbcs	sp, {r0, r2, r8, fp, sp, lr}
    1fbc:	6c050001 	stcvs	0, cr0, [r5], {1}
    1fc0:	00012bab 	andeq	r2, r1, fp, lsr #23
    1fc4:	29e96d05 	stmibcs	r9!, {r0, r2, r8, sl, fp, sp, lr}^
    1fc8:	75050001 	strvc	r0, [r5, #-1]
    1fcc:	00012ab8 			@ <UNDEFINED> instruction: 0x00012ab8
    1fd0:	281b7605 	ldmdacs	fp, {r0, r2, r9, sl, ip, sp, lr}
    1fd4:	77050001 	strvc	r0, [r5, -r1]
    1fd8:	00012788 	andeq	r2, r1, r8, lsl #15
    1fdc:	2d3d7805 	ldccs	8, cr7, [sp, #-20]!	@ 0xffffffec
    1fe0:	79050001 	stmdbvc	r5, {r0}
    1fe4:	00012d16 	andeq	r2, r1, r6, lsl sp
    1fe8:	2e9e7a05 	vfnmscs.f32	s14, s28, s10
    1fec:	7b050001 	blvc	141ff8 <_Min_Stack_Size+0x141bf8>
    1ff0:	00012760 	andeq	r2, r1, r0, ror #14
    1ff4:	2b837c05 	blcs	fe0e1010 <_estack+0xde0de810>
    1ff8:	80050001 	andhi	r0, r5, r1
    1ffc:	012ae701 			@ <UNDEFINED> instruction: 0x012ae701
    2000:	01810500 	orreq	r0, r1, r0, lsl #10
    2004:	00012996 	muleq	r1, r6, r9
    2008:	34018205 	strcc	r8, [r1], #-517	@ 0xfffffdfb
    200c:	0500012c 	streq	r0, [r0, #-300]	@ 0xfffffed4
    2010:	28d30183 	ldmcs	r3, {r0, r1, r7, r8}^
    2014:	04000001 	streq	r0, [r0], #-1
    2018:	36c70200 	strbcc	r0, [r7], r0, lsl #4
    201c:	00070000 	andeq	r0, r7, r0
    2020:	03000000 	movweq	r0, #0
    2024:	08030100 	stmdaeq	r3, {r8}
    2028:	15090506 	strne	r0, [r9, #-1286]	@ 0xfffffafa
    202c:	03000130 	movweq	r0, #304	@ 0x130
    2030:	0905070b 	stmdbeq	r5, {r0, r1, r3, r8, r9, sl}
    2034:	000125b1 			@ <UNDEFINED> instruction: 0x000125b1
    2038:	05050b03 	streq	r0, [r5, #-2819]	@ 0xfffff4fd
    203c:	00c1b209 	sbceq	fp, r1, r9, lsl #4
    2040:	080a0300 	stmdaeq	sl, {r8, r9}
    2044:	00000007 	andeq	r0, r0, r7
    2048:	0c030400 	cfstrseq	mvf0, [r3], {-0}
    204c:	b7090504 	strlt	r0, [r9, -r4, lsl #10]
    2050:	030000e2 	movweq	r0, #226	@ 0xe2
    2054:	1b05090c 	blne	14448c <_Min_Stack_Size+0x14408c>
    2058:	0000a53b 	andeq	sl, r0, fp, lsr r5
    205c:	050a1d03 	streq	r1, [sl, #-3331]	@ 0xfffff2fd
    2060:	00539808 	subseq	r9, r3, r8, lsl #16
    2064:	0b0a0300 	bleq	282c6c <_Min_Stack_Size+0x28286c>
    2068:	c36c0705 	cmngt	ip, #1310720	@ 0x140000
    206c:	0a030000 	beq	c2074 <_Min_Stack_Size+0xc1c74>
    2070:	0000070c 	andeq	r0, r0, ip, lsl #14
    2074:	07040000 	streq	r0, [r4, -r0]
    2078:	00000000 	andeq	r0, r0, r0
    207c:	0d0b0304 	stceq	3, cr0, [fp, #-16]
    2080:	a6c50205 	strbge	r0, [r5], r5, lsl #4
    2084:	04030000 	streq	r0, [r3], #-0
    2088:	0000070e 	andeq	r0, r0, lr, lsl #14
    208c:	03040000 	movweq	r0, #16384	@ 0x4000
    2090:	00070f05 	andeq	r0, r7, r5, lsl #30
    2094:	04000000 	streq	r0, [r0], #-0
    2098:	00000007 	andeq	r0, r0, r7
    209c:	00070400 	andeq	r0, r7, r0, lsl #8
    20a0:	04000000 	streq	r0, [r0], #-0
    20a4:	00000007 	andeq	r0, r0, r7
    20a8:	10230300 	eorne	r0, r3, r0, lsl #6
    20ac:	c5522b05 	ldrbgt	r2, [r2, #-2821]	@ 0xfffff4fb
    20b0:	2d030000 	stccs	0, cr0, [r3, #-0]
    20b4:	00000702 	andeq	r0, r0, r2, lsl #14
    20b8:	03040000 	movweq	r0, #16384	@ 0x4000
    20bc:	0007112f 	andeq	r1, r7, pc, lsr #2
    20c0:	04000000 	streq	r0, [r0], #-0
    20c4:	00000007 	andeq	r0, r0, r7
    20c8:	24030400 	strcs	r0, [r3], #-1024	@ 0xfffffc00
    20cc:	00000711 	andeq	r0, r0, r1, lsl r7
    20d0:	05040000 	streq	r0, [r4, #-0]
    20d4:	00770527 	rsbseq	r0, r7, r7, lsr #10
    20d8:	12280300 	eorne	r0, r8, #0, 6
    20dc:	00000007 	andeq	r0, r0, r7
    20e0:	2f050400 	svccs	0x00050400
    20e4:	0000437a 	andeq	r4, r0, sl, ror r3
    20e8:	05133c03 	ldreq	r3, [r3, #-3075]	@ 0xfffff3fd
    20ec:	00e3fa0b 	rsceq	pc, r3, fp, lsl #20
    20f0:	0a0d0300 	beq	342cf8 <_Min_Stack_Size+0x3428f8>
    20f4:	110e0304 	tstne	lr, r4, lsl #6
    20f8:	140f0304 	strne	r0, [pc], #-772	@ 2100 <_Min_Stack_Size+0x1d00>
    20fc:	00000007 	andeq	r0, r0, r7
    2100:	11180300 	tstne	r8, r0, lsl #6
    2104:	00000007 	andeq	r0, r0, r7
    2108:	1b030400 	blne	c3110 <_Min_Stack_Size+0xc2d10>
    210c:	8c060515 	cfstr32hi	mvfx0, [r6], {21}
    2110:	04000103 	streq	r0, [r0], #-259	@ 0xfffffefd
    2114:	00000007 	andeq	r0, r0, r7
    2118:	00070400 	andeq	r0, r7, r0, lsl #8
    211c:	03000000 	movweq	r0, #0
    2120:	00071622 	andeq	r1, r7, r2, lsr #12
    2124:	04000000 	streq	r0, [r0], #-0
    2128:	00000007 	andeq	r0, r0, r7
    212c:	03ca0300 	biceq	r0, sl, #0, 6
    2130:	00000717 	andeq	r0, r0, r7, lsl r7
    2134:	07040000 	streq	r0, [r4, -r0]
    2138:	00000000 	andeq	r0, r0, r0
    213c:	00000704 	andeq	r0, r0, r4, lsl #14
    2140:	55030000 	strpl	r0, [r3, #-0]
    2144:	00000718 	andeq	r0, r0, r8, lsl r7
    2148:	07040000 	streq	r0, [r4, -r0]
    214c:	00000000 	andeq	r0, r0, r0
    2150:	190d0304 	stmdbne	sp, {r2, r8, r9}
    2154:	412d0805 			@ <UNDEFINED> instruction: 0x412d0805
    2158:	0a030000 	beq	c2160 <_Min_Stack_Size+0xc1d60>
    215c:	0007040e 	andeq	r0, r7, lr, lsl #8
    2160:	03000000 	movweq	r0, #0
    2164:	00071110 	andeq	r1, r7, r0, lsl r1
    2168:	04000000 	streq	r0, [r0], #-0
    216c:	051a1403 	ldreq	r1, [sl, #-1027]	@ 0xfffffbfd
    2170:	004ec202 	subeq	ip, lr, r2, lsl #4
    2174:	16030400 	strne	r0, [r3], -r0, lsl #8
    2178:	0000071b 	andeq	r0, r0, fp, lsl r7
    217c:	07040000 	streq	r0, [r4, -r0]
    2180:	00000000 	andeq	r0, r0, r0
    2184:	1c0e0304 	stcne	3, cr0, [lr], {4}
    2188:	051d0903 	ldreq	r0, [sp, #-2307]	@ 0xfffff6fd
    218c:	00897c0a 	addeq	r7, r9, sl, lsl #24
    2190:	1e0d0300 	cdpne	3, 0, cr0, cr13, cr0, {0}
    2194:	00000007 	andeq	r0, r0, r7
    2198:	0e030400 	cfcpyseq	mvf0, mvf3
    219c:	00000703 	andeq	r0, r0, r3, lsl #14
    21a0:	07040000 	streq	r0, [r4, -r0]
    21a4:	00000000 	andeq	r0, r0, r0
    21a8:	730d0504 	movwvc	r0, #54532	@ 0xd504
    21ac:	04000089 	streq	r0, [r0], #-137	@ 0xffffff77
    21b0:	00000007 	andeq	r0, r0, r7
    21b4:	00070400 	andeq	r0, r7, r0, lsl #8
    21b8:	04000000 	streq	r0, [r0], #-0
    21bc:	00000007 	andeq	r0, r0, r7
    21c0:	ca070400 	bgt	1c31c8 <_Min_Stack_Size+0x1c2dc8>
    21c4:	04000021 	streq	r0, [r0], #-33	@ 0xffffffdf
    21c8:	00040004 	andeq	r0, r4, r4
    21cc:	61310500 	teqvs	r1, r0, lsl #10
    21d0:	05000134 	streq	r0, [r0, #-308]	@ 0xfffffecc
    21d4:	0135b832 	teqeq	r5, r2, lsr r8
    21d8:	8e330500 	cfabs32hi	mvfx0, mvfx3
    21dc:	05000135 	streq	r0, [r0, #-309]	@ 0xfffffecb
    21e0:	01324f37 	teqeq	r2, r7, lsr pc
    21e4:	31380500 	teqcc	r8, r0, lsl #10
    21e8:	05000131 	streq	r0, [r0, #-305]	@ 0xfffffecf
    21ec:	01314939 	teqeq	r1, r9, lsr r9
    21f0:	fb3a0500 	blx	e835fa <_Min_Stack_Size+0xe831fa>
    21f4:	05000130 	streq	r0, [r0, #-304]	@ 0xfffffed0
    21f8:	0135d73b 	teqeq	r5, fp, lsr r7
    21fc:	153c0500 	ldrne	r0, [ip, #-1280]!	@ 0xfffffb00
    2200:	05000131 	streq	r0, [r0, #-305]	@ 0xfffffecf
    2204:	0133ff3d 	teqeq	r3, sp, lsr pc	@ <UNPREDICTABLE>
    2208:	643e0500 	ldrtvs	r0, [lr], #-1280	@ 0xfffffb00
    220c:	0500012f 	streq	r0, [r0, #-303]	@ 0xfffffed1
    2210:	01353f3f 	teqeq	r5, pc, lsr pc
    2214:	43400500 	movtmi	r0, #1280	@ 0x500
    2218:	05000134 	streq	r0, [r0, #-308]	@ 0xfffffecc
    221c:	0131c844 	teqeq	r1, r4, asr #16
    2220:	ad450500 	cfstr64ge	mvdx0, [r5, #-0]
    2224:	05000134 	streq	r0, [r0, #-308]	@ 0xfffffecc
    2228:	0134d649 	teqeq	r4, r9, asr #12
    222c:	f84a0500 			@ <UNDEFINED> instruction: 0xf84a0500
    2230:	05000132 	streq	r0, [r0, #-306]	@ 0xfffffece
    2234:	01304d4b 	teqeq	r0, fp, asr #26
    2238:	f64f0500 			@ <UNDEFINED> instruction: 0xf64f0500
    223c:	05000134 	streq	r0, [r0, #-308]	@ 0xfffffecc
    2240:	01316350 	teqeq	r1, r0, asr r3
    2244:	1b510500 	blne	144364c <_Min_Stack_Size+0x144324c>
    2248:	05000134 	streq	r0, [r0, #-308]	@ 0xfffffecc
    224c:	01366552 	teqeq	r6, r2, asr r5
    2250:	67560500 	ldrbvs	r0, [r6, -r0, lsl #10]
    2254:	05000132 	streq	r0, [r0, #-306]	@ 0xfffffece
    2258:	01364157 	teqeq	r6, r7, asr r1
    225c:	7b580500 	blvc	1603664 <_Min_Stack_Size+0x1603264>
    2260:	05000133 	streq	r0, [r0, #-307]	@ 0xfffffecd
    2264:	01355d59 	teqeq	r5, r9, asr sp
    2268:	1c5c0500 	cfldr64ne	mvdx0, [ip], {-0}
    226c:	05000135 	streq	r0, [r0, #-309]	@ 0xfffffecb
    2270:	0135f35d 	teqeq	r5, sp, asr r3	@ <UNPREDICTABLE>
    2274:	875e0500 	ldrbhi	r0, [lr, -r0, lsl #10]
    2278:	05000134 	streq	r0, [r0, #-308]	@ 0xfffffecc
    227c:	0130d25f 	teqeq	r0, pc, asr r2
    2280:	82600500 	rsbhi	r0, r0, #0, 10
    2284:	05000131 	streq	r0, [r0, #-305]	@ 0xfffffecf
    2288:	01320a6a 	teqeq	r2, sl, ror #20
    228c:	2f6b0500 	svccs	0x006b0500
    2290:	05000133 	streq	r0, [r0, #-307]	@ 0xfffffecd
    2294:	012fa06c 			@ <UNDEFINED> instruction: 0x012fa06c
    2298:	b66d0500 	strbtlt	r0, [sp], -r0, lsl #10
    229c:	05000133 	streq	r0, [r0, #-307]	@ 0xfffffecd
    22a0:	012ed16e 			@ <UNDEFINED> instruction: 0x012ed16e
    22a4:	896f0500 	stmdbhi	pc!, {r8, sl}^	@ <UNPREDICTABLE>
    22a8:	00000132 	andeq	r0, r0, r2, lsr r1
    22ac:	05020004 	streq	r0, [r2, #-4]
    22b0:	07000040 	streq	r0, [r0, -r0, asr #32]
    22b4:	00000000 	andeq	r0, r0, r0
    22b8:	03010003 	movweq	r0, #4099	@ 0x1003
    22bc:	09050201 	stmdbeq	r5, {r0, r9}
    22c0:	0000a3dc 	ldrdeq	sl, [r0], -ip
    22c4:	05030a03 	streq	r0, [r3, #-2563]	@ 0xfffff5fd
    22c8:	00a9c208 	adceq	ip, r9, r8, lsl #4
    22cc:	040a0300 	streq	r0, [sl], #-768	@ 0xfffffd00
    22d0:	53980805 	orrspl	r0, r8, #327680	@ 0x50000
    22d4:	0a030000 	beq	c22dc <_Min_Stack_Size+0xc1edc>
    22d8:	6c070505 	cfstr32vs	mvfx0, [r7], {5}
    22dc:	030000c3 	movweq	r0, #195	@ 0xc3
    22e0:	0007060a 	andeq	r0, r7, sl, lsl #12
    22e4:	04000000 	streq	r0, [r0], #-0
    22e8:	00000007 	andeq	r0, r0, r7
    22ec:	0b030400 	bleq	c32f4 <_Min_Stack_Size+0xc2ef4>
    22f0:	c5020507 	strgt	r0, [r2, #-1287]	@ 0xfffffaf9
    22f4:	030000a6 	movweq	r0, #166	@ 0xa6
    22f8:	00070804 	andeq	r0, r7, r4, lsl #16
    22fc:	04000000 	streq	r0, [r0], #-0
    2300:	07090503 	streq	r0, [r9, -r3, lsl #10]
    2304:	00000000 	andeq	r0, r0, r0
    2308:	00000704 	andeq	r0, r0, r4, lsl #14
    230c:	07040000 	streq	r0, [r4, -r0]
    2310:	00000000 	andeq	r0, r0, r0
    2314:	0a0b0304 	beq	2c2f2c <_Min_Stack_Size+0x2c2b2c>
    2318:	e3fa0b05 	mvns	r0, #5120	@ 0x1400
    231c:	0d030000 	stceq	0, cr0, [r3, #-0]
    2320:	0e030404 	cdpeq	4, 0, cr0, cr3, cr4, {0}
    2324:	15f0070b 	ldrbne	r0, [r0, #1803]!	@ 0x70b
    2328:	03040000 	movweq	r0, #16384	@ 0x4000
    232c:	00070c0f 	andeq	r0, r7, pc, lsl #24
    2330:	03000000 	movweq	r0, #0
    2334:	00070b18 	andeq	r0, r7, r8, lsl fp
    2338:	04000000 	streq	r0, [r0], #-0
    233c:	050d1b03 	streq	r1, [sp, #-2819]	@ 0xfffff4fd
    2340:	01038c06 	tsteq	r3, r6, lsl #24
    2344:	0e070300 	cdpeq	3, 0, cr0, cr7, cr0, {0}
    2348:	00000007 	andeq	r0, r0, r7
    234c:	07040400 	streq	r0, [r4, -r0, lsl #8]
    2350:	00000000 	andeq	r0, r0, r0
    2354:	00000704 	andeq	r0, r0, r4, lsl #14
    2358:	22030000 	andcs	r0, r3, #0
    235c:	0000070f 	andeq	r0, r0, pc, lsl #14
    2360:	07040000 	streq	r0, [r4, -r0]
    2364:	00000000 	andeq	r0, r0, r0
    2368:	1003ca03 	andne	ip, r3, r3, lsl #20
    236c:	00000007 	andeq	r0, r0, r7
    2370:	00070400 	andeq	r0, r7, r0, lsl #8
    2374:	04000000 	streq	r0, [r0], #-0
    2378:	05110c03 	ldreq	r0, [r1, #-3075]	@ 0xfffff3fd
    237c:	00c5522b 	sbceq	r5, r5, fp, lsr #4
    2380:	0b2f0300 	bleq	bc2f88 <_Min_Stack_Size+0xbc2b88>
    2384:	00000704 	andeq	r0, r0, r4, lsl #14
    2388:	07040000 	streq	r0, [r4, -r0]
    238c:	00001779 	andeq	r1, r0, r9, ror r7
    2390:	070b1103 	streq	r1, [fp, -r3, lsl #2]
    2394:	00000000 	andeq	r0, r0, r0
    2398:	12140304 	andsne	r0, r4, #4, 6	@ 0x10000000
    239c:	80d90405 	sbcshi	r0, r9, r5, lsl #8
    23a0:	03040000 	movweq	r0, #16384	@ 0x4000
    23a4:	1e051318 	mcrne	3, 0, r1, cr5, cr8, {0}
    23a8:	0000f25d 	andeq	pc, r0, sp, asr r2	@ <UNPREDICTABLE>
    23ac:	02a40704 	adceq	r0, r4, #4, 14	@ 0x100000
    23b0:	bd030000 	stclt	0, cr0, [r3, #-0]
    23b4:	04041401 	streq	r1, [r4], #-1025	@ 0xfffffbff
    23b8:	05150b03 	ldreq	r0, [r5, #-2819]	@ 0xfffff4fd
    23bc:	00c1b209 	sbceq	fp, r1, r9, lsl #4
    23c0:	160a0300 	strne	r0, [sl], -r0, lsl #6
    23c4:	00000007 	andeq	r0, r0, r7
    23c8:	0c030400 	cfstrseq	mvf0, [r3], {-0}
    23cc:	b7090517 	smladlt	r9, r7, r5, r0
    23d0:	030000e2 	movweq	r0, #226	@ 0xe2
    23d4:	8907180c 	stmdbhi	r7, {r2, r3, fp, ip}
    23d8:	03000017 	movweq	r0, #23
    23dc:	00070b24 	andeq	r0, r7, r4, lsr #22
    23e0:	04000000 	streq	r0, [r0], #-0
    23e4:	77052705 	strvc	r2, [r5, -r5, lsl #14]
    23e8:	28030000 	stmdacs	r3, {}	@ <UNPREDICTABLE>
    23ec:	00000719 	andeq	r0, r0, r9, lsl r7
    23f0:	07040000 	streq	r0, [r4, -r0]
    23f4:	000017a5 	andeq	r1, r0, r5, lsr #15
    23f8:	071a5503 	ldreq	r5, [sl, -r3, lsl #10]
    23fc:	00000000 	andeq	r0, r0, r0
    2400:	00000704 	andeq	r0, r0, r4, lsl #14
    2404:	03040000 	movweq	r0, #16384	@ 0x4000
    2408:	08051b0d 	stmdaeq	r5, {r0, r2, r3, r8, r9, fp, ip}
    240c:	0000412d 	andeq	r4, r0, sp, lsr #2
    2410:	04080a03 	streq	r0, [r8], #-2563	@ 0xfffff5fd
    2414:	00000007 	andeq	r0, r0, r7
    2418:	0b100300 	bleq	403020 <_Min_Stack_Size+0x402c20>
    241c:	00000007 	andeq	r0, r0, r7
    2420:	14030400 	strne	r0, [r3], #-1024	@ 0xfffffc00
    2424:	c202051c 	andgt	r0, r2, #28, 10	@ 0x7000000
    2428:	0400004e 	streq	r0, [r0], #-78	@ 0xffffffb2
    242c:	071d1603 	ldreq	r1, [sp, -r3, lsl #12]
    2430:	00000000 	andeq	r0, r0, r0
    2434:	00000704 	andeq	r0, r0, r4, lsl #14
    2438:	03040000 	movweq	r0, #16384	@ 0x4000
    243c:	09031e0e 	stmdbeq	r3, {r1, r2, r3, r9, sl, fp, ip}
    2440:	7c0a051f 	cfstr32vc	mvfx0, [sl], {31}
    2444:	03000089 	movweq	r0, #137	@ 0x89
    2448:	0007200d 	andeq	r2, r7, sp
    244c:	04000000 	streq	r0, [r0], #-0
    2450:	07210e03 	streq	r0, [r1, -r3, lsl #28]!
    2454:	00000000 	andeq	r0, r0, r0
    2458:	00000704 	andeq	r0, r0, r4, lsl #14
    245c:	05040000 	streq	r0, [r4, #-0]
    2460:	0089730d 	addeq	r7, r9, sp, lsl #6
    2464:	00070400 	andeq	r0, r7, r0, lsl #8
    2468:	04000000 	streq	r0, [r0], #-0
    246c:	00000007 	andeq	r0, r0, r7
    2470:	0c030400 	cfstrseq	mvf0, [r3], {-0}
    2474:	02c40722 	sbceq	r0, r4, #8912896	@ 0x880000
    2478:	63030000 	movwvs	r0, #12288	@ 0x3000
    247c:	e6200523 	strt	r0, [r0], -r3, lsr #10
    2480:	03000066 	movweq	r0, #102	@ 0x66
    2484:	ec07243f 	cfstrs	mvf2, [r7], {63}	@ 0x3f
    2488:	04000002 	streq	r0, [r0], #-2
    248c:	00030807 	andeq	r0, r3, r7, lsl #16
    2490:	25780300 	ldrbcs	r0, [r8, #-768]!	@ 0xfffffd00
    2494:	4b631a05 	blmi	18c8cb0 <_Min_Stack_Size+0x18c88b0>
    2498:	3b030000 	blcc	c24a0 <_Min_Stack_Size+0xc20a0>
    249c:	032a0726 			@ <UNDEFINED> instruction: 0x032a0726
    24a0:	04040000 	streq	r0, [r4], #-0
    24a4:	00041507 	andeq	r1, r4, r7, lsl #10
    24a8:	0e9a0300 	cdpeq	3, 9, cr0, cr10, cr0, {0}
    24ac:	12890727 	addne	r0, r9, #10223616	@ 0x9c0000
    24b0:	05040000 	streq	r0, [r4, #-0]
    24b4:	66400eed 	strbvs	r0, [r0], -sp, ror #29
    24b8:	03040000 	movweq	r0, #16384	@ 0x4000
    24bc:	1b052864 	blne	14c654 <_Min_Stack_Size+0x14c254>
    24c0:	0000a190 	muleq	r0, r0, r1
    24c4:	0d030404 	cfstrseq	mvf0, [r3, #-16]
    24c8:	0e030423 	cdpeq	4, 0, cr0, cr3, cr3, {1}
    24cc:	001a0729 	andseq	r0, sl, r9, lsr #14
    24d0:	04040000 	streq	r0, [r4], #-0
    24d4:	Address 0x24d4 is out of bounds.


Disassembly of section .debug_line:

