NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
00000000 <.debug_line>:
       0:	0000012b 	andeq	r0, r0, fp, lsr #2
       4:	008b0003 	addeq	r0, fp, r3
       8:	01020000 	mrseq	r0, (UNDEF: 2)
       c:	000d0efb 	strdeq	r0, [sp], -fp
      10:	01010101 	tsteq	r1, r1, lsl #2
      14:	01000000 	mrseq	r0, (UNDEF: 0)
      18:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
      1c:	54522f2e 	ldrbpl	r2, [r2], #-3886	@ 0xfffff0d2
      20:	4300534f 	movwmi	r5, #847	@ 0x34f
      24:	73552f3a 	cmpvc	r5, #58, 30	@ 0xe8
      28:	2f737265 	svccs	0x00737265
      2c:	74696378 	strbtvc	r6, [r9], #-888	@ 0xfffffc88
      30:	6e4f2f65 	cdpvs	15, 4, cr2, cr15, cr5, {3}
      34:	69724465 	ldmdbvs	r2!, {r0, r2, r5, r6, sl, lr}^
      38:	442f6576 	strtmi	r6, [pc], #-1398	@ 40 <_Min_Heap_Size-0x1c0>
      3c:	746b7365 	strbtvc	r7, [fp], #-869	@ 0xfffffc9b
      40:	4c2f706f 	stcmi	0, cr7, [pc], #-444	@ fffffe8c <_estack+0xdfffd68c>
      44:	6e726165 	rpwvssz	f6, f2, f5
      48:	206e6920 	rsbcs	r6, lr, r0, lsr #18
      4c:	74706564 	ldrbtvc	r6, [r0], #-1380	@ 0xfffffa9c
      50:	74532f68 	ldrbvc	r2, [r3], #-3944	@ 0xfffff098
      54:	2f32336d 	svccs	0x0032336d
      58:	534f5452 	movtpl	r5, #62546	@ 0xf452
      5c:	636e492f 	cmnvs	lr, #770048	@ 0xbc000
      60:	6f430000 	svcvs	0x00430000
      64:	78657472 	stmdavc	r5!, {r1, r4, r5, r6, sl, ip, sp, lr}^
      68:	4f5f584d 	svcmi	0x005f584d
      6c:	6f505f73 	svcvs	0x00505f73
      70:	6e697472 	mcrvs	4, 3, r7, cr9, cr2, {3}
      74:	00632e67 	rsbeq	r2, r3, r7, ror #28
      78:	43000001 	movwmi	r0, #1
      7c:	6574726f 	ldrbvs	r7, [r4, #-623]!	@ 0xfffffd91
      80:	5f584d78 	svcpl	0x00584d78
      84:	505f734f 	subspl	r7, pc, pc, asr #6
      88:	6974726f 	ldmdbvs	r4!, {r0, r1, r2, r3, r5, r6, r9, ip, sp, lr}^
      8c:	682e676e 	stmdavs	lr!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}
      90:	00000200 	andeq	r0, r0, r0, lsl #4
      94:	00050500 	andeq	r0, r5, r0, lsl #10
      98:	01700205 	cmneq	r0, r5, lsl #4
      9c:	0a030800 	beq	c20a4 <_Min_Stack_Size+0xc1ca4>
      a0:	04020001 	streq	r0, [r2], #-1
      a4:	0b051301 	bleq	144cb0 <_Min_Stack_Size+0x1448b0>
      a8:	01040200 	mrseq	r0, R12_usr
      ac:	00010201 	andeq	r0, r1, r1, lsl #4
      b0:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
      b4:	72020500 	andvc	r0, r2, #0, 10
      b8:	03080001 	movweq	r0, #32769	@ 0x8001
      bc:	0200010f 	andeq	r0, r0, #-1073741821	@ 0xc0000003
      c0:	05130104 	ldreq	r0, [r3, #-260]	@ 0xfffffefc
      c4:	0402000b 	streq	r0, [r2], #-11
      c8:	01020101 	tsteq	r2, r1, lsl #2
      cc:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
      d0:	02050005 	andeq	r0, r5, #5
      d4:	08000174 	stmdaeq	r0, {r2, r4, r5, r6, r8}
      d8:	00011403 	andeq	r1, r1, r3, lsl #8
      dc:	13010402 	movwne	r0, #5122	@ 0x1402
      e0:	02000b05 	andeq	r0, r0, #5120	@ 0x1400
      e4:	02010104 	andeq	r0, r1, #4, 2
      e8:	01010001 	tsteq	r1, r1
      ec:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
      f0:	00000002 	andeq	r0, r0, r2
      f4:	01190300 	tsteq	r9, r0, lsl #6
      f8:	01040200 	mrseq	r0, R12_usr
      fc:	000b0513 	andeq	r0, fp, r3, lsl r5
     100:	01010402 	tsteq	r1, r2, lsl #8
     104:	01000102 	tsteq	r0, r2, lsl #2
     108:	00050501 	andeq	r0, r5, r1, lsl #10
     10c:	01760205 	cmneq	r6, r5, lsl #4
     110:	1f030800 	svcne	0x00030800
     114:	96061401 	strls	r1, [r6], -r1, lsl #8
     118:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
     11c:	02050013 	andeq	r0, r5, #19
     120:	00000000 	andeq	r0, r0, r0
     124:	05012c03 	streq	r2, [r1, #-3075]	@ 0xfffff3fd
     128:	01021701 	tsteq	r2, r1, lsl #14
     12c:	f1010100 	setend	le
     130:	03000008 	movweq	r0, #8
     134:	00074c00 	andeq	r4, r7, r0, lsl #24
     138:	fb010200 	blx	40942 <_Min_Stack_Size+0x40542>
     13c:	01000d0e 	tsteq	r0, lr, lsl #26
     140:	00010101 	andeq	r0, r1, r1, lsl #2
     144:	00010000 	andeq	r0, r1, r0
     148:	2e2e0100 	sufcse	f0, f6, f0
     14c:	4f54522f 	svcmi	0x0054522f
     150:	3a430053 	bcc	10c02a4 <_Min_Stack_Size+0x10bfea4>
     154:	6573552f 	ldrbvs	r5, [r3, #-1327]!	@ 0xfffffad1
     158:	782f7372 	stmdavc	pc!, {r1, r4, r5, r6, r8, r9, ip, sp, lr}	@ <UNPREDICTABLE>
     15c:	65746963 	ldrbvs	r6, [r4, #-2403]!	@ 0xfffff69d
     160:	656e4f2f 	strbvs	r4, [lr, #-3887]!	@ 0xfffff0d1
     164:	76697244 	strbtvc	r7, [r9], -r4, asr #4
     168:	65442f65 	strbvs	r2, [r4, #-3941]	@ 0xfffff09b
     16c:	6f746b73 	svcvs	0x00746b73
     170:	654c2f70 	strbvs	r2, [ip, #-3952]	@ 0xfffff090
     174:	206e7261 	rsbcs	r7, lr, r1, ror #4
     178:	64206e69 	strtvs	r6, [r0], #-3689	@ 0xfffff197
     17c:	68747065 	ldmdavs	r4!, {r0, r2, r5, r6, ip, sp, lr}^
     180:	6d74532f 	ldclvs	3, cr5, [r4, #-188]!	@ 0xffffff44
     184:	522f3233 	eorpl	r3, pc, #805306371	@ 0x30000003
     188:	2f534f54 	svccs	0x00534f54
     18c:	00636e49 	rsbeq	r6, r3, r9, asr #28
     190:	535c3a43 	cmppl	ip, #274432	@ 0x43000
     194:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
     198:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     19c:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     1a0:	315f4544 	cmpcc	pc, r4, asr #10
     1a4:	2e33312e 	rsfcssp	f3, f3, #0.5
     1a8:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
     1ac:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     1b0:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     1b4:	705c4544 	subsvc	r4, ip, r4, asr #10
     1b8:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
     1bc:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
     1c0:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
     1c4:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
     1c8:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
     1cc:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
     1d0:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
     1d4:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
     1d8:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
     1dc:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
     1e0:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 18 <_Min_Heap_Size-0x1e8>
     1e4:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
     1e8:	6f742d75 	svcvs	0x00742d75
     1ec:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
     1f0:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
     1f4:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
     1f8:	32312e32 	eorscc	r2, r1, #800	@ 0x320
     1fc:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
     200:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
     204:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
     208:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
     20c:	30322e30 	eorscc	r2, r2, r0, lsr lr
     210:	30322e30 	eorscc	r2, r2, r0, lsr lr
     214:	36303432 			@ <UNDEFINED> instruction: 0x36303432
     218:	36313931 			@ <UNDEFINED> instruction: 0x36313931
     21c:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
     220:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     224:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
     228:	2f2e2e2f 	svccs	0x002e2e2f
     22c:	2f62696c 	svccs	0x0062696c
     230:	2f636367 	svccs	0x00636367
     234:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
     238:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
     23c:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
     240:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
     244:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
     248:	2f2e2e2f 	svccs	0x002e2e2f
     24c:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     250:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
     254:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
     258:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
     25c:	61652d65 	cmnvs	r5, r5, ror #26
     260:	692f6962 	stmdbvs	pc!, {r1, r5, r6, r8, fp, sp, lr}	@ <UNPREDICTABLE>
     264:	756c636e 	strbvc	r6, [ip, #-878]!	@ 0xfffffc92
     268:	43006564 	movwmi	r6, #1380	@ 0x564
     26c:	54535c3a 	ldrbpl	r5, [r3], #-3130	@ 0xfffff3c6
     270:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
     274:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
     278:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
     27c:	2e315f45 	cdpcs	15, 3, cr5, cr1, cr5, {2}
     280:	302e3331 	eorcc	r3, lr, r1, lsr r3
     284:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
     288:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
     28c:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
     290:	6c705c45 	ldclvs	12, cr5, [r0], #-276	@ 0xfffffeec
     294:	6e696775 	mcrvs	7, 3, r6, cr9, cr5, {3}
     298:	6f635c73 	svcvs	0x00635c73
     29c:	74732e6d 	ldrbtvc	r2, [r3], #-3693	@ 0xfffff193
     2a0:	6d74732e 	ldclvs	3, cr7, [r4, #-184]!	@ 0xffffff48
     2a4:	75633233 	strbvc	r3, [r3, #-563]!	@ 0xfffffdcd
     2a8:	692e6562 	stmdbvs	lr!, {r1, r5, r6, r8, sl, sp, lr}
     2ac:	6d2e6564 	cfstr32vs	mvfx6, [lr, #-400]!	@ 0xfffffe70
     2b0:	652e7563 	strvs	r7, [lr, #-1379]!	@ 0xfffffa9d
     2b4:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
     2b8:	746c616e 	strbtvc	r6, [ip], #-366	@ 0xfffffe92
     2bc:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     2c0:	756e672e 	strbvc	r6, [lr, #-1838]!	@ 0xfffff8d2
     2c4:	6f6f742d 	svcvs	0x006f742d
     2c8:	662d736c 	strtvs	r7, [sp], -ip, ror #6
     2cc:	732d726f 			@ <UNDEFINED> instruction: 0x732d726f
     2d0:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
     2d4:	2e32312e 	rsfcssp	f3, f2, #0.5
     2d8:	65722e33 	ldrbvs	r2, [r2, #-3635]!	@ 0xfffff1cd
     2dc:	772e316c 	strvc	r3, [lr, -ip, ror #2]!
     2e0:	32336e69 	eorscc	r6, r3, #1680	@ 0x690
     2e4:	302e315f 	eorcc	r3, lr, pc, asr r1
     2e8:	3030322e 	eorscc	r3, r0, lr, lsr #4
     2ec:	3230322e 	eorscc	r3, r0, #-536870910	@ 0xe0000002
     2f0:	31363034 	teqcc	r6, r4, lsr r0
     2f4:	32363139 	eorscc	r3, r6, #1073741838	@ 0x4000000e
     2f8:	6f745c33 	svcvs	0x00745c33
     2fc:	5c736c6f 	ldclpl	12, cr6, [r3], #-444	@ 0xfffffe44
     300:	2f6e6962 	svccs	0x006e6962
     304:	612f2e2e 			@ <UNDEFINED> instruction: 0x612f2e2e
     308:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
     30c:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
     310:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
     314:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
     318:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
     31c:	77656e2f 	strbvc	r6, [r5, -pc, lsr #28]!
     320:	2d62696c 			@ <UNDEFINED> instruction: 0x2d62696c
     324:	6f6e616e 	svcvs	0x006e616e
     328:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
     32c:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
     330:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
     334:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
     338:	5f454449 	svcpl	0x00454449
     33c:	33312e31 	teqcc	r1, #784	@ 0x310
     340:	535c302e 	cmppl	ip, #46	@ 0x2e
     344:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
     348:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
     34c:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
     350:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
     354:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
     358:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
     35c:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
     360:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
     364:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
     368:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
     36c:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
     370:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
     374:	616e7265 	cmnvs	lr, r5, ror #4
     378:	6f6f746c 	svcvs	0x006f746c
     37c:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
     380:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
     384:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     388:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
     38c:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
     390:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
     394:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
     398:	316c6572 	smccc	50770	@ 0xc652
     39c:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
     3a0:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
     3a4:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
     3a8:	322e3030 	eorcc	r3, lr, #48	@ 0x30
     3ac:	30343230 	eorscc	r3, r4, r0, lsr r2
     3b0:	31393136 	teqcc	r9, r6, lsr r1
     3b4:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
     3b8:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 1f0 <_Min_Heap_Size-0x10>
     3bc:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
     3c0:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
     3c4:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
     3c8:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
     3cc:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
     3d0:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
     3d4:	61652d65 	cmnvs	r5, r5, ror #26
     3d8:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
     3dc:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
     3e0:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
     3e4:	2f2e2e2f 	svccs	0x002e2e2f
     3e8:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     3ec:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
     3f0:	6f6e2d6d 	svcvs	0x006e2d6d
     3f4:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
     3f8:	2f696261 	svccs	0x00696261
     3fc:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
     400:	2f656475 	svccs	0x00656475
     404:	00737973 	rsbseq	r7, r3, r3, ror r9
     408:	535c3a43 	cmppl	ip, #274432	@ 0x43000
     40c:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
     410:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     414:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     418:	315f4544 	cmpcc	pc, r4, asr #10
     41c:	2e33312e 	rsfcssp	f3, f3, #0.5
     420:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
     424:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     428:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     42c:	705c4544 	subsvc	r4, ip, r4, asr #10
     430:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
     434:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
     438:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
     43c:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
     440:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
     444:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
     448:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
     44c:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
     450:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
     454:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
     458:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 290 <_Min_Heap_Size+0x90>
     45c:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
     460:	6f742d75 	svcvs	0x00742d75
     464:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
     468:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
     46c:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
     470:	32312e32 	eorscc	r2, r1, #800	@ 0x320
     474:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
     478:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
     47c:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
     480:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
     484:	30322e30 	eorscc	r2, r2, r0, lsr lr
     488:	30322e30 	eorscc	r2, r2, r0, lsr lr
     48c:	36303432 			@ <UNDEFINED> instruction: 0x36303432
     490:	36313931 			@ <UNDEFINED> instruction: 0x36313931
     494:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
     498:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     49c:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
     4a0:	2f2e2e2f 	svccs	0x002e2e2f
     4a4:	2f62696c 	svccs	0x0062696c
     4a8:	2f636367 	svccs	0x00636367
     4ac:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
     4b0:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
     4b4:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
     4b8:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
     4bc:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
     4c0:	2f2e2e2f 	svccs	0x002e2e2f
     4c4:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     4c8:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
     4cc:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
     4d0:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
     4d4:	61652d65 	cmnvs	r5, r5, ror #26
     4d8:	692f6962 	stmdbvs	pc!, {r1, r5, r6, r8, fp, sp, lr}	@ <UNPREDICTABLE>
     4dc:	756c636e 	strbvc	r6, [ip, #-878]!	@ 0xfffffc92
     4e0:	6d2f6564 	cfstr32vs	mvfx6, [pc, #-400]!	@ 358 <_Min_Heap_Size+0x158>
     4e4:	69686361 	stmdbvs	r8!, {r0, r5, r6, r8, r9, sp, lr}^
     4e8:	4300656e 	movwmi	r6, #1390	@ 0x56e
     4ec:	54535c3a 	ldrbpl	r5, [r3], #-3130	@ 0xfffff3c6
     4f0:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
     4f4:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
     4f8:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
     4fc:	2e315f45 	cdpcs	15, 3, cr5, cr1, cr5, {2}
     500:	302e3331 	eorcc	r3, lr, r1, lsr r3
     504:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
     508:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
     50c:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
     510:	6c705c45 	ldclvs	12, cr5, [r0], #-276	@ 0xfffffeec
     514:	6e696775 	mcrvs	7, 3, r6, cr9, cr5, {3}
     518:	6f635c73 	svcvs	0x00635c73
     51c:	74732e6d 	ldrbtvc	r2, [r3], #-3693	@ 0xfffff193
     520:	6d74732e 	ldclvs	3, cr7, [r4, #-184]!	@ 0xffffff48
     524:	75633233 	strbvc	r3, [r3, #-563]!	@ 0xfffffdcd
     528:	692e6562 	stmdbvs	lr!, {r1, r5, r6, r8, sl, sp, lr}
     52c:	6d2e6564 	cfstr32vs	mvfx6, [lr, #-400]!	@ 0xfffffe70
     530:	652e7563 	strvs	r7, [lr, #-1379]!	@ 0xfffffa9d
     534:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
     538:	746c616e 	strbtvc	r6, [ip], #-366	@ 0xfffffe92
     53c:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     540:	756e672e 	strbvc	r6, [lr, #-1838]!	@ 0xfffff8d2
     544:	6f6f742d 	svcvs	0x006f742d
     548:	662d736c 	strtvs	r7, [sp], -ip, ror #6
     54c:	732d726f 			@ <UNDEFINED> instruction: 0x732d726f
     550:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
     554:	2e32312e 	rsfcssp	f3, f2, #0.5
     558:	65722e33 	ldrbvs	r2, [r2, #-3635]!	@ 0xfffff1cd
     55c:	772e316c 	strvc	r3, [lr, -ip, ror #2]!
     560:	32336e69 	eorscc	r6, r3, #1680	@ 0x690
     564:	302e315f 	eorcc	r3, lr, pc, asr r1
     568:	3030322e 	eorscc	r3, r0, lr, lsr #4
     56c:	3230322e 	eorscc	r3, r0, #-536870910	@ 0xe0000002
     570:	31363034 	teqcc	r6, r4, lsr r0
     574:	32363139 	eorscc	r3, r6, #1073741838	@ 0x4000000e
     578:	6f745c33 	svcvs	0x00745c33
     57c:	5c736c6f 	ldclpl	12, cr6, [r3], #-444	@ 0xfffffe44
     580:	2f6e6962 	svccs	0x006e6962
     584:	6c2f2e2e 	stcvs	14, cr2, [pc], #-184	@ 4d4 <_Min_Stack_Size+0xd4>
     588:	672f6269 	strvs	r6, [pc, -r9, ror #4]!
     58c:	612f6363 			@ <UNDEFINED> instruction: 0x612f6363
     590:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
     594:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
     598:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
     59c:	2e32312f 	rsfcssp	f3, f2, #10.0
     5a0:	2f312e33 	svccs	0x00312e33
     5a4:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
     5a8:	00656475 	rsbeq	r6, r5, r5, ror r4
     5ac:	552f3a43 	strpl	r3, [pc, #-2627]!	@ fffffb71 <_estack+0xdfffd371>
     5b0:	73726573 	cmnvc	r2, #482344960	@ 0x1cc00000
     5b4:	6963782f 	stmdbvs	r3!, {r0, r1, r2, r3, r5, fp, ip, sp, lr}^
     5b8:	4f2f6574 	svcmi	0x002f6574
     5bc:	7244656e 	subvc	r6, r4, #461373440	@ 0x1b800000
     5c0:	2f657669 	svccs	0x00657669
     5c4:	6b736544 	blvs	1cd9adc <_Min_Stack_Size+0x1cd96dc>
     5c8:	2f706f74 	svccs	0x00706f74
     5cc:	7261654c 	rsbvc	r6, r1, #76, 10	@ 0x13000000
     5d0:	6e69206e 	cdpvs	0, 6, cr2, cr9, cr14, {3}
     5d4:	70656420 	rsbvc	r6, r5, r0, lsr #8
     5d8:	532f6874 			@ <UNDEFINED> instruction: 0x532f6874
     5dc:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
     5e0:	4d54532f 	ldclmi	3, cr5, [r4, #-188]	@ 0xffffff44
     5e4:	31463233 	cmpcc	r6, r3, lsr r2
     5e8:	36433330 			@ <UNDEFINED> instruction: 0x36433330
     5ec:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
     5f0:	73726576 	cmnvc	r2, #494927872	@ 0x1d800000
     5f4:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
     5f8:	2f3a4300 	svccs	0x003a4300
     5fc:	72657355 	rsbvc	r7, r5, #1409286145	@ 0x54000001
     600:	63782f73 	cmnvs	r8, #460	@ 0x1cc
     604:	2f657469 	svccs	0x00657469
     608:	44656e4f 	strbtmi	r6, [r5], #-3663	@ 0xfffff1b1
     60c:	65766972 	ldrbvs	r6, [r6, #-2418]!	@ 0xfffff68e
     610:	7365442f 	cmnvc	r5, #788529152	@ 0x2f000000
     614:	706f746b 	rsbvc	r7, pc, fp, ror #8
     618:	61654c2f 	cmnvs	r5, pc, lsr #24
     61c:	69206e72 	stmdbvs	r0!, {r1, r4, r5, r6, r9, sl, fp, sp, lr}
     620:	6564206e 	strbvs	r2, [r4, #-110]!	@ 0xffffff92
     624:	2f687470 	svccs	0x00687470
     628:	336d7453 	cmncc	sp, #1392508928	@ 0x53000000
     62c:	4d432f32 	stclmi	15, cr2, [r3, #-200]	@ 0xffffff38
     630:	5f534953 	svcpl	0x00534953
     634:	00003556 	andeq	r3, r0, r6, asr r5
     638:	534f5452 	movtpl	r5, #62546	@ 0xf452
     63c:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
     640:	00632e4f 	rsbeq	r2, r3, pc, asr #28
     644:	53000001 	movwpl	r0, #1
     648:	64656863 	strbtvs	r6, [r5], #-2147	@ 0xfffff79d
     64c:	72616c75 	rsbvc	r6, r1, #29952	@ 0x7500
     650:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
     654:	54520000 	ldrbpl	r0, [r2], #-0
     658:	465f534f 	ldrbmi	r5, [pc], -pc, asr #6
     65c:	2e4f4649 	cdpcs	6, 4, cr4, cr15, cr9, {2}
     660:	00020068 	andeq	r0, r2, r8, rrx
     664:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
     668:	682e6f69 	stmdavs	lr!, {r0, r3, r5, r6, r8, r9, sl, fp, sp, lr}
     66c:	00000300 	andeq	r0, r0, r0, lsl #6
     670:	736e615f 	cmnvc	lr, #-1073741801	@ 0xc0000017
     674:	00682e69 	rsbeq	r2, r8, r9, ror #28
     678:	6e000003 	cdpvs	0, 0, cr0, cr0, cr3, {0}
     67c:	696c7765 	stmdbvs	ip!, {r0, r2, r5, r6, r8, r9, sl, ip, sp, lr}^
     680:	00682e62 	rsbeq	r2, r8, r2, ror #28
     684:	5f000004 	svcpl	0x00000004
     688:	6c77656e 	cfldr64vs	mvdx6, [r7], #-440	@ 0xfffffe48
     68c:	765f6269 	ldrbvc	r6, [pc], -r9, ror #4
     690:	69737265 	ldmdbvs	r3!, {r0, r2, r5, r6, r9, ip, sp, lr}^
     694:	682e6e6f 	stmdavs	lr!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}
     698:	00000300 	andeq	r0, r0, r0, lsl #6
     69c:	666e6f63 	strbtvs	r6, [lr], -r3, ror #30
     6a0:	682e6769 	stmdavs	lr!, {r0, r3, r5, r6, r8, r9, sl, sp, lr}
     6a4:	00000500 	andeq	r0, r0, r0, lsl #10
     6a8:	65656569 	strbvs	r6, [r5, #-1385]!	@ 0xfffffa97
     6ac:	682e7066 	stmdavs	lr!, {r1, r2, r5, r6, ip, sp, lr}
     6b0:	00000600 	andeq	r0, r0, r0, lsl #12
     6b4:	74616566 	strbtvc	r6, [r1], #-1382	@ 0xfffffa9a
     6b8:	73657275 	cmnvc	r5, #1342177287	@ 0x50000007
     6bc:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
     6c0:	64630000 	strbtvs	r0, [r3], #-0
     6c4:	2e736665 	cdpcs	6, 7, cr6, cr3, cr5, {3}
     6c8:	00050068 	andeq	r0, r5, r8, rrx
     6cc:	65645f00 	strbvs	r5, [r4, #-3840]!	@ 0xfffff100
     6d0:	6c756166 	ldfvse	f6, [r5], #-408	@ 0xfffffe68
     6d4:	79745f74 	ldmdbvc	r4!, {r2, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
     6d8:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
     6dc:	00060068 	andeq	r0, r6, r8, rrx
     6e0:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
     6e4:	2e666564 	cdpcs	5, 6, cr6, cr6, cr4, {3}
     6e8:	00070068 	andeq	r0, r7, r8, rrx
     6ec:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
     6f0:	2e677261 	cdpcs	2, 6, cr7, cr7, cr1, {3}
     6f4:	00070068 	andeq	r0, r7, r8, rrx
     6f8:	65657200 	strbvs	r7, [r5, #-512]!	@ 0xfffffe00
     6fc:	682e746e 	stmdavs	lr!, {r1, r2, r3, r5, r6, sl, ip, sp, lr}
     700:	00000500 	andeq	r0, r0, r0, lsl #10
     704:	7079745f 	rsbsvc	r7, r9, pc, asr r4
     708:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
     70c:	00000500 	andeq	r0, r0, r0, lsl #10
     710:	7079745f 	rsbsvc	r7, r9, pc, asr r4
     714:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
     718:	00000600 	andeq	r0, r0, r0, lsl #12
     71c:	6b636f6c 	blvs	18dc4d4 <_Min_Stack_Size+0x18dc0d4>
     720:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
     724:	73610000 	cmnvc	r1, #0
     728:	74726573 	ldrbtvc	r6, [r2], #-1395	@ 0xfffffa8d
     72c:	0300682e 	movweq	r6, #2094	@ 0x82e
     730:	74730000 	ldrbtvc	r0, [r3], #-0
