NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     734:	2e6f6964 	vnmulcs.f16	s13, s30, s9	@ <UNPREDICTABLE>
     738:	00050068 	andeq	r0, r5, r8, rrx
     73c:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
     740:	2e746e69 	cdpcs	14, 7, cr6, cr4, cr9, {3}
     744:	00070068 	andeq	r0, r7, r8, rrx
     748:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
     74c:	2e746e69 	cdpcs	14, 7, cr6, cr4, cr9, {3}
     750:	00030068 	andeq	r0, r3, r8, rrx
     754:	6e695f00 	cdpvs	15, 6, cr5, cr9, cr0, {0}
     758:	70757374 	rsbsvc	r7, r5, r4, ror r3
     75c:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
     760:	735f0000 	cmpvc	pc, #0
     764:	6e696474 	mcrvs	4, 3, r6, cr9, cr4, {3}
     768:	00682e74 	rsbeq	r2, r8, r4, ror lr
     76c:	73000005 	movwvc	r0, #5
     770:	6e697274 	mcrvs	2, 3, r7, cr9, cr4, {3}
     774:	00682e67 	rsbeq	r2, r8, r7, ror #28
     778:	5f000003 	svcpl	0x00000003
     77c:	61636f6c 	cmnvs	r3, ip, ror #30
     780:	682e656c 	stmdavs	lr!, {r2, r3, r5, r6, r8, sl, sp, lr}
     784:	00000500 	andeq	r0, r0, r0, lsl #10
     788:	69727473 	ldmdbvs	r2!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
     78c:	2e73676e 	cdpcs	7, 7, cr6, cr3, cr14, {3}
     790:	00030068 	andeq	r0, r3, r8, rrx
     794:	72747300 	rsbsvc	r7, r4, #0, 6
     798:	2e676e69 	cdpcs	14, 6, cr6, cr7, cr9, {3}
     79c:	00050068 	andeq	r0, r5, r8, rrx
     7a0:	6d747300 	ldclvs	3, cr7, [r4, #-0]
     7a4:	31663233 	cmncc	r6, r3, lsr r2
     7a8:	36633330 			@ <UNDEFINED> instruction: 0x36633330
     7ac:	6970675f 	ldmdbvs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, sp, lr}^
     7b0:	00682e6f 	rsbeq	r2, r8, pc, ror #28
     7b4:	73000008 	movwvc	r0, #8
     7b8:	6f626474 	svcvs	0x00626474
     7bc:	682e6c6f 	stmdavs	lr!, {r0, r1, r2, r3, r5, r6, sl, fp, sp, lr}
     7c0:	00000700 	andeq	r0, r0, r0, lsl #14
     7c4:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
     7c8:	30316632 	eorscc	r6, r1, r2, lsr r6
     7cc:	2e367833 	mrccs	8, 1, r7, cr6, cr3, {1}
     7d0:	00080068 	andeq	r0, r8, r8, rrx
     7d4:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
     7d8:	2e62696c 	vnmulcs.f16	s13, s4, s25	@ <UNPREDICTABLE>
     7dc:	00030068 	andeq	r0, r3, r8, rrx
     7e0:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
     7e4:	2e62696c 	vnmulcs.f16	s13, s4, s25	@ <UNPREDICTABLE>
     7e8:	00060068 	andeq	r0, r6, r8, rrx
     7ec:	6c6c6100 	stfvse	f6, [ip], #-0
     7f0:	2e61636f 	cdpcs	3, 6, cr6, cr1, cr15, {3}
     7f4:	00030068 	andeq	r0, r3, r8, rrx
     7f8:	4d524100 	ldfmie	f4, [r2, #-0]
     7fc:	2e334d43 	cdpcs	13, 3, cr4, cr3, cr3, {2}
     800:	00090068 	andeq	r0, r9, r8, rrx
     804:	726f6300 	rsbvc	r6, pc, #0, 6
     808:	6d635f65 	stclvs	15, cr5, [r3, #-404]!	@ 0xfffffe6c
     80c:	00682e33 	rsbeq	r2, r8, r3, lsr lr
     810:	63000009 	movwvs	r0, #9
     814:	7369736d 	cmnvc	r9, #-1275068415	@ 0xb4000001
     818:	7265765f 	rsbvc	r7, r5, #99614720	@ 0x5f00000
     81c:	6e6f6973 			@ <UNDEFINED> instruction: 0x6e6f6973
     820:	0900682e 	stmdbeq	r0, {r1, r2, r3, r5, fp, sp, lr}
     824:	6d630000 	stclvs	0, cr0, [r3, #-0]
     828:	5f736973 	svcpl	0x00736973
     82c:	706d6f63 	rsbvc	r6, sp, r3, ror #30
     830:	72656c69 	rsbvc	r6, r5, #26880	@ 0x6900
     834:	0900682e 	stmdbeq	r0, {r1, r2, r3, r5, fp, sp, lr}
     838:	6d630000 	stclvs	0, cr0, [r3, #-0]
     83c:	5f736973 	svcpl	0x00736973
     840:	2e636367 	cdpcs	3, 6, cr6, cr3, cr7, {3}
     844:	00090068 	andeq	r0, r9, r8, rrx
     848:	75706d00 	ldrbvc	r6, [r0, #-3328]!	@ 0xfffff300
     84c:	6d72615f 	ldfvse	f6, [r2, #-380]!	@ 0xfffffe84
     850:	682e3776 	stmdavs	lr!, {r1, r2, r4, r5, r6, r8, r9, sl, ip, sp}
     854:	00000900 	andeq	r0, r0, r0, lsl #18
     858:	74737973 	ldrbtvc	r7, [r3], #-2419	@ 0xfffff68d
     85c:	415f6d65 	cmpmi	pc, r5, ror #26
     860:	4d434d52 	stclmi	13, cr4, [r3, #-328]	@ 0xfffffeb8
     864:	00682e33 	rsbeq	r2, r8, r3, lsr lr
     868:	43000009 	movwmi	r0, #9
     86c:	6574726f 	ldrbvs	r7, [r4, #-623]!	@ 0xfffffd91
     870:	5f584d78 	svcpl	0x00584d78
     874:	505f734f 	subspl	r7, pc, pc, asr #6
     878:	6974726f 	ldmdbvs	r4!, {r0, r1, r2, r3, r5, r6, r9, ip, sp, lr}^
     87c:	682e676e 	stmdavs	lr!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}
     880:	00000200 	andeq	r0, r0, r0, lsl #4
     884:	00540500 	subseq	r0, r4, r0, lsl #10
     888:	01880205 	orreq	r0, r8, r5, lsl #4
     88c:	0b030800 	bleq	c2894 <_Min_Stack_Size+0xc2494>
     890:	14020501 	strne	r0, [r2], #-1281	@ 0xfffffaff
     894:	01060405 	tsteq	r6, r5, lsl #8
     898:	23060205 	movwcs	r0, #25093	@ 0x6205
     89c:	01060d05 	tsteq	r6, r5, lsl #26
     8a0:	21060205 	tstcs	r6, r5, lsl #4
     8a4:	01060d05 	tsteq	r6, r5, lsl #26
     8a8:	21060205 	tstcs	r6, r5, lsl #4
     8ac:	01060d05 	tsteq	r6, r5, lsl #26
     8b0:	21060205 	tstcs	r6, r5, lsl #4
     8b4:	01060f05 	tsteq	r6, r5, lsl #30
     8b8:	21060205 	tstcs	r6, r5, lsl #4
     8bc:	01060f05 	tsteq	r6, r5, lsl #30
     8c0:	30060205 	andcc	r0, r6, r5, lsl #4
     8c4:	01060905 	tsteq	r6, r5, lsl #18
     8c8:	030a0520 	movweq	r0, #42272	@ 0xa520
     8cc:	01052078 	tsteq	r5, r8, ror r0
     8d0:	02200a03 	eoreq	r0, r0, #12288	@ 0x3000
     8d4:	01010001 	tsteq	r1, r1
     8d8:	05004005 	streq	r4, [r0, #-5]
     8dc:	00000002 	andeq	r0, r0, r2
     8e0:	011c0300 	tsteq	ip, r0, lsl #6
     8e4:	05160205 	ldreq	r0, [r6, #-517]	@ 0xfffffdfb
     8e8:	05010605 	streq	r0, [r1, #-1541]	@ 0xfffff9fb
     8ec:	0402001a 	streq	r0, [r2], #-26	@ 0xffffffe6
     8f0:	12052e01 	andne	r2, r5, #1, 28
     8f4:	01040200 	mrseq	r0, R12_usr
     8f8:	06020520 	streq	r0, [r2], -r0, lsr #10
     8fc:	06190525 	ldreq	r0, [r9], -r5, lsr #10
     900:	20050501 	andcs	r0, r5, r1, lsl #10
     904:	4d060205 	sfmmi	f0, 4, [r6, #-20]	@ 0xffffffec
     908:	01060f05 	tsteq	r6, r5, lsl #30
     90c:	21060205 	tstcs	r6, r5, lsl #4
     910:	01060f05 	tsteq	r6, r5, lsl #30
     914:	41060205 	tstmi	r6, r5, lsl #4
     918:	01060a05 	tsteq	r6, r5, lsl #20
     91c:	05203705 	streq	r3, [r0, #-1797]!	@ 0xfffff8fb
     920:	3e052042 	cdpcc	0, 0, cr2, cr5, cr2, {2}
     924:	2e530520 	cdpcs	5, 5, cr0, cr3, cr0, {1}
     928:	05200505 	streq	r0, [r0, #-1285]!	@ 0xfffffafb
     92c:	05210603 	streq	r0, [r1, #-1539]!	@ 0xfffff9fd
     930:	0501060e 	streq	r0, [r1, #-1550]	@ 0xfffff9f2
     934:	05300603 	ldreq	r0, [r0, #-1539]!	@ 0xfffff9fd
     938:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
     93c:	05203009 	streq	r3, [r0, #-9]!
     940:	04020021 	streq	r0, [r2], #-33	@ 0xffffffdf
     944:	20720301 	rsbscs	r0, r2, r1, lsl #6
     948:	054b0a05 	strbeq	r0, [fp, #-2565]	@ 0xfffff5fb
     94c:	20100301 	andscs	r0, r0, r1, lsl #6
     950:	6b030a05 	blvs	c316c <_Min_Stack_Size+0xc2d6c>
     954:	20202020 	eorcs	r2, r0, r0, lsr #32
     958:	01000102 	tsteq	r0, r2, lsl #2
     95c:	00420501 	subeq	r0, r2, r1, lsl #10
     960:	00000205 	andeq	r0, r0, r5, lsl #4
     964:	3a030000 	bcc	c096c <_Min_Stack_Size+0xc056c>
     968:	14020501 	strne	r0, [r2], #-1281	@ 0xfffffaff
     96c:	01060505 	tsteq	r6, r5, lsl #10
     970:	02001205 	andeq	r1, r0, #1342177280	@ 0x50000000
     974:	052e0104 	streq	r0, [lr, #-260]!	@ 0xfffffefc
     978:	05320602 	ldreq	r0, [r2, #-1538]!	@ 0xfffff9fe
     97c:	0501060a 	streq	r0, [r1, #-1546]	@ 0xfffff9f6
     980:	02052005 	andeq	r2, r5, #5
     984:	0a054106 	beq	150da4 <_Min_Stack_Size+0x1509a4>
     988:	08050106 	stmdaeq	r5, {r1, r2, r8}
     98c:	06020520 	streq	r0, [r2], -r0, lsr #10
     990:	060f0521 	streq	r0, [pc], -r1, lsr #10
     994:	06020501 	streq	r0, [r2], -r1, lsl #10
     998:	060a053f 			@ <UNDEFINED> instruction: 0x060a053f
     99c:	20370501 	eorscs	r0, r7, r1, lsl #10
     9a0:	05204205 	streq	r4, [r0, #-517]!	@ 0xfffffdfb
     9a4:	5305203e 	movwpl	r2, #20542	@ 0x503e
     9a8:	2005052e 	andcs	r0, r5, lr, lsr #10
     9ac:	21060305 	tstcs	r6, r5, lsl #6
     9b0:	01060e05 	tsteq	r6, r5, lsl #28
     9b4:	30060305 	andcc	r0, r6, r5, lsl #6
     9b8:	01060d05 	tsteq	r6, r5, lsl #26
     9bc:	20300905 	eorscs	r0, r0, r5, lsl #18
     9c0:	6f030a05 	svcvs	0x00030a05
     9c4:	20202020 	eorcs	r2, r0, r0, lsr #32
     9c8:	03010524 	movweq	r0, #5412	@ 0x1524
     9cc:	0102200e 	tsteq	r2, lr
     9d0:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
     9d4:	0205002e 	andeq	r0, r5, #46	@ 0x2e
     9d8:	00000000 	andeq	r0, r0, r0
     9dc:	0100d603 	tsteq	r0, r3, lsl #12
     9e0:	05140205 	ldreq	r0, [r4, #-517]	@ 0xfffffdfb
     9e4:	05010604 	streq	r0, [r1, #-1540]	@ 0xfffff9fc
     9e8:	04020011 	streq	r0, [r2], #-17	@ 0xffffffef
     9ec:	20052e01 	andcs	r2, r5, r1, lsl #28
     9f0:	02040200 	andeq	r0, r4, #0, 4
     9f4:	0602052e 	streq	r0, [r2], -lr, lsr #10
     9f8:	06040530 			@ <UNDEFINED> instruction: 0x06040530
     9fc:	0a052e01 	beq	14c208 <_Min_Stack_Size+0x14be08>
     a00:	20202057 	eorcs	r2, r0, r7, asr r0
     a04:	25010520 	strcs	r0, [r1, #-1312]	@ 0xfffffae0
     a08:	01000102 	tsteq	r0, r2, lsl #2
     a0c:	00230501 	eoreq	r0, r3, r1, lsl #10
     a10:	00000205 	andeq	r0, r0, r5, lsl #4
     a14:	e2030000 	and	r0, r3, #0
     a18:	01050100 	mrseq	r0, (UNDEF: 21)
     a1c:	02011103 	andeq	r1, r1, #-1073741824	@ 0xc0000000
     a20:	01010001 	tsteq	r1, r1
     a24:	00000941 	andeq	r0, r0, r1, asr #18
     a28:	074c0003 	strbeq	r0, [ip, -r3]
     a2c:	01020000 	mrseq	r0, (UNDEF: 2)
     a30:	000d0efb 	strdeq	r0, [sp], -fp
     a34:	01010101 	tsteq	r1, r1, lsl #2
     a38:	01000000 	mrseq	r0, (UNDEF: 0)
     a3c:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
     a40:	54522f2e 	ldrbpl	r2, [r2], #-3886	@ 0xfffff0d2
     a44:	4300534f 	movwmi	r5, #847	@ 0x34f
     a48:	73552f3a 	cmpvc	r5, #58, 30	@ 0xe8
     a4c:	2f737265 	svccs	0x00737265
     a50:	74696378 	strbtvc	r6, [r9], #-888	@ 0xfffffc88
     a54:	6e4f2f65 	cdpvs	15, 4, cr2, cr15, cr5, {3}
     a58:	69724465 	ldmdbvs	r2!, {r0, r2, r5, r6, sl, lr}^
     a5c:	442f6576 	strtmi	r6, [pc], #-1398	@ a64 <_Min_Stack_Size+0x664>
     a60:	746b7365 	strbtvc	r7, [fp], #-869	@ 0xfffffc9b
     a64:	4c2f706f 	stcmi	0, cr7, [pc], #-444	@ 8b0 <_Min_Stack_Size+0x4b0>
     a68:	6e726165 	rpwvssz	f6, f2, f5
     a6c:	206e6920 	rsbcs	r6, lr, r0, lsr #18
     a70:	74706564 	ldrbtvc	r6, [r0], #-1380	@ 0xfffffa9c
     a74:	74532f68 	ldrbvc	r2, [r3], #-3944	@ 0xfffff098
     a78:	2f32336d 	svccs	0x0032336d
     a7c:	534f5452 	movtpl	r5, #62546	@ 0xf452
     a80:	636e492f 	cmnvs	lr, #770048	@ 0xbc000
     a84:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
     a88:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
     a8c:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
     a90:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
     a94:	5f454449 	svcpl	0x00454449
     a98:	33312e31 	teqcc	r1, #784	@ 0x310
     a9c:	535c302e 	cmppl	ip, #46	@ 0x2e
     aa0:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
     aa4:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
     aa8:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
     aac:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
     ab0:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
     ab4:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
     ab8:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
     abc:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
     ac0:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
     ac4:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
     ac8:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
     acc:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
     ad0:	616e7265 	cmnvs	lr, r5, ror #4
     ad4:	6f6f746c 	svcvs	0x006f746c
     ad8:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
     adc:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
     ae0:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     ae4:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
     ae8:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
     aec:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
     af0:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
     af4:	316c6572 	smccc	50770	@ 0xc652
     af8:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
     afc:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
     b00:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
     b04:	322e3030 	eorcc	r3, lr, #48	@ 0x30
     b08:	30343230 	eorscc	r3, r4, r0, lsr r2
     b0c:	31393136 	teqcc	r9, r6, lsr r1
     b10:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
     b14:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 94c <_Min_Stack_Size+0x54c>
     b18:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
     b1c:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
     b20:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
     b24:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
     b28:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
     b2c:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
     b30:	61652d65 	cmnvs	r5, r5, ror #26
     b34:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
     b38:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
     b3c:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
     b40:	2f2e2e2f 	svccs	0x002e2e2f
     b44:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     b48:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
     b4c:	6f6e2d6d 	svcvs	0x006e2d6d
     b50:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
     b54:	2f696261 	svccs	0x00696261
     b58:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
     b5c:	00656475 	rsbeq	r6, r5, r5, ror r4
     b60:	535c3a43 	cmppl	ip, #274432	@ 0x43000
     b64:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
     b68:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     b6c:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     b70:	315f4544 	cmpcc	pc, r4, asr #10
     b74:	2e33312e 	rsfcssp	f3, f3, #0.5
     b78:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
     b7c:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     b80:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     b84:	705c4544 	subsvc	r4, ip, r4, asr #10
     b88:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
     b8c:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
     b90:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
     b94:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
     b98:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
     b9c:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
     ba0:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
     ba4:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
     ba8:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
     bac:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
     bb0:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 9e8 <_Min_Stack_Size+0x5e8>
     bb4:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
     bb8:	6f742d75 	svcvs	0x00742d75
     bbc:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
     bc0:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
     bc4:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
     bc8:	32312e32 	eorscc	r2, r1, #800	@ 0x320
     bcc:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
     bd0:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
     bd4:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
     bd8:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
     bdc:	30322e30 	eorscc	r2, r2, r0, lsr lr
     be0:	30322e30 	eorscc	r2, r2, r0, lsr lr
     be4:	36303432 			@ <UNDEFINED> instruction: 0x36303432
     be8:	36313931 			@ <UNDEFINED> instruction: 0x36313931
     bec:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
     bf0:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     bf4:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
     bf8:	2f2e2e2f 	svccs	0x002e2e2f
     bfc:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
     c00:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
     c04:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
     c08:	6e692f69 	cdpvs	15, 6, cr2, cr9, cr9, {3}
     c0c:	64756c63 	ldrbtvs	r6, [r5], #-3171	@ 0xfffff39d
     c10:	656e2f65 	strbvs	r2, [lr, #-3941]!	@ 0xfffff09b
     c14:	62696c77 	rsbvs	r6, r9, #30464	@ 0x7700
     c18:	6e616e2d 	cdpvs	14, 6, cr6, cr1, cr13, {1}
     c1c:	3a43006f 	bcc	10c0de0 <_Min_Stack_Size+0x10c09e0>
     c20:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
     c24:	334d5453 	movtcc	r5, #54355	@ 0xd453
     c28:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
     c2c:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
     c30:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
     c34:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
     c38:	334d5453 	movtcc	r5, #54355	@ 0xd453
     c3c:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
     c40:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
     c44:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
     c48:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
     c4c:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ ae4 <_Min_Stack_Size+0x6e4>
     c50:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
     c54:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
     c58:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
     c5c:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
     c60:	636d2e65 	cmnvs	sp, #1616	@ 0x650
     c64:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
     c68:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
     c6c:	6f746c61 	svcvs	0x00746c61
     c70:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
     c74:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
     c78:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ ab0 <_Min_Stack_Size+0x6b0>
     c7c:	6f662d73 	svcvs	0x00662d73
     c80:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
     c84:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
     c88:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
     c8c:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
     c90:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
     c94:	5f32336e 	svcpl	0x0032336e
     c98:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
     c9c:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
     ca0:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
     ca4:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
     ca8:	33323631 	teqcc	r2, #51380224	@ 0x3100000
     cac:	6f6f745c 	svcvs	0x006f745c
     cb0:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
     cb4:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
     cb8:	696c2f2e 	stmdbvs	ip!, {r1, r2, r3, r5, r8, r9, sl, fp, sp}^
     cbc:	63672f62 	cmnvs	r7, #392	@ 0x188
     cc0:	72612f63 	rsbvc	r2, r1, #396	@ 0x18c
     cc4:	6f6e2d6d 	svcvs	0x006e2d6d
     cc8:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
     ccc:	2f696261 	svccs	0x00696261
     cd0:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
     cd4:	2e2f312e 	sufcsep	f3, f7, #0.5
     cd8:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
     cdc:	2f2e2e2f 	svccs	0x002e2e2f
     ce0:	612f2e2e 			@ <UNDEFINED> instruction: 0x612f2e2e
     ce4:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
     ce8:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
     cec:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
     cf0:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
     cf4:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
     cf8:	7379732f 	cmnvc	r9, #-1140850688	@ 0xbc000000
     cfc:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
     d00:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
     d04:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
     d08:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
     d0c:	5f454449 	svcpl	0x00454449
     d10:	33312e31 	teqcc	r1, #784	@ 0x310
     d14:	535c302e 	cmppl	ip, #46	@ 0x2e
     d18:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
     d1c:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
     d20:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
     d24:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
     d28:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
     d2c:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
     d30:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
     d34:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
     d38:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
     d3c:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
     d40:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
     d44:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
     d48:	616e7265 	cmnvs	lr, r5, ror #4
     d4c:	6f6f746c 	svcvs	0x006f746c
     d50:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
     d54:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
     d58:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     d5c:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
     d60:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
     d64:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
     d68:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
     d6c:	316c6572 	smccc	50770	@ 0xc652
     d70:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
     d74:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
     d78:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
     d7c:	322e3030 	eorcc	r3, lr, #48	@ 0x30
     d80:	30343230 	eorscc	r3, r4, r0, lsr r2
     d84:	31393136 	teqcc	r9, r6, lsr r1
     d88:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
     d8c:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ bc4 <_Min_Stack_Size+0x7c4>
     d90:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
     d94:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
     d98:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
     d9c:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
     da0:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
     da4:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
     da8:	61652d65 	cmnvs	r5, r5, ror #26
     dac:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
     db0:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
     db4:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
     db8:	2f2e2e2f 	svccs	0x002e2e2f
     dbc:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
     dc0:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
     dc4:	6f6e2d6d 	svcvs	0x006e2d6d
     dc8:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
     dcc:	2f696261 	svccs	0x00696261
     dd0:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
     dd4:	2f656475 	svccs	0x00656475
     dd8:	6863616d 	stmdavs	r3!, {r0, r2, r3, r5, r6, r8, sp, lr}^
     ddc:	00656e69 	rsbeq	r6, r5, r9, ror #28
     de0:	535c3a43 	cmppl	ip, #274432	@ 0x43000
     de4:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
     de8:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     dec:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     df0:	315f4544 	cmpcc	pc, r4, asr #10
     df4:	2e33312e 	rsfcssp	f3, f3, #0.5
     df8:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
     dfc:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
     e00:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
     e04:	705c4544 	subsvc	r4, ip, r4, asr #10
     e08:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
     e0c:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
     e10:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
     e14:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
     e18:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
     e1c:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
     e20:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
     e24:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
     e28:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
     e2c:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
     e30:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ c68 <_Min_Stack_Size+0x868>
     e34:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
     e38:	6f742d75 	svcvs	0x00742d75
     e3c:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
     e40:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
     e44:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
     e48:	32312e32 	eorscc	r2, r1, #800	@ 0x320
     e4c:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
     e50:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
     e54:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
     e58:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
     e5c:	30322e30 	eorscc	r2, r2, r0, lsr lr
     e60:	30322e30 	eorscc	r2, r2, r0, lsr lr
     e64:	36303432 			@ <UNDEFINED> instruction: 0x36303432
     e68:	36313931 			@ <UNDEFINED> instruction: 0x36313931
     e6c:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
     e70:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
     e74:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
     e78:	2f2e2e2f 	svccs	0x002e2e2f
     e7c:	2f62696c 	svccs	0x0062696c
     e80:	2f636367 	svccs	0x00636367
     e84:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
     e88:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
