NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     e8c:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
     e90:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
     e94:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
     e98:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
     e9c:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
     ea0:	2f3a4300 	svccs	0x003a4300
     ea4:	72657355 	rsbvc	r7, r5, #1409286145	@ 0x54000001
     ea8:	63782f73 	cmnvs	r8, #460	@ 0x1cc
     eac:	2f657469 	svccs	0x00657469
     eb0:	44656e4f 	strbtmi	r6, [r5], #-3663	@ 0xfffff1b1
     eb4:	65766972 	ldrbvs	r6, [r6, #-2418]!	@ 0xfffff68e
     eb8:	7365442f 	cmnvc	r5, #788529152	@ 0x2f000000
     ebc:	706f746b 	rsbvc	r7, pc, fp, ror #8
     ec0:	61654c2f 	cmnvs	r5, pc, lsr #24
     ec4:	69206e72 	stmdbvs	r0!, {r1, r4, r5, r6, r9, sl, fp, sp, lr}
     ec8:	6564206e 	strbvs	r2, [r4, #-110]!	@ 0xffffff92
     ecc:	2f687470 	svccs	0x00687470
     ed0:	336d7453 	cmncc	sp, #1392508928	@ 0x53000000
     ed4:	54532f32 	ldrbpl	r2, [r3], #-3890	@ 0xfffff0ce
     ed8:	4632334d 	ldrtmi	r3, [r2], -sp, asr #6
     edc:	43333031 	teqmi	r3, #49	@ 0x31
     ee0:	72445f36 	subvc	r5, r4, #54, 30	@ 0xd8
     ee4:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
     ee8:	6e692f73 	mcrvs	15, 3, r2, cr9, cr3, {3}
     eec:	3a430063 	bcc	10c1080 <_Min_Stack_Size+0x10c0c80>
     ef0:	6573552f 	ldrbvs	r5, [r3, #-1327]!	@ 0xfffffad1
     ef4:	782f7372 	stmdavc	pc!, {r1, r4, r5, r6, r8, r9, ip, sp, lr}	@ <UNPREDICTABLE>
     ef8:	65746963 	ldrbvs	r6, [r4, #-2403]!	@ 0xfffff69d
     efc:	656e4f2f 	strbvs	r4, [lr, #-3887]!	@ 0xfffff0d1
     f00:	76697244 	strbtvc	r7, [r9], -r4, asr #4
     f04:	65442f65 	strbvs	r2, [r4, #-3941]	@ 0xfffff09b
     f08:	6f746b73 	svcvs	0x00746b73
     f0c:	654c2f70 	strbvs	r2, [ip, #-3952]	@ 0xfffff090
     f10:	206e7261 	rsbcs	r7, lr, r1, ror #4
     f14:	64206e69 	strtvs	r6, [r0], #-3689	@ 0xfffff197
     f18:	68747065 	ldmdavs	r4!, {r0, r2, r5, r6, ip, sp, lr}^
     f1c:	6d74532f 	ldclvs	3, cr5, [r4, #-188]!	@ 0xffffff44
     f20:	432f3233 			@ <UNDEFINED> instruction: 0x432f3233
     f24:	5349534d 	movtpl	r5, #37709	@ 0x934d
     f28:	0035565f 	eorseq	r5, r5, pc, asr r6
     f2c:	68635300 	stmdavs	r3!, {r8, r9, ip, lr}^
     f30:	6c756465 	cfldrdvs	mvd6, [r5], #-404	@ 0xfffffe6c
     f34:	632e7261 			@ <UNDEFINED> instruction: 0x632e7261
     f38:	00000100 	andeq	r0, r0, r0, lsl #2
     f3c:	74726f43 	ldrbtvc	r6, [r2], #-3907	@ 0xfffff0bd
     f40:	584d7865 	stmdapl	sp, {r0, r2, r5, r6, fp, ip, sp, lr}^
     f44:	5f734f5f 	svcpl	0x00734f5f
     f48:	74726f50 	ldrbtvc	r6, [r2], #-3920	@ 0xfffff0b0
     f4c:	2e676e69 	cdpcs	14, 6, cr6, cr7, cr9, {3}
     f50:	00020068 	andeq	r0, r2, r8, rrx
     f54:	68635300 	stmdavs	r3!, {r8, r9, ip, lr}^
     f58:	6c756465 	cfldrdvs	mvd6, [r5], #-404	@ 0xfffffe6c
     f5c:	682e7261 	stmdavs	lr!, {r0, r5, r6, r9, ip, sp, lr}
     f60:	00000200 	andeq	r0, r0, r0, lsl #4
     f64:	534f5452 	movtpl	r5, #62546	@ 0xf452
     f68:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
     f6c:	00682e4f 	rsbeq	r2, r8, pc, asr #28
     f70:	73000002 	movwvc	r0, #2
     f74:	6e697274 	mcrvs	2, 3, r7, cr9, cr4, {3}
     f78:	00682e67 	rsbeq	r2, r8, r7, ror #28
     f7c:	5f000003 	svcpl	0x00000003
     f80:	69736e61 	ldmdbvs	r3!, {r0, r5, r6, r9, sl, fp, sp, lr}^
     f84:	0300682e 	movweq	r6, #2094	@ 0x82e
     f88:	656e0000 	strbvs	r0, [lr, #-0]!
     f8c:	62696c77 	rsbvs	r6, r9, #30464	@ 0x7700
     f90:	0400682e 	streq	r6, [r0], #-2094	@ 0xfffff7d2
     f94:	6e5f0000 	cdpvs	0, 5, cr0, cr15, cr0, {0}
     f98:	696c7765 	stmdbvs	ip!, {r0, r2, r5, r6, r8, r9, sl, ip, sp, lr}^
     f9c:	65765f62 	ldrbvs	r5, [r6, #-3938]!	@ 0xfffff09e
     fa0:	6f697372 	svcvs	0x00697372
     fa4:	00682e6e 	rsbeq	r2, r8, lr, ror #28
     fa8:	63000003 	movwvs	r0, #3
     fac:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
     fb0:	00682e67 	rsbeq	r2, r8, r7, ror #28
     fb4:	69000005 	stmdbvs	r0, {r0, r2}
     fb8:	66656565 	strbtvs	r6, [r5], -r5, ror #10
     fbc:	00682e70 	rsbeq	r2, r8, r0, ror lr
     fc0:	66000006 	strvs	r0, [r0], -r6
     fc4:	75746165 	ldrbvc	r6, [r4, #-357]!	@ 0xfffffe9b
     fc8:	2e736572 	mrccs	5, 3, r6, cr3, cr2, {3}
     fcc:	00050068 	andeq	r0, r5, r8, rrx
     fd0:	65657200 	strbvs	r7, [r5, #-512]!	@ 0xfffffe00
     fd4:	682e746e 	stmdavs	lr!, {r1, r2, r3, r5, r6, sl, ip, sp, lr}
     fd8:	00000500 	andeq	r0, r0, r0, lsl #10
     fdc:	64647473 	strbtvs	r7, [r4], #-1139	@ 0xfffffb8d
     fe0:	682e6665 	stmdavs	lr!, {r0, r2, r5, r6, r9, sl, sp, lr}
     fe4:	00000700 	andeq	r0, r0, r0, lsl #14
     fe8:	7079745f 	rsbsvc	r7, r9, pc, asr r4
     fec:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
     ff0:	00000500 	andeq	r0, r0, r0, lsl #10
     ff4:	7079745f 	rsbsvc	r7, r9, pc, asr r4
     ff8:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
     ffc:	00000600 	andeq	r0, r0, r0, lsl #12
    1000:	6665645f 			@ <UNDEFINED> instruction: 0x6665645f
    1004:	746c7561 	strbtvc	r7, [ip], #-1377	@ 0xfffffa9f
    1008:	7079745f 	rsbsvc	r7, r9, pc, asr r4
    100c:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
    1010:	00000600 	andeq	r0, r0, r0, lsl #12
    1014:	6b636f6c 	blvs	18dcdcc <_Min_Stack_Size+0x18dc9cc>
    1018:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    101c:	73610000 	cmnvc	r1, #0
    1020:	74726573 	ldrbtvc	r6, [r2], #-1395	@ 0xfffffa8d
    1024:	0300682e 	movweq	r6, #2094	@ 0x82e
    1028:	64630000 	strbtvs	r0, [r3], #-0
    102c:	2e736665 	cdpcs	6, 7, cr6, cr3, cr5, {3}
    1030:	00050068 	andeq	r0, r5, r8, rrx
    1034:	6f6c5f00 	svcvs	0x006c5f00
    1038:	656c6163 	strbvs	r6, [ip, #-355]!	@ 0xfffffe9d
    103c:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    1040:	74730000 	ldrbtvc	r0, [r3], #-0
    1044:	676e6972 			@ <UNDEFINED> instruction: 0x676e6972
    1048:	00682e73 	rsbeq	r2, r8, r3, ror lr
    104c:	73000003 	movwvc	r0, #3
    1050:	6e697274 	mcrvs	2, 3, r7, cr9, cr4, {3}
    1054:	00682e67 	rsbeq	r2, r8, r7, ror #28
    1058:	73000005 	movwvc	r0, #5
    105c:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    1060:	33303166 	teqcc	r0, #-2147483623	@ 0x80000019
    1064:	675f3663 	ldrbvs	r3, [pc, -r3, ror #12]
    1068:	2e6f6970 			@ <UNDEFINED> instruction: 0x2e6f6970
    106c:	00080068 	andeq	r0, r8, r8, rrx
    1070:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    1074:	6c6f6f62 	stclvs	15, cr6, [pc], #-392	@ ef4 <_Min_Stack_Size+0xaf4>
    1078:	0700682e 	streq	r6, [r0, -lr, lsr #16]
    107c:	74730000 	ldrbtvc	r0, [r3], #-0
    1080:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    1084:	78333031 	ldmdavc	r3!, {r0, r4, r5, ip, sp}
    1088:	00682e36 	rsbeq	r2, r8, r6, lsr lr
    108c:	73000008 	movwvc	r0, #8
    1090:	6f696474 	svcvs	0x00696474
    1094:	0300682e 	movweq	r6, #2094	@ 0x82e
    1098:	74730000 	ldrbtvc	r0, [r3], #-0
    109c:	67726164 	ldrbvs	r6, [r2, -r4, ror #2]!
    10a0:	0700682e 	streq	r6, [r0, -lr, lsr #16]
    10a4:	74730000 	ldrbtvc	r0, [r3], #-0
    10a8:	2e6f6964 	vnmulcs.f16	s13, s30, s9	@ <UNPREDICTABLE>
    10ac:	00050068 	andeq	r0, r5, r8, rrx
    10b0:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    10b4:	2e62696c 	vnmulcs.f16	s13, s4, s25	@ <UNPREDICTABLE>
    10b8:	00030068 	andeq	r0, r3, r8, rrx
    10bc:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    10c0:	2e62696c 	vnmulcs.f16	s13, s4, s25	@ <UNPREDICTABLE>
    10c4:	00060068 	andeq	r0, r6, r8, rrx
    10c8:	6c6c6100 	stfvse	f6, [ip], #-0
    10cc:	2e61636f 	cdpcs	3, 6, cr6, cr1, cr15, {3}
    10d0:	00030068 	andeq	r0, r3, r8, rrx
    10d4:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    10d8:	2e746e69 	cdpcs	14, 7, cr6, cr4, cr9, {3}
    10dc:	00070068 	andeq	r0, r7, r8, rrx
    10e0:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    10e4:	2e746e69 	cdpcs	14, 7, cr6, cr4, cr9, {3}
    10e8:	00030068 	andeq	r0, r3, r8, rrx
    10ec:	6e695f00 	cdpvs	15, 6, cr5, cr9, cr0, {0}
    10f0:	70757374 	rsbsvc	r7, r5, r4, ror r3
    10f4:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    10f8:	735f0000 	cmpvc	pc, #0
    10fc:	6e696474 	mcrvs	4, 3, r6, cr9, cr4, {3}
    1100:	00682e74 	rsbeq	r2, r8, r4, ror lr
    1104:	41000005 	tstmi	r0, r5
    1108:	4d434d52 	stclmi	13, cr4, [r3, #-328]	@ 0xfffffeb8
    110c:	00682e33 	rsbeq	r2, r8, r3, lsr lr
    1110:	63000009 	movwvs	r0, #9
    1114:	5f65726f 	svcpl	0x0065726f
    1118:	2e336d63 	cdpcs	13, 3, cr6, cr3, cr3, {3}
    111c:	00090068 	andeq	r0, r9, r8, rrx
    1120:	736d6300 	cmnvc	sp, #0, 6
    1124:	765f7369 	ldrbvc	r7, [pc], -r9, ror #6
    1128:	69737265 	ldmdbvs	r3!, {r0, r2, r5, r6, r9, ip, sp, lr}^
    112c:	682e6e6f 	stmdavs	lr!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}
    1130:	00000900 	andeq	r0, r0, r0, lsl #18
    1134:	69736d63 	ldmdbvs	r3!, {r0, r1, r5, r6, r8, sl, fp, sp, lr}^
    1138:	6f635f73 	svcvs	0x00635f73
    113c:	6c69706d 	stclvs	0, cr7, [r9], #-436	@ 0xfffffe4c
    1140:	682e7265 	stmdavs	lr!, {r0, r2, r5, r6, r9, ip, sp, lr}
    1144:	00000900 	andeq	r0, r0, r0, lsl #18
    1148:	69736d63 	ldmdbvs	r3!, {r0, r1, r5, r6, r8, sl, fp, sp, lr}^
    114c:	63675f73 	cmnvs	r7, #460	@ 0x1cc
    1150:	00682e63 	rsbeq	r2, r8, r3, ror #28
    1154:	6d000009 	stcvs	0, cr0, [r0, #-36]	@ 0xffffffdc
    1158:	615f7570 	cmpvs	pc, r0, ror r5	@ <UNPREDICTABLE>
    115c:	37766d72 			@ <UNDEFINED> instruction: 0x37766d72
    1160:	0900682e 	stmdbeq	r0, {r1, r2, r3, r5, fp, sp, lr}
    1164:	79730000 	ldmdbvc	r3!, {}^	@ <UNPREDICTABLE>
    1168:	6d657473 	cfstrdvs	mvd7, [r5, #-460]!	@ 0xfffffe34
    116c:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    1170:	2e334d43 	cdpcs	13, 3, cr4, cr3, cr3, {2}
    1174:	00090068 	andeq	r0, r9, r8, rrx
    1178:	05050000 	streq	r0, [r5, #-0]
    117c:	9e020500 	cfsh32ls	mvfx0, mvfx2, #0
    1180:	03080001 	movweq	r0, #32769	@ 0x8001
    1184:	000100e9 	andeq	r0, r1, r9, ror #1
    1188:	13010402 	movwne	r0, #5122	@ 0x1402
    118c:	02000205 	andeq	r0, r0, #1342177280	@ 0x50000000
    1190:	05140104 	ldreq	r0, [r4, #-260]	@ 0xfffffefc
    1194:	0402000b 	streq	r0, [r2], #-11
    1198:	01021e01 	tsteq	r2, r1, lsl #28
    119c:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    11a0:	02050005 	andeq	r0, r5, #5
    11a4:	080001a2 	stmdaeq	r0, {r1, r5, r7, r8}
    11a8:	14011d03 	strne	r1, [r1], #-3331	@ 0xfffff2fd
    11ac:	02051413 	andeq	r1, r5, #318767104	@ 0x13000000
    11b0:	06050515 			@ <UNDEFINED> instruction: 0x06050515
    11b4:	00010214 	andeq	r0, r1, r4, lsl r2
    11b8:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    11bc:	a4020500 	strge	r0, [r2], #-1280	@ 0xfffffb00
    11c0:	03080001 	movweq	r0, #32769	@ 0x8001
    11c4:	0214012a 	andseq	r0, r4, #-2147483638	@ 0x8000000a
    11c8:	01010001 	tsteq	r1, r1
    11cc:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    11d0:	00000002 	andeq	r0, r0, r2
    11d4:	012f0300 			@ <UNDEFINED> instruction: 0x012f0300
    11d8:	77020513 	smladvc	r2, r3, r5, r0
    11dc:	22212221 	eorcs	r2, r1, #268435458	@ 0x10000002
    11e0:	22212221 	eorcs	r2, r1, #268435458	@ 0x10000002
    11e4:	06050521 	streq	r0, [r5], -r1, lsr #10
    11e8:	00010214 	andeq	r0, r1, r4, lsl r2
    11ec:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    11f0:	a8020500 	stmdage	r2, {r8, sl}
    11f4:	03080001 	movweq	r0, #32769	@ 0x8001
    11f8:	130100c5 	movwne	r0, #4293	@ 0x10c5
    11fc:	01061e05 	tsteq	r6, r5, lsl #28
    1200:	05201c05 	streq	r1, [r0, #-3077]!	@ 0xfffff3fb
    1204:	053d0605 	ldreq	r0, [sp, #-1541]!	@ 0xfffff9fb
    1208:	05010635 	streq	r0, [r1, #-1589]	@ 0xfffff9cb
    120c:	05052e1c 	streq	r2, [r5, #-3612]	@ 0xfffff1e4
    1210:	3a052f06 	bcc	14ce30 <_Min_Stack_Size+0x14ca30>
    1214:	21050106 	tstcs	r5, r6, lsl #2
    1218:	3005052e 	andcc	r0, r5, lr, lsr #10
    121c:	01000602 	tsteq	r0, r2, lsl #12
    1220:	00050501 	andeq	r0, r5, r1, lsl #10
    1224:	01cc0205 	biceq	r0, ip, r5, lsl #4
    1228:	f0030800 			@ <UNDEFINED> instruction: 0xf0030800
    122c:	01060100 	mrseq	r0, (UNDEF: 22)
    1230:	20100306 	andscs	r0, r0, r6, lsl #6
    1234:	01061905 	tsteq	r6, r5, lsl #18
    1238:	22060505 	andcs	r0, r6, #20971520	@ 0x1400000
    123c:	01061605 	tsteq	r6, r5, lsl #12
    1240:	2f060505 	svccs	0x00060505
    1244:	01061a05 	tsteq	r6, r5, lsl #20
    1248:	4c060505 	cfstr32mi	mvfx0, [r6], {5}
    124c:	01060905 	tsteq	r6, r5, lsl #18
    1250:	05201605 	streq	r1, [r0, #-1541]!	@ 0xfffff9fb
    1254:	052f0605 	streq	r0, [pc, #-1541]!	@ c57 <_Min_Stack_Size+0x857>
    1258:	0501061a 	streq	r0, [r1, #-1562]	@ 0xfffff9e6
    125c:	053e0605 	ldreq	r0, [lr, #-1541]!	@ 0xfffff9fb
    1260:	05010609 	streq	r0, [r1, #-1545]	@ 0xfffff9f7
    1264:	05052016 	streq	r2, [r5, #-22]	@ 0xffffffea
    1268:	1a052f06 	bne	14ce88 <_Min_Stack_Size+0x14ca88>
    126c:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1270:	0a054c06 	beq	154290 <_Min_Stack_Size+0x153e90>
    1274:	01170501 	tsteq	r7, r1, lsl #10
    1278:	10061a05 	andne	r1, r6, r5, lsl #20
    127c:	05251705 	streq	r1, [r5, #-1797]!	@ 0xfffff8fb
    1280:	04020002 	streq	r0, [r2], #-2
    1284:	051f0603 	ldreq	r0, [pc, #-1539]	@ c89 <_Min_Stack_Size+0x889>
    1288:	04020006 	streq	r0, [r2], #-6
    128c:	05010603 	streq	r0, [r1, #-1539]	@ 0xfffff9fd
    1290:	04020013 	streq	r0, [r2], #-19	@ 0xffffffed
    1294:	02052003 	andeq	r2, r5, #3
    1298:	03040200 	movweq	r0, #16896	@ 0x4200
    129c:	17052f06 	strne	r2, [r5, -r6, lsl #30]
    12a0:	03040200 	movweq	r0, #16896	@ 0x4200
    12a4:	1e050106 	adfnes	f0, f5, f6
    12a8:	03040200 	movweq	r0, #16896	@ 0x4200
    12ac:	17052b06 	strne	r2, [r5, -r6, lsl #22]
    12b0:	03040200 	movweq	r0, #16896	@ 0x4200
    12b4:	04020001 	streq	r0, [r2], #-1
    12b8:	05200603 	streq	r0, [r0, #-1539]!	@ 0xfffff9fd
    12bc:	02022705 	andeq	r2, r2, #1310720	@ 0x140000
    12c0:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    12c4:	02050005 	andeq	r0, r5, #5
    12c8:	0800020c 	stmdaeq	r0, {r2, r3, r9}
    12cc:	01019403 	tsteq	r1, r3, lsl #8
    12d0:	23051413 	movwcs	r1, #21523	@ 0x5413
    12d4:	17050106 	strne	r0, [r5, -r6, lsl #2]
    12d8:	0605053c 			@ <UNDEFINED> instruction: 0x0605053c
    12dc:	062b0521 	strteq	r0, [fp], -r1, lsr #10
    12e0:	2e170501 	cfmul32cs	mvfx0, mvfx7, mvfx1
    12e4:	21060505 	tstcs	r6, r5, lsl #10
    12e8:	01060805 	tsteq	r6, r5, lsl #16
    12ec:	06370505 	ldrteq	r0, [r7], -r5, lsl #10
    12f0:	052e0a03 	streq	r0, [lr, #-2563]!	@ 0xfffff5fd
    12f4:	05010621 	streq	r0, [r1, #-1569]	@ 0xfffff9df
    12f8:	2105203a 	tstcs	r5, sl, lsr r0
    12fc:	0605053c 			@ <UNDEFINED> instruction: 0x0605053c
    1300:	17053330 	smladxne	r5, r0, r3, r3
    1304:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1308:	13063e06 	movwne	r3, #28166	@ 0x6e06
    130c:	74030905 	strvc	r0, [r3], #-2309	@ 0xfffff6fb
    1310:	03050520 	movweq	r0, #21792	@ 0x5520
    1314:	0502200c 	streq	r2, [r2, #-12]
    1318:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    131c:	02050005 	andeq	r0, r5, #5
    1320:	08000248 	stmdaeq	r0, {r3, r6, r9}
    1324:	0100d103 	tsteq	r0, r3, lsl #2
    1328:	1a051323 	bne	145fbc <_Min_Stack_Size+0x145bbc>
    132c:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1330:	05304c06 	ldreq	r4, [r0, #-3078]!	@ 0xfffff3fa
    1334:	05010609 	streq	r0, [r1, #-1545]	@ 0xfffff9f7
    1338:	676c0605 	strbvs	r0, [ip, -r5, lsl #12]!
    133c:	01061805 	tsteq	r6, r5, lsl #16
    1340:	4b060505 	blmi	18275c <_Min_Stack_Size+0x18235c>
    1344:	01061c05 	tsteq	r6, r5, lsl #24
    1348:	2f060505 	svccs	0x00060505
    134c:	01061a05 	tsteq	r6, r5, lsl #20
    1350:	4c060505 	cfstr32mi	mvfx0, [r6], {5}
    1354:	01061205 	tsteq	r6, r5, lsl #4
    1358:	2f060505 	svccs	0x00060505
    135c:	11060f05 	tstne	r6, r5, lsl #30
    1360:	2e3f0505 	cdpcs	5, 3, cr0, cr15, cr5, {0}
    1364:	01000c02 	tsteq	r0, r2, lsl #24
    1368:	000aef01 	andeq	lr, sl, r1, lsl #30
    136c:	fd000300 	stc2	3, cr0, [r0, #-0]
    1370:	02000005 	andeq	r0, r0, #5
    1374:	0d0efb01 	vstreq	d15, [lr, #-4]
    1378:	01010100 	mrseq	r0, (UNDEF: 17)
    137c:	00000001 	andeq	r0, r0, r1
    1380:	01000001 	tsteq	r0, r1
    1384:	532f2e2e 			@ <UNDEFINED> instruction: 0x532f2e2e
    1388:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    138c:	33303146 	teqcc	r0, #-2147483631	@ 0x80000011
    1390:	445f3643 	ldrbmi	r3, [pc], #-1603	@ 1398 <_Min_Stack_Size+0xf98>
    1394:	65766972 	ldrbvs	r6, [r6, #-2418]!	@ 0xfffff68e
    1398:	43007372 	movwmi	r7, #882	@ 0x372
    139c:	54535c3a 	ldrbpl	r5, [r3], #-3130	@ 0xfffff3c6
    13a0:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    13a4:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    13a8:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    13ac:	2e315f45 	cdpcs	15, 3, cr5, cr1, cr5, {2}
    13b0:	302e3331 	eorcc	r3, lr, r1, lsr r3
    13b4:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    13b8:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    13bc:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    13c0:	6c705c45 	ldclvs	12, cr5, [r0], #-276	@ 0xfffffeec
    13c4:	6e696775 	mcrvs	7, 3, r6, cr9, cr5, {3}
    13c8:	6f635c73 	svcvs	0x00635c73
    13cc:	74732e6d 	ldrbtvc	r2, [r3], #-3693	@ 0xfffff193
    13d0:	6d74732e 	ldclvs	3, cr7, [r4, #-184]!	@ 0xffffff48
    13d4:	75633233 	strbvc	r3, [r3, #-563]!	@ 0xfffffdcd
    13d8:	692e6562 	stmdbvs	lr!, {r1, r5, r6, r8, sl, sp, lr}
    13dc:	6d2e6564 	cfstr32vs	mvfx6, [lr, #-400]!	@ 0xfffffe70
    13e0:	652e7563 	strvs	r7, [lr, #-1379]!	@ 0xfffffa9d
    13e4:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
    13e8:	746c616e 	strbtvc	r6, [ip], #-366	@ 0xfffffe92
    13ec:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    13f0:	756e672e 	strbvc	r6, [lr, #-1838]!	@ 0xfffff8d2
    13f4:	6f6f742d 	svcvs	0x006f742d
    13f8:	662d736c 	strtvs	r7, [sp], -ip, ror #6
    13fc:	732d726f 			@ <UNDEFINED> instruction: 0x732d726f
    1400:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    1404:	2e32312e 	rsfcssp	f3, f2, #0.5
    1408:	65722e33 	ldrbvs	r2, [r2, #-3635]!	@ 0xfffff1cd
    140c:	772e316c 	strvc	r3, [lr, -ip, ror #2]!
    1410:	32336e69 	eorscc	r6, r3, #1680	@ 0x690
    1414:	302e315f 	eorcc	r3, lr, pc, asr r1
    1418:	3030322e 	eorscc	r3, r0, lr, lsr #4
    141c:	3230322e 	eorscc	r3, r0, #-536870910	@ 0xe0000002
    1420:	31363034 	teqcc	r6, r4, lsr r0
    1424:	32363139 	eorscc	r3, r6, #1073741838	@ 0x4000000e
    1428:	6f745c33 	svcvs	0x00745c33
    142c:	5c736c6f 	ldclpl	12, cr6, [r3], #-444	@ 0xfffffe44
    1430:	2f6e6962 	svccs	0x006e6962
    1434:	6c2f2e2e 	stcvs	14, cr2, [pc], #-184	@ 1384 <_Min_Stack_Size+0xf84>
    1438:	672f6269 	strvs	r6, [pc, -r9, ror #4]!
    143c:	612f6363 			@ <UNDEFINED> instruction: 0x612f6363
    1440:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    1444:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    1448:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    144c:	2e32312f 	rsfcssp	f3, f2, #10.0
    1450:	2f312e33 	svccs	0x00312e33
    1454:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    1458:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    145c:	2f2e2e2f 	svccs	0x002e2e2f
    1460:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    1464:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    1468:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    146c:	6e692f69 	cdpvs	15, 6, cr2, cr9, cr9, {3}
    1470:	64756c63 	ldrbtvs	r6, [r5], #-3171	@ 0xfffff39d
    1474:	616d2f65 	cmnvs	sp, r5, ror #30
    1478:	6e696863 	cdpvs	8, 6, cr6, cr9, cr3, {3}
    147c:	3a430065 	bcc	10c1618 <_Min_Stack_Size+0x10c1218>
    1480:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
    1484:	334d5453 	movtcc	r5, #54355	@ 0xd453
    1488:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    148c:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    1490:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
    1494:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
    1498:	334d5453 	movtcc	r5, #54355	@ 0xd453
    149c:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    14a0:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    14a4:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
    14a8:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
    14ac:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ 1344 <_Min_Stack_Size+0xf44>
    14b0:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
    14b4:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    14b8:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
    14bc:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
    14c0:	636d2e65 	cmnvs	sp, #1616	@ 0x650
    14c4:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
    14c8:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    14cc:	6f746c61 	svcvs	0x00746c61
    14d0:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
    14d4:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
    14d8:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 1310 <_Min_Stack_Size+0xf10>
    14dc:	6f662d73 	svcvs	0x00662d73
    14e0:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
    14e4:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
    14e8:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    14ec:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
    14f0:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
    14f4:	5f32336e 	svcpl	0x0032336e
    14f8:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
    14fc:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
    1500:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
    1504:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
    1508:	33323631 	teqcc	r2, #51380224	@ 0x3100000
    150c:	6f6f745c 	svcvs	0x006f745c
    1510:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
    1514:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
    1518:	696c2f2e 	stmdbvs	ip!, {r1, r2, r3, r5, r8, r9, sl, fp, sp}^
    151c:	63672f62 	cmnvs	r7, #392	@ 0x188
    1520:	72612f63 	rsbvc	r2, r1, #396	@ 0x18c
    1524:	6f6e2d6d 	svcvs	0x006e2d6d
    1528:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    152c:	2f696261 	svccs	0x00696261
    1530:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    1534:	2e2f312e 	sufcsep	f3, f7, #0.5
    1538:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    153c:	2f2e2e2f 	svccs	0x002e2e2f
    1540:	612f2e2e 			@ <UNDEFINED> instruction: 0x612f2e2e
    1544:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    1548:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    154c:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    1550:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
    1554:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
    1558:	7379732f 	cmnvc	r9, #-1140850688	@ 0xbc000000
    155c:	2f2e2e00 	svccs	0x002e2e00
    1560:	334d5453 	movtcc	r5, #54355	@ 0xd453
    1564:	30314632 	eorscc	r4, r1, r2, lsr r6
    1568:	5f364333 	svcpl	0x00364333
    156c:	76697244 	strbtvc	r7, [r9], -r4, asr #4
    1570:	2f737265 	svccs	0x00737265
    1574:	00636e69 	rsbeq	r6, r3, r9, ror #28
    1578:	535c3a43 	cmppl	ip, #274432	@ 0x43000
    157c:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
    1580:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    1584:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    1588:	315f4544 	cmpcc	pc, r4, asr #10
    158c:	2e33312e 	rsfcssp	f3, f3, #0.5
    1590:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
    1594:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    1598:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    159c:	705c4544 	subsvc	r4, ip, r4, asr #10
    15a0:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    15a4:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
    15a8:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
    15ac:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
    15b0:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
    15b4:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
    15b8:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
    15bc:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
    15c0:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
    15c4:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
    15c8:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 1400 <_Min_Stack_Size+0x1000>
    15cc:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
    15d0:	6f742d75 	svcvs	0x00742d75
    15d4:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
