NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    15d8:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    15dc:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    15e0:	32312e32 	eorscc	r2, r1, #800	@ 0x320
    15e4:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
    15e8:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
    15ec:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
    15f0:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
    15f4:	30322e30 	eorscc	r2, r2, r0, lsr lr
    15f8:	30322e30 	eorscc	r2, r2, r0, lsr lr
    15fc:	36303432 			@ <UNDEFINED> instruction: 0x36303432
    1600:	36313931 			@ <UNDEFINED> instruction: 0x36313931
    1604:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
    1608:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    160c:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
    1610:	2f2e2e2f 	svccs	0x002e2e2f
    1614:	2f62696c 	svccs	0x0062696c
    1618:	2f636367 	svccs	0x00636367
    161c:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    1620:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    1624:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    1628:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
    162c:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
    1630:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
    1634:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
    1638:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
    163c:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
    1640:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    1644:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    1648:	5f454449 	svcpl	0x00454449
    164c:	33312e31 	teqcc	r1, #784	@ 0x310
    1650:	535c302e 	cmppl	ip, #46	@ 0x2e
    1654:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    1658:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    165c:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
    1660:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
    1664:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
    1668:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
    166c:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
    1670:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    1674:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
    1678:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
    167c:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
    1680:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
    1684:	616e7265 	cmnvs	lr, r5, ror #4
    1688:	6f6f746c 	svcvs	0x006f746c
    168c:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
    1690:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
    1694:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    1698:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
    169c:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
    16a0:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
    16a4:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    16a8:	316c6572 	smccc	50770	@ 0xc652
    16ac:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
    16b0:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
    16b4:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
    16b8:	322e3030 	eorcc	r3, lr, #48	@ 0x30
    16bc:	30343230 	eorscc	r3, r4, r0, lsr r2
    16c0:	31393136 	teqcc	r9, r6, lsr r1
    16c4:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
    16c8:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 1500 <_Min_Stack_Size+0x1100>
    16cc:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
    16d0:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
    16d4:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
    16d8:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
    16dc:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    16e0:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    16e4:	61652d65 	cmnvs	r5, r5, ror #26
    16e8:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
    16ec:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    16f0:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
    16f4:	2f2e2e2f 	svccs	0x002e2e2f
    16f8:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    16fc:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    1700:	6f6e2d6d 	svcvs	0x006e2d6d
    1704:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    1708:	2f696261 	svccs	0x00696261
    170c:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    1710:	00656475 	rsbeq	r6, r5, r5, ror r4
    1714:	535c3a43 	cmppl	ip, #274432	@ 0x43000
    1718:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
    171c:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    1720:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    1724:	315f4544 	cmpcc	pc, r4, asr #10
    1728:	2e33312e 	rsfcssp	f3, f3, #0.5
    172c:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
    1730:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    1734:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    1738:	705c4544 	subsvc	r4, ip, r4, asr #10
    173c:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    1740:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
    1744:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
    1748:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
    174c:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
    1750:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
    1754:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
    1758:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
    175c:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
    1760:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
    1764:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 159c <_Min_Stack_Size+0x119c>
    1768:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
    176c:	6f742d75 	svcvs	0x00742d75
    1770:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
    1774:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    1778:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    177c:	32312e32 	eorscc	r2, r1, #800	@ 0x320
    1780:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
    1784:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
    1788:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
    178c:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
    1790:	30322e30 	eorscc	r2, r2, r0, lsr lr
    1794:	30322e30 	eorscc	r2, r2, r0, lsr lr
    1798:	36303432 			@ <UNDEFINED> instruction: 0x36303432
    179c:	36313931 			@ <UNDEFINED> instruction: 0x36313931
    17a0:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
    17a4:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    17a8:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
    17ac:	2f2e2e2f 	svccs	0x002e2e2f
    17b0:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    17b4:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    17b8:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    17bc:	6e692f69 	cdpvs	15, 6, cr2, cr9, cr9, {3}
    17c0:	64756c63 	ldrbtvs	r6, [r5], #-3171	@ 0xfffff39d
    17c4:	656e2f65 	strbvs	r2, [lr, #-3941]!	@ 0xfffff09b
    17c8:	62696c77 	rsbvs	r6, r9, #30464	@ 0x7700
    17cc:	6e616e2d 	cdpvs	14, 6, cr6, cr1, cr13, {1}
    17d0:	7300006f 	movwvc	r0, #111	@ 0x6f
    17d4:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    17d8:	33303166 	teqcc	r0, #-2147483623	@ 0x80000019
    17dc:	455f3663 	ldrbmi	r3, [pc, #-1635]	@ 1181 <_Min_Stack_Size+0xd81>
    17e0:	5f495458 	svcpl	0x00495458
    17e4:	76697244 	strbtvc	r7, [r9], -r4, asr #4
    17e8:	632e7265 			@ <UNDEFINED> instruction: 0x632e7265
    17ec:	00000100 	andeq	r0, r0, r0, lsl #2
    17f0:	6665645f 			@ <UNDEFINED> instruction: 0x6665645f
    17f4:	746c7561 	strbtvc	r7, [ip], #-1377	@ 0xfffffa9f
    17f8:	7079745f 	rsbsvc	r7, r9, pc, asr r4
    17fc:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
    1800:	00000200 	andeq	r0, r0, r0, lsl #4
    1804:	6474735f 	ldrbtvs	r7, [r4], #-863	@ 0xfffffca1
    1808:	2e746e69 	cdpcs	14, 7, cr6, cr4, cr9, {3}
    180c:	00030068 	andeq	r0, r3, r8, rrx
    1810:	6d747300 	ldclvs	3, cr7, [r4, #-0]
    1814:	31663233 	cmncc	r6, r3, lsr r2
    1818:	36783330 			@ <UNDEFINED> instruction: 0x36783330
    181c:	0400682e 	streq	r6, [r0], #-2094	@ 0xfffff7d2
    1820:	74730000 	ldrbtvc	r0, [r3], #-0
    1824:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    1828:	63333031 	teqvs	r3, #49	@ 0x31
    182c:	70675f36 	rsbvc	r5, r7, r6, lsr pc
    1830:	682e6f69 	stmdavs	lr!, {r0, r3, r5, r6, r8, r9, sl, fp, sp, lr}
    1834:	00000400 	andeq	r0, r0, r0, lsl #8
    1838:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    183c:	30316632 	eorscc	r6, r1, r2, lsr r6
    1840:	5f366333 	svcpl	0x00366333
    1844:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    1848:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    184c:	2e726576 	mrccs	5, 3, r6, cr2, cr6, {3}
    1850:	00040068 	andeq	r0, r4, r8, rrx
    1854:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    1858:	6c6f6f62 	stclvs	15, cr6, [pc], #-392	@ 16d8 <_Min_Stack_Size+0x12d8>
    185c:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    1860:	74730000 	ldrbtvc	r0, [r3], #-0
    1864:	2e6f6964 	vnmulcs.f16	s13, s30, s9	@ <UNPREDICTABLE>
    1868:	00060068 	andeq	r0, r6, r8, rrx
    186c:	6e615f00 	cdpvs	15, 6, cr5, cr1, cr0, {0}
    1870:	682e6973 	stmdavs	lr!, {r0, r1, r4, r5, r6, r8, fp, sp, lr}
    1874:	00000600 	andeq	r0, r0, r0, lsl #12
    1878:	6c77656e 	cfldr64vs	mvdx6, [r7], #-440	@ 0xfffffe48
    187c:	682e6269 	stmdavs	lr!, {r0, r3, r5, r6, r9, sp, lr}
    1880:	00000700 	andeq	r0, r0, r0, lsl #14
    1884:	77656e5f 			@ <UNDEFINED> instruction: 0x77656e5f
    1888:	5f62696c 	svcpl	0x0062696c
    188c:	73726576 	cmnvc	r2, #494927872	@ 0x1d800000
    1890:	2e6e6f69 	cdpcs	15, 6, cr6, cr14, cr9, {3}
    1894:	00060068 	andeq	r0, r6, r8, rrx
    1898:	6e6f6300 	cdpvs	3, 6, cr6, cr15, cr0, {0}
    189c:	2e676966 	vnmulcs.f16	s13, s14, s13	@ <UNPREDICTABLE>
    18a0:	00030068 	andeq	r0, r3, r8, rrx
    18a4:	65656900 	strbvs	r6, [r5, #-2304]!	@ 0xfffff700
    18a8:	2e706665 	cdpcs	6, 7, cr6, cr0, cr5, {3}
    18ac:	00020068 	andeq	r0, r2, r8, rrx
    18b0:	61656600 	cmnvs	r5, r0, lsl #12
    18b4:	65727574 	ldrbvs	r7, [r2, #-1396]!	@ 0xfffffa8c
    18b8:	00682e73 	rsbeq	r2, r8, r3, ror lr
    18bc:	63000003 	movwvs	r0, #3
    18c0:	73666564 	cmnvc	r6, #100, 10	@ 0x19000000
    18c4:	0300682e 	movweq	r6, #2094	@ 0x82e
    18c8:	74730000 	ldrbtvc	r0, [r3], #-0
    18cc:	66656464 	strbtvs	r6, [r5], -r4, ror #8
    18d0:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    18d4:	74730000 	ldrbtvc	r0, [r3], #-0
    18d8:	67726164 	ldrbvs	r6, [r2, -r4, ror #2]!
    18dc:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    18e0:	65720000 	ldrbvs	r0, [r2, #-0]!
    18e4:	2e746e65 	cdpcs	14, 7, cr6, cr4, cr5, {3}
    18e8:	00030068 	andeq	r0, r3, r8, rrx
    18ec:	79745f00 	ldmdbvc	r4!, {r8, r9, sl, fp, ip, lr}^
    18f0:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
    18f4:	00030068 	andeq	r0, r3, r8, rrx
    18f8:	79745f00 	ldmdbvc	r4!, {r8, r9, sl, fp, ip, lr}^
    18fc:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
    1900:	00020068 	andeq	r0, r2, r8, rrx
    1904:	636f6c00 	cmnvs	pc, #0, 24
    1908:	00682e6b 	rsbeq	r2, r8, fp, ror #28
    190c:	61000003 	tstvs	r0, r3
    1910:	72657373 	rsbvc	r7, r5, #-872415231	@ 0xcc000001
    1914:	00682e74 	rsbeq	r2, r8, r4, ror lr
    1918:	73000006 	movwvc	r0, #6
    191c:	6f696474 	svcvs	0x00696474
    1920:	0300682e 	movweq	r6, #2094	@ 0x82e
    1924:	74730000 	ldrbtvc	r0, [r3], #-0
    1928:	62696c64 	rsbvs	r6, r9, #100, 24	@ 0x6400
    192c:	0600682e 	streq	r6, [r0], -lr, lsr #16
    1930:	74730000 	ldrbtvc	r0, [r3], #-0
    1934:	62696c64 	rsbvs	r6, r9, #100, 24	@ 0x6400
    1938:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
    193c:	6c610000 	stclvs	0, cr0, [r1], #-0
    1940:	61636f6c 	cmnvs	r3, ip, ror #30
    1944:	0600682e 	streq	r6, [r0], -lr, lsr #16
    1948:	74730000 	ldrbtvc	r0, [r3], #-0
    194c:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    1950:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    1954:	74730000 	ldrbtvc	r0, [r3], #-0
    1958:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    195c:	0600682e 	streq	r6, [r0], -lr, lsr #16
    1960:	695f0000 	ldmdbvs	pc, {}^	@ <UNPREDICTABLE>
    1964:	7573746e 	ldrbvc	r7, [r3, #-1134]!	@ 0xfffffb92
    1968:	00682e70 	rsbeq	r2, r8, r0, ror lr
    196c:	00000003 	andeq	r0, r0, r3
    1970:	05000105 	streq	r0, [r0, #-261]	@ 0xfffffefb
    1974:	00000002 	andeq	r0, r0, r2
    1978:	01160300 	tsteq	r6, r0, lsl #6
    197c:	05130505 	ldreq	r0, [r3, #-1285]	@ 0xfffffafb
    1980:	2b05bc11 	blcs	1709cc <_Min_Stack_Size+0x1705cc>
    1984:	21110582 	tstcs	r1, r2, lsl #11
    1988:	05822b05 	streq	r2, [r2, #2821]	@ 0xb05
    198c:	2b052111 	blcs	149dd8 <_Min_Stack_Size+0x1499d8>
    1990:	21110582 	tstcs	r1, r2, lsl #11
    1994:	05822b05 	streq	r2, [r2, #2821]	@ 0xb05
    1998:	2c052111 	stfcss	f2, [r5], {17}
    199c:	21310582 	teqcs	r1, r2, lsl #11
    19a0:	05824e05 	streq	r4, [r2, #3589]	@ 0xe05
    19a4:	5e05213f 	mcrpl	1, 0, r2, cr5, cr15, {1}
    19a8:	06010582 	streq	r0, [r1], -r2, lsl #11
    19ac:	00010214 	andeq	r0, r1, r4, lsl r2
    19b0:	01050101 	tsteq	r5, r1, lsl #2
    19b4:	00020500 	andeq	r0, r2, r0, lsl #10
    19b8:	03000000 	movweq	r0, #0
    19bc:	05050124 	streq	r0, [r5, #-292]	@ 0xfffffedc
    19c0:	bc110513 	cfldr32lt	mvfx0, [r1], {19}
    19c4:	05822c05 	streq	r2, [r2, #3077]	@ 0xc05
    19c8:	2c052111 	stfcss	f2, [r5], {17}
    19cc:	21110582 	tstcs	r1, r2, lsl #11
    19d0:	05822c05 	streq	r2, [r2, #3077]	@ 0xc05
    19d4:	2c052111 	stfcss	f2, [r5], {17}
    19d8:	21110582 	tstcs	r1, r2, lsl #11
    19dc:	05822d05 	streq	r2, [r2, #3333]	@ 0xd05
    19e0:	4f052131 	svcmi	0x00052131
    19e4:	213f0582 	teqcs	pc, r2, lsl #11
    19e8:	05825f05 	streq	r5, [r2, #3845]	@ 0xf05
    19ec:	02140601 	andseq	r0, r4, #1048576	@ 0x100000
    19f0:	01010001 	tsteq	r1, r1
    19f4:	05000105 	streq	r0, [r0, #-261]	@ 0xfffffefb
    19f8:	00000002 	andeq	r0, r0, r2
    19fc:	00cf0300 	sbceq	r0, pc, r0, lsl #6
    1a00:	13050501 	movwne	r0, #21761	@ 0x5501
    1a04:	01060f05 	tsteq	r6, r5, lsl #30
    1a08:	3d060505 	cfstr32cc	mvfx0, [r6, #-20]	@ 0xffffffec
    1a0c:	01060f05 	tsteq	r6, r5, lsl #30
    1a10:	21060505 	tstcs	r6, r5, lsl #10
    1a14:	01061005 	tsteq	r6, r5
    1a18:	21060505 	tstcs	r6, r5, lsl #10
    1a1c:	01061105 	tsteq	r6, r5, lsl #2
    1a20:	21060505 	tstcs	r6, r5, lsl #10
    1a24:	01061005 	tsteq	r6, r5
    1a28:	21060505 	tstcs	r6, r5, lsl #10
    1a2c:	01060e05 	tsteq	r6, r5, lsl #28
    1a30:	3d060505 	cfstr32cc	mvfx0, [r6, #-20]	@ 0xffffffec
    1a34:	67676783 	strbvs	r6, [r7, -r3, lsl #15]!
    1a38:	01056767 	tsteq	r5, r7, ror #14
    1a3c:	04026706 	streq	r6, [r2], #-1798	@ 0xfffff8fa
    1a40:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    1a44:	02050001 	andeq	r0, r5, #1
    1a48:	00000000 	andeq	r0, r0, r0
    1a4c:	0100e803 	tsteq	r0, r3, lsl #16
    1a50:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1a54:	05133e06 	ldreq	r3, [r3, #-3590]	@ 0xfffff1fa
    1a58:	05010616 	streq	r0, [r1, #-1558]	@ 0xfffff9ea
    1a5c:	053d0605 	ldreq	r0, [sp, #-1541]!	@ 0xfffff9fb
    1a60:	0501061b 	streq	r0, [r1, #-1563]	@ 0xfffff9e5
    1a64:	063d0605 	ldrteq	r0, [sp], -r5, lsl #12
    1a68:	0531062e 	ldreq	r0, [r1, #-1582]!	@ 0xfffff9d2
    1a6c:	05010633 	streq	r0, [r1, #-1587]	@ 0xfffff9cd
    1a70:	15210605 	strne	r0, [r1, #-1541]!	@ 0xfffff9fb
    1a74:	66061105 	strvs	r1, [r6], -r5, lsl #2
    1a78:	2e202e05 	cdpcs	14, 2, cr2, cr0, cr5, {0}
    1a7c:	052e2505 	streq	r2, [lr, #-1285]!	@ 0xfffffafb
    1a80:	053d0605 	ldreq	r0, [sp, #-1541]!	@ 0xfffff9fb
    1a84:	05010611 	streq	r0, [r1, #-1553]	@ 0xfffff9ef
    1a88:	5a05202a 	bpl	149b38 <_Min_Stack_Size+0x149738>
    1a8c:	04020020 	streq	r0, [r2], #-32	@ 0xffffffe0
    1a90:	02003c01 	andeq	r3, r0, #256	@ 0x100
    1a94:	004a0304 	subeq	r0, sl, r4, lsl #6
    1a98:	4a050402 	bmi	142aa8 <_Min_Stack_Size+0x1426a8>
    1a9c:	02006105 	andeq	r6, r0, #1073741825	@ 0x40000001
    1aa0:	05661004 	strbeq	r1, [r6, #-4]!
    1aa4:	04020025 	streq	r0, [r2], #-37	@ 0xffffffdb
    1aa8:	05052010 	streq	r2, [r5, #-16]
    1aac:	10040200 	andne	r0, r4, r0, lsl #4
    1ab0:	09053106 	stmdbeq	r5, {r1, r2, r8, ip, sp}
    1ab4:	10040200 	andne	r0, r4, r0, lsl #4
    1ab8:	2b050106 	blcs	141ed8 <_Min_Stack_Size+0x141ad8>
    1abc:	10040200 	andne	r0, r4, r0, lsl #4
    1ac0:	0017052e 	andseq	r0, r7, lr, lsr #10
    1ac4:	20100402 	andscs	r0, r0, r2, lsl #8
    1ac8:	02001005 	andeq	r1, r0, #5
    1acc:	053c1004 	ldreq	r1, [ip, #-4]!
    1ad0:	04020005 	streq	r0, [r2], #-5
    1ad4:	053d0610 	ldreq	r0, [sp, #-1552]!	@ 0xfffff9f0
    1ad8:	04020009 	streq	r0, [r2], #-9
    1adc:	05010610 	streq	r0, [r1, #-1552]	@ 0xfffff9f0
    1ae0:	0402002b 	streq	r0, [r2], #-43	@ 0xffffffd5
    1ae4:	17052010 	smladne	r5, r0, r0, r2
    1ae8:	10040200 	andne	r0, r4, r0, lsl #4
    1aec:	00100520 	andseq	r0, r0, r0, lsr #10
    1af0:	20100402 	andscs	r0, r0, r2, lsl #8
    1af4:	02000505 	andeq	r0, r0, #20971520	@ 0x1400000
    1af8:	3f061004 	svccc	0x00061004
    1afc:	02001105 	andeq	r1, r0, #1073741825	@ 0x40000001
    1b00:	01061004 	tsteq	r6, r4
    1b04:	02000805 	andeq	r0, r0, #327680	@ 0x50000
    1b08:	05201004 	streq	r1, [r0, #-4]!
    1b0c:	0532060a 	ldreq	r0, [r2, #-1546]!	@ 0xfffff9f6
    1b10:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1b14:	05220609 	streq	r0, [r2, #-1545]!	@ 0xfffff9f7
    1b18:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1b1c:	1a052e2e 	bne	14d3dc <_Min_Stack_Size+0x14cfdc>
    1b20:	2e140520 	cfmul64cs	mvdx0, mvdx4, mvdx0
    1b24:	73035a05 	movwvc	r5, #14853	@ 0x3a05
    1b28:	0609053c 			@ <UNDEFINED> instruction: 0x0609053c
    1b2c:	05660903 	strbeq	r0, [r6, #-2307]!	@ 0xfffff6fd
    1b30:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1b34:	1a052e2e 	bne	14d3f4 <_Min_Stack_Size+0x14cff4>
    1b38:	20140520 	andscs	r0, r4, r0, lsr #10
    1b3c:	03060505 	movweq	r0, #25861	@ 0x6505
    1b40:	47052e0d 	strmi	r2, [r5, -sp, lsl #28]
    1b44:	25050106 	strcs	r0, [r5, #-262]	@ 0xfffffefa
    1b48:	203d0520 	eorscs	r0, sp, r0, lsr #10
    1b4c:	3f060505 	svccc	0x00060505
    1b50:	01061105 	tsteq	r6, r5, lsl #2
    1b54:	05200805 	streq	r0, [r0, #-2053]!	@ 0xfffff7fb
    1b58:	0533060a 	ldreq	r0, [r3, #-1546]!	@ 0xfffff9f6
    1b5c:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1b60:	0a052501 	beq	14af6c <_Min_Stack_Size+0x14ab6c>
    1b64:	2e6c0306 	cdpcs	3, 6, cr0, cr12, cr6, {0}
    1b68:	01060d05 	tsteq	r6, r5, lsl #26
    1b6c:	30060905 	andcc	r0, r6, r5, lsl #18
    1b70:	01060d05 	tsteq	r6, r5, lsl #26
    1b74:	052e2e05 	streq	r2, [lr, #-3589]!	@ 0xfffff1fb
    1b78:	1405201a 	strne	r2, [r5], #-26	@ 0xffffffe6
    1b7c:	0609053c 			@ <UNDEFINED> instruction: 0x0609053c
    1b80:	060d052f 	streq	r0, [sp], -pc, lsr #10
    1b84:	202e0501 	eorcs	r0, lr, r1, lsl #10
    1b88:	05201a05 	streq	r1, [r0, #-2565]!	@ 0xfffff5fb
    1b8c:	09052014 	stmdbeq	r5, {r2, r4, sp}
    1b90:	3c090306 	stccc	3, cr0, [r9], {6}
    1b94:	01060d05 	tsteq	r6, r5, lsl #26
    1b98:	052e2d05 	streq	r2, [lr, #-3333]!	@ 0xfffff2fb
    1b9c:	13052019 	movwne	r2, #20505	@ 0x5019
    1ba0:	06090520 	streq	r0, [r9], -r0, lsr #10
    1ba4:	0d054e2f 	stceq	14, cr4, [r5, #-188]	@ 0xffffff44
    1ba8:	2e050106 	adfcss	f0, f5, f6
    1bac:	201a052e 	andscs	r0, sl, lr, lsr #10
    1bb0:	052e1305 	streq	r1, [lr, #-773]!	@ 0xfffffcfb
    1bb4:	053d0609 	ldreq	r0, [sp, #-1545]!	@ 0xfffff9f7
    1bb8:	023e0601 	eorseq	r0, lr, #1048576	@ 0x100000
    1bbc:	01010007 	tsteq	r1, r7
    1bc0:	05000105 	streq	r0, [r0, #-261]	@ 0xfffffefb
    1bc4:	00000002 	andeq	r0, r0, r2
    1bc8:	01390300 	teqeq	r9, r0, lsl #6
    1bcc:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1bd0:	01052106 	tsteq	r5, r6, lsl #2
    1bd4:	01022f06 	tsteq	r2, r6, lsl #30
    1bd8:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    1bdc:	02050001 	andeq	r0, r5, #1
    1be0:	00000000 	andeq	r0, r0, r0
    1be4:	0100c503 	tsteq	r0, r3, lsl #10
    1be8:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1bec:	01052106 	tsteq	r5, r6, lsl #2
    1bf0:	01022f06 	tsteq	r2, r6, lsl #30
    1bf4:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    1bf8:	02050001 	andeq	r0, r5, #1
    1bfc:	080002a8 	stmdaeq	r0, {r3, r5, r7, r9}
    1c00:	01019b03 	tsteq	r1, r3, lsl #22
    1c04:	05210505 	streq	r0, [r1, #-1285]!	@ 0xfffffafb
    1c08:	05010609 	streq	r0, [r1, #-1545]	@ 0xfffff9f7
    1c0c:	05052e0e 	streq	r2, [r5, #-3598]	@ 0xfffff1f2
    1c10:	13053d06 	movwne	r3, #23814	@ 0x5d06
    1c14:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1c18:	2f010520 	svccs	0x00010520
    1c1c:	01000502 	tsteq	r0, r2, lsl #10
    1c20:	00010501 	andeq	r0, r1, r1, lsl #10
    1c24:	02c40205 	sbceq	r0, r4, #1342177280	@ 0x50000000
    1c28:	a1030800 	tstge	r3, r0, lsl #16
    1c2c:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    1c30:	06090521 	streq	r0, [r9], -r1, lsr #10
    1c34:	2e0e0501 	cfsh32cs	mvfx0, mvfx14, #1
    1c38:	3d060505 	cfstr32cc	mvfx0, [r6, #-20]	@ 0xffffffec
    1c3c:	01061305 	tsteq	r6, r5, lsl #6
    1c40:	05200505 	streq	r0, [r0, #-1285]!	@ 0xfffffafb
    1c44:	05022f01 	streq	r2, [r2, #-3841]	@ 0xfffff0ff
    1c48:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    1c4c:	02050001 	andeq	r0, r5, #1
    1c50:	080002e0 	stmdaeq	r0, {r5, r6, r7, r9}
    1c54:	0101a703 	tsteq	r1, r3, lsl #14
    1c58:	05210505 	streq	r0, [r1, #-1285]!	@ 0xfffffafb
    1c5c:	05010609 	streq	r0, [r1, #-1545]	@ 0xfffff9f7
    1c60:	05052e0e 	streq	r2, [r5, #-3598]	@ 0xfffff1f2
    1c64:	13053d06 	movwne	r3, #23814	@ 0x5d06
    1c68:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1c6c:	2f010520 	svccs	0x00010520
    1c70:	01000502 	tsteq	r0, r2, lsl #10
    1c74:	00010501 	andeq	r0, r1, r1, lsl #10
    1c78:	02fc0205 	rscseq	r0, ip, #1342177280	@ 0x50000000
    1c7c:	ad030800 	stcge	8, cr0, [r3, #-0]
    1c80:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    1c84:	06090521 	streq	r0, [r9], -r1, lsr #10
    1c88:	2e0e0501 	cfsh32cs	mvfx0, mvfx14, #1
    1c8c:	3d060505 	cfstr32cc	mvfx0, [r6, #-20]	@ 0xffffffec
    1c90:	01061305 	tsteq	r6, r5, lsl #6
    1c94:	05200505 	streq	r0, [r0, #-1285]!	@ 0xfffffafb
    1c98:	05022f01 	streq	r2, [r2, #-3841]	@ 0xfffff0ff
    1c9c:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    1ca0:	02050001 	andeq	r0, r5, #1
    1ca4:	08000318 	stmdaeq	r0, {r3, r4, r8, r9}
    1ca8:	0101b303 	tsteq	r1, r3, lsl #6
    1cac:	05210505 	streq	r0, [r1, #-1285]!	@ 0xfffffafb
    1cb0:	05010609 	streq	r0, [r1, #-1545]	@ 0xfffff9f7
    1cb4:	05052e0e 	streq	r2, [r5, #-3598]	@ 0xfffff1f2
    1cb8:	13053d06 	movwne	r3, #23814	@ 0x5d06
    1cbc:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    1cc0:	2f010520 	svccs	0x00010520
    1cc4:	01000502 	tsteq	r0, r2, lsl #10
    1cc8:	00010501 	andeq	r0, r1, r1, lsl #10
    1ccc:	03340205 	teqeq	r4, #1342177280	@ 0x50000000
    1cd0:	b9030800 	stmdblt	r3, {fp}
    1cd4:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    1cd8:	060d0521 	streq	r0, [sp], -r1, lsr #10
    1cdc:	2e080501 	cfsh32cs	mvfx0, mvfx8, #1
    1ce0:	3e060905 	vmlacc.f16	s0, s12, s10	@ <UNPREDICTABLE>
    1ce4:	01060d05 	tsteq	r6, r5, lsl #26
    1ce8:	052e1205 	streq	r1, [lr, #-517]!	@ 0xfffffdfb
    1cec:	053d0609 	ldreq	r0, [sp, #-1545]!	@ 0xfffff9f7
    1cf0:	05010617 	streq	r0, [r1, #-1559]	@ 0xfffff9e9
    1cf4:	05052009 	streq	r2, [r5, #-9]
    1cf8:	0d053006 	stceq	0, cr3, [r5, #-24]	@ 0xffffffe8
    1cfc:	08050106 	stmdaeq	r5, {r1, r2, r8}
    1d00:	0609052e 	streq	r0, [r9], -lr, lsr #10
    1d04:	060d053e 			@ <UNDEFINED> instruction: 0x060d053e
    1d08:	2e120501 	cfmul32cs	mvfx0, mvfx2, mvfx1
    1d0c:	3d060905 	vstrcc.16	s0, [r6, #-10]	@ <UNPREDICTABLE>
    1d10:	01061705 	tsteq	r6, r5, lsl #14
    1d14:	05200905 	streq	r0, [r0, #-2309]!	@ 0xfffff6fb
    1d18:	05300605 	ldreq	r0, [r0, #-1541]!	@ 0xfffff9fb
    1d1c:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1d20:	09052e08 	stmdbeq	r5, {r3, r9, sl, fp, sp}
    1d24:	0d053e06 	stceq	14, cr3, [r5, #-24]	@ 0xffffffe8
    1d28:	12050106 	andne	r0, r5, #-2147483647	@ 0x80000001
    1d2c:	0609052e 	streq	r0, [r9], -lr, lsr #10
    1d30:	0617053d 			@ <UNDEFINED> instruction: 0x0617053d
    1d34:	20090501 	andcs	r0, r9, r1, lsl #10
    1d38:	30060505 	andcc	r0, r6, r5, lsl #10
    1d3c:	01060d05 	tsteq	r6, r5, lsl #26
    1d40:	052e0805 	streq	r0, [lr, #-2053]!	@ 0xfffff7fb
    1d44:	053e0609 	ldreq	r0, [lr, #-1545]!	@ 0xfffff9f7
    1d48:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
