NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    1d4c:	09052e12 	stmdbeq	r5, {r1, r4, r9, sl, fp, sp}
    1d50:	17053d06 	strne	r3, [r5, -r6, lsl #26]
    1d54:	09050106 	stmdbeq	r5, {r1, r2, r8}
    1d58:	06050520 	streq	r0, [r5], -r0, lsr #10
    1d5c:	060d0530 			@ <UNDEFINED> instruction: 0x060d0530
    1d60:	2e080501 	cfsh32cs	mvfx0, mvfx8, #1
    1d64:	3e060905 	vmlacc.f16	s0, s12, s10	@ <UNPREDICTABLE>
    1d68:	01060d05 	tsteq	r6, r5, lsl #26
    1d6c:	052e1205 	streq	r1, [lr, #-517]!	@ 0xfffffdfb
    1d70:	053d0609 	ldreq	r0, [sp, #-1545]!	@ 0xfffff9f7
    1d74:	05010617 	streq	r0, [r1, #-1559]	@ 0xfffff9e9
    1d78:	01052009 	tsteq	r5, r9
    1d7c:	00060230 	andeq	r0, r6, r0, lsr r2
    1d80:	01050101 	tsteq	r5, r1, lsl #2
    1d84:	00020500 	andeq	r0, r2, r0, lsl #10
    1d88:	03000000 	movweq	r0, #0
    1d8c:	050101d6 	streq	r0, [r1, #-470]	@ 0xfffffe2a
    1d90:	0d052105 	stfeqs	f2, [r5, #-20]	@ 0xffffffec
    1d94:	08050106 	stmdaeq	r5, {r1, r2, r8}
    1d98:	0609052e 	streq	r0, [r9], -lr, lsr #10
    1d9c:	060d053e 			@ <UNDEFINED> instruction: 0x060d053e
    1da0:	2e120501 	cfmul32cs	mvfx0, mvfx2, mvfx1
    1da4:	3d060905 	vstrcc.16	s0, [r6, #-10]	@ <UNPREDICTABLE>
    1da8:	01061705 	tsteq	r6, r5, lsl #14
    1dac:	05200905 	streq	r0, [r0, #-2309]!	@ 0xfffff6fb
    1db0:	05300605 	ldreq	r0, [r0, #-1541]!	@ 0xfffff9fb
    1db4:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1db8:	09052e08 	stmdbeq	r5, {r3, r9, sl, fp, sp}
    1dbc:	0d053e06 	stceq	14, cr3, [r5, #-24]	@ 0xffffffe8
    1dc0:	12050106 	andne	r0, r5, #-2147483647	@ 0x80000001
    1dc4:	0609052e 	streq	r0, [r9], -lr, lsr #10
    1dc8:	0617053d 			@ <UNDEFINED> instruction: 0x0617053d
    1dcc:	20090501 	andcs	r0, r9, r1, lsl #10
    1dd0:	30060505 	andcc	r0, r6, r5, lsl #10
    1dd4:	01060d05 	tsteq	r6, r5, lsl #26
    1dd8:	052e0805 	streq	r0, [lr, #-2053]!	@ 0xfffff7fb
    1ddc:	053e0609 	ldreq	r0, [lr, #-1545]!	@ 0xfffff9f7
    1de0:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1de4:	09052e12 	stmdbeq	r5, {r1, r4, r9, sl, fp, sp}
    1de8:	17053d06 	strne	r3, [r5, -r6, lsl #26]
    1dec:	09050106 	stmdbeq	r5, {r1, r2, r8}
    1df0:	06050520 	streq	r0, [r5], -r0, lsr #10
    1df4:	060d0530 			@ <UNDEFINED> instruction: 0x060d0530
    1df8:	2e080501 	cfsh32cs	mvfx0, mvfx8, #1
    1dfc:	3e060905 	vmlacc.f16	s0, s12, s10	@ <UNPREDICTABLE>
    1e00:	01060d05 	tsteq	r6, r5, lsl #26
    1e04:	052e1205 	streq	r1, [lr, #-517]!	@ 0xfffffdfb
    1e08:	053d0609 	ldreq	r0, [sp, #-1545]!	@ 0xfffff9f7
    1e0c:	05010617 	streq	r0, [r1, #-1559]	@ 0xfffff9e9
    1e10:	05052009 	streq	r2, [r5, #-9]
    1e14:	0d053006 	stceq	0, cr3, [r5, #-24]	@ 0xffffffe8
    1e18:	08050106 	stmdaeq	r5, {r1, r2, r8}
    1e1c:	0609052e 	streq	r0, [r9], -lr, lsr #10
    1e20:	060d053e 			@ <UNDEFINED> instruction: 0x060d053e
    1e24:	2e120501 	cfmul32cs	mvfx0, mvfx2, mvfx1
    1e28:	3d060905 	vstrcc.16	s0, [r6, #-10]	@ <UNPREDICTABLE>
    1e2c:	01061705 	tsteq	r6, r5, lsl #14
    1e30:	05200905 	streq	r0, [r0, #-2309]!	@ 0xfffff6fb
    1e34:	05300605 	ldreq	r0, [r0, #-1541]!	@ 0xfffff9fb
    1e38:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    1e3c:	09052e08 	stmdbeq	r5, {r3, r9, sl, fp, sp}
    1e40:	0d053e06 	stceq	14, cr3, [r5, #-24]	@ 0xffffffe8
    1e44:	12050106 	andne	r0, r5, #-2147483647	@ 0x80000001
    1e48:	0609052e 	streq	r0, [r9], -lr, lsr #10
    1e4c:	0617053d 			@ <UNDEFINED> instruction: 0x0617053d
    1e50:	20090501 	andcs	r0, r9, r1, lsl #10
    1e54:	02300105 	eorseq	r0, r0, #1073741825	@ 0x40000001
    1e58:	01010005 	tsteq	r1, r5
    1e5c:	00000daf 	andeq	r0, r0, pc, lsr #27
    1e60:	06170003 	ldreq	r0, [r7], -r3
    1e64:	01020000 	mrseq	r0, (UNDEF: 2)
    1e68:	000d0efb 	strdeq	r0, [sp], -fp
    1e6c:	01010101 	tsteq	r1, r1, lsl #2
    1e70:	01000000 	mrseq	r0, (UNDEF: 0)
    1e74:	2e010000 	cdpcs	0, 0, cr0, cr1, cr0, {0}
    1e78:	54532f2e 	ldrbpl	r2, [r3], #-3886	@ 0xfffff0d2
    1e7c:	4632334d 	ldrtmi	r3, [r2], -sp, asr #6
    1e80:	43333031 	teqmi	r3, #49	@ 0x31
    1e84:	72445f36 	subvc	r5, r4, #54, 30	@ 0xd8
    1e88:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
    1e8c:	3a430073 	bcc	10c2060 <_Min_Stack_Size+0x10c1c60>
    1e90:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
    1e94:	334d5453 	movtcc	r5, #54355	@ 0xd453
    1e98:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    1e9c:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    1ea0:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
    1ea4:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
    1ea8:	334d5453 	movtcc	r5, #54355	@ 0xd453
    1eac:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    1eb0:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    1eb4:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
    1eb8:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
    1ebc:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ 1d54 <_Min_Stack_Size+0x1954>
    1ec0:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
    1ec4:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    1ec8:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
    1ecc:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
    1ed0:	636d2e65 	cmnvs	sp, #1616	@ 0x650
    1ed4:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
    1ed8:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    1edc:	6f746c61 	svcvs	0x00746c61
    1ee0:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
    1ee4:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
    1ee8:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 1d20 <_Min_Stack_Size+0x1920>
    1eec:	6f662d73 	svcvs	0x00662d73
    1ef0:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
    1ef4:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
    1ef8:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    1efc:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
    1f00:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
    1f04:	5f32336e 	svcpl	0x0032336e
    1f08:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
    1f0c:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
    1f10:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
    1f14:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
    1f18:	33323631 	teqcc	r2, #51380224	@ 0x3100000
    1f1c:	6f6f745c 	svcvs	0x006f745c
    1f20:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
    1f24:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
    1f28:	696c2f2e 	stmdbvs	ip!, {r1, r2, r3, r5, r8, r9, sl, fp, sp}^
    1f2c:	63672f62 	cmnvs	r7, #392	@ 0x188
    1f30:	72612f63 	rsbvc	r2, r1, #396	@ 0x18c
    1f34:	6f6e2d6d 	svcvs	0x006e2d6d
    1f38:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    1f3c:	2f696261 	svccs	0x00696261
    1f40:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    1f44:	2e2f312e 	sufcsep	f3, f7, #0.5
    1f48:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    1f4c:	2f2e2e2f 	svccs	0x002e2e2f
    1f50:	612f2e2e 			@ <UNDEFINED> instruction: 0x612f2e2e
    1f54:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    1f58:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    1f5c:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    1f60:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
    1f64:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
    1f68:	63616d2f 	cmnvs	r1, #3008	@ 0xbc0
    1f6c:	656e6968 	strbvs	r6, [lr, #-2408]!	@ 0xfffff698
    1f70:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
    1f74:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
    1f78:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    1f7c:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    1f80:	5f454449 	svcpl	0x00454449
    1f84:	33312e31 	teqcc	r1, #784	@ 0x310
    1f88:	535c302e 	cmppl	ip, #46	@ 0x2e
    1f8c:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    1f90:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    1f94:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
    1f98:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
    1f9c:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
    1fa0:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
    1fa4:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
    1fa8:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    1fac:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
    1fb0:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
    1fb4:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
    1fb8:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
    1fbc:	616e7265 	cmnvs	lr, r5, ror #4
    1fc0:	6f6f746c 	svcvs	0x006f746c
    1fc4:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
    1fc8:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
    1fcc:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    1fd0:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
    1fd4:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
    1fd8:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
    1fdc:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    1fe0:	316c6572 	smccc	50770	@ 0xc652
    1fe4:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
    1fe8:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
    1fec:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
    1ff0:	322e3030 	eorcc	r3, lr, #48	@ 0x30
    1ff4:	30343230 	eorscc	r3, r4, r0, lsr r2
    1ff8:	31393136 	teqcc	r9, r6, lsr r1
    1ffc:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
    2000:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 1e38 <_Min_Stack_Size+0x1a38>
    2004:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
    2008:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
    200c:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
    2010:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
    2014:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    2018:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    201c:	61652d65 	cmnvs	r5, r5, ror #26
    2020:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
    2024:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    2028:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
    202c:	2f2e2e2f 	svccs	0x002e2e2f
    2030:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    2034:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    2038:	6f6e2d6d 	svcvs	0x006e2d6d
    203c:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    2040:	2f696261 	svccs	0x00696261
    2044:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    2048:	2f656475 	svccs	0x00656475
    204c:	00737973 	rsbseq	r7, r3, r3, ror r9
    2050:	532f2e2e 			@ <UNDEFINED> instruction: 0x532f2e2e
    2054:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    2058:	33303146 	teqcc	r0, #-2147483631	@ 0x80000011
    205c:	445f3643 	ldrbmi	r3, [pc], #-1603	@ 2064 <_Min_Stack_Size+0x1c64>
    2060:	65766972 	ldrbvs	r6, [r6, #-2418]!	@ 0xfffff68e
    2064:	692f7372 	stmdbvs	pc!, {r1, r4, r5, r6, r8, r9, ip, sp, lr}	@ <UNPREDICTABLE>
    2068:	4300636e 	movwmi	r6, #878	@ 0x36e
    206c:	54535c3a 	ldrbpl	r5, [r3], #-3130	@ 0xfffff3c6
    2070:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    2074:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    2078:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    207c:	2e315f45 	cdpcs	15, 3, cr5, cr1, cr5, {2}
    2080:	302e3331 	eorcc	r3, lr, r1, lsr r3
    2084:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    2088:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    208c:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    2090:	6c705c45 	ldclvs	12, cr5, [r0], #-276	@ 0xfffffeec
    2094:	6e696775 	mcrvs	7, 3, r6, cr9, cr5, {3}
    2098:	6f635c73 	svcvs	0x00635c73
    209c:	74732e6d 	ldrbtvc	r2, [r3], #-3693	@ 0xfffff193
    20a0:	6d74732e 	ldclvs	3, cr7, [r4, #-184]!	@ 0xffffff48
    20a4:	75633233 	strbvc	r3, [r3, #-563]!	@ 0xfffffdcd
    20a8:	692e6562 	stmdbvs	lr!, {r1, r5, r6, r8, sl, sp, lr}
    20ac:	6d2e6564 	cfstr32vs	mvfx6, [lr, #-400]!	@ 0xfffffe70
    20b0:	652e7563 	strvs	r7, [lr, #-1379]!	@ 0xfffffa9d
    20b4:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
    20b8:	746c616e 	strbtvc	r6, [ip], #-366	@ 0xfffffe92
    20bc:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    20c0:	756e672e 	strbvc	r6, [lr, #-1838]!	@ 0xfffff8d2
    20c4:	6f6f742d 	svcvs	0x006f742d
    20c8:	662d736c 	strtvs	r7, [sp], -ip, ror #6
    20cc:	732d726f 			@ <UNDEFINED> instruction: 0x732d726f
    20d0:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    20d4:	2e32312e 	rsfcssp	f3, f2, #0.5
    20d8:	65722e33 	ldrbvs	r2, [r2, #-3635]!	@ 0xfffff1cd
    20dc:	772e316c 	strvc	r3, [lr, -ip, ror #2]!
    20e0:	32336e69 	eorscc	r6, r3, #1680	@ 0x690
    20e4:	302e315f 	eorcc	r3, lr, pc, asr r1
    20e8:	3030322e 	eorscc	r3, r0, lr, lsr #4
    20ec:	3230322e 	eorscc	r3, r0, #-536870910	@ 0xe0000002
    20f0:	31363034 	teqcc	r6, r4, lsr r0
    20f4:	32363139 	eorscc	r3, r6, #1073741838	@ 0x4000000e
    20f8:	6f745c33 	svcvs	0x00745c33
    20fc:	5c736c6f 	ldclpl	12, cr6, [r3], #-444	@ 0xfffffe44
    2100:	2f6e6962 	svccs	0x006e6962
    2104:	6c2f2e2e 	stcvs	14, cr2, [pc], #-184	@ 2054 <_Min_Stack_Size+0x1c54>
    2108:	672f6269 	strvs	r6, [pc, -r9, ror #4]!
    210c:	612f6363 			@ <UNDEFINED> instruction: 0x612f6363
    2110:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    2114:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    2118:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    211c:	2e32312f 	rsfcssp	f3, f2, #10.0
    2120:	2f312e33 	svccs	0x00312e33
    2124:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    2128:	00656475 	rsbeq	r6, r5, r5, ror r4
    212c:	535c3a43 	cmppl	ip, #274432	@ 0x43000
    2130:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
    2134:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    2138:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    213c:	315f4544 	cmpcc	pc, r4, asr #10
    2140:	2e33312e 	rsfcssp	f3, f3, #0.5
    2144:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
    2148:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    214c:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    2150:	705c4544 	subsvc	r4, ip, r4, asr #10
    2154:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    2158:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
    215c:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
    2160:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
    2164:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
    2168:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
    216c:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
    2170:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
    2174:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
    2178:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
    217c:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 1fb4 <_Min_Stack_Size+0x1bb4>
    2180:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
    2184:	6f742d75 	svcvs	0x00742d75
    2188:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
    218c:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    2190:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    2194:	32312e32 	eorscc	r2, r1, #800	@ 0x320
    2198:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
    219c:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
    21a0:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
    21a4:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
    21a8:	30322e30 	eorscc	r2, r2, r0, lsr lr
    21ac:	30322e30 	eorscc	r2, r2, r0, lsr lr
    21b0:	36303432 			@ <UNDEFINED> instruction: 0x36303432
    21b4:	36313931 			@ <UNDEFINED> instruction: 0x36313931
    21b8:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
    21bc:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    21c0:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
    21c4:	2f2e2e2f 	svccs	0x002e2e2f
    21c8:	2f62696c 	svccs	0x0062696c
    21cc:	2f636367 	svccs	0x00636367
    21d0:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    21d4:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    21d8:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    21dc:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
    21e0:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
    21e4:	2f2e2e2f 	svccs	0x002e2e2f
    21e8:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    21ec:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    21f0:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    21f4:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    21f8:	61652d65 	cmnvs	r5, r5, ror #26
    21fc:	692f6962 	stmdbvs	pc!, {r1, r5, r6, r8, fp, sp, lr}	@ <UNPREDICTABLE>
    2200:	756c636e 	strbvc	r6, [ip, #-878]!	@ 0xfffffc92
    2204:	43006564 	movwmi	r6, #1380	@ 0x564
    2208:	54535c3a 	ldrbpl	r5, [r3], #-3130	@ 0xfffff3c6
    220c:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    2210:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    2214:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    2218:	2e315f45 	cdpcs	15, 3, cr5, cr1, cr5, {2}
    221c:	302e3331 	eorcc	r3, lr, r1, lsr r3
    2220:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    2224:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    2228:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    222c:	6c705c45 	ldclvs	12, cr5, [r0], #-276	@ 0xfffffeec
    2230:	6e696775 	mcrvs	7, 3, r6, cr9, cr5, {3}
    2234:	6f635c73 	svcvs	0x00635c73
    2238:	74732e6d 	ldrbtvc	r2, [r3], #-3693	@ 0xfffff193
    223c:	6d74732e 	ldclvs	3, cr7, [r4, #-184]!	@ 0xffffff48
    2240:	75633233 	strbvc	r3, [r3, #-563]!	@ 0xfffffdcd
    2244:	692e6562 	stmdbvs	lr!, {r1, r5, r6, r8, sl, sp, lr}
    2248:	6d2e6564 	cfstr32vs	mvfx6, [lr, #-400]!	@ 0xfffffe70
    224c:	652e7563 	strvs	r7, [lr, #-1379]!	@ 0xfffffa9d
    2250:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
    2254:	746c616e 	strbtvc	r6, [ip], #-366	@ 0xfffffe92
    2258:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    225c:	756e672e 	strbvc	r6, [lr, #-1838]!	@ 0xfffff8d2
    2260:	6f6f742d 	svcvs	0x006f742d
    2264:	662d736c 	strtvs	r7, [sp], -ip, ror #6
    2268:	732d726f 			@ <UNDEFINED> instruction: 0x732d726f
    226c:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    2270:	2e32312e 	rsfcssp	f3, f2, #0.5
    2274:	65722e33 	ldrbvs	r2, [r2, #-3635]!	@ 0xfffff1cd
    2278:	772e316c 	strvc	r3, [lr, -ip, ror #2]!
    227c:	32336e69 	eorscc	r6, r3, #1680	@ 0x690
    2280:	302e315f 	eorcc	r3, lr, pc, asr r1
    2284:	3030322e 	eorscc	r3, r0, lr, lsr #4
    2288:	3230322e 	eorscc	r3, r0, #-536870910	@ 0xe0000002
    228c:	31363034 	teqcc	r6, r4, lsr r0
    2290:	32363139 	eorscc	r3, r6, #1073741838	@ 0x4000000e
    2294:	6f745c33 	svcvs	0x00745c33
    2298:	5c736c6f 	ldclpl	12, cr6, [r3], #-444	@ 0xfffffe44
    229c:	2f6e6962 	svccs	0x006e6962
    22a0:	612f2e2e 			@ <UNDEFINED> instruction: 0x612f2e2e
    22a4:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    22a8:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    22ac:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    22b0:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
    22b4:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
    22b8:	77656e2f 	strbvc	r6, [r5, -pc, lsr #28]!
    22bc:	2d62696c 			@ <UNDEFINED> instruction: 0x2d62696c
    22c0:	6f6e616e 	svcvs	0x006e616e
    22c4:	74730000 	ldrbtvc	r0, [r3], #-0
    22c8:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    22cc:	63333031 	teqvs	r3, #49	@ 0x31
    22d0:	32495f36 	subcc	r5, r9, #54, 30	@ 0xd8
    22d4:	72445f43 	subvc	r5, r4, #268	@ 0x10c
    22d8:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
    22dc:	0100632e 	tsteq	r0, lr, lsr #6
    22e0:	645f0000 	ldrbvs	r0, [pc], #-0	@ 22e8 <_Min_Stack_Size+0x1ee8>
    22e4:	75616665 	strbvc	r6, [r1, #-1637]!	@ 0xfffff99b
    22e8:	745f746c 	ldrbvc	r7, [pc], #-1132	@ 22f0 <_Min_Stack_Size+0x1ef0>
    22ec:	73657079 	cmnvc	r5, #121	@ 0x79
    22f0:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
    22f4:	735f0000 	cmpvc	pc, #0
    22f8:	6e696474 	mcrvs	4, 3, r6, cr9, cr4, {3}
    22fc:	00682e74 	rsbeq	r2, r8, r4, ror lr
    2300:	73000003 	movwvc	r0, #3
    2304:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    2308:	33303166 	teqcc	r0, #-2147483623	@ 0x80000019
    230c:	682e3678 	stmdavs	lr!, {r3, r4, r5, r6, r9, sl, ip, sp}
    2310:	00000400 	andeq	r0, r0, r0, lsl #8
    2314:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    2318:	30316632 	eorscc	r6, r1, r2, lsr r6
    231c:	5f366333 	svcpl	0x00366333
    2320:	6f697067 	svcvs	0x00697067
    2324:	0400682e 	streq	r6, [r0], #-2094	@ 0xfffff7d2
    2328:	74730000 	ldrbtvc	r0, [r3], #-0
    232c:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    2330:	63333031 	teqvs	r3, #49	@ 0x31
    2334:	32495f36 	subcc	r5, r9, #54, 30	@ 0xd8
    2338:	72445f43 	subvc	r5, r4, #268	@ 0x10c
    233c:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
    2340:	0400682e 	streq	r6, [r0], #-2094	@ 0xfffff7d2
    2344:	74730000 	ldrbtvc	r0, [r3], #-0
    2348:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    234c:	63333130 	teqvs	r3, #48, 2
    2350:	43525f36 	cmpmi	r2, #54, 30	@ 0xd8
    2354:	72445f43 	subvc	r5, r4, #268	@ 0x10c
    2358:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
    235c:	0400682e 	streq	r6, [r0], #-2094	@ 0xfffff7d2
    2360:	74730000 	ldrbtvc	r0, [r3], #-0
    2364:	6f6f6264 	svcvs	0x006f6264
    2368:	00682e6c 	rsbeq	r2, r8, ip, ror #28
    236c:	73000005 	movwvc	r0, #5
    2370:	6f696474 	svcvs	0x00696474
    2374:	0600682e 	streq	r6, [r0], -lr, lsr #16
    2378:	615f0000 	cmpvs	pc, r0
    237c:	2e69736e 	cdpcs	3, 6, cr7, cr9, cr14, {3}
    2380:	00060068 	andeq	r0, r6, r8, rrx
    2384:	77656e00 	strbvc	r6, [r5, -r0, lsl #28]!
    2388:	2e62696c 	vnmulcs.f16	s13, s4, s25	@ <UNPREDICTABLE>
    238c:	00070068 	andeq	r0, r7, r8, rrx
    2390:	656e5f00 	strbvs	r5, [lr, #-3840]!	@ 0xfffff100
    2394:	62696c77 	rsbvs	r6, r9, #30464	@ 0x7700
    2398:	7265765f 	rsbvc	r7, r5, #99614720	@ 0x5f00000
    239c:	6e6f6973 			@ <UNDEFINED> instruction: 0x6e6f6973
    23a0:	0600682e 	streq	r6, [r0], -lr, lsr #16
    23a4:	6f630000 	svcvs	0x00630000
    23a8:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    23ac:	0300682e 	movweq	r6, #2094	@ 0x82e
    23b0:	65690000 	strbvs	r0, [r9, #-0]!
    23b4:	70666565 	rsbvc	r6, r6, r5, ror #10
    23b8:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
    23bc:	65660000 	strbvs	r0, [r6, #-0]!
    23c0:	72757461 	rsbsvc	r7, r5, #1627389952	@ 0x61000000
    23c4:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
    23c8:	00000300 	andeq	r0, r0, r0, lsl #6
    23cc:	66656463 	strbtvs	r6, [r5], -r3, ror #8
    23d0:	00682e73 	rsbeq	r2, r8, r3, ror lr
    23d4:	73000003 	movwvc	r0, #3
    23d8:	65646474 	strbvs	r6, [r4, #-1140]!	@ 0xfffffb8c
    23dc:	00682e66 	rsbeq	r2, r8, r6, ror #28
    23e0:	73000005 	movwvc	r0, #5
    23e4:	72616474 	rsbvc	r6, r1, #116, 8	@ 0x74000000
    23e8:	00682e67 	rsbeq	r2, r8, r7, ror #28
    23ec:	72000005 	andvc	r0, r0, #5
    23f0:	746e6565 	strbtvc	r6, [lr], #-1381	@ 0xfffffa9b
    23f4:	0300682e 	movweq	r6, #2094	@ 0x82e
    23f8:	745f0000 	ldrbvc	r0, [pc], #-0	@ 2400 <_Min_Stack_Size+0x2000>
    23fc:	73657079 	cmnvc	r5, #121	@ 0x79
    2400:	0300682e 	movweq	r6, #2094	@ 0x82e
    2404:	745f0000 	ldrbvc	r0, [pc], #-0	@ 240c <_Min_Stack_Size+0x200c>
    2408:	73657079 	cmnvc	r5, #121	@ 0x79
    240c:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
    2410:	6f6c0000 	svcvs	0x006c0000
    2414:	682e6b63 	stmdavs	lr!, {r0, r1, r5, r6, r8, r9, fp, sp, lr}
    2418:	00000300 	andeq	r0, r0, r0, lsl #6
    241c:	65737361 	ldrbvs	r7, [r3, #-865]!	@ 0xfffffc9f
    2420:	682e7472 	stmdavs	lr!, {r1, r4, r5, r6, sl, ip, sp, lr}
    2424:	00000600 	andeq	r0, r0, r0, lsl #12
    2428:	69647473 	stmdbvs	r4!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
    242c:	00682e6f 	rsbeq	r2, r8, pc, ror #28
    2430:	73000003 	movwvc	r0, #3
    2434:	696c6474 	stmdbvs	ip!, {r2, r4, r5, r6, sl, sp, lr}^
    2438:	00682e62 	rsbeq	r2, r8, r2, ror #28
    243c:	73000006 	movwvc	r0, #6
    2440:	696c6474 	stmdbvs	ip!, {r2, r4, r5, r6, sl, sp, lr}^
    2444:	00682e62 	rsbeq	r2, r8, r2, ror #28
    2448:	61000002 	tstvs	r0, r2
    244c:	636f6c6c 	cmnvs	pc, #108, 24	@ 0x6c00
    2450:	00682e61 	rsbeq	r2, r8, r1, ror #28
    2454:	73000006 	movwvc	r0, #6
    2458:	6e696474 	mcrvs	4, 3, r6, cr9, cr4, {3}
    245c:	00682e74 	rsbeq	r2, r8, r4, ror lr
    2460:	73000005 	movwvc	r0, #5
    2464:	6e696474 	mcrvs	4, 3, r6, cr9, cr4, {3}
    2468:	00682e74 	rsbeq	r2, r8, r4, ror lr
    246c:	5f000006 	svcpl	0x00000006
    2470:	73746e69 	cmnvc	r4, #1680	@ 0x690
    2474:	682e7075 	stmdavs	lr!, {r0, r2, r4, r5, r6, ip, sp, lr}
    2478:	00000300 	andeq	r0, r0, r0, lsl #6
    247c:	00050500 	andeq	r0, r5, r0, lsl #10
    2480:	00000205 	andeq	r0, r0, r5, lsl #4
    2484:	16030000 	strne	r0, [r3], -r0
    2488:	06010601 	streq	r0, [r1], -r1, lsl #12
