NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    248c:	0513133d 	ldreq	r1, [r3, #-829]	@ 0xfffffcc3
    2490:	05010608 	streq	r0, [r1, #-1544]	@ 0xfffff9f8
    2494:	0541060a 	strbeq	r0, [r1, #-1546]	@ 0xfffff9f6
    2498:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    249c:	05420605 	strbeq	r0, [r2, #-1541]	@ 0xfffff9fb
    24a0:	05010608 	streq	r0, [r1, #-1544]	@ 0xfffff9f8
    24a4:	25030605 	strcs	r0, [r3, #-1541]	@ 0xfffff9fb
    24a8:	0608053c 			@ <UNDEFINED> instruction: 0x0608053c
    24ac:	06020501 	streq	r0, [r2], -r1, lsl #10
    24b0:	06060530 			@ <UNDEFINED> instruction: 0x06060530
    24b4:	20100501 	andscs	r0, r0, r1, lsl #10
    24b8:	3d060205 	sfmcc	f0, 4, [r6, #-20]	@ 0xffffffec
    24bc:	01060605 	tsteq	r6, r5, lsl #12
    24c0:	05201005 	streq	r1, [r0, #-5]!
    24c4:	053d0602 	ldreq	r0, [sp, #-1538]!	@ 0xfffff9fe
    24c8:	05010606 	streq	r0, [r1, #-1542]	@ 0xfffff9fa
    24cc:	05052010 	streq	r2, [r5, #-16]
    24d0:	08053e06 	stmdaeq	r5, {r1, r2, r9, sl, fp, ip, sp}
    24d4:	0a050106 	beq	1428f4 <_Min_Stack_Size+0x1424f4>
    24d8:	0d054006 	stceq	0, cr4, [r5, #-24]	@ 0xffffffe8
    24dc:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    24e0:	13054006 	movwne	r4, #20486	@ 0x5006
    24e4:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    24e8:	13052f06 	movwne	r2, #24326	@ 0x5f06
    24ec:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    24f0:	09052206 	stmdbeq	r5, {r1, r2, r9, sp}
    24f4:	13050106 	movwne	r0, #20742	@ 0x5106
    24f8:	3d050520 	cfstr32cc	mvfx0, [r5, #-128]	@ 0xffffff80
    24fc:	03060205 	movweq	r0, #25093	@ 0x6205
    2500:	20052040 	andcs	r2, r5, r0, asr #32
    2504:	054a0106 	strbeq	r0, [sl, #-262]	@ 0xfffffefa
    2508:	6a750602 	bvs	1d43d18 <_Min_Stack_Size+0x1d43918>
    250c:	01062005 	tsteq	r6, r5
    2510:	0602054a 	streq	r0, [r2], -sl, asr #10
    2514:	10056b75 	andne	r6, r5, r5, ror fp
    2518:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    251c:	0a052106 	beq	14a93c <_Min_Stack_Size+0x14a53c>
    2520:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    2524:	09053d06 	stmdbeq	r5, {r1, r2, r8, sl, fp, ip, sp}
    2528:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    252c:	21052f06 	tstcs	r5, r6, lsl #30
    2530:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    2534:	05134b06 	ldreq	r4, [r3, #-2822]	@ 0xfffff4fa
    2538:	05010610 	streq	r0, [r1, #-1552]	@ 0xfffff9f0
    253c:	053e0602 	ldreq	r0, [lr, #-1538]!	@ 0xfffff9fe
    2540:	05010606 	streq	r0, [r1, #-1542]	@ 0xfffff9fa
    2544:	02052010 	andeq	r2, r5, #16
    2548:	05133d06 	ldreq	r3, [r3, #-3334]	@ 0xfffff2fa
    254c:	05010614 	streq	r0, [r1, #-1556]	@ 0xfffff9ec
    2550:	03052005 	movweq	r2, #20485	@ 0x5005
    2554:	0606053d 			@ <UNDEFINED> instruction: 0x0606053d
    2558:	0513133e 	ldreq	r1, [r3, #-830]	@ 0xfffffcc2
    255c:	05100642 	ldreq	r0, [r0, #-1602]	@ 0xfffff9be
    2560:	052e2020 	streq	r2, [lr, #-32]!	@ 0xffffffe0
    2564:	06052214 			@ <UNDEFINED> instruction: 0x06052214
    2568:	22052106 	andcs	r2, r5, #-2147483647	@ 0x80000001
    256c:	16050106 	strne	r0, [r5], -r6, lsl #2
    2570:	06020520 	streq	r0, [r2], -r0, lsr #10
    2574:	06100522 	ldreq	r0, [r0], -r2, lsr #10
    2578:	06020501 	streq	r0, [r2], -r1, lsl #10
    257c:	03051521 	movweq	r1, #21793	@ 0x5521
    2580:	05211006 	streq	r1, [r1, #-6]!
    2584:	0d054a2e 	vstreq	s8, [r5, #-184]	@ 0xffffff48
    2588:	200a051e 	andcs	r0, sl, lr, lsl r5
    258c:	05231005 	streq	r1, [r3, #-5]!
    2590:	052f0602 	streq	r0, [pc, #-1538]!	@ 1f96 <_Min_Stack_Size+0x1b96>
    2594:	05010605 	streq	r0, [r1, #-1541]	@ 0xfffff9fb
    2598:	133e0606 	teqne	lr, #6291456	@ 0x600000
    259c:	06320514 			@ <UNDEFINED> instruction: 0x06320514
    25a0:	21070510 	tstcs	r7, r0, lsl r5
    25a4:	051f0e05 	ldreq	r0, [pc, #-3589]	@ 17a7 <_Min_Stack_Size+0x13a7>
    25a8:	052e3015 	streq	r3, [lr, #-21]!	@ 0xffffffeb
    25ac:	10030602 	andne	r0, r3, r2, lsl #12
    25b0:	821e0520 	andshi	r0, lr, #32, 10	@ 0x8000000
    25b4:	05780205 	ldrbeq	r0, [r8, #-517]!	@ 0xfffffdfb
    25b8:	1702821e 	smladne	r2, lr, r2, r8
    25bc:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    25c0:	02050005 	andeq	r0, r5, #5
    25c4:	00000000 	andeq	r0, r0, r0
    25c8:	0100dd03 	tsteq	r0, r3, lsl #26
    25cc:	06080513 			@ <UNDEFINED> instruction: 0x06080513
    25d0:	060a0501 	streq	r0, [sl], -r1, lsl #10
    25d4:	060d0542 	streq	r0, [sp], -r2, asr #10
    25d8:	42050501 	andmi	r0, r5, #4194304	@ 0x400000
    25dc:	03060205 	movweq	r0, #25093	@ 0x6205
    25e0:	67832076 			@ <UNDEFINED> instruction: 0x67832076
    25e4:	0567836a 	strbeq	r8, [r7, #-874]!	@ 0xfffffc96
    25e8:	025a0605 	subseq	r0, sl, #5242880	@ 0x500000
    25ec:	01010008 	tsteq	r1, r8
    25f0:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    25f4:	00000002 	andeq	r0, r0, r2
    25f8:	00ec0300 	rsceq	r0, ip, r0, lsl #6
    25fc:	06010601 	streq	r0, [r1], -r1, lsl #12
    2600:	16051330 			@ <UNDEFINED> instruction: 0x16051330
    2604:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    2608:	1e053d06 	cdpne	13, 0, cr3, cr5, cr6, {0}
    260c:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    2610:	08053d06 	stmdaeq	r5, {r1, r2, r8, sl, fp, ip, sp}
    2614:	0a050106 	beq	142a34 <_Min_Stack_Size+0x142634>
    2618:	0d054406 	cfstrseq	mvf4, [r5, #-24]	@ 0xffffffe8
    261c:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    2620:	053c0903 	ldreq	r0, [ip, #-2307]!	@ 0xfffff6fd
    2624:	71030602 	tstvc	r3, r2, lsl #12
    2628:	0618052e 	ldreq	r0, [r8], -lr, lsr #10
    262c:	06020501 	streq	r0, [r2], -r1, lsl #10
    2630:	063c063d 			@ <UNDEFINED> instruction: 0x063c063d
    2634:	0618052f 	ldreq	r0, [r8], -pc, lsr #10
    2638:	06020501 	streq	r0, [r2], -r1, lsl #10
    263c:	18055d3d 	stmdane	r5, {r0, r2, r3, r4, r5, r8, sl, fp, ip, lr}
    2640:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    2644:	3c064b06 			@ <UNDEFINED> instruction: 0x3c064b06
    2648:	18052f06 	stmdane	r5, {r1, r2, r8, r9, sl, fp, sp}
    264c:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    2650:	05054b06 	streq	r4, [r5, #-2822]	@ 0xfffff4fa
    2654:	07024e06 	streq	r4, [r2, -r6, lsl #28]
    2658:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    265c:	02050005 	andeq	r0, r5, #5
    2660:	00000000 	andeq	r0, r0, r0
    2664:	0101c003 	tsteq	r1, r3
    2668:	06120513 			@ <UNDEFINED> instruction: 0x06120513
    266c:	21050501 	tstcs	r5, r1, lsl #10
    2670:	01000102 	tsteq	r0, r2, lsl #2
    2674:	00050501 	andeq	r0, r5, r1, lsl #10
    2678:	00000205 	andeq	r0, r0, r5, lsl #4
    267c:	c5030000 	strgt	r0, [r3, #-0]
    2680:	05130101 	ldreq	r0, [r3, #-257]	@ 0xfffffeff
    2684:	0501061a 	streq	r0, [r1, #-1562]	@ 0xfffff9e6
    2688:	02022105 	andeq	r2, r2, #1073741825	@ 0x40000001
    268c:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    2690:	02050005 	andeq	r0, r5, #5
    2694:	00000000 	andeq	r0, r0, r0
    2698:	0101ea03 	tsteq	r1, r3, lsl #20
    269c:	13131313 	tstne	r3, #1275068416	@ 0x4c000000
    26a0:	27030205 	strcs	r0, [r3, -r5, lsl #4]
    26a4:	060805ba 			@ <UNDEFINED> instruction: 0x060805ba
    26a8:	06020501 	streq	r0, [r2], -r1, lsl #10
    26ac:	06080521 	streq	r0, [r8], -r1, lsr #10
    26b0:	06020501 	streq	r0, [r2], -r1, lsl #10
    26b4:	03141421 	tsteq	r4, #553648128	@ 0x21000000
    26b8:	0c050113 	stfeqs	f0, [r5], {19}
    26bc:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    26c0:	3c400320 	mcrrcc	3, 2, r0, r0, cr0
    26c4:	06020520 	streq	r0, [r2], -r0, lsr #10
    26c8:	060b0524 	streq	r0, [fp], -r4, lsr #10
    26cc:	20050501 	andcs	r0, r5, r1, lsl #10
    26d0:	03060205 	movweq	r0, #25093	@ 0x6205
    26d4:	0b053c0f 	bleq	151718 <_Min_Stack_Size+0x151318>
    26d8:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    26dc:	06020520 	streq	r0, [r2], -r0, lsr #10
    26e0:	053c0a03 	ldreq	r0, [ip, #-2563]!	@ 0xfffff5fd
    26e4:	0501060c 	streq	r0, [r1, #-1548]	@ 0xfffff9f4
    26e8:	02052005 	andeq	r2, r5, #5
    26ec:	3c310306 	ldccc	3, cr0, [r1], #-24	@ 0xffffffe8
    26f0:	01060c05 	tsteq	r6, r5, lsl #24
    26f4:	03200505 			@ <UNDEFINED> instruction: 0x03200505
    26f8:	063c7fb2 			@ <UNDEFINED> instruction: 0x063c7fb2
    26fc:	2000d603 	andcs	sp, r0, r3, lsl #12
    2700:	03021306 	movweq	r1, #8966	@ 0x2306
    2704:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    2708:	02050005 	andeq	r0, r5, #5
    270c:	00000000 	andeq	r0, r0, r0
    2710:	0101cd03 	tsteq	r1, r3, lsl #26
    2714:	3d060106 	stfccs	f0, [r6, #-24]	@ 0xffffffe8
    2718:	01060805 	tsteq	r6, r5, lsl #16
    271c:	00300905 	eorseq	r0, r0, r5, lsl #18
    2720:	06010402 	streq	r0, [r1], -r2, lsl #8
    2724:	03050520 	movweq	r0, #21792	@ 0x5520
    2728:	0805660c 	stmdaeq	r5, {r2, r3, r9, sl, sp, lr}
    272c:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    2730:	06052306 	streq	r2, [r5], -r6, lsl #6
    2734:	10050106 	andne	r0, r5, r6, lsl #2
    2738:	44050520 	strmi	r0, [r5], #-1312	@ 0xfffffae0
    273c:	1d060205 	sfmne	f0, 4, [r6, #-20]	@ 0xffffffec
    2740:	01060605 	tsteq	r6, r5, lsl #12
    2744:	05201005 	streq	r1, [r0, #-5]!
    2748:	01023f05 	tsteq	r2, r5, lsl #30
    274c:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    2750:	02050005 	andeq	r0, r5, #5
    2754:	00000000 	andeq	r0, r0, r0
    2758:	01018503 	tsteq	r1, r3, lsl #10
    275c:	83060106 	movwhi	r0, #24838	@ 0x6106
    2760:	202e0613 	eorcs	r0, lr, r3, lsl r6
    2764:	0d052f06 	stceq	15, cr2, [r5, #-24]	@ 0xffffffe8
    2768:	0c050106 	stfeqs	f0, [r5], {6}
    276c:	01040200 	mrseq	r0, R12_usr
    2770:	0d052e06 	stceq	14, cr2, [r5, #-24]	@ 0xffffffe8
    2774:	01040200 	mrseq	r0, R12_usr
    2778:	0c050106 	stfeqs	f0, [r5], {6}
    277c:	01040200 	mrseq	r0, R12_usr
    2780:	0605054a 	streq	r0, [r5], -sl, asr #10
    2784:	03060530 	movweq	r0, #25904	@ 0x6530
    2788:	050101bd 	streq	r0, [r1, #-445]	@ 0xfffffe43
    278c:	17131505 	ldrne	r1, [r3, -r5, lsl #10]
    2790:	03060d05 	movweq	r0, #27909	@ 0x6d05
    2794:	1205017a 	andne	r0, r5, #-2147483618	@ 0x8000001e
    2798:	030d0534 	movweq	r0, #54580	@ 0xd534
    279c:	052e7ebb 	streq	r7, [lr, #-3771]!	@ 0xfffff145
    27a0:	0402000c 	streq	r0, [r2], #-12
    27a4:	052e0601 	streq	r0, [lr, #-1537]!	@ 0xfffff9ff
    27a8:	0402000d 	streq	r0, [r2], #-13
    27ac:	05010601 	streq	r0, [r1, #-1537]	@ 0xfffff9ff
    27b0:	0402000c 	streq	r0, [r2], #-12
    27b4:	0d054a01 	vstreq	s8, [r5, #-4]
    27b8:	000c0530 	andeq	r0, ip, r0, lsr r5
    27bc:	06010402 	streq	r0, [r1], -r2, lsl #8
    27c0:	000d052e 	andeq	r0, sp, lr, lsr #10
    27c4:	06010402 	streq	r0, [r1], -r2, lsl #8
    27c8:	000c0501 	andeq	r0, ip, r1, lsl #10
    27cc:	4a010402 	bmi	437dc <_Min_Stack_Size+0x433dc>
    27d0:	30061305 	andcc	r1, r6, r5, lsl #6
    27d4:	0a052e06 	beq	14dff4 <_Min_Stack_Size+0x14dbf4>
    27d8:	06020531 			@ <UNDEFINED> instruction: 0x06020531
    27dc:	0618051f 			@ <UNDEFINED> instruction: 0x0618051f
    27e0:	2e0f0501 	cfsh32cs	mvfx0, mvfx15, #1
    27e4:	21060205 	tstcs	r6, r5, lsl #4
    27e8:	02000905 	andeq	r0, r0, #81920	@ 0x14000
    27ec:	05010104 	streq	r0, [r1, #-260]	@ 0xfffffefc
    27f0:	0402000a 	streq	r0, [r2], #-10
    27f4:	05010601 	streq	r0, [r1, #-1537]	@ 0xfffff9ff
    27f8:	04020009 	streq	r0, [r2], #-9
    27fc:	1e054a01 	vmlane.f32	s8, s10, s2
    2800:	02040200 	andeq	r0, r4, #0, 4
    2804:	13052b06 	movwne	r2, #23302	@ 0x5b06
    2808:	02040200 	andeq	r0, r4, #0, 4
    280c:	34050501 	strcc	r0, [r5], #-1281	@ 0xfffffaff
    2810:	01060805 	tsteq	r6, r5, lsl #16
    2814:	05250505 	streq	r0, [r5, #-1285]!	@ 0xfffffafb
    2818:	052b0602 	streq	r0, [fp, #-1538]!	@ 0xfffff9fe
    281c:	01bc0306 			@ <UNDEFINED> instruction: 0x01bc0306
    2820:	14050501 	strne	r0, [r5], #-1281	@ 0xfffffaff
    2824:	05140205 	ldreq	r0, [r4, #-517]	@ 0xfffffdfb
    2828:	05010606 	streq	r0, [r1, #-1542]	@ 0xfffff9fa
    282c:	053c2010 	ldreq	r2, [ip, #-16]!
    2830:	7ec30305 	cdpvc	3, 12, cr0, cr3, cr5, {0}
    2834:	00040201 	andeq	r0, r4, r1, lsl #4
    2838:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    283c:	00020500 	andeq	r0, r2, r0, lsl #10
    2840:	03000000 	movweq	r0, #0
    2844:	0601019d 			@ <UNDEFINED> instruction: 0x0601019d
    2848:	13830601 	orrne	r0, r3, #1048576	@ 0x100000
    284c:	06202e06 	strteq	r2, [r0], -r6, lsl #28
    2850:	060d052f 	streq	r0, [sp], -pc, lsr #10
    2854:	000c0501 	andeq	r0, ip, r1, lsl #10
    2858:	06010402 	streq	r0, [r1], -r2, lsl #8
    285c:	000d0520 	andeq	r0, sp, r0, lsr #10
    2860:	06010402 	streq	r0, [r1], -r2, lsl #8
    2864:	000c0501 	andeq	r0, ip, r1, lsl #10
    2868:	4a010402 	bmi	43878 <_Min_Stack_Size+0x43478>
    286c:	30060505 	andcc	r0, r6, r5, lsl #10
    2870:	a5030605 	strge	r0, [r3, #-1541]	@ 0xfffff9fb
    2874:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    2878:	060d0515 			@ <UNDEFINED> instruction: 0x060d0515
    287c:	06050501 	streq	r0, [r5], -r1, lsl #10
    2880:	1302052f 	movwne	r0, #9519	@ 0x252f
    2884:	05160505 	ldreq	r0, [r6, #-1285]	@ 0xfffffafb
    2888:	2e010612 	mcrcs	6, 0, r0, cr1, cr2, {0}
    288c:	d3030d05 	movwle	r0, #15621	@ 0x3d05
    2890:	0c05207e 	stceq	0, cr2, [r5], {126}	@ 0x7e
    2894:	01040200 	mrseq	r0, R12_usr
    2898:	0d052006 	stceq	0, cr2, [r5, #-24]	@ 0xffffffe8
    289c:	01040200 	mrseq	r0, R12_usr
    28a0:	0c050106 	stfeqs	f0, [r5], {6}
    28a4:	01040200 	mrseq	r0, R12_usr
    28a8:	0605054a 	streq	r0, [r5], -sl, asr #10
    28ac:	03060530 	movweq	r0, #25904	@ 0x6530
    28b0:	050101bb 	streq	r0, [r1, #-443]	@ 0xfffffe45
    28b4:	02051405 	andeq	r1, r5, #83886080	@ 0x5000000
    28b8:	06060515 			@ <UNDEFINED> instruction: 0x06060515
    28bc:	20100501 	andscs	r0, r0, r1, lsl #10
    28c0:	0605053c 			@ <UNDEFINED> instruction: 0x0605053c
    28c4:	017ec103 	cmneq	lr, r3, lsl #2
    28c8:	01060805 	tsteq	r6, r5, lsl #16
    28cc:	3e060205 	cdpcc	2, 0, cr0, cr6, cr5, {0}
    28d0:	01060905 	tsteq	r6, r5, lsl #18
    28d4:	20061605 	andcs	r1, r6, r5, lsl #12
    28d8:	0e053c06 	cdpeq	12, 0, cr3, cr5, cr6, {0}
    28dc:	0d052022 	stceq	0, cr2, [r5, #-136]	@ 0xffffff78
    28e0:	01040200 	mrseq	r0, R12_usr
    28e4:	0e053c06 	cdpeq	12, 0, cr3, cr5, cr6, {0}
    28e8:	01040200 	mrseq	r0, R12_usr
    28ec:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    28f0:	01040200 	mrseq	r0, R12_usr
    28f4:	0006054a 	andeq	r0, r6, sl, asr #10
    28f8:	06020402 	streq	r0, [r2], -r2, lsl #8
    28fc:	001c0530 	andseq	r0, ip, r0, lsr r5
    2900:	06020402 	streq	r0, [r2], -r2, lsl #8
    2904:	00130501 	andseq	r0, r3, r1, lsl #10
    2908:	2e020402 	cdpcs	4, 0, cr0, cr2, cr2, {0}
    290c:	02000605 	andeq	r0, r0, #5242880	@ 0x500000
    2910:	21060204 	tstcs	r6, r4, lsl #4
    2914:	02001c05 	andeq	r1, r0, #1280	@ 0x500
    2918:	050d0204 	streq	r0, [sp, #-516]	@ 0xfffffdfc
    291c:	04020016 	streq	r0, [r2], #-22	@ 0xffffffea
    2920:	02052002 	andeq	r2, r5, #2
    2924:	052e0903 	streq	r0, [lr, #-2307]!	@ 0xfffff6fd
    2928:	01af0306 			@ <UNDEFINED> instruction: 0x01af0306
    292c:	14050501 	strne	r0, [r5], #-1281	@ 0xfffffaff
    2930:	051a0205 	ldreq	r0, [sl, #-517]	@ 0xfffffdfb
    2934:	05010606 	streq	r0, [r1, #-1542]	@ 0xfffff9fa
    2938:	053c2010 	ldreq	r2, [ip, #-16]!
    293c:	c9030605 	stmdbgt	r3, {r0, r2, r9, sl}
    2940:	2b05017e 	blcs	142f40 <_Min_Stack_Size+0x142b40>
    2944:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    2948:	08054b06 	stmdaeq	r5, {r1, r2, r8, r9, fp, lr}
    294c:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    2950:	21052406 	tstcs	r5, r6, lsl #8
    2954:	052e0106 	streq	r0, [lr, #-262]!	@ 0xfffffefa
    2958:	05053c08 	streq	r3, [r5, #-3080]	@ 0xfffff3f8
    295c:	0602054e 	streq	r0, [r2], -lr, asr #10
    2960:	052e7a03 	streq	r7, [lr, #-2563]!	@ 0xfffff5fd
    2964:	019d0306 	orrseq	r0, sp, r6, lsl #6
    2968:	14050501 	strne	r0, [r5], #-1281	@ 0xfffffaff
    296c:	05140205 	ldreq	r0, [r4, #-517]	@ 0xfffffdfb
    2970:	05010606 	streq	r0, [r1, #-1542]	@ 0xfffff9fa
    2974:	05052010 	streq	r2, [r5, #-16]
    2978:	02052043 	andeq	r2, r5, #67	@ 0x43
    297c:	7edc0306 	cdpvc	3, 13, cr0, cr12, cr6, {0}
    2980:	03060501 	movweq	r0, #25857	@ 0x6501
    2984:	050101a6 	streq	r0, [r1, #-422]	@ 0xfffffe5a
    2988:	02051405 	andeq	r1, r5, #83886080	@ 0x5000000
    298c:	06060515 			@ <UNDEFINED> instruction: 0x06060515
    2990:	20100501 	andscs	r0, r0, r1, lsl #10
    2994:	0305053c 	movweq	r0, #21820	@ 0x553c
    2998:	02017ed7 	andeq	r7, r1, #3440	@ 0xd70
    299c:	01010005 	tsteq	r1, r5
    29a0:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    29a4:	00000002 	andeq	r0, r0, r2
    29a8:	02c90300 	sbceq	r0, r9, #0, 6
    29ac:	0d051301 	stceq	3, cr1, [r5, #-4]
    29b0:	05200106 	streq	r0, [r0, #-262]!	@ 0xfffffefa
    29b4:	05210605 	streq	r0, [r1, #-1541]!	@ 0xfffff9fb
    29b8:	05010608 	streq	r0, [r1, #-1544]	@ 0xfffff9f8
    29bc:	05210602 	streq	r0, [r1, #-1538]!	@ 0xfffff9fe
    29c0:	0501060a 	streq	r0, [r1, #-1546]	@ 0xfffff9f6
    29c4:	05320605 	ldreq	r0, [r2, #-1541]!	@ 0xfffff9fb
    29c8:	05010612 	streq	r0, [r1, #-1554]	@ 0xfffff9ee
    29cc:	01022105 	tsteq	r2, r5, lsl #2
    29d0:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    29d4:	02050005 	andeq	r0, r5, #5
    29d8:	00000000 	andeq	r0, r0, r0
    29dc:	0102d403 	tsteq	r2, r3, lsl #8
    29e0:	06080513 			@ <UNDEFINED> instruction: 0x06080513
    29e4:	06020501 	streq	r0, [r2], -r1, lsl #10
    29e8:	06060522 	streq	r0, [r6], -r2, lsr #10
    29ec:	20100501 	andscs	r0, r0, r1, lsl #10
    29f0:	4e060205 	cdpmi	2, 0, cr0, cr6, cr5, {0}
    29f4:	01060605 	tsteq	r6, r5, lsl #12
    29f8:	05201005 	streq	r1, [r0, #-5]!
    29fc:	01023f05 	tsteq	r2, r5, lsl #30
    2a00:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    2a04:	02050005 	andeq	r0, r5, #5
    2a08:	00000000 	andeq	r0, r0, r0
    2a0c:	0102e103 	tsteq	r2, r3, lsl #2
    2a10:	06080513 			@ <UNDEFINED> instruction: 0x06080513
    2a14:	06020501 	streq	r0, [r2], -r1, lsl #10
    2a18:	06060523 	streq	r0, [r6], -r3, lsr #10
    2a1c:	20100501 	andscs	r0, r0, r1, lsl #10
    2a20:	4f060205 	svcmi	0x00060205
    2a24:	01060605 	tsteq	r6, r5, lsl #12
    2a28:	05201005 	streq	r1, [r0, #-5]!
    2a2c:	01023e05 	tsteq	r2, r5, lsl #28
    2a30:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    2a34:	02050005 	andeq	r0, r5, #5
    2a38:	080003c4 	stmdaeq	r0, {r2, r6, r7, r8, r9}
    2a3c:	0102ef03 	tsteq	r2, r3, lsl #30
    2a40:	00010214 	andeq	r0, r1, r4, lsl r2
    2a44:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    2a48:	c8020500 	stmdagt	r2, {r8, sl}
    2a4c:	03080003 	movweq	r0, #32771	@ 0x8003
    2a50:	060103c8 	streq	r0, [r1], -r8, asr #7
    2a54:	05210601 	streq	r0, [r1, #-1537]!	@ 0xfffff9ff
    2a58:	0501062f 	streq	r0, [r1, #-1583]	@ 0xfffff9d1
    2a5c:	054c0605 	strbeq	r0, [ip, #-1541]	@ 0xfffff9fb
    2a60:	0a057a02 	beq	161270 <_Min_Stack_Size+0x160e70>
    2a64:	06050106 	streq	r0, [r5], -r6, lsl #2
    2a68:	02052406 	andeq	r2, r5, #100663296	@ 0x6000000
    2a6c:	06050514 			@ <UNDEFINED> instruction: 0x06050514
    2a70:	05012f03 	streq	r2, [r1, #-3843]	@ 0xfffff0fd
    2a74:	57030602 	strpl	r0, [r3, -r2, lsl #12]
    2a78:	060a0520 	streq	r0, [sl], -r0, lsr #10
    2a7c:	20050501 	andcs	r0, r5, r1, lsl #10
    2a80:	3f060605 	svccc	0x00060605
    2a84:	01061e05 	tsteq	r6, r5, lsl #28
    2a88:	3c06052e 	cfstr32cc	mvfx0, [r6], {46}	@ 0x2e
    2a8c:	0205202e 	andeq	r2, r5, #46	@ 0x2e
    2a90:	20090306 	andcs	r0, r9, r6, lsl #6
    2a94:	01061a05 	tsteq	r6, r5, lsl #20
    2a98:	3c02052e 	cfstr32cc	mvfx0, [r2], {46}	@ 0x2e
    2a9c:	2622062e 	strtcs	r0, [r2], -lr, lsr #12
    2aa0:	01060a05 	tsteq	r6, r5, lsl #20
    2aa4:	05200505 	streq	r0, [r0, #-1285]!	@ 0xfffffafb
    2aa8:	053f0606 	ldreq	r0, [pc, #-1542]!	@ 24aa <_Min_Stack_Size+0x20aa>
    2aac:	2e01061e 	mcrcs	6, 0, r0, cr1, cr14, {0}
    2ab0:	2e3c0605 	cfmsuba32cs	mvax0, mvax0, mvfx12, mvfx5
    2ab4:	06020520 	streq	r0, [r2], -r0, lsr #10
    2ab8:	060c0528 	streq	r0, [ip], -r8, lsr #10
    2abc:	20050501 	andcs	r0, r5, r1, lsl #10
    2ac0:	3f060605 	svccc	0x00060605
    2ac4:	01061e05 	tsteq	r6, r5, lsl #28
    2ac8:	3c06052e 	cfstr32cc	mvfx0, [r6], {46}	@ 0x2e
    2acc:	2705052e 	strcs	r0, [r5, -lr, lsr #10]
    2ad0:	01000502 	tsteq	r0, r2, lsl #10
    2ad4:	00050501 	andeq	r0, r5, r1, lsl #10
    2ad8:	044c0205 	strbeq	r0, [ip], #-517	@ 0xfffffdfb
    2adc:	f4030800 	vst2.8	{d0-d1}, [r3], r0
    2ae0:	052f0102 	streq	r0, [pc, #-258]!	@ 29e6 <_Min_Stack_Size+0x25e6>
    2ae4:	05010617 	streq	r0, [r1, #-1559]	@ 0xfffff9e9
    2ae8:	142f0605 	strtne	r0, [pc], #-1541	@ 2af0 <_Min_Stack_Size+0x26f0>
    2aec:	06110514 			@ <UNDEFINED> instruction: 0x06110514
    2af0:	06050501 	streq	r0, [r5], -r1, lsl #10
    2af4:	0611052f 	ldreq	r0, [r1], -pc, lsr #10
    2af8:	06050501 	streq	r0, [r5], -r1, lsl #10
    2afc:	06110521 	ldreq	r0, [r1], -r1, lsr #10
    2b00:	06050501 	streq	r0, [r5], -r1, lsl #10
    2b04:	06080524 	streq	r0, [r8], -r4, lsr #10
    2b08:	000f0501 	andeq	r0, pc, r1, lsl #10
    2b0c:	3c010402 	cfstrscc	mvf0, [r1], {2}
    2b10:	03060505 	movweq	r0, #25861	@ 0x6505
    2b14:	11053c09 	tstne	r5, r9, lsl #24
    2b18:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    2b1c:	0f053206 	svceq	0x00053206
    2b20:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    2b24:	3c150306 	ldccc	3, cr0, [r5], {6}
    2b28:	01061105 	tsteq	r6, r5, lsl #2
    2b2c:	30060505 	andcc	r0, r6, r5, lsl #10
    2b30:	01060f05 	tsteq	r6, r5, lsl #30
    2b34:	03060505 	movweq	r0, #25861	@ 0x6505
    2b38:	11053c10 	tstne	r5, r0, lsl ip
    2b3c:	05200106 	streq	r0, [r0, #-262]!	@ 0xfffffefa
    2b40:	05220605 	streq	r0, [r2, #-1541]!	@ 0xfffff9fb
    2b44:	204e0302 	subcs	r0, lr, r2, lsl #6
    2b48:	01060605 	tsteq	r6, r5, lsl #12
    2b4c:	052e1005 	streq	r1, [lr, #-5]!
    2b50:	06210602 	strteq	r0, [r1], -r2, lsl #12
    2b54:	0c03063c 	stceq	6, cr0, [r3], {60}	@ 0x3c
    2b58:	060a0520 	streq	r0, [sl], -r0, lsr #10
    2b5c:	05052001 	streq	r2, [r5, #-1]
    2b60:	06060520 	streq	r0, [r6], -r0, lsr #10
    2b64:	053c0903 	ldreq	r0, [ip, #-2307]!	@ 0xfffff6fd
    2b68:	05010617 	streq	r0, [r1, #-1559]	@ 0xfffff9e9
    2b6c:	06052e11 			@ <UNDEFINED> instruction: 0x06052e11
    2b70:	17052106 	strne	r2, [r5, -r6, lsl #2]
    2b74:	11050106 	tstne	r5, r6, lsl #2
    2b78:	06060520 	streq	r0, [r6], -r0, lsr #10
    2b7c:	00180521 	andseq	r0, r8, r1, lsr #10
    2b80:	06020402 	streq	r0, [r2], -r2, lsl #8
    2b84:	06020552 			@ <UNDEFINED> instruction: 0x06020552
    2b88:	060a053f 			@ <UNDEFINED> instruction: 0x060a053f
    2b8c:	05052001 	streq	r2, [r5, #-1]
    2b90:	0d030620 	stceq	6, cr0, [r3, #-128]	@ 0xffffff80
    2b94:	0611053c 			@ <UNDEFINED> instruction: 0x0611053c
    2b98:	06050501 	streq	r0, [r5], -r1, lsl #10
    2b9c:	06180530 			@ <UNDEFINED> instruction: 0x06180530
    2ba0:	06020501 	streq	r0, [r2], -r1, lsl #10
    2ba4:	060a053f 			@ <UNDEFINED> instruction: 0x060a053f
    2ba8:	05052001 	streq	r2, [r5, #-1]
    2bac:	06060520 	streq	r0, [r6], -r0, lsr #10
    2bb0:	06050544 	streq	r0, [r5], -r4, asr #10
    2bb4:	0606054f 	streq	r0, [r6], -pc, asr #10
    2bb8:	05206803 	streq	r6, [r0, #-2051]!	@ 0xfffff7fd
    2bbc:	585b0305 	ldmdapl	fp, {r0, r2, r8, r9}^
    2bc0:	01061105 	tsteq	r6, r5, lsl #2
    2bc4:	06050520 	streq	r0, [r5], -r0, lsr #10
    2bc8:	01150324 	tsteq	r5, r4, lsr #6
    2bcc:	01061105 	tsteq	r6, r5, lsl #2
    2bd0:	22060505 	andcs	r0, r6, #20971520	@ 0x1400000
    2bd4:	05011003 	streq	r1, [r1, #-3]
    2bd8:	05010611 	streq	r0, [r1, #-1553]	@ 0xfffff9ef
    2bdc:	06220605 	strteq	r0, [r2], -r5, lsl #12
    2be0:	2e011003 	cdpcs	0, 0, cr1, cr1, cr3, {0}
    2be4:	01000202 	tsteq	r0, r2, lsl #4
    2be8:	00050501 	andeq	r0, r5, r1, lsl #10
    2bec:	04f40205 	ldrbteq	r0, [r4], #517	@ 0x205
    2bf0:	89030800 	stmdbhi	r3, {fp}
    2bf4:	02140104 	andseq	r0, r4, #4, 2
    2bf8:	01010001 	tsteq	r1, r1
    2bfc:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    2c00:	0004f602 	andeq	pc, r4, r2, lsl #12
    2c04:	048e0308 	streq	r0, [lr], #776	@ 0x308
    2c08:	01021401 	tsteq	r2, r1, lsl #8
