NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    2c0c:	b4010100 	strlt	r0, [r1], #-256	@ 0xffffff00
    2c10:	0300000a 	movweq	r0, #10
    2c14:	0005fb00 	andeq	pc, r5, r0, lsl #22
    2c18:	fb010200 	blx	43422 <_Min_Stack_Size+0x43022>
    2c1c:	01000d0e 	tsteq	r0, lr, lsl #26
    2c20:	00010101 	andeq	r0, r1, r1, lsl #2
    2c24:	00010000 	andeq	r0, r1, r0
    2c28:	2e2e0100 	sufcse	f0, f6, f0
    2c2c:	4d54532f 	ldclmi	3, cr5, [r4, #-188]	@ 0xffffff44
    2c30:	31463233 	cmpcc	r6, r3, lsr r2
    2c34:	36433330 			@ <UNDEFINED> instruction: 0x36433330
    2c38:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    2c3c:	73726576 	cmnvc	r2, #494927872	@ 0x1d800000
    2c40:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
    2c44:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
    2c48:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    2c4c:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    2c50:	5f454449 	svcpl	0x00454449
    2c54:	33312e31 	teqcc	r1, #784	@ 0x310
    2c58:	535c302e 	cmppl	ip, #46	@ 0x2e
    2c5c:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    2c60:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    2c64:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
    2c68:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
    2c6c:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
    2c70:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
    2c74:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
    2c78:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    2c7c:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
    2c80:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
    2c84:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
    2c88:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
    2c8c:	616e7265 	cmnvs	lr, r5, ror #4
    2c90:	6f6f746c 	svcvs	0x006f746c
    2c94:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
    2c98:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
    2c9c:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    2ca0:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
    2ca4:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
    2ca8:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
    2cac:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    2cb0:	316c6572 	smccc	50770	@ 0xc652
    2cb4:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
    2cb8:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
    2cbc:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
    2cc0:	322e3030 	eorcc	r3, lr, #48	@ 0x30
    2cc4:	30343230 	eorscc	r3, r4, r0, lsr r2
    2cc8:	31393136 	teqcc	r9, r6, lsr r1
    2ccc:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
    2cd0:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 2b08 <_Min_Stack_Size+0x2708>
    2cd4:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
    2cd8:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
    2cdc:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
    2ce0:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
    2ce4:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    2ce8:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    2cec:	61652d65 	cmnvs	r5, r5, ror #26
    2cf0:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
    2cf4:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    2cf8:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
    2cfc:	2f2e2e2f 	svccs	0x002e2e2f
    2d00:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    2d04:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    2d08:	6f6e2d6d 	svcvs	0x006e2d6d
    2d0c:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    2d10:	2f696261 	svccs	0x00696261
    2d14:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    2d18:	2f656475 	svccs	0x00656475
    2d1c:	6863616d 	stmdavs	r3!, {r0, r2, r3, r5, r6, r8, sp, lr}^
    2d20:	00656e69 	rsbeq	r6, r5, r9, ror #28
    2d24:	535c3a43 	cmppl	ip, #274432	@ 0x43000
    2d28:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
    2d2c:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    2d30:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    2d34:	315f4544 	cmpcc	pc, r4, asr #10
    2d38:	2e33312e 	rsfcssp	f3, f3, #0.5
    2d3c:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
    2d40:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    2d44:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    2d48:	705c4544 	subsvc	r4, ip, r4, asr #10
    2d4c:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    2d50:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
    2d54:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
    2d58:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
    2d5c:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
    2d60:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
    2d64:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
    2d68:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
    2d6c:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
    2d70:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
    2d74:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 2bac <_Min_Stack_Size+0x27ac>
    2d78:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
    2d7c:	6f742d75 	svcvs	0x00742d75
    2d80:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
    2d84:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    2d88:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    2d8c:	32312e32 	eorscc	r2, r1, #800	@ 0x320
    2d90:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
    2d94:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
    2d98:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
    2d9c:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
    2da0:	30322e30 	eorscc	r2, r2, r0, lsr lr
    2da4:	30322e30 	eorscc	r2, r2, r0, lsr lr
    2da8:	36303432 			@ <UNDEFINED> instruction: 0x36303432
    2dac:	36313931 			@ <UNDEFINED> instruction: 0x36313931
    2db0:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
    2db4:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    2db8:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
    2dbc:	2f2e2e2f 	svccs	0x002e2e2f
    2dc0:	2f62696c 	svccs	0x0062696c
    2dc4:	2f636367 	svccs	0x00636367
    2dc8:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    2dcc:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    2dd0:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    2dd4:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
    2dd8:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
    2ddc:	2f2e2e2f 	svccs	0x002e2e2f
    2de0:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    2de4:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    2de8:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    2dec:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    2df0:	61652d65 	cmnvs	r5, r5, ror #26
    2df4:	692f6962 	stmdbvs	pc!, {r1, r5, r6, r8, fp, sp, lr}	@ <UNPREDICTABLE>
    2df8:	756c636e 	strbvc	r6, [ip, #-878]!	@ 0xfffffc92
    2dfc:	732f6564 			@ <UNDEFINED> instruction: 0x732f6564
    2e00:	2e007379 	mcrcs	3, 0, r7, cr0, cr9, {3}
    2e04:	54532f2e 	ldrbpl	r2, [r3], #-3886	@ 0xfffff0d2
    2e08:	4632334d 	ldrtmi	r3, [r2], -sp, asr #6
    2e0c:	43333031 	teqmi	r3, #49	@ 0x31
    2e10:	72445f36 	subvc	r5, r4, #54, 30	@ 0xd8
    2e14:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
    2e18:	6e692f73 	mcrvs	15, 3, r2, cr9, cr3, {3}
    2e1c:	3a430063 	bcc	10c2fb0 <_Min_Stack_Size+0x10c2bb0>
    2e20:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
    2e24:	334d5453 	movtcc	r5, #54355	@ 0xd453
    2e28:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    2e2c:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    2e30:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
    2e34:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
    2e38:	334d5453 	movtcc	r5, #54355	@ 0xd453
    2e3c:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    2e40:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    2e44:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
    2e48:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
    2e4c:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ 2ce4 <_Min_Stack_Size+0x28e4>
    2e50:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
    2e54:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    2e58:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
    2e5c:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
    2e60:	636d2e65 	cmnvs	sp, #1616	@ 0x650
    2e64:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
    2e68:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    2e6c:	6f746c61 	svcvs	0x00746c61
    2e70:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
    2e74:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
    2e78:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 2cb0 <_Min_Stack_Size+0x28b0>
    2e7c:	6f662d73 	svcvs	0x00662d73
    2e80:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
    2e84:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
    2e88:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    2e8c:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
    2e90:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
    2e94:	5f32336e 	svcpl	0x0032336e
    2e98:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
    2e9c:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
    2ea0:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
    2ea4:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
    2ea8:	33323631 	teqcc	r2, #51380224	@ 0x3100000
    2eac:	6f6f745c 	svcvs	0x006f745c
    2eb0:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
    2eb4:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
    2eb8:	696c2f2e 	stmdbvs	ip!, {r1, r2, r3, r5, r8, r9, sl, fp, sp}^
    2ebc:	63672f62 	cmnvs	r7, #392	@ 0x188
    2ec0:	72612f63 	rsbvc	r2, r1, #396	@ 0x18c
    2ec4:	6f6e2d6d 	svcvs	0x006e2d6d
    2ec8:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    2ecc:	2f696261 	svccs	0x00696261
    2ed0:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    2ed4:	692f312e 	stmdbvs	pc!, {r1, r2, r3, r5, r8, ip, sp}	@ <UNPREDICTABLE>
    2ed8:	756c636e 	strbvc	r6, [ip, #-878]!	@ 0xfffffc92
    2edc:	43006564 	movwmi	r6, #1380	@ 0x564
    2ee0:	54535c3a 	ldrbpl	r5, [r3], #-3130	@ 0xfffff3c6
    2ee4:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    2ee8:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    2eec:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    2ef0:	2e315f45 	cdpcs	15, 3, cr5, cr1, cr5, {2}
    2ef4:	302e3331 	eorcc	r3, lr, r1, lsr r3
    2ef8:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    2efc:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    2f00:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    2f04:	6c705c45 	ldclvs	12, cr5, [r0], #-276	@ 0xfffffeec
    2f08:	6e696775 	mcrvs	7, 3, r6, cr9, cr5, {3}
    2f0c:	6f635c73 	svcvs	0x00635c73
    2f10:	74732e6d 	ldrbtvc	r2, [r3], #-3693	@ 0xfffff193
    2f14:	6d74732e 	ldclvs	3, cr7, [r4, #-184]!	@ 0xffffff48
    2f18:	75633233 	strbvc	r3, [r3, #-563]!	@ 0xfffffdcd
    2f1c:	692e6562 	stmdbvs	lr!, {r1, r5, r6, r8, sl, sp, lr}
    2f20:	6d2e6564 	cfstr32vs	mvfx6, [lr, #-400]!	@ 0xfffffe70
    2f24:	652e7563 	strvs	r7, [lr, #-1379]!	@ 0xfffffa9d
    2f28:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
    2f2c:	746c616e 	strbtvc	r6, [ip], #-366	@ 0xfffffe92
    2f30:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    2f34:	756e672e 	strbvc	r6, [lr, #-1838]!	@ 0xfffff8d2
    2f38:	6f6f742d 	svcvs	0x006f742d
    2f3c:	662d736c 	strtvs	r7, [sp], -ip, ror #6
    2f40:	732d726f 			@ <UNDEFINED> instruction: 0x732d726f
    2f44:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    2f48:	2e32312e 	rsfcssp	f3, f2, #0.5
    2f4c:	65722e33 	ldrbvs	r2, [r2, #-3635]!	@ 0xfffff1cd
    2f50:	772e316c 	strvc	r3, [lr, -ip, ror #2]!
    2f54:	32336e69 	eorscc	r6, r3, #1680	@ 0x690
    2f58:	302e315f 	eorcc	r3, lr, pc, asr r1
    2f5c:	3030322e 	eorscc	r3, r0, lr, lsr #4
    2f60:	3230322e 	eorscc	r3, r0, #-536870910	@ 0xe0000002
    2f64:	31363034 	teqcc	r6, r4, lsr r0
    2f68:	32363139 	eorscc	r3, r6, #1073741838	@ 0x4000000e
    2f6c:	6f745c33 	svcvs	0x00745c33
    2f70:	5c736c6f 	ldclpl	12, cr6, [r3], #-444	@ 0xfffffe44
    2f74:	2f6e6962 	svccs	0x006e6962
    2f78:	6c2f2e2e 	stcvs	14, cr2, [pc], #-184	@ 2ec8 <_Min_Stack_Size+0x2ac8>
    2f7c:	672f6269 	strvs	r6, [pc, -r9, ror #4]!
    2f80:	612f6363 			@ <UNDEFINED> instruction: 0x612f6363
    2f84:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    2f88:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    2f8c:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    2f90:	2e32312f 	rsfcssp	f3, f2, #10.0
    2f94:	2f312e33 	svccs	0x00312e33
    2f98:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    2f9c:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    2fa0:	2f2e2e2f 	svccs	0x002e2e2f
    2fa4:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    2fa8:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    2fac:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    2fb0:	6e692f69 	cdpvs	15, 6, cr2, cr9, cr9, {3}
    2fb4:	64756c63 	ldrbtvs	r6, [r5], #-3171	@ 0xfffff39d
    2fb8:	3a430065 	bcc	10c3154 <_Min_Stack_Size+0x10c2d54>
    2fbc:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
    2fc0:	334d5453 	movtcc	r5, #54355	@ 0xd453
    2fc4:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    2fc8:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    2fcc:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
    2fd0:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
    2fd4:	334d5453 	movtcc	r5, #54355	@ 0xd453
    2fd8:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    2fdc:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    2fe0:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
    2fe4:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
    2fe8:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ 2e80 <_Min_Stack_Size+0x2a80>
    2fec:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
    2ff0:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    2ff4:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
    2ff8:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
    2ffc:	636d2e65 	cmnvs	sp, #1616	@ 0x650
    3000:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
    3004:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    3008:	6f746c61 	svcvs	0x00746c61
    300c:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
    3010:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
    3014:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 2e4c <_Min_Stack_Size+0x2a4c>
    3018:	6f662d73 	svcvs	0x00662d73
    301c:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
    3020:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
    3024:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    3028:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
    302c:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
    3030:	5f32336e 	svcpl	0x0032336e
    3034:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
    3038:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
    303c:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
    3040:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
    3044:	33323631 	teqcc	r2, #51380224	@ 0x3100000
    3048:	6f6f745c 	svcvs	0x006f745c
    304c:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
    3050:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
    3054:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    3058:	6f6e2d6d 	svcvs	0x006e2d6d
    305c:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    3060:	2f696261 	svccs	0x00696261
    3064:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    3068:	2f656475 	svccs	0x00656475
    306c:	6c77656e 	cfldr64vs	mvdx6, [r7], #-440	@ 0xfffffe48
    3070:	6e2d6269 	cdpvs	2, 2, cr6, cr13, cr9, {3}
    3074:	006f6e61 	rsbeq	r6, pc, r1, ror #28
    3078:	6d747300 	ldclvs	3, cr7, [r4, #-0]
    307c:	31663233 	cmncc	r6, r3, lsr r2
    3080:	36633330 			@ <UNDEFINED> instruction: 0x36633330
    3084:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    3088:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    308c:	2e726576 	mrccs	5, 3, r6, cr2, cr6, {3}
    3090:	00010063 	andeq	r0, r1, r3, rrx
    3094:	65645f00 	strbvs	r5, [r4, #-3840]!	@ 0xfffff100
    3098:	6c756166 	ldfvse	f6, [r5], #-408	@ 0xfffffe68
    309c:	79745f74 	ldmdbvc	r4!, {r2, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
    30a0:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
    30a4:	00020068 	andeq	r0, r2, r8, rrx
    30a8:	74735f00 	ldrbtvc	r5, [r3], #-3840	@ 0xfffff100
    30ac:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    30b0:	0300682e 	movweq	r6, #2094	@ 0x82e
    30b4:	74730000 	ldrbtvc	r0, [r3], #-0
    30b8:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    30bc:	78333031 	ldmdavc	r3!, {r0, r4, r5, ip, sp}
    30c0:	00682e36 	rsbeq	r2, r8, r6, lsr lr
    30c4:	73000004 	movwvc	r0, #4
    30c8:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    30cc:	33303166 	teqcc	r0, #-2147483623	@ 0x80000019
    30d0:	675f3663 	ldrbvs	r3, [pc, -r3, ror #12]
    30d4:	2e6f6970 			@ <UNDEFINED> instruction: 0x2e6f6970
    30d8:	00040068 	andeq	r0, r4, r8, rrx
    30dc:	6d747300 	ldclvs	3, cr7, [r4, #-0]
    30e0:	31663233 	cmncc	r6, r3, lsr r2
    30e4:	36633330 			@ <UNDEFINED> instruction: 0x36633330
    30e8:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    30ec:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    30f0:	2e726576 	mrccs	5, 3, r6, cr2, cr6, {3}
    30f4:	00040068 	andeq	r0, r4, r8, rrx
    30f8:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    30fc:	6c6f6f62 	stclvs	15, cr6, [pc], #-392	@ 2f7c <_Min_Stack_Size+0x2b7c>
    3100:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    3104:	74730000 	ldrbtvc	r0, [r3], #-0
    3108:	2e6f6964 	vnmulcs.f16	s13, s30, s9	@ <UNPREDICTABLE>
    310c:	00060068 	andeq	r0, r6, r8, rrx
    3110:	6e615f00 	cdpvs	15, 6, cr5, cr1, cr0, {0}
    3114:	682e6973 	stmdavs	lr!, {r0, r1, r4, r5, r6, r8, fp, sp, lr}
    3118:	00000600 	andeq	r0, r0, r0, lsl #12
    311c:	6c77656e 	cfldr64vs	mvdx6, [r7], #-440	@ 0xfffffe48
    3120:	682e6269 	stmdavs	lr!, {r0, r3, r5, r6, r9, sp, lr}
    3124:	00000700 	andeq	r0, r0, r0, lsl #14
    3128:	77656e5f 			@ <UNDEFINED> instruction: 0x77656e5f
    312c:	5f62696c 	svcpl	0x0062696c
    3130:	73726576 	cmnvc	r2, #494927872	@ 0x1d800000
    3134:	2e6e6f69 	cdpcs	15, 6, cr6, cr14, cr9, {3}
    3138:	00060068 	andeq	r0, r6, r8, rrx
    313c:	6e6f6300 	cdpvs	3, 6, cr6, cr15, cr0, {0}
    3140:	2e676966 	vnmulcs.f16	s13, s14, s13	@ <UNPREDICTABLE>
    3144:	00030068 	andeq	r0, r3, r8, rrx
    3148:	65656900 	strbvs	r6, [r5, #-2304]!	@ 0xfffff700
    314c:	2e706665 	cdpcs	6, 7, cr6, cr0, cr5, {3}
    3150:	00020068 	andeq	r0, r2, r8, rrx
    3154:	61656600 	cmnvs	r5, r0, lsl #12
    3158:	65727574 	ldrbvs	r7, [r2, #-1396]!	@ 0xfffffa8c
    315c:	00682e73 	rsbeq	r2, r8, r3, ror lr
    3160:	63000003 	movwvs	r0, #3
    3164:	73666564 	cmnvc	r6, #100, 10	@ 0x19000000
    3168:	0300682e 	movweq	r6, #2094	@ 0x82e
    316c:	74730000 	ldrbtvc	r0, [r3], #-0
    3170:	66656464 	strbtvs	r6, [r5], -r4, ror #8
    3174:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    3178:	74730000 	ldrbtvc	r0, [r3], #-0
    317c:	67726164 	ldrbvs	r6, [r2, -r4, ror #2]!
    3180:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    3184:	65720000 	ldrbvs	r0, [r2, #-0]!
    3188:	2e746e65 	cdpcs	14, 7, cr6, cr4, cr5, {3}
    318c:	00030068 	andeq	r0, r3, r8, rrx
    3190:	79745f00 	ldmdbvc	r4!, {r8, r9, sl, fp, ip, lr}^
    3194:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
    3198:	00030068 	andeq	r0, r3, r8, rrx
    319c:	79745f00 	ldmdbvc	r4!, {r8, r9, sl, fp, ip, lr}^
    31a0:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
    31a4:	00020068 	andeq	r0, r2, r8, rrx
    31a8:	636f6c00 	cmnvs	pc, #0, 24
    31ac:	00682e6b 	rsbeq	r2, r8, fp, ror #28
    31b0:	61000003 	tstvs	r0, r3
    31b4:	72657373 	rsbvc	r7, r5, #-872415231	@ 0xcc000001
    31b8:	00682e74 	rsbeq	r2, r8, r4, ror lr
    31bc:	73000006 	movwvc	r0, #6
    31c0:	6f696474 	svcvs	0x00696474
    31c4:	0300682e 	movweq	r6, #2094	@ 0x82e
    31c8:	74730000 	ldrbtvc	r0, [r3], #-0
    31cc:	62696c64 	rsbvs	r6, r9, #100, 24	@ 0x6400
    31d0:	0600682e 	streq	r6, [r0], -lr, lsr #16
    31d4:	74730000 	ldrbtvc	r0, [r3], #-0
    31d8:	62696c64 	rsbvs	r6, r9, #100, 24	@ 0x6400
    31dc:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
    31e0:	6c610000 	stclvs	0, cr0, [r1], #-0
    31e4:	61636f6c 	cmnvs	r3, ip, ror #30
    31e8:	0600682e 	streq	r6, [r0], -lr, lsr #16
    31ec:	74730000 	ldrbtvc	r0, [r3], #-0
    31f0:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    31f4:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    31f8:	74730000 	ldrbtvc	r0, [r3], #-0
    31fc:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    3200:	0600682e 	streq	r6, [r0], -lr, lsr #16
    3204:	695f0000 	ldmdbvs	pc, {}^	@ <UNPREDICTABLE>
    3208:	7573746e 	ldrbvc	r7, [r3, #-1134]!	@ 0xfffffb92
    320c:	00682e70 	rsbeq	r2, r8, r0, ror lr
    3210:	00000003 	andeq	r0, r0, r3
    3214:	05000105 	streq	r0, [r0, #-261]	@ 0xfffffefb
    3218:	00000002 	andeq	r0, r0, r2
    321c:	012a0300 			@ <UNDEFINED> instruction: 0x012a0300
    3220:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    3224:	14133d06 	ldrne	r3, [r3], #-3334	@ 0xfffff2fa
    3228:	01060805 	tsteq	r6, r5, lsl #16
    322c:	41060a05 	tstmi	r6, r5, lsl #20
    3230:	01060d05 	tsteq	r6, r5, lsl #26
    3234:	43060505 	movwmi	r0, #25861	@ 0x6505
    3238:	15151515 	ldrne	r1, [r5, #-1301]	@ 0xfffffaeb
    323c:	10051515 	andne	r1, r5, r5, lsl r5
    3240:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    3244:	053f0806 	ldreq	r0, [pc, #-2054]!	@ 2a46 <_Min_Stack_Size+0x2646>
    3248:	05010613 	streq	r0, [r1, #-1555]	@ 0xfffff9ed
    324c:	0a052e08 	beq	14ea74 <_Min_Stack_Size+0x14e674>
    3250:	09052406 	stmdbeq	r5, {r1, r2, sl, sp}
    3254:	06140518 			@ <UNDEFINED> instruction: 0x06140518
    3258:	030e0501 	movweq	r0, #58625	@ 0xe501
    325c:	05052e53 	streq	r2, [r5, #-3667]	@ 0xfffff1ad
    3260:	20310306 	eorscs	r0, r1, r6, lsl #6
    3264:	01061005 	tsteq	r6, r5
    3268:	3f060505 	svccc	0x00060505
    326c:	01061305 	tsteq	r6, r5, lsl #6
    3270:	052e0805 	streq	r0, [lr, #-2053]!	@ 0xfffff7fb
    3274:	05220609 	streq	r0, [r2, #-1545]!	@ 0xfffff9f7
    3278:	05010614 	streq	r0, [r1, #-1556]	@ 0xfffff9ec
    327c:	05220609 	streq	r0, [r2, #-1545]!	@ 0xfffff9f7
    3280:	0501060c 	streq	r0, [r1, #-1548]	@ 0xfffff9f4
    3284:	0540060e 	strbeq	r0, [r0, #-1550]	@ 0xfffff9f2
    3288:	05010611 	streq	r0, [r1, #-1553]	@ 0xfffff9ef
    328c:	05420605 	strbeq	r0, [r2, #-1541]	@ 0xfffff9fb
    3290:	05010613 	streq	r0, [r1, #-1555]	@ 0xfffff9ed
    3294:	052f0605 	streq	r0, [pc, #-1541]!	@ 2c97 <_Min_Stack_Size+0x2897>
    3298:	05010613 	streq	r0, [r1, #-1555]	@ 0xfffff9ed
    329c:	05300605 	ldreq	r0, [r0, #-1541]!	@ 0xfffff9fb
    32a0:	05010609 	streq	r0, [r1, #-1545]	@ 0xfffff9f7
    32a4:	05052e17 	streq	r2, [r5, #-3607]	@ 0xfffff1e9
    32a8:	15054c06 	strne	r4, [r5, #-3078]	@ 0xfffff3fa
    32ac:	01050106 	tsteq	r5, r6, lsl #2
    32b0:	0609053d 			@ <UNDEFINED> instruction: 0x0609053d
    32b4:	207fbc03 	rsbscs	fp, pc, r3, lsl #24
    32b8:	01061c05 	tsteq	r6, r5, lsl #24
    32bc:	0609053c 			@ <UNDEFINED> instruction: 0x0609053c
    32c0:	1c056a59 			@ <UNDEFINED> instruction: 0x1c056a59
    32c4:	053c0106 	ldreq	r0, [ip, #-262]!	@ 0xfffffefa
    32c8:	05590609 	ldrbeq	r0, [r9, #-1545]	@ 0xfffff9f7
    32cc:	6630030d 	ldrtvs	r0, [r0], -sp, lsl #6
    32d0:	00130294 	mulseq	r3, r4, r2
    32d4:	01050101 	tsteq	r5, r1, lsl #2
    32d8:	00020500 	andeq	r0, r2, r0, lsl #10
    32dc:	03000000 	movweq	r0, #0
    32e0:	050100f7 	streq	r0, [r1, #-247]	@ 0xffffff09
    32e4:	08051305 	stmdaeq	r5, {r0, r2, r8, r9, ip}
    32e8:	0a050106 	beq	143708 <_Min_Stack_Size+0x143308>
    32ec:	0d054106 	stfeqs	f4, [r5, #-24]	@ 0xffffffe8
    32f0:	01050106 	tsteq	r5, r6, lsl #2
    32f4:	06090541 	streq	r0, [r9], -r1, asr #10
    32f8:	83207803 			@ <UNDEFINED> instruction: 0x83207803
    32fc:	01058394 			@ <UNDEFINED> instruction: 0x01058394
    3300:	06028406 	streq	r8, [r2], -r6, lsl #8
    3304:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    3308:	02050001 	andeq	r0, r5, #1
    330c:	00000000 	andeq	r0, r0, r0
    3310:	01018803 	tsteq	r1, r3, lsl #16
    3314:	02000c05 	andeq	r0, r0, #1280	@ 0x500
    3318:	05130104 	ldreq	r0, [r3, #-260]	@ 0xfffffefc
    331c:	04020014 	streq	r0, [r2], #-20	@ 0xffffffec
    3320:	05010601 	streq	r0, [r1, #-1537]	@ 0xfffff9ff
    3324:	0402000c 	streq	r0, [r2], #-12
    3328:	05052001 	streq	r2, [r5, #-1]
    332c:	14053d06 	strne	r3, [r5], #-3334	@ 0xfffff2fa
    3330:	12050106 	andne	r0, r5, #-2147483647	@ 0x80000001
    3334:	06050520 	streq	r0, [r5], -r0, lsr #10
