NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    3338:	000c0521 	andeq	r0, ip, r1, lsr #10
    333c:	01010402 	tsteq	r1, r2, lsl #8
    3340:	02001405 	andeq	r1, r0, #83886080	@ 0x5000000
    3344:	01060104 	tsteq	r6, r4, lsl #2
    3348:	02000c05 	andeq	r0, r0, #1280	@ 0x500
    334c:	05200104 	streq	r0, [r0, #-260]!	@ 0xfffffefc
    3350:	053d0605 	ldreq	r0, [sp, #-1541]!	@ 0xfffff9fb
    3354:	05010616 	streq	r0, [r1, #-1558]	@ 0xfffff9ea
    3358:	01052010 	tsteq	r5, r0, lsl r0
    335c:	00010221 	andeq	r0, r1, r1, lsr #4
    3360:	01050101 	tsteq	r5, r1, lsl #2
    3364:	00020500 	andeq	r0, r2, r0, lsl #10
    3368:	03000000 	movweq	r0, #0
    336c:	06010190 			@ <UNDEFINED> instruction: 0x06010190
    3370:	06050501 	streq	r0, [r5], -r1, lsl #10
    3374:	31051421 	tstcc	r5, r1, lsr #8
    3378:	21051006 	tstcs	r5, r6
    337c:	4a08054c 	bmi	2048b4 <_Min_Stack_Size+0x2044b4>
    3380:	02004e05 	andeq	r4, r0, #5, 28	@ 0x50
    3384:	05200104 	streq	r0, [r0, #-260]!	@ 0xfffffefc
    3388:	053f0609 	ldreq	r0, [pc, #-1545]!	@ 2d87 <_Min_Stack_Size+0x2987>
    338c:	0501060c 	streq	r0, [r1, #-1548]	@ 0xfffff9f4
    3390:	04020014 	streq	r0, [r2], #-20	@ 0xffffffec
    3394:	05210601 	streq	r0, [r1, #-1537]!	@ 0xfffff9ff
    3398:	0402001c 	streq	r0, [r2], #-28	@ 0xffffffe4
    339c:	05010601 	streq	r0, [r1, #-1537]	@ 0xfffff9ff
    33a0:	04020014 	streq	r0, [r2], #-20	@ 0xffffffec
    33a4:	09052001 	stmdbeq	r5, {r0, sp}
    33a8:	19053e06 	stmdbne	r5, {r1, r2, r9, sl, fp, ip, sp}
    33ac:	16050106 	strne	r0, [r5], -r6, lsl #2
    33b0:	26010520 	strcs	r0, [r1], -r0, lsr #10
    33b4:	01000602 	tsteq	r0, r2, lsl #12
    33b8:	00010501 	andeq	r0, r1, r1, lsl #10
    33bc:	00000205 	andeq	r0, r0, r5, lsl #4
    33c0:	a2030000 	andge	r0, r3, #0
    33c4:	01060101 	tsteq	r6, r1, lsl #2
    33c8:	21060505 	tstcs	r6, r5, lsl #10
    33cc:	06310514 			@ <UNDEFINED> instruction: 0x06310514
    33d0:	4c210510 	cfstr32mi	mvfx0, [r1], #-64	@ 0xffffffc0
    33d4:	053c0805 	ldreq	r0, [ip, #-2053]!	@ 0xfffff7fb
    33d8:	055b0609 	ldrbeq	r0, [fp, #-1545]	@ 0xfffff9f7
    33dc:	0501060c 	streq	r0, [r1, #-1548]	@ 0xfffff9f4
    33e0:	04020014 	streq	r0, [r2], #-20	@ 0xffffffec
    33e4:	05210601 	streq	r0, [r1, #-1537]!	@ 0xfffff9ff
    33e8:	0402001c 	streq	r0, [r2], #-28	@ 0xffffffe4
    33ec:	05010601 	streq	r0, [r1, #-1537]	@ 0xfffff9ff
    33f0:	04020014 	streq	r0, [r2], #-20	@ 0xffffffec
    33f4:	09052001 	stmdbeq	r5, {r0, sp}
    33f8:	1a053e06 	bne	152c18 <_Min_Stack_Size+0x152818>
    33fc:	14050106 	strne	r0, [r5], #-262	@ 0xfffffefa
    3400:	26010520 	strcs	r0, [r1], -r0, lsr #10
    3404:	01000602 	tsteq	r0, r2, lsl #12
    3408:	00010501 	andeq	r0, r1, r1, lsl #10
    340c:	04f80205 	ldrbteq	r0, [r8], #517	@ 0x205
    3410:	ba030800 	blt	c5418 <_Min_Stack_Size+0xc5018>
    3414:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    3418:	19051321 	stmdbne	r5, {r0, r5, r8, r9, ip}
    341c:	2e050106 	adfcss	f0, f5, f6
    3420:	2011052e 	andscs	r0, r1, lr, lsr #10
    3424:	0605052e 	streq	r0, [r5], -lr, lsr #10
    3428:	061a052f 	ldreq	r0, [sl], -pc, lsr #10
    342c:	20120501 	andscs	r0, r2, r1, lsl #10
    3430:	2f060505 	svccs	0x00060505
    3434:	01061a05 	tsteq	r6, r5, lsl #20
    3438:	05202f05 	streq	r2, [r0, #-3845]!	@ 0xfffff0fb
    343c:	05052012 	streq	r2, [r5, #-18]	@ 0xffffffee
    3440:	16053006 	strne	r3, [r5], -r6
    3444:	22050106 	andcs	r0, r5, #-2147483647	@ 0x80000001
    3448:	20050520 	andcs	r0, r5, r0, lsr #10
    344c:	022f0105 	eoreq	r0, pc, #1073741825	@ 0x40000001
    3450:	01010005 	tsteq	r1, r5
    3454:	05000105 	streq	r0, [r0, #-261]	@ 0xfffffefb
    3458:	00052802 	andeq	r2, r5, r2, lsl #16
    345c:	01c40308 	biceq	r0, r4, r8, lsl #6
    3460:	21050501 	tstcs	r5, r1, lsl #10
    3464:	06190513 			@ <UNDEFINED> instruction: 0x06190513
    3468:	2e2e0501 	cfsh64cs	mvdx0, mvdx14, #1
    346c:	2e201105 	sufcss	f1, f0, f5
    3470:	2f060505 	svccs	0x00060505
    3474:	01061a05 	tsteq	r6, r5, lsl #20
    3478:	05201205 	streq	r1, [r0, #-517]!	@ 0xfffffdfb
    347c:	052f0605 	streq	r0, [pc, #-1541]!	@ 2e7f <_Min_Stack_Size+0x2a7f>
    3480:	0501061a 	streq	r0, [r1, #-1562]	@ 0xfffff9e6
    3484:	1205202f 	andne	r2, r5, #47	@ 0x2f
    3488:	06050520 	streq	r0, [r5], -r0, lsr #10
    348c:	06160530 			@ <UNDEFINED> instruction: 0x06160530
    3490:	20220501 	eorcs	r0, r2, r1, lsl #10
    3494:	05200505 	streq	r0, [r0, #-1285]!	@ 0xfffffafb
    3498:	05022f01 	streq	r2, [r2, #-3841]	@ 0xfffff0ff
    349c:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    34a0:	02050001 	andeq	r0, r5, #1
    34a4:	00000000 	andeq	r0, r0, r0
    34a8:	0101ce03 	tsteq	r1, r3, lsl #28
    34ac:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    34b0:	05142f06 	ldreq	r2, [r4, #-3846]	@ 0xfffff0fa
    34b4:	05010608 	streq	r0, [r1, #-1544]	@ 0xfffff9f8
    34b8:	cf03060a 	svcgt	0x0003060a
    34bc:	0d053c00 	stceq	12, cr3, [r5, #-0]
    34c0:	01050106 	tsteq	r5, r6, lsl #2
    34c4:	3c00cf03 	stccc	15, cr12, [r0], {3}
    34c8:	03060905 	movweq	r0, #26885	@ 0x6905
    34cc:	052e7ee9 	streq	r7, [lr, #-3817]!	@ 0xfffff117
    34d0:	0501061e 	streq	r0, [r1, #-1566]	@ 0xfffff9e2
    34d4:	0d052e0c 	stceq	14, cr2, [r5, #-48]	@ 0xffffffd0
    34d8:	3c2c0306 	stccc	3, cr0, [ip], #-24	@ 0xffffffe8
    34dc:	01061005 	tsteq	r6, r5
    34e0:	03060d05 	movweq	r0, #27909	@ 0x6d05
    34e4:	23053c0a 	movwcs	r3, #23562	@ 0x5c0a
    34e8:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    34ec:	1e053d06 	cdpne	13, 0, cr3, cr5, cr6, {0}
    34f0:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    34f4:	055c3d06 	ldrbeq	r3, [ip, #-3334]	@ 0xfffff2fa
    34f8:	05010623 	streq	r0, [r1, #-1571]	@ 0xfffff9dd
    34fc:	053d060d 	ldreq	r0, [sp, #-1549]!	@ 0xfffff9f3
    3500:	0501061e 	streq	r0, [r1, #-1566]	@ 0xfffff9e2
    3504:	053d060d 	ldreq	r0, [sp, #-1549]!	@ 0xfffff9f3
    3508:	05010626 	streq	r0, [r1, #-1574]	@ 0xfffff9da
    350c:	4e2f060d 	cfmadda32mi	mvax0, mvax0, mvfx15, mvfx13
    3510:	01062305 	tsteq	r6, r5, lsl #6
    3514:	3d060d05 	stccc	13, cr0, [r6, #-20]	@ 0xffffffec
    3518:	01061e05 	tsteq	r6, r5, lsl #28
    351c:	2f060d05 	svccs	0x00060d05
    3520:	587fbe03 	ldmdapl	pc!, {r0, r1, r9, sl, fp, ip, sp, pc}^	@ <UNPREDICTABLE>
    3524:	01063205 	tsteq	r6, r5, lsl #4
    3528:	05200d05 	streq	r0, [r0, #-3333]!	@ 0xfffff2fb
    352c:	056a0615 	strbeq	r0, [sl, #-1557]!	@ 0xfffff9eb
    3530:	0501062b 	streq	r0, [r1, #-1579]	@ 0xfffff9d5
    3534:	053d0615 	ldreq	r0, [sp, #-1557]!	@ 0xfffff9eb
    3538:	05010626 	streq	r0, [r1, #-1574]	@ 0xfffff9da
    353c:	063d0615 			@ <UNDEFINED> instruction: 0x063d0615
    3540:	052f062e 	streq	r0, [pc, #-1582]!	@ 2f1a <_Min_Stack_Size+0x2b1a>
    3544:	010d030d 	tsteq	sp, sp, lsl #6
    3548:	01062305 	tsteq	r6, r5, lsl #6
    354c:	3d060d05 	stccc	13, cr0, [r6, #-20]	@ 0xffffffec
    3550:	01061e05 	tsteq	r6, r5, lsl #28
    3554:	3d060d05 	stccc	13, cr0, [r6, #-20]	@ 0xffffffec
    3558:	01062605 	tsteq	r6, r5, lsl #12
    355c:	3d060d05 	stccc	13, cr0, [r6, #-20]	@ 0xffffffec
    3560:	0623055c 			@ <UNDEFINED> instruction: 0x0623055c
    3564:	060d0501 	streq	r0, [sp], -r1, lsl #10
    3568:	061e053d 			@ <UNDEFINED> instruction: 0x061e053d
    356c:	060d0501 	streq	r0, [sp], -r1, lsl #10
    3570:	23054e2f 	movwcs	r4, #24111	@ 0x5e2f
    3574:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    3578:	1e053d06 	cdpne	13, 0, cr3, cr5, cr6, {0}
    357c:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    3580:	26052f06 	strcs	r2, [r5], -r6, lsl #30
    3584:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    3588:	15052f06 	strne	r2, [r5, #-3846]	@ 0xfffff0fa
    358c:	05586703 	ldrbeq	r6, [r8, #-1795]	@ 0xfffff8fd
    3590:	0501062b 	streq	r0, [r1, #-1579]	@ 0xfffff9d5
    3594:	053d0615 	ldreq	r0, [sp, #-1557]!	@ 0xfffff9eb
    3598:	05010626 	streq	r0, [r1, #-1574]	@ 0xfffff9da
    359c:	053d0615 	ldreq	r0, [sp, #-1557]!	@ 0xfffff9eb
    35a0:	0501062e 	streq	r0, [r1, #-1582]	@ 0xfffff9d2
    35a4:	063d0615 			@ <UNDEFINED> instruction: 0x063d0615
    35a8:	052f062e 	streq	r0, [pc, #-1582]!	@ 2f82 <_Min_Stack_Size+0x2b82>
    35ac:	201d0311 	andscs	r0, sp, r1, lsl r3
    35b0:	01062705 	tsteq	r6, r5, lsl #14
    35b4:	3d061105 	stfccs	f1, [r6, #-20]	@ 0xffffffec
    35b8:	01062205 	tsteq	r6, r5, lsl #4
    35bc:	3d061105 	stfccs	f1, [r6, #-20]	@ 0xffffffec
    35c0:	09052e06 	stmdbeq	r5, {r1, r2, r9, sl, fp, sp}
    35c4:	3c1e0306 	ldccc	3, cr0, [lr], {6}
    35c8:	01061e05 	tsteq	r6, r5, lsl #28
    35cc:	052e0c05 	streq	r0, [lr, #-3077]!	@ 0xfffff3fb
    35d0:	2c03060d 	stccs	6, cr0, [r3], {13}
    35d4:	0610053c 			@ <UNDEFINED> instruction: 0x0610053c
    35d8:	060d0501 	streq	r0, [sp], -r1, lsl #10
    35dc:	053c0a03 	ldreq	r0, [ip, #-2563]!	@ 0xfffff5fd
    35e0:	05010623 	streq	r0, [r1, #-1571]	@ 0xfffff9dd
    35e4:	054b060d 	strbeq	r0, [fp, #-1549]	@ 0xfffff9f3
    35e8:	0501061e 	streq	r0, [r1, #-1566]	@ 0xfffff9e2
    35ec:	5c3d060d 	ldcpl	6, cr0, [sp], #-52	@ 0xffffffcc
    35f0:	01062305 	tsteq	r6, r5, lsl #6
    35f4:	4b060d05 	blmi	186a10 <_Min_Stack_Size+0x186610>
    35f8:	01061e05 	tsteq	r6, r5, lsl #28
    35fc:	3d060d05 	stccc	13, cr0, [r6, #-20]	@ 0xffffffec
    3600:	01062605 	tsteq	r6, r5, lsl #12
    3604:	2f060d05 	svccs	0x00060d05
    3608:	0623054e 	strteq	r0, [r3], -lr, asr #10
    360c:	060d0501 	streq	r0, [sp], -r1, lsl #10
    3610:	061e054b 	ldreq	r0, [lr], -fp, asr #10
    3614:	060d0501 	streq	r0, [sp], -r1, lsl #10
    3618:	0601052f 	streq	r0, [r1], -pc, lsr #10
    361c:	060d054d 	streq	r0, [sp], -sp, asr #10
    3620:	207fbb03 	rsbscs	fp, pc, r3, lsl #22
    3624:	01063205 	tsteq	r6, r5, lsl #4
    3628:	05200d05 	streq	r0, [r0, #-3333]!	@ 0xfffff2fb
    362c:	056a0615 	strbeq	r0, [sl, #-1557]!	@ 0xfffff9eb
    3630:	0501062b 	streq	r0, [r1, #-1579]	@ 0xfffff9d5
    3634:	054b0615 	strbeq	r0, [fp, #-1557]	@ 0xfffff9eb
    3638:	05010626 	streq	r0, [r1, #-1574]	@ 0xfffff9da
    363c:	063d0615 			@ <UNDEFINED> instruction: 0x063d0615
    3640:	052f062e 	streq	r0, [pc, #-1582]!	@ 301a <_Min_Stack_Size+0x2c1a>
    3644:	010d030d 	tsteq	sp, sp, lsl #6
    3648:	01062305 	tsteq	r6, r5, lsl #6
    364c:	4b060d05 	blmi	186a68 <_Min_Stack_Size+0x186668>
    3650:	01061e05 	tsteq	r6, r5, lsl #28
    3654:	3d060d05 	stccc	13, cr0, [r6, #-20]	@ 0xffffffec
    3658:	01062605 	tsteq	r6, r5, lsl #12
    365c:	3d060d05 	stccc	13, cr0, [r6, #-20]	@ 0xffffffec
    3660:	0623055c 			@ <UNDEFINED> instruction: 0x0623055c
    3664:	060d0501 	streq	r0, [sp], -r1, lsl #10
    3668:	061e054b 	ldreq	r0, [lr], -fp, asr #10
    366c:	060d0501 	streq	r0, [sp], -r1, lsl #10
    3670:	23054e2f 	movwcs	r4, #24111	@ 0x5e2f
    3674:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    3678:	1e054b06 	vmlane.f64	d4, d5, d6
    367c:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    3680:	26052f06 	strcs	r2, [r5], -r6, lsl #30
    3684:	0d050106 	stfeqs	f0, [r5, #-24]	@ 0xffffffe8
    3688:	15052f06 	strne	r2, [r5, #-3846]	@ 0xfffff0fa
    368c:	05586703 	ldrbeq	r6, [r8, #-1795]	@ 0xfffff8fd
    3690:	0501062b 	streq	r0, [r1, #-1579]	@ 0xfffff9d5
    3694:	054b0615 	strbeq	r0, [fp, #-1557]	@ 0xfffff9eb
    3698:	05010626 	streq	r0, [r1, #-1574]	@ 0xfffff9da
    369c:	053d0615 	ldreq	r0, [sp, #-1557]!	@ 0xfffff9eb
    36a0:	0501062e 	streq	r0, [r1, #-1582]	@ 0xfffff9d2
    36a4:	063d0615 			@ <UNDEFINED> instruction: 0x063d0615
    36a8:	052f062e 	streq	r0, [pc, #-1582]!	@ 3082 <_Min_Stack_Size+0x2c82>
    36ac:	201d0311 	andscs	r0, sp, r1, lsl r3
    36b0:	01062705 	tsteq	r6, r5, lsl #14
    36b4:	4b061105 	blmi	187ad0 <_Min_Stack_Size+0x1876d0>
    36b8:	01062205 	tsteq	r6, r5, lsl #4
    36bc:	3d061105 	stfccs	f1, [r6, #-20]	@ 0xffffffec
    36c0:	0e022e06 	cdpeq	14, 0, cr2, cr2, cr6, {0}
    36c4:	3a010100 	bcc	43acc <_Min_Stack_Size+0x436cc>
    36c8:	03000009 	movweq	r0, #9
    36cc:	00061b00 	andeq	r1, r6, r0, lsl #22
    36d0:	fb010200 	blx	43eda <_Min_Stack_Size+0x43ada>
    36d4:	01000d0e 	tsteq	r0, lr, lsl #26
    36d8:	00010101 	andeq	r0, r1, r1, lsl #2
    36dc:	00010000 	andeq	r0, r1, r0
    36e0:	2e2e0100 	sufcse	f0, f6, f0
    36e4:	4d54532f 	ldclmi	3, cr5, [r4, #-188]	@ 0xffffff44
    36e8:	31463233 	cmpcc	r6, r3, lsr r2
    36ec:	36433330 			@ <UNDEFINED> instruction: 0x36433330
    36f0:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    36f4:	73726576 	cmnvc	r2, #494927872	@ 0x1d800000
    36f8:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
    36fc:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
    3700:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    3704:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    3708:	5f454449 	svcpl	0x00454449
    370c:	33312e31 	teqcc	r1, #784	@ 0x310
    3710:	535c302e 	cmppl	ip, #46	@ 0x2e
    3714:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    3718:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    371c:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
    3720:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
    3724:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
    3728:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
    372c:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
    3730:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    3734:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
    3738:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
    373c:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
    3740:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
    3744:	616e7265 	cmnvs	lr, r5, ror #4
    3748:	6f6f746c 	svcvs	0x006f746c
    374c:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
    3750:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
    3754:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    3758:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
    375c:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
    3760:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
    3764:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    3768:	316c6572 	smccc	50770	@ 0xc652
    376c:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
    3770:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
    3774:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
    3778:	322e3030 	eorcc	r3, lr, #48	@ 0x30
    377c:	30343230 	eorscc	r3, r4, r0, lsr r2
    3780:	31393136 	teqcc	r9, r6, lsr r1
    3784:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
    3788:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 35c0 <_Min_Stack_Size+0x31c0>
    378c:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
    3790:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
    3794:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
    3798:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
    379c:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    37a0:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    37a4:	61652d65 	cmnvs	r5, r5, ror #26
    37a8:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
    37ac:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    37b0:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
    37b4:	2f2e2e2f 	svccs	0x002e2e2f
    37b8:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    37bc:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    37c0:	6f6e2d6d 	svcvs	0x006e2d6d
    37c4:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    37c8:	2f696261 	svccs	0x00696261
    37cc:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    37d0:	2f656475 	svccs	0x00656475
    37d4:	6863616d 	stmdavs	r3!, {r0, r2, r3, r5, r6, r8, sp, lr}^
    37d8:	00656e69 	rsbeq	r6, r5, r9, ror #28
    37dc:	535c3a43 	cmppl	ip, #274432	@ 0x43000
    37e0:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
    37e4:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    37e8:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    37ec:	315f4544 	cmpcc	pc, r4, asr #10
    37f0:	2e33312e 	rsfcssp	f3, f3, #0.5
    37f4:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
    37f8:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    37fc:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    3800:	705c4544 	subsvc	r4, ip, r4, asr #10
    3804:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    3808:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
    380c:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
    3810:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
    3814:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
    3818:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
    381c:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
    3820:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
    3824:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
    3828:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
    382c:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 3664 <_Min_Stack_Size+0x3264>
    3830:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
    3834:	6f742d75 	svcvs	0x00742d75
    3838:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
    383c:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    3840:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    3844:	32312e32 	eorscc	r2, r1, #800	@ 0x320
    3848:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
    384c:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
    3850:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
    3854:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
    3858:	30322e30 	eorscc	r2, r2, r0, lsr lr
    385c:	30322e30 	eorscc	r2, r2, r0, lsr lr
    3860:	36303432 			@ <UNDEFINED> instruction: 0x36303432
    3864:	36313931 			@ <UNDEFINED> instruction: 0x36313931
    3868:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
    386c:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    3870:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
    3874:	2f2e2e2f 	svccs	0x002e2e2f
    3878:	2f62696c 	svccs	0x0062696c
    387c:	2f636367 	svccs	0x00636367
    3880:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    3884:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    3888:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    388c:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
    3890:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
    3894:	2f2e2e2f 	svccs	0x002e2e2f
    3898:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    389c:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    38a0:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    38a4:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    38a8:	61652d65 	cmnvs	r5, r5, ror #26
    38ac:	692f6962 	stmdbvs	pc!, {r1, r5, r6, r8, fp, sp, lr}	@ <UNPREDICTABLE>
    38b0:	756c636e 	strbvc	r6, [ip, #-878]!	@ 0xfffffc92
    38b4:	732f6564 			@ <UNDEFINED> instruction: 0x732f6564
    38b8:	2e007379 	mcrcs	3, 0, r7, cr0, cr9, {3}
    38bc:	54532f2e 	ldrbpl	r2, [r3], #-3886	@ 0xfffff0d2
    38c0:	4632334d 	ldrtmi	r3, [r2], -sp, asr #6
    38c4:	43333031 	teqmi	r3, #49	@ 0x31
    38c8:	72445f36 	subvc	r5, r4, #54, 30	@ 0xd8
    38cc:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
    38d0:	6e692f73 	mcrvs	15, 3, r2, cr9, cr3, {3}
    38d4:	3a430063 	bcc	10c3a68 <_Min_Stack_Size+0x10c3668>
    38d8:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
    38dc:	334d5453 	movtcc	r5, #54355	@ 0xd453
    38e0:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    38e4:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    38e8:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
    38ec:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
    38f0:	334d5453 	movtcc	r5, #54355	@ 0xd453
    38f4:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    38f8:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    38fc:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
    3900:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
    3904:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ 379c <_Min_Stack_Size+0x339c>
    3908:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
    390c:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    3910:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
    3914:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
    3918:	636d2e65 	cmnvs	sp, #1616	@ 0x650
    391c:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
    3920:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    3924:	6f746c61 	svcvs	0x00746c61
    3928:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
    392c:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
    3930:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 3768 <_Min_Stack_Size+0x3368>
    3934:	6f662d73 	svcvs	0x00662d73
    3938:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
    393c:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
    3940:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    3944:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
    3948:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
    394c:	5f32336e 	svcpl	0x0032336e
    3950:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
    3954:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
    3958:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
    395c:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
    3960:	33323631 	teqcc	r2, #51380224	@ 0x3100000
    3964:	6f6f745c 	svcvs	0x006f745c
    3968:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
    396c:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
    3970:	696c2f2e 	stmdbvs	ip!, {r1, r2, r3, r5, r8, r9, sl, fp, sp}^
    3974:	63672f62 	cmnvs	r7, #392	@ 0x188
    3978:	72612f63 	rsbvc	r2, r1, #396	@ 0x18c
    397c:	6f6e2d6d 	svcvs	0x006e2d6d
    3980:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    3984:	2f696261 	svccs	0x00696261
    3988:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    398c:	692f312e 	stmdbvs	pc!, {r1, r2, r3, r5, r8, ip, sp}	@ <UNPREDICTABLE>
    3990:	756c636e 	strbvc	r6, [ip, #-878]!	@ 0xfffffc92
    3994:	43006564 	movwmi	r6, #1380	@ 0x564
    3998:	54535c3a 	ldrbpl	r5, [r3], #-3130	@ 0xfffff3c6
    399c:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    39a0:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    39a4:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    39a8:	2e315f45 	cdpcs	15, 3, cr5, cr1, cr5, {2}
    39ac:	302e3331 	eorcc	r3, lr, r1, lsr r3
    39b0:	4d54535c 	ldclmi	3, cr5, [r4, #-368]	@ 0xfffffe90
    39b4:	75433233 	strbvc	r3, [r3, #-563]	@ 0xfffffdcd
    39b8:	44496562 	strbmi	r6, [r9], #-1378	@ 0xfffffa9e
    39bc:	6c705c45 	ldclvs	12, cr5, [r0], #-276	@ 0xfffffeec
    39c0:	6e696775 	mcrvs	7, 3, r6, cr9, cr5, {3}
    39c4:	6f635c73 	svcvs	0x00635c73
    39c8:	74732e6d 	ldrbtvc	r2, [r3], #-3693	@ 0xfffff193
    39cc:	6d74732e 	ldclvs	3, cr7, [r4, #-184]!	@ 0xffffff48
    39d0:	75633233 	strbvc	r3, [r3, #-563]!	@ 0xfffffdcd
    39d4:	692e6562 	stmdbvs	lr!, {r1, r5, r6, r8, sl, sp, lr}
    39d8:	6d2e6564 	cfstr32vs	mvfx6, [lr, #-400]!	@ 0xfffffe70
    39dc:	652e7563 	strvs	r7, [lr, #-1379]!	@ 0xfffffa9d
    39e0:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
    39e4:	746c616e 	strbtvc	r6, [ip], #-366	@ 0xfffffe92
    39e8:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    39ec:	756e672e 	strbvc	r6, [lr, #-1838]!	@ 0xfffff8d2
    39f0:	6f6f742d 	svcvs	0x006f742d
    39f4:	662d736c 	strtvs	r7, [sp], -ip, ror #6
    39f8:	732d726f 			@ <UNDEFINED> instruction: 0x732d726f
    39fc:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    3a00:	2e32312e 	rsfcssp	f3, f2, #0.5
    3a04:	65722e33 	ldrbvs	r2, [r2, #-3635]!	@ 0xfffff1cd
    3a08:	772e316c 	strvc	r3, [lr, -ip, ror #2]!
    3a0c:	32336e69 	eorscc	r6, r3, #1680	@ 0x690
    3a10:	302e315f 	eorcc	r3, lr, pc, asr r1
    3a14:	3030322e 	eorscc	r3, r0, lr, lsr #4
    3a18:	3230322e 	eorscc	r3, r0, #-536870910	@ 0xe0000002
    3a1c:	31363034 	teqcc	r6, r4, lsr r0
    3a20:	32363139 	eorscc	r3, r6, #1073741838	@ 0x4000000e
    3a24:	6f745c33 	svcvs	0x00745c33
    3a28:	5c736c6f 	ldclpl	12, cr6, [r3], #-444	@ 0xfffffe44
    3a2c:	2f6e6962 	svccs	0x006e6962
    3a30:	6c2f2e2e 	stcvs	14, cr2, [pc], #-184	@ 3980 <_Min_Stack_Size+0x3580>
    3a34:	672f6269 	strvs	r6, [pc, -r9, ror #4]!
    3a38:	612f6363 			@ <UNDEFINED> instruction: 0x612f6363
    3a3c:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    3a40:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    3a44:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    3a48:	2e32312f 	rsfcssp	f3, f2, #10.0
    3a4c:	2f312e33 	svccs	0x00312e33
    3a50:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    3a54:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    3a58:	2f2e2e2f 	svccs	0x002e2e2f
    3a5c:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    3a60:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
