NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    3a64:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    3a68:	6e692f69 	cdpvs	15, 6, cr2, cr9, cr9, {3}
    3a6c:	64756c63 	ldrbtvs	r6, [r5], #-3171	@ 0xfffff39d
    3a70:	3a430065 	bcc	10c3c0c <_Min_Stack_Size+0x10c380c>
    3a74:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
    3a78:	334d5453 	movtcc	r5, #54355	@ 0xd453
    3a7c:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    3a80:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    3a84:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
    3a88:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
    3a8c:	334d5453 	movtcc	r5, #54355	@ 0xd453
    3a90:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    3a94:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    3a98:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
    3a9c:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
    3aa0:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ 3938 <_Min_Stack_Size+0x3538>
    3aa4:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
    3aa8:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    3aac:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
    3ab0:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
    3ab4:	636d2e65 	cmnvs	sp, #1616	@ 0x650
    3ab8:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
    3abc:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    3ac0:	6f746c61 	svcvs	0x00746c61
    3ac4:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
    3ac8:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
    3acc:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 3904 <_Min_Stack_Size+0x3504>
    3ad0:	6f662d73 	svcvs	0x00662d73
    3ad4:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
    3ad8:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
    3adc:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    3ae0:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
    3ae4:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
    3ae8:	5f32336e 	svcpl	0x0032336e
    3aec:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
    3af0:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
    3af4:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
    3af8:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
    3afc:	33323631 	teqcc	r2, #51380224	@ 0x3100000
    3b00:	6f6f745c 	svcvs	0x006f745c
    3b04:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
    3b08:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
    3b0c:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    3b10:	6f6e2d6d 	svcvs	0x006e2d6d
    3b14:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    3b18:	2f696261 	svccs	0x00696261
    3b1c:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    3b20:	2f656475 	svccs	0x00656475
    3b24:	6c77656e 	cfldr64vs	mvdx6, [r7], #-440	@ 0xfffffe48
    3b28:	6e2d6269 	cdpvs	2, 2, cr6, cr13, cr9, {3}
    3b2c:	006f6e61 	rsbeq	r6, pc, r1, ror #28
    3b30:	6d747300 	ldclvs	3, cr7, [r4, #-0]
    3b34:	31663233 	cmncc	r6, r3, lsr r2
    3b38:	36633330 			@ <UNDEFINED> instruction: 0x36633330
    3b3c:	4153555f 	cmpmi	r3, pc, asr r5
    3b40:	445f5452 	ldrbmi	r5, [pc], #-1106	@ 3b48 <_Min_Stack_Size+0x3748>
    3b44:	65766972 	ldrbvs	r6, [r6, #-2418]!	@ 0xfffff68e
    3b48:	00632e72 	rsbeq	r2, r3, r2, ror lr
    3b4c:	5f000001 	svcpl	0x00000001
    3b50:	61666564 	cmnvs	r6, r4, ror #10
    3b54:	5f746c75 	svcpl	0x00746c75
    3b58:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    3b5c:	00682e73 	rsbeq	r2, r8, r3, ror lr
    3b60:	5f000002 	svcpl	0x00000002
    3b64:	69647473 	stmdbvs	r4!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
    3b68:	682e746e 	stmdavs	lr!, {r1, r2, r3, r5, r6, sl, ip, sp, lr}
    3b6c:	00000300 	andeq	r0, r0, r0, lsl #6
    3b70:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    3b74:	30316632 	eorscc	r6, r1, r2, lsr r6
    3b78:	2e367833 	mrccs	8, 1, r7, cr6, cr3, {1}
    3b7c:	00040068 	andeq	r0, r4, r8, rrx
    3b80:	6d747300 	ldclvs	3, cr7, [r4, #-0]
    3b84:	31663233 	cmncc	r6, r3, lsr r2
    3b88:	36633330 			@ <UNDEFINED> instruction: 0x36633330
    3b8c:	6970675f 	ldmdbvs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, sp, lr}^
    3b90:	00682e6f 	rsbeq	r2, r8, pc, ror #28
    3b94:	73000004 	movwvc	r0, #4
    3b98:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    3b9c:	33303166 	teqcc	r0, #-2147483623	@ 0x80000019
    3ba0:	555f3663 	ldrbpl	r3, [pc, #-1635]	@ 3545 <_Min_Stack_Size+0x3145>
    3ba4:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    3ba8:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    3bac:	2e726576 	mrccs	5, 3, r6, cr2, cr6, {3}
    3bb0:	00040068 	andeq	r0, r4, r8, rrx
    3bb4:	6d747300 	ldclvs	3, cr7, [r4, #-0]
    3bb8:	30663233 	rsbcc	r3, r6, r3, lsr r2
    3bbc:	36633331 			@ <UNDEFINED> instruction: 0x36633331
    3bc0:	4343525f 	movtmi	r5, #12895	@ 0x325f
    3bc4:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
    3bc8:	2e726576 	mrccs	5, 3, r6, cr2, cr6, {3}
    3bcc:	00040068 	andeq	r0, r4, r8, rrx
    3bd0:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    3bd4:	6c6f6f62 	stclvs	15, cr6, [pc], #-392	@ 3a54 <_Min_Stack_Size+0x3654>
    3bd8:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    3bdc:	74730000 	ldrbtvc	r0, [r3], #-0
    3be0:	2e6f6964 	vnmulcs.f16	s13, s30, s9	@ <UNPREDICTABLE>
    3be4:	00060068 	andeq	r0, r6, r8, rrx
    3be8:	6e615f00 	cdpvs	15, 6, cr5, cr1, cr0, {0}
    3bec:	682e6973 	stmdavs	lr!, {r0, r1, r4, r5, r6, r8, fp, sp, lr}
    3bf0:	00000600 	andeq	r0, r0, r0, lsl #12
    3bf4:	6c77656e 	cfldr64vs	mvdx6, [r7], #-440	@ 0xfffffe48
    3bf8:	682e6269 	stmdavs	lr!, {r0, r3, r5, r6, r9, sp, lr}
    3bfc:	00000700 	andeq	r0, r0, r0, lsl #14
    3c00:	77656e5f 			@ <UNDEFINED> instruction: 0x77656e5f
    3c04:	5f62696c 	svcpl	0x0062696c
    3c08:	73726576 	cmnvc	r2, #494927872	@ 0x1d800000
    3c0c:	2e6e6f69 	cdpcs	15, 6, cr6, cr14, cr9, {3}
    3c10:	00060068 	andeq	r0, r6, r8, rrx
    3c14:	6e6f6300 	cdpvs	3, 6, cr6, cr15, cr0, {0}
    3c18:	2e676966 	vnmulcs.f16	s13, s14, s13	@ <UNPREDICTABLE>
    3c1c:	00030068 	andeq	r0, r3, r8, rrx
    3c20:	65656900 	strbvs	r6, [r5, #-2304]!	@ 0xfffff700
    3c24:	2e706665 	cdpcs	6, 7, cr6, cr0, cr5, {3}
    3c28:	00020068 	andeq	r0, r2, r8, rrx
    3c2c:	61656600 	cmnvs	r5, r0, lsl #12
    3c30:	65727574 	ldrbvs	r7, [r2, #-1396]!	@ 0xfffffa8c
    3c34:	00682e73 	rsbeq	r2, r8, r3, ror lr
    3c38:	63000003 	movwvs	r0, #3
    3c3c:	73666564 	cmnvc	r6, #100, 10	@ 0x19000000
    3c40:	0300682e 	movweq	r6, #2094	@ 0x82e
    3c44:	74730000 	ldrbtvc	r0, [r3], #-0
    3c48:	66656464 	strbtvs	r6, [r5], -r4, ror #8
    3c4c:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    3c50:	74730000 	ldrbtvc	r0, [r3], #-0
    3c54:	67726164 	ldrbvs	r6, [r2, -r4, ror #2]!
    3c58:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    3c5c:	65720000 	ldrbvs	r0, [r2, #-0]!
    3c60:	2e746e65 	cdpcs	14, 7, cr6, cr4, cr5, {3}
    3c64:	00030068 	andeq	r0, r3, r8, rrx
    3c68:	79745f00 	ldmdbvc	r4!, {r8, r9, sl, fp, ip, lr}^
    3c6c:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
    3c70:	00030068 	andeq	r0, r3, r8, rrx
    3c74:	79745f00 	ldmdbvc	r4!, {r8, r9, sl, fp, ip, lr}^
    3c78:	2e736570 	mrccs	5, 3, r6, cr3, cr0, {3}
    3c7c:	00020068 	andeq	r0, r2, r8, rrx
    3c80:	636f6c00 	cmnvs	pc, #0, 24
    3c84:	00682e6b 	rsbeq	r2, r8, fp, ror #28
    3c88:	61000003 	tstvs	r0, r3
    3c8c:	72657373 	rsbvc	r7, r5, #-872415231	@ 0xcc000001
    3c90:	00682e74 	rsbeq	r2, r8, r4, ror lr
    3c94:	73000006 	movwvc	r0, #6
    3c98:	6f696474 	svcvs	0x00696474
    3c9c:	0300682e 	movweq	r6, #2094	@ 0x82e
    3ca0:	74730000 	ldrbtvc	r0, [r3], #-0
    3ca4:	62696c64 	rsbvs	r6, r9, #100, 24	@ 0x6400
    3ca8:	0600682e 	streq	r6, [r0], -lr, lsr #16
    3cac:	74730000 	ldrbtvc	r0, [r3], #-0
    3cb0:	62696c64 	rsbvs	r6, r9, #100, 24	@ 0x6400
    3cb4:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
    3cb8:	6c610000 	stclvs	0, cr0, [r1], #-0
    3cbc:	61636f6c 	cmnvs	r3, ip, ror #30
    3cc0:	0600682e 	streq	r6, [r0], -lr, lsr #16
    3cc4:	74730000 	ldrbtvc	r0, [r3], #-0
    3cc8:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    3ccc:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    3cd0:	74730000 	ldrbtvc	r0, [r3], #-0
    3cd4:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    3cd8:	0600682e 	streq	r6, [r0], -lr, lsr #16
    3cdc:	695f0000 	ldmdbvs	pc, {}^	@ <UNPREDICTABLE>
    3ce0:	7573746e 	ldrbvc	r7, [r3, #-1134]!	@ 0xfffffb92
    3ce4:	00682e70 	rsbeq	r2, r8, r0, ror lr
    3ce8:	00000003 	andeq	r0, r0, r3
    3cec:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    3cf0:	00000002 	andeq	r0, r0, r2
    3cf4:	01250300 			@ <UNDEFINED> instruction: 0x01250300
    3cf8:	3d060106 	stfccs	f0, [r6, #-24]	@ 0xffffffe8
    3cfc:	01061805 	tsteq	r6, r5, lsl #16
    3d00:	2f060505 	svccs	0x00060505
    3d04:	06080515 			@ <UNDEFINED> instruction: 0x06080515
    3d08:	060a0501 	streq	r0, [sl], -r1, lsl #10
    3d0c:	060d053f 			@ <UNDEFINED> instruction: 0x060d053f
    3d10:	060a0501 	streq	r0, [sl], -r1, lsl #10
    3d14:	060d053f 			@ <UNDEFINED> instruction: 0x060d053f
    3d18:	06050501 	streq	r0, [r5], -r1, lsl #10
    3d1c:	060b0541 	streq	r0, [fp], -r1, asr #10
    3d20:	20110501 	andscs	r0, r1, r1, lsl #10
    3d24:	40060505 	andmi	r0, r6, r5, lsl #10
    3d28:	01060b05 	tsteq	r6, r5, lsl #22
    3d2c:	05201f05 	streq	r1, [r0, #-3845]!	@ 0xfffff0fb
    3d30:	05052011 	streq	r2, [r5, #-17]	@ 0xffffffef
    3d34:	0b053206 	bleq	150554 <_Min_Stack_Size+0x150154>
    3d38:	1f050106 	svcne	0x00050106
    3d3c:	20110520 	andscs	r0, r1, r0, lsr #10
    3d40:	32060505 	andcc	r0, r6, #20971520	@ 0x1400000
    3d44:	01060b05 	tsteq	r6, r5, lsl #22
    3d48:	05201f05 	streq	r1, [r0, #-3845]!	@ 0xfffff0fb
    3d4c:	05052011 	streq	r2, [r5, #-17]	@ 0xffffffef
    3d50:	0b053206 	bleq	150570 <_Min_Stack_Size+0x150170>
    3d54:	1f050106 	svcne	0x00050106
    3d58:	20110520 	andscs	r0, r1, r0, lsr #10
    3d5c:	32060505 	andcc	r0, r6, #20971520	@ 0x1400000
    3d60:	01060b05 	tsteq	r6, r5, lsl #22
    3d64:	05201f05 	streq	r1, [r0, #-3845]!	@ 0xfffff0fb
    3d68:	05052011 	streq	r2, [r5, #-17]	@ 0xffffffef
    3d6c:	08053306 	stmdaeq	r5, {r1, r2, r8, r9, ip, sp}
    3d70:	02050106 	andeq	r0, r5, #-2147483647	@ 0x80000001
    3d74:	09054206 	stmdbeq	r5, {r1, r2, r9, lr}
    3d78:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    3d7c:	0b053106 	bleq	15019c <_Min_Stack_Size+0x14fd9c>
    3d80:	05660106 	strbeq	r0, [r6, #-262]!	@ 0xfffffefa
    3d84:	0505d609 	streq	sp, [r5, #-1545]	@ 0xfffff9f7
    3d88:	11053006 	tstne	r5, r6
    3d8c:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    3d90:	14052406 	strne	r2, [r5], #-1030	@ 0xfffffbfa
    3d94:	08050106 	stmdaeq	r5, {r1, r2, r8}
    3d98:	06020520 	streq	r0, [r2], -r0, lsr #10
    3d9c:	06080522 	streq	r0, [r8], -r2, lsr #10
    3da0:	200e0501 	andcs	r0, lr, r1, lsl #10
    3da4:	30060205 	andcc	r0, r6, r5, lsl #4
    3da8:	01060505 	tsteq	r6, r5, lsl #10
    3dac:	3f060705 	svccc	0x00060705
    3db0:	01060a05 	tsteq	r6, r5, lsl #20
    3db4:	3f060705 	svccc	0x00060705
    3db8:	01060a05 	tsteq	r6, r5, lsl #20
    3dbc:	05400505 	strbeq	r0, [r0, #-1285]	@ 0xfffffafb
    3dc0:	40030602 	andmi	r0, r3, r2, lsl #12
    3dc4:	03696920 	cmneq	r9, #32, 18	@ 0x80000
    3dc8:	0905661f 	stmdbeq	r5, {r0, r1, r2, r3, r4, r9, sl, sp, lr}
    3dcc:	052e0106 	streq	r0, [lr, #-262]!	@ 0xfffffefa
    3dd0:	12030606 	andne	r0, r3, #6291456	@ 0x600000
    3dd4:	05939320 	ldreq	r9, [r3, #800]	@ 0x320
    3dd8:	02850605 	addeq	r0, r5, #5242880	@ 0x500000
    3ddc:	0101000e 	tsteq	r1, lr
    3de0:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    3de4:	00000002 	andeq	r0, r0, r2
    3de8:	00f40300 	rscseq	r0, r4, r0, lsl #6
    3dec:	08051301 	stmdaeq	r5, {r0, r8, r9, ip}
    3df0:	0a050106 	beq	144210 <_Min_Stack_Size+0x143e10>
    3df4:	0d054306 	stceq	3, cr4, [r5, #-24]	@ 0xffffffe8
    3df8:	0a050106 	beq	144218 <_Min_Stack_Size+0x143e18>
    3dfc:	0d054306 	stceq	3, cr4, [r5, #-24]	@ 0xffffffe8
    3e00:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    3e04:	06020543 	streq	r0, [r2], -r3, asr #10
    3e08:	59206d03 	stmdbpl	r0!, {r0, r1, r8, sl, fp, sp, lr}
    3e0c:	59965996 	ldmibpl	r6, {r1, r2, r4, r7, r8, fp, ip, lr}
    3e10:	86060505 	strhi	r0, [r6], -r5, lsl #10
    3e14:	01000902 	tsteq	r0, r2, lsl #18
    3e18:	00050501 	andeq	r0, r5, r1, lsl #10
    3e1c:	00000205 	andeq	r0, r0, r5, lsl #4
    3e20:	a2030000 	andge	r0, r3, #0
    3e24:	15130101 	ldrne	r0, [r3, #-257]	@ 0xfffffeff
    3e28:	01060805 	tsteq	r6, r5, lsl #16
    3e2c:	02000905 	andeq	r0, r0, #81920	@ 0x14000
    3e30:	21060104 	tstcs	r6, r4, lsl #2
    3e34:	02001105 	andeq	r1, r0, #1073741825	@ 0x40000001
    3e38:	01060104 	tsteq	r6, r4, lsl #2
    3e3c:	02000905 	andeq	r0, r0, #81920	@ 0x14000
    3e40:	05200104 	streq	r0, [r0, #-260]!	@ 0xfffffefc
    3e44:	05400605 	strbeq	r0, [r0, #-1541]	@ 0xfffff9fb
    3e48:	01100302 	tsteq	r0, r2, lsl #6
    3e4c:	01061b05 	tsteq	r6, r5, lsl #22
    3e50:	05200d05 	streq	r0, [r0, #-3333]!	@ 0xfffff2fb
    3e54:	01022305 	tsteq	r2, r5, lsl #6
    3e58:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    3e5c:	02050005 	andeq	r0, r5, #5
    3e60:	00000000 	andeq	r0, r0, r0
    3e64:	0101c103 	tsteq	r1, r3, lsl #2
    3e68:	02000c05 	andeq	r0, r0, #1280	@ 0x500
    3e6c:	05140104 	ldreq	r0, [r4, #-260]	@ 0xfffffefc
    3e70:	04020014 	streq	r0, [r2], #-20	@ 0xffffffec
    3e74:	05010601 	streq	r0, [r1, #-1537]	@ 0xfffff9ff
    3e78:	0402000c 	streq	r0, [r2], #-12
    3e7c:	05052001 	streq	r2, [r5, #-1]
    3e80:	0001023e 	andeq	r0, r1, lr, lsr r2
    3e84:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    3e88:	00020500 	andeq	r0, r2, r0, lsl #10
    3e8c:	03000000 	movweq	r0, #0
    3e90:	150101c9 	strne	r0, [r1, #-457]	@ 0xfffffe37
    3e94:	01060805 	tsteq	r6, r5, lsl #16
    3e98:	02000905 	andeq	r0, r0, #81920	@ 0x14000
    3e9c:	22060104 	andcs	r0, r6, #4, 2
    3ea0:	02001105 	andeq	r1, r0, #1073741825	@ 0x40000001
    3ea4:	01060104 	tsteq	r6, r4, lsl #2
    3ea8:	02000905 	andeq	r0, r0, #81920	@ 0x14000
    3eac:	05200104 	streq	r0, [r0, #-260]!	@ 0xfffffefc
    3eb0:	05410605 	strbeq	r0, [r1, #-1541]	@ 0xfffff9fb
    3eb4:	01130302 	tsteq	r3, r2, lsl #6
    3eb8:	01061805 	tsteq	r6, r5, lsl #16
    3ebc:	052e0505 	streq	r0, [lr, #-1285]!	@ 0xfffffafb
    3ec0:	05310606 	ldreq	r0, [r1, #-1542]!	@ 0xfffff9fa
    3ec4:	05010628 	streq	r0, [r1, #-1576]	@ 0xfffff9d8
    3ec8:	0505202d 	streq	r2, [r5, #-45]	@ 0xffffffd3
    3ecc:	052e0b03 	streq	r0, [lr, #-2819]!	@ 0xfffff4fd
    3ed0:	051b0606 	ldreq	r0, [fp, #-1542]	@ 0xfffff9fa
    3ed4:	05010628 	streq	r0, [r1, #-1576]	@ 0xfffff9d8
    3ed8:	0602202d 	streq	r2, [r2], -sp, lsr #32
    3edc:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    3ee0:	02050005 	andeq	r0, r5, #5
    3ee4:	00000000 	andeq	r0, r0, r0
    3ee8:	0101fe03 	tsteq	r1, r3, lsl #28	@ <UNPREDICTABLE>
    3eec:	2f060106 	svccs	0x00060106
    3ef0:	06080514 			@ <UNDEFINED> instruction: 0x06080514
    3ef4:	060a0501 	streq	r0, [sl], -r1, lsl #10
    3ef8:	053c2603 	ldreq	r2, [ip, #-1539]!	@ 0xfffff9fd
    3efc:	0501060d 	streq	r0, [r1, #-1549]	@ 0xfffff9f3
    3f00:	2503060a 	strcs	r0, [r3, #-1546]	@ 0xfffff9f6
    3f04:	060d053c 			@ <UNDEFINED> instruction: 0x060d053c
    3f08:	03050501 	movweq	r0, #21761	@ 0x5501
    3f0c:	02053c25 	andeq	r3, r5, #9472	@ 0x2500
    3f10:	7f980306 	svcvc	0x00980306
    3f14:	0618052e 	ldreq	r0, [r8], -lr, lsr #10
    3f18:	06020501 	streq	r0, [r2], -r1, lsl #10
    3f1c:	0613054b 	ldreq	r0, [r3], -fp, asr #10
    3f20:	06020501 	streq	r0, [r2], -r1, lsl #10
    3f24:	061b053d 			@ <UNDEFINED> instruction: 0x061b053d
    3f28:	06020501 	streq	r0, [r2], -r1, lsl #10
    3f2c:	063c063d 			@ <UNDEFINED> instruction: 0x063c063d
    3f30:	06180531 			@ <UNDEFINED> instruction: 0x06180531
    3f34:	06020501 	streq	r0, [r2], -r1, lsl #10
    3f38:	0613054b 	ldreq	r0, [r3], -fp, asr #10
    3f3c:	06020501 	streq	r0, [r2], -r1, lsl #10
    3f40:	09034c3d 	stmdbeq	r3, {r0, r2, r3, r4, r5, sl, fp, lr}
    3f44:	20130301 	andscs	r0, r3, r1, lsl #6
    3f48:	01061805 	tsteq	r6, r5, lsl #16
    3f4c:	3d060205 	sfmcc	f0, 4, [r6, #-20]	@ 0xffffffec
    3f50:	01061305 	tsteq	r6, r5, lsl #6
    3f54:	3d060205 	sfmcc	f0, 4, [r6, #-20]	@ 0xffffffec
    3f58:	01061b05 	tsteq	r6, r5, lsl #22
    3f5c:	3d060205 	sfmcc	f0, 4, [r6, #-20]	@ 0xffffffec
    3f60:	31063c06 	tstcc	r6, r6, lsl #24
    3f64:	01061805 	tsteq	r6, r5, lsl #16
    3f68:	3d060205 	sfmcc	f0, 4, [r6, #-20]	@ 0xffffffec
    3f6c:	01061305 	tsteq	r6, r5, lsl #6
    3f70:	2f060205 	svccs	0x00060205
    3f74:	0109034c 	tsteq	r9, ip, asr #6
    3f78:	05201203 	streq	r1, [r0, #-515]!	@ 0xfffffdfd
    3f7c:	05010618 	streq	r0, [r1, #-1560]	@ 0xfffff9e8
    3f80:	054b0602 	strbeq	r0, [fp, #-1538]	@ 0xfffff9fe
    3f84:	05010613 	streq	r0, [r1, #-1555]	@ 0xfffff9ed
    3f88:	053d0602 	ldreq	r0, [sp, #-1538]!	@ 0xfffff9fe
    3f8c:	0501061b 	streq	r0, [r1, #-1563]	@ 0xfffff9e5
    3f90:	063d0602 	ldrteq	r0, [sp], -r2, lsl #12
    3f94:	0531063c 	ldreq	r0, [r1, #-1596]!	@ 0xfffff9c4
    3f98:	05010618 	streq	r0, [r1, #-1560]	@ 0xfffff9e8
    3f9c:	054b0602 	strbeq	r0, [fp, #-1538]	@ 0xfffff9fe
    3fa0:	05010613 	streq	r0, [r1, #-1555]	@ 0xfffff9ed
    3fa4:	4c3d0602 	ldcmi	6, cr0, [sp], #-8
    3fa8:	0605051a 			@ <UNDEFINED> instruction: 0x0605051a
    3fac:	02010b03 	andeq	r0, r1, #3072	@ 0xc00
    3fb0:	0101000c 	tsteq	r1, ip
    3fb4:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    3fb8:	00055802 	andeq	r5, r5, r2, lsl #16
    3fbc:	02f50308 	rscseq	r0, r5, #8, 6	@ 0x20000000
    3fc0:	17052201 	strne	r2, [r5, -r1, lsl #4]
    3fc4:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    3fc8:	0302302e 	movweq	r3, #8238	@ 0x202e
    3fcc:	05010100 	streq	r0, [r1, #-256]	@ 0xffffff00
    3fd0:	02050005 	andeq	r0, r5, #5
    3fd4:	08000568 	stmdaeq	r0, {r3, r5, r6, r8, sl}
    3fd8:	0102fc03 	tsteq	r2, r3, lsl #24	@ <UNPREDICTABLE>
    3fdc:	06170521 	ldreq	r0, [r7], -r1, lsr #10
    3fe0:	2e050501 	cfsh32cs	mvfx0, mvfx5, #1
    3fe4:	00030230 	andeq	r0, r3, r0, lsr r2
    3fe8:	05050101 	streq	r0, [r5, #-257]	@ 0xfffffeff
    3fec:	78020500 	stmdavc	r2, {r8, sl}
    3ff0:	03080005 	movweq	r0, #32773	@ 0x8005
    3ff4:	21010381 	smlabbcs	r1, r1, r3, r0
    3ff8:	01061705 	tsteq	r6, r5, lsl #14
    3ffc:	302e0505 	eorcc	r0, lr, r5, lsl #10
    4000:	01000302 	tsteq	r0, r2, lsl #6
    4004:	00084d01 	andeq	r4, r8, r1, lsl #26
    4008:	37000300 	strcc	r0, [r0, -r0, lsl #6]
    400c:	02000007 	andeq	r0, r0, #7
    4010:	0d0efb01 	vstreq	d15, [lr, #-4]
    4014:	01010100 	mrseq	r0, (UNDEF: 17)
    4018:	00000001 	andeq	r0, r0, r1
    401c:	01000001 	tsteq	r0, r1
    4020:	532f2e2e 			@ <UNDEFINED> instruction: 0x532f2e2e
    4024:	43006372 	movwmi	r6, #882	@ 0x372
    4028:	73552f3a 	cmpvc	r5, #58, 30	@ 0xe8
    402c:	2f737265 	svccs	0x00737265
    4030:	74696378 	strbtvc	r6, [r9], #-888	@ 0xfffffc88
    4034:	6e4f2f65 	cdpvs	15, 4, cr2, cr15, cr5, {3}
    4038:	69724465 	ldmdbvs	r2!, {r0, r2, r5, r6, sl, lr}^
    403c:	442f6576 	strtmi	r6, [pc], #-1398	@ 4044 <_Min_Stack_Size+0x3c44>
    4040:	746b7365 	strbtvc	r7, [fp], #-869	@ 0xfffffc9b
    4044:	4c2f706f 	stcmi	0, cr7, [pc], #-444	@ 3e90 <_Min_Stack_Size+0x3a90>
    4048:	6e726165 	rpwvssz	f6, f2, f5
    404c:	206e6920 	rsbcs	r6, lr, r0, lsr #18
    4050:	74706564 	ldrbtvc	r6, [r0], #-1380	@ 0xfffffa9c
    4054:	74532f68 	ldrbvc	r2, [r3], #-3944	@ 0xfffff098
    4058:	2f32336d 	svccs	0x0032336d
    405c:	534f5452 	movtpl	r5, #62546	@ 0xf452
    4060:	636e492f 	cmnvs	lr, #770048	@ 0xbc000
    4064:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
    4068:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
    406c:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    4070:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    4074:	5f454449 	svcpl	0x00454449
    4078:	33312e31 	teqcc	r1, #784	@ 0x310
    407c:	535c302e 	cmppl	ip, #46	@ 0x2e
    4080:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    4084:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    4088:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
    408c:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
    4090:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
    4094:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
    4098:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
    409c:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    40a0:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
    40a4:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
    40a8:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
    40ac:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
    40b0:	616e7265 	cmnvs	lr, r5, ror #4
    40b4:	6f6f746c 	svcvs	0x006f746c
    40b8:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
    40bc:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
    40c0:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    40c4:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
    40c8:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
    40cc:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
    40d0:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    40d4:	316c6572 	smccc	50770	@ 0xc652
    40d8:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
    40dc:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
    40e0:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
    40e4:	322e3030 	eorcc	r3, lr, #48	@ 0x30
    40e8:	30343230 	eorscc	r3, r4, r0, lsr r2
    40ec:	31393136 	teqcc	r9, r6, lsr r1
    40f0:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
    40f4:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 3f2c <_Min_Stack_Size+0x3b2c>
    40f8:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
    40fc:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
    4100:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
    4104:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
    4108:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    410c:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    4110:	61652d65 	cmnvs	r5, r5, ror #26
    4114:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
    4118:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    411c:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
    4120:	2f2e2e2f 	svccs	0x002e2e2f
    4124:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    4128:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    412c:	6f6e2d6d 	svcvs	0x006e2d6d
    4130:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    4134:	2f696261 	svccs	0x00696261
    4138:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    413c:	00656475 	rsbeq	r6, r5, r5, ror r4
    4140:	535c3a43 	cmppl	ip, #274432	@ 0x43000
    4144:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
    4148:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    414c:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    4150:	315f4544 	cmpcc	pc, r4, asr #10
    4154:	2e33312e 	rsfcssp	f3, f3, #0.5
    4158:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
    415c:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    4160:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    4164:	705c4544 	subsvc	r4, ip, r4, asr #10
    4168:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    416c:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
    4170:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
    4174:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
    4178:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
    417c:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
    4180:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
    4184:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
    4188:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
    418c:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
    4190:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 3fc8 <_Min_Stack_Size+0x3bc8>
    4194:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
    4198:	6f742d75 	svcvs	0x00742d75
    419c:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
    41a0:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    41a4:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    41a8:	32312e32 	eorscc	r2, r1, #800	@ 0x320
    41ac:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
    41b0:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
    41b4:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
    41b8:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
    41bc:	30322e30 	eorscc	r2, r2, r0, lsr lr
