NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    41c0:	30322e30 	eorscc	r2, r2, r0, lsr lr
    41c4:	36303432 			@ <UNDEFINED> instruction: 0x36303432
    41c8:	36313931 			@ <UNDEFINED> instruction: 0x36313931
    41cc:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
    41d0:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    41d4:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
    41d8:	2f2e2e2f 	svccs	0x002e2e2f
    41dc:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    41e0:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    41e4:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    41e8:	6e692f69 	cdpvs	15, 6, cr2, cr9, cr9, {3}
    41ec:	64756c63 	ldrbtvs	r6, [r5], #-3171	@ 0xfffff39d
    41f0:	656e2f65 	strbvs	r2, [lr, #-3941]!	@ 0xfffff09b
    41f4:	62696c77 	rsbvs	r6, r9, #30464	@ 0x7700
    41f8:	6e616e2d 	cdpvs	14, 6, cr6, cr1, cr13, {1}
    41fc:	3a43006f 	bcc	10c43c0 <_Min_Stack_Size+0x10c3fc0>
    4200:	5c54535c 	mrrcpl	3, 5, r5, r4, cr12
    4204:	334d5453 	movtcc	r5, #54355	@ 0xd453
    4208:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    420c:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    4210:	312e315f 			@ <UNDEFINED> instruction: 0x312e315f
    4214:	5c302e33 	ldcpl	14, cr2, [r0], #-204	@ 0xffffff34
    4218:	334d5453 	movtcc	r5, #54355	@ 0xd453
    421c:	62754332 	rsbsvs	r4, r5, #-939524096	@ 0xc8000000
    4220:	45444965 	strbmi	r4, [r4, #-2405]	@ 0xfffff69b
    4224:	756c705c 	strbvc	r7, [ip, #-92]!	@ 0xffffffa4
    4228:	736e6967 	cmnvc	lr, #1687552	@ 0x19c000
    422c:	6d6f635c 	stclvs	3, cr6, [pc, #-368]!	@ 40c4 <_Min_Stack_Size+0x3cc4>
    4230:	2e74732e 	cdpcs	3, 7, cr7, cr4, cr14, {1}
    4234:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    4238:	62756332 	rsbsvs	r6, r5, #-939524096	@ 0xc8000000
    423c:	64692e65 	strbtvs	r2, [r9], #-3685	@ 0xfffff19b
    4240:	636d2e65 	cmnvs	sp, #1616	@ 0x650
    4244:	78652e75 	stmdavc	r5!, {r0, r2, r4, r5, r6, r9, sl, fp, sp}^
    4248:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    424c:	6f746c61 	svcvs	0x00746c61
    4250:	2e736c6f 	cdpcs	12, 7, cr6, cr3, cr15, {3}
    4254:	2d756e67 	ldclcs	14, cr6, [r5, #-412]!	@ 0xfffffe64
    4258:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 4090 <_Min_Stack_Size+0x3c90>
    425c:	6f662d73 	svcvs	0x00662d73
    4260:	74732d72 	ldrbtvc	r2, [r3], #-3442	@ 0xfffff28e
    4264:	2e32336d 	cdpcs	3, 3, cr3, cr2, cr13, {3}
    4268:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    426c:	6c65722e 	sfmvs	f7, 2, [r5], #-184	@ 0xffffff48
    4270:	69772e31 	ldmdbvs	r7!, {r0, r4, r5, r9, sl, fp, sp}^
    4274:	5f32336e 	svcpl	0x0032336e
    4278:	2e302e31 	mrccs	14, 1, r2, cr0, cr1, {1}
    427c:	2e303032 	mrccs	0, 1, r3, cr0, cr2, {1}
    4280:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
    4284:	39313630 	ldmdbcc	r1!, {r4, r5, r9, sl, ip, sp}
    4288:	33323631 	teqcc	r2, #51380224	@ 0x3100000
    428c:	6f6f745c 	svcvs	0x006f745c
    4290:	625c736c 	subsvs	r7, ip, #108, 6	@ 0xb0000001
    4294:	2e2f6e69 	cdpcs	14, 2, cr6, cr15, cr9, {3}
    4298:	696c2f2e 	stmdbvs	ip!, {r1, r2, r3, r5, r8, r9, sl, fp, sp}^
    429c:	63672f62 	cmnvs	r7, #392	@ 0x188
    42a0:	72612f63 	rsbvc	r2, r1, #396	@ 0x18c
    42a4:	6f6e2d6d 	svcvs	0x006e2d6d
    42a8:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    42ac:	2f696261 	svccs	0x00696261
    42b0:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    42b4:	2e2f312e 	sufcsep	f3, f7, #0.5
    42b8:	2e2e2f2e 	cdpcs	15, 2, cr2, cr14, cr14, {1}
    42bc:	2f2e2e2f 	svccs	0x002e2e2f
    42c0:	612f2e2e 			@ <UNDEFINED> instruction: 0x612f2e2e
    42c4:	6e2d6d72 	mcrvs	13, 1, r6, cr13, cr2, {3}
    42c8:	2d656e6f 	stclcs	14, cr6, [r5, #-444]!	@ 0xfffffe44
    42cc:	69626165 	stmdbvs	r2!, {r0, r2, r5, r6, r8, sp, lr}^
    42d0:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
    42d4:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
    42d8:	7379732f 	cmnvc	r9, #-1140850688	@ 0xbc000000
    42dc:	5c3a4300 	ldcpl	3, cr4, [sl], #-0
    42e0:	535c5453 	cmppl	ip, #1392508928	@ 0x53000000
    42e4:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    42e8:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    42ec:	5f454449 	svcpl	0x00454449
    42f0:	33312e31 	teqcc	r1, #784	@ 0x310
    42f4:	535c302e 	cmppl	ip, #46	@ 0x2e
    42f8:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    42fc:	65627543 	strbvs	r7, [r2, #-1347]!	@ 0xfffffabd
    4300:	5c454449 	cfstrdpl	mvd4, [r5], {73}	@ 0x49
    4304:	67756c70 			@ <UNDEFINED> instruction: 0x67756c70
    4308:	5c736e69 	ldclpl	14, cr6, [r3], #-420	@ 0xfffffe5c
    430c:	2e6d6f63 	cdpcs	15, 6, cr6, cr13, cr3, {3}
    4310:	732e7473 			@ <UNDEFINED> instruction: 0x732e7473
    4314:	32336d74 	eorscc	r6, r3, #116, 26	@ 0x1d00
    4318:	65627563 	strbvs	r7, [r2, #-1379]!	@ 0xfffffa9d
    431c:	6564692e 	strbvs	r6, [r4, #-2350]!	@ 0xfffff6d2
    4320:	75636d2e 	strbvc	r6, [r3, #-3374]!	@ 0xfffff2d2
    4324:	7478652e 	ldrbtvc	r6, [r8], #-1326	@ 0xfffffad2
    4328:	616e7265 	cmnvs	lr, r5, ror #4
    432c:	6f6f746c 	svcvs	0x006f746c
    4330:	672e736c 	strvs	r7, [lr, -ip, ror #6]!
    4334:	742d756e 	strtvc	r7, [sp], #-1390	@ 0xfffffa92
    4338:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    433c:	726f662d 	rsbvc	r6, pc, #47185920	@ 0x2d00000
    4340:	6d74732d 	ldclvs	3, cr7, [r4, #-180]!	@ 0xffffff4c
    4344:	312e3233 			@ <UNDEFINED> instruction: 0x312e3233
    4348:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    434c:	316c6572 	smccc	50770	@ 0xc652
    4350:	6e69772e 	cdpvs	7, 6, cr7, cr9, cr14, {1}
    4354:	315f3233 	cmpcc	pc, r3, lsr r2	@ <UNPREDICTABLE>
    4358:	322e302e 	eorcc	r3, lr, #46	@ 0x2e
    435c:	322e3030 	eorcc	r3, lr, #48	@ 0x30
    4360:	30343230 	eorscc	r3, r4, r0, lsr r2
    4364:	31393136 	teqcc	r9, r6, lsr r1
    4368:	5c333236 	lfmpl	f3, 4, [r3], #-216	@ 0xffffff28
    436c:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 41a4 <_Min_Stack_Size+0x3da4>
    4370:	69625c73 	stmdbvs	r2!, {r0, r1, r4, r5, r6, sl, fp, ip, lr}^
    4374:	2e2e2f6e 	cdpcs	15, 2, cr2, cr14, cr14, {3}
    4378:	62696c2f 	rsbvs	r6, r9, #12032	@ 0x2f00
    437c:	6363672f 	cmnvs	r3, #12320768	@ 0xbc0000
    4380:	6d72612f 	ldfvse	f6, [r2, #-188]!	@ 0xffffff44
    4384:	6e6f6e2d 	cdpvs	14, 6, cr6, cr15, cr13, {1}
    4388:	61652d65 	cmnvs	r5, r5, ror #26
    438c:	312f6962 			@ <UNDEFINED> instruction: 0x312f6962
    4390:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
    4394:	2e2e2f31 	mcrcs	15, 1, r2, cr14, cr1, {1}
    4398:	2f2e2e2f 	svccs	0x002e2e2f
    439c:	2e2f2e2e 	cdpcs	14, 2, cr2, cr15, cr14, {1}
    43a0:	72612f2e 	rsbvc	r2, r1, #46, 30	@ 0xb8
    43a4:	6f6e2d6d 	svcvs	0x006e2d6d
    43a8:	652d656e 	strvs	r6, [sp, #-1390]!	@ 0xfffffa92
    43ac:	2f696261 	svccs	0x00696261
    43b0:	6c636e69 	stclvs	14, cr6, [r3], #-420	@ 0xfffffe5c
    43b4:	2f656475 	svccs	0x00656475
    43b8:	6863616d 	stmdavs	r3!, {r0, r2, r3, r5, r6, r8, sp, lr}^
    43bc:	00656e69 	rsbeq	r6, r5, r9, ror #28
    43c0:	535c3a43 	cmppl	ip, #274432	@ 0x43000
    43c4:	54535c54 	ldrbpl	r5, [r3], #-3156	@ 0xfffff3ac
    43c8:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    43cc:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    43d0:	315f4544 	cmpcc	pc, r4, asr #10
    43d4:	2e33312e 	rsfcssp	f3, f3, #0.5
    43d8:	54535c30 	ldrbpl	r5, [r3], #-3120	@ 0xfffff3d0
    43dc:	4332334d 	teqmi	r2, #872415233	@ 0x34000001
    43e0:	49656275 	stmdbmi	r5!, {r0, r2, r4, r5, r6, r9, sp, lr}^
    43e4:	705c4544 	subsvc	r4, ip, r4, asr #10
    43e8:	6967756c 	stmdbvs	r7!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    43ec:	635c736e 	cmpvs	ip, #-1207959551	@ 0xb8000001
    43f0:	732e6d6f 			@ <UNDEFINED> instruction: 0x732e6d6f
    43f4:	74732e74 	ldrbtvc	r2, [r3], #-3700	@ 0xfffff18c
    43f8:	6332336d 	teqvs	r2, #-1275068415	@ 0xb4000001
    43fc:	2e656275 	mcrcs	2, 3, r6, cr5, cr5, {3}
    4400:	2e656469 	cdpcs	4, 6, cr6, cr5, cr9, {3}
    4404:	2e75636d 	cdpcs	3, 7, cr6, cr5, cr13, {3}
    4408:	65747865 	ldrbvs	r7, [r4, #-2149]!	@ 0xfffff79b
    440c:	6c616e72 	stclvs	14, cr6, [r1], #-456	@ 0xfffffe38
    4410:	6c6f6f74 	stclvs	15, cr6, [pc], #-464	@ 4248 <_Min_Stack_Size+0x3e48>
    4414:	6e672e73 	mcrvs	14, 3, r2, cr7, cr3, {3}
    4418:	6f742d75 	svcvs	0x00742d75
    441c:	2d736c6f 	ldclcs	12, cr6, [r3, #-444]!	@ 0xfffffe44
    4420:	2d726f66 	ldclcs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    4424:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
    4428:	32312e32 	eorscc	r2, r1, #800	@ 0x320
    442c:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
    4430:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
    4434:	336e6977 	cmncc	lr, #1949696	@ 0x1dc000
    4438:	2e315f32 	mrccs	15, 1, r5, cr1, cr2, {1}
    443c:	30322e30 	eorscc	r2, r2, r0, lsr lr
    4440:	30322e30 	eorscc	r2, r2, r0, lsr lr
    4444:	36303432 			@ <UNDEFINED> instruction: 0x36303432
    4448:	36313931 			@ <UNDEFINED> instruction: 0x36313931
    444c:	745c3332 	ldrbvc	r3, [ip], #-818	@ 0xfffffcce
    4450:	736c6f6f 	cmnvc	ip, #444	@ 0x1bc
    4454:	6e69625c 	mcrvs	2, 3, r6, cr9, cr12, {2}
    4458:	2f2e2e2f 	svccs	0x002e2e2f
    445c:	2f62696c 	svccs	0x0062696c
    4460:	2f636367 	svccs	0x00636367
    4464:	2d6d7261 	sfmcs	f7, 2, [sp, #-388]!	@ 0xfffffe7c
    4468:	656e6f6e 	strbvs	r6, [lr, #-3950]!	@ 0xfffff092
    446c:	6261652d 	rsbvs	r6, r1, #188743680	@ 0xb400000
    4470:	32312f69 	eorscc	r2, r1, #420	@ 0x1a4
    4474:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
    4478:	636e692f 	cmnvs	lr, #770048	@ 0xbc000
    447c:	6564756c 	strbvs	r7, [r4, #-1388]!	@ 0xfffffa94
    4480:	2f3a4300 	svccs	0x003a4300
    4484:	72657355 	rsbvc	r7, r5, #1409286145	@ 0x54000001
    4488:	63782f73 	cmnvs	r8, #460	@ 0x1cc
    448c:	2f657469 	svccs	0x00657469
    4490:	44656e4f 	strbtmi	r6, [r5], #-3663	@ 0xfffff1b1
    4494:	65766972 	ldrbvs	r6, [r6, #-2418]!	@ 0xfffff68e
    4498:	7365442f 	cmnvc	r5, #788529152	@ 0x2f000000
    449c:	706f746b 	rsbvc	r7, pc, fp, ror #8
    44a0:	61654c2f 	cmnvs	r5, pc, lsr #24
    44a4:	69206e72 	stmdbvs	r0!, {r1, r4, r5, r6, r9, sl, fp, sp, lr}
    44a8:	6564206e 	strbvs	r2, [r4, #-110]!	@ 0xffffff92
    44ac:	2f687470 	svccs	0x00687470
    44b0:	336d7453 	cmncc	sp, #1392508928	@ 0x53000000
    44b4:	54532f32 	ldrbpl	r2, [r3], #-3890	@ 0xfffff0ce
    44b8:	4632334d 	ldrtmi	r3, [r2], -sp, asr #6
    44bc:	43333031 	teqmi	r3, #49	@ 0x31
    44c0:	72445f36 	subvc	r5, r4, #54, 30	@ 0xd8
    44c4:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
    44c8:	6e692f73 	mcrvs	15, 3, r2, cr9, cr3, {3}
    44cc:	3a430063 	bcc	10c4660 <_Min_Stack_Size+0x10c4260>
    44d0:	6573552f 	ldrbvs	r5, [r3, #-1327]!	@ 0xfffffad1
    44d4:	782f7372 	stmdavc	pc!, {r1, r4, r5, r6, r8, r9, ip, sp, lr}	@ <UNPREDICTABLE>
    44d8:	65746963 	ldrbvs	r6, [r4, #-2403]!	@ 0xfffff69d
    44dc:	656e4f2f 	strbvs	r4, [lr, #-3887]!	@ 0xfffff0d1
    44e0:	76697244 	strbtvc	r7, [r9], -r4, asr #4
    44e4:	65442f65 	strbvs	r2, [r4, #-3941]	@ 0xfffff09b
    44e8:	6f746b73 	svcvs	0x00746b73
    44ec:	654c2f70 	strbvs	r2, [ip, #-3952]	@ 0xfffff090
    44f0:	206e7261 	rsbcs	r7, lr, r1, ror #4
    44f4:	64206e69 	strtvs	r6, [r0], #-3689	@ 0xfffff197
    44f8:	68747065 	ldmdavs	r4!, {r0, r2, r5, r6, ip, sp, lr}^
    44fc:	6d74532f 	ldclvs	3, cr5, [r4, #-188]!	@ 0xffffff44
    4500:	432f3233 			@ <UNDEFINED> instruction: 0x432f3233
    4504:	5349534d 	movtpl	r5, #37709	@ 0x934d
    4508:	0035565f 	eorseq	r5, r5, pc, asr r6
    450c:	69616d00 	stmdbvs	r1!, {r8, sl, fp, sp, lr}^
    4510:	00632e6e 	rsbeq	r2, r3, lr, ror #28
    4514:	53000001 	movwpl	r0, #1
    4518:	64656863 	strbtvs	r6, [r5], #-2147	@ 0xfffff79d
    451c:	72616c75 	rsbvc	r6, r1, #29952	@ 0x7500
    4520:	0200682e 	andeq	r6, r0, #3014656	@ 0x2e0000
    4524:	74730000 	ldrbtvc	r0, [r3], #-0
    4528:	676e6972 			@ <UNDEFINED> instruction: 0x676e6972
    452c:	0300682e 	movweq	r6, #2094	@ 0x82e
    4530:	615f0000 	cmpvs	pc, r0
    4534:	2e69736e 	cdpcs	3, 6, cr7, cr9, cr14, {3}
    4538:	00030068 	andeq	r0, r3, r8, rrx
    453c:	77656e00 	strbvc	r6, [r5, -r0, lsl #28]!
    4540:	2e62696c 	vnmulcs.f16	s13, s4, s25	@ <UNPREDICTABLE>
    4544:	00040068 	andeq	r0, r4, r8, rrx
    4548:	656e5f00 	strbvs	r5, [lr, #-3840]!	@ 0xfffff100
    454c:	62696c77 	rsbvs	r6, r9, #30464	@ 0x7700
    4550:	7265765f 	rsbvc	r7, r5, #99614720	@ 0x5f00000
    4554:	6e6f6973 			@ <UNDEFINED> instruction: 0x6e6f6973
    4558:	0300682e 	movweq	r6, #2094	@ 0x82e
    455c:	6f630000 	svcvs	0x00630000
    4560:	6769666e 	strbvs	r6, [r9, -lr, ror #12]!
    4564:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    4568:	65690000 	strbvs	r0, [r9, #-0]!
    456c:	70666565 	rsbvc	r6, r6, r5, ror #10
    4570:	0600682e 	streq	r6, [r0], -lr, lsr #16
    4574:	65660000 	strbvs	r0, [r6, #-0]!
    4578:	72757461 	rsbsvc	r7, r5, #1627389952	@ 0x61000000
    457c:	682e7365 	stmdavs	lr!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}
    4580:	00000500 	andeq	r0, r0, r0, lsl #10
    4584:	6e656572 	mcrvs	5, 3, r6, cr5, cr2, {3}
    4588:	00682e74 	rsbeq	r2, r8, r4, ror lr
    458c:	73000005 	movwvc	r0, #5
    4590:	65646474 	strbvs	r6, [r4, #-1140]!	@ 0xfffffb8c
    4594:	00682e66 	rsbeq	r2, r8, r6, ror #28
    4598:	5f000007 	svcpl	0x00000007
    459c:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    45a0:	00682e73 	rsbeq	r2, r8, r3, ror lr
    45a4:	5f000005 	svcpl	0x00000005
    45a8:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    45ac:	00682e73 	rsbeq	r2, r8, r3, ror lr
    45b0:	5f000006 	svcpl	0x00000006
    45b4:	61666564 	cmnvs	r6, r4, ror #10
    45b8:	5f746c75 	svcpl	0x00746c75
    45bc:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    45c0:	00682e73 	rsbeq	r2, r8, r3, ror lr
    45c4:	6c000006 	stcvs	0, cr0, [r0], {6}
    45c8:	2e6b636f 	cdpcs	3, 6, cr6, cr11, cr15, {3}
    45cc:	00050068 	andeq	r0, r5, r8, rrx
    45d0:	73736100 	cmnvc	r3, #0, 2
    45d4:	2e747265 	cdpcs	2, 7, cr7, cr4, cr5, {3}
    45d8:	00030068 	andeq	r0, r3, r8, rrx
    45dc:	65646300 	strbvs	r6, [r4, #-768]!	@ 0xfffffd00
    45e0:	682e7366 	stmdavs	lr!, {r1, r2, r5, r6, r8, r9, ip, sp, lr}
    45e4:	00000500 	andeq	r0, r0, r0, lsl #10
    45e8:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    45ec:	2e656c61 	cdpcs	12, 6, cr6, cr5, cr1, {3}
    45f0:	00050068 	andeq	r0, r5, r8, rrx
    45f4:	72747300 	rsbsvc	r7, r4, #0, 6
    45f8:	73676e69 	cmnvc	r7, #1680	@ 0x690
    45fc:	0300682e 	movweq	r6, #2094	@ 0x82e
    4600:	74730000 	ldrbtvc	r0, [r3], #-0
    4604:	676e6972 			@ <UNDEFINED> instruction: 0x676e6972
    4608:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    460c:	74730000 	ldrbtvc	r0, [r3], #-0
    4610:	6632336d 	ldrtvs	r3, [r2], -sp, ror #6
    4614:	63333031 	teqvs	r3, #49	@ 0x31
    4618:	70675f36 	rsbvc	r5, r7, r6, lsr pc
    461c:	682e6f69 	stmdavs	lr!, {r0, r3, r5, r6, r8, r9, sl, fp, sp, lr}
    4620:	00000800 	andeq	r0, r0, r0, lsl #16
    4624:	62647473 	rsbvs	r7, r4, #1929379840	@ 0x73000000
    4628:	2e6c6f6f 	cdpcs	15, 6, cr6, cr12, cr15, {3}
    462c:	00070068 	andeq	r0, r7, r8, rrx
    4630:	6d747300 	ldclvs	3, cr7, [r4, #-0]
    4634:	31663233 	cmncc	r6, r3, lsr r2
    4638:	36783330 			@ <UNDEFINED> instruction: 0x36783330
    463c:	0800682e 	stmdaeq	r0, {r1, r2, r3, r5, fp, sp, lr}
    4640:	74730000 	ldrbtvc	r0, [r3], #-0
    4644:	2e6f6964 	vnmulcs.f16	s13, s30, s9	@ <UNPREDICTABLE>
    4648:	00030068 	andeq	r0, r3, r8, rrx
    464c:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    4650:	2e677261 	cdpcs	2, 6, cr7, cr7, cr1, {3}
    4654:	00070068 	andeq	r0, r7, r8, rrx
    4658:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    465c:	682e6f69 	stmdavs	lr!, {r0, r3, r5, r6, r8, r9, sl, fp, sp, lr}
    4660:	00000500 	andeq	r0, r0, r0, lsl #10
    4664:	6c647473 	cfstrdvs	mvd7, [r4], #-460	@ 0xfffffe34
    4668:	682e6269 	stmdavs	lr!, {r0, r3, r5, r6, r9, sp, lr}
    466c:	00000300 	andeq	r0, r0, r0, lsl #6
    4670:	6c647473 	cfstrdvs	mvd7, [r4], #-460	@ 0xfffffe34
    4674:	682e6269 	stmdavs	lr!, {r0, r3, r5, r6, r9, sp, lr}
    4678:	00000600 	andeq	r0, r0, r0, lsl #12
    467c:	6f6c6c61 	svcvs	0x006c6c61
    4680:	682e6163 	stmdavs	lr!, {r0, r1, r5, r6, r8, sp, lr}
    4684:	00000300 	andeq	r0, r0, r0, lsl #6
    4688:	69647473 	stmdbvs	r4!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
    468c:	682e746e 	stmdavs	lr!, {r1, r2, r3, r5, r6, sl, ip, sp, lr}
    4690:	00000700 	andeq	r0, r0, r0, lsl #14
    4694:	69647473 	stmdbvs	r4!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
    4698:	682e746e 	stmdavs	lr!, {r1, r2, r3, r5, r6, sl, ip, sp, lr}
    469c:	00000300 	andeq	r0, r0, r0, lsl #6
    46a0:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    46a4:	2e707573 	mrccs	5, 3, r7, cr0, cr3, {3}
    46a8:	00050068 	andeq	r0, r5, r8, rrx
    46ac:	74735f00 	ldrbtvc	r5, [r3], #-3840	@ 0xfffff100
    46b0:	746e6964 	strbtvc	r6, [lr], #-2404	@ 0xfffff69c
    46b4:	0500682e 	streq	r6, [r0, #-2094]	@ 0xfffff7d2
    46b8:	52410000 	subpl	r0, r1, #0
    46bc:	334d434d 	movtcc	r4, #54093	@ 0xd34d
    46c0:	0900682e 	stmdbeq	r0, {r1, r2, r3, r5, fp, sp, lr}
    46c4:	6f630000 	svcvs	0x00630000
    46c8:	635f6572 	cmpvs	pc, #478150656	@ 0x1c800000
    46cc:	682e336d 	stmdavs	lr!, {r0, r2, r3, r5, r6, r8, r9, ip, sp}
    46d0:	00000900 	andeq	r0, r0, r0, lsl #18
    46d4:	69736d63 	ldmdbvs	r3!, {r0, r1, r5, r6, r8, sl, fp, sp, lr}^
    46d8:	65765f73 	ldrbvs	r5, [r6, #-3955]!	@ 0xfffff08d
    46dc:	6f697372 	svcvs	0x00697372
    46e0:	00682e6e 	rsbeq	r2, r8, lr, ror #28
    46e4:	63000009 	movwvs	r0, #9
    46e8:	7369736d 	cmnvc	r9, #-1275068415	@ 0xb4000001
    46ec:	6d6f635f 	stclvs	3, cr6, [pc, #-380]!	@ 4578 <_Min_Stack_Size+0x4178>
    46f0:	656c6970 	strbvs	r6, [ip, #-2416]!	@ 0xfffff690
    46f4:	00682e72 	rsbeq	r2, r8, r2, ror lr
    46f8:	63000009 	movwvs	r0, #9
    46fc:	7369736d 	cmnvc	r9, #-1275068415	@ 0xb4000001
    4700:	6363675f 	cmnvs	r3, #24903680	@ 0x17c0000
    4704:	0900682e 	stmdbeq	r0, {r1, r2, r3, r5, fp, sp, lr}
    4708:	706d0000 	rsbvc	r0, sp, r0
    470c:	72615f75 	rsbvc	r5, r1, #468	@ 0x1d4
    4710:	2e37766d 	cfmsuba32cs	mvax3, mvax7, mvfx7, mvfx13
    4714:	00090068 	andeq	r0, r9, r8, rrx
    4718:	73797300 	cmnvc	r9, #0, 6
    471c:	5f6d6574 	svcpl	0x006d6574
    4720:	434d5241 	movtmi	r5, #53825	@ 0xd241
    4724:	682e334d 	stmdavs	lr!, {r0, r2, r3, r6, r8, r9, ip, sp}
    4728:	00000900 	andeq	r0, r0, r0, lsl #18
    472c:	74726f43 	ldrbtvc	r6, [r2], #-3907	@ 0xfffff0bd
    4730:	584d7865 	stmdapl	sp, {r0, r2, r5, r6, fp, ip, sp, lr}^
    4734:	5f734f5f 	svcpl	0x00734f5f
    4738:	74726f50 	ldrbtvc	r6, [r2], #-3920	@ 0xfffff0b0
    473c:	2e676e69 	cdpcs	14, 6, cr6, cr7, cr9, {3}
    4740:	00020068 	andeq	r0, r2, r8, rrx
    4744:	05050000 	streq	r0, [r5, #-0]
    4748:	88020500 	stmdahi	r2, {r8, sl}
    474c:	17080005 	strne	r0, [r8, -r5]
    4750:	01040200 	mrseq	r0, R12_usr
    4754:	00020513 	andeq	r0, r2, r3, lsl r5
    4758:	15010402 	strne	r0, [r1, #-1026]	@ 0xfffffbfe
    475c:	02000b05 	andeq	r0, r0, #5120	@ 0x1400
    4760:	020f0104 	andeq	r0, pc, #4, 2
    4764:	01010001 	tsteq	r1, r1
    4768:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    476c:	00058a02 	andeq	r8, r5, r2, lsl #20
    4770:	010c0308 	tsteq	ip, r8, lsl #6
    4774:	01040200 	mrseq	r0, R12_usr
    4778:	00020513 	andeq	r0, r2, r3, lsl r5
    477c:	15010402 	strne	r0, [r1, #-1026]	@ 0xfffffbfe
    4780:	02000b05 	andeq	r0, r0, #5120	@ 0x1400
    4784:	020f0104 	andeq	r0, pc, #4, 2
    4788:	01010001 	tsteq	r1, r1
    478c:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    4790:	00058c02 	andeq	r8, r5, r2, lsl #24
    4794:	01130308 	tsteq	r3, r8, lsl #6
    4798:	01040200 	mrseq	r0, R12_usr
    479c:	00020513 	andeq	r0, r2, r3, lsl r5
    47a0:	15010402 	strne	r0, [r1, #-1026]	@ 0xfffffbfe
    47a4:	02000b05 	andeq	r0, r0, #5120	@ 0x1400
    47a8:	020f0104 	andeq	r0, pc, #4, 2
    47ac:	01010001 	tsteq	r1, r1
    47b0:	05000505 	streq	r0, [r0, #-1285]	@ 0xfffffafb
    47b4:	00059002 	andeq	r9, r5, r2
    47b8:	011b0308 	tsteq	fp, r8, lsl #6
    47bc:	06090522 	streq	r0, [r9], -r2, lsr #10
    47c0:	2e080501 	cfsh32cs	mvfx0, mvfx8, #1
    47c4:	02000205 	andeq	r0, r0, #1342177280	@ 0x50000000
    47c8:	22060104 	andcs	r0, r6, #4, 2
    47cc:	02000805 	andeq	r0, r0, #327680	@ 0x50000
    47d0:	05010104 	streq	r0, [r1, #-260]	@ 0xfffffefc
    47d4:	16052405 	strne	r2, [r5], -r5, lsl #8
    47d8:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    47dc:	18054b06 	stmdane	r5, {r1, r2, r8, r9, fp, lr}
    47e0:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    47e4:	14052f06 	strne	r2, [r5], #-3846	@ 0xfffff0fa
    47e8:	05050106 	streq	r0, [r5, #-262]	@ 0xfffffefa
    47ec:	05142f06 	ldreq	r2, [r4, #-3846]	@ 0xfffff0fa
    47f0:	05010616 	streq	r0, [r1, #-1558]	@ 0xfffff9ea
    47f4:	052f0605 	streq	r0, [pc, #-1541]!	@ 41f7 <_Min_Stack_Size+0x3df7>
    47f8:	05010618 	streq	r0, [r1, #-1560]	@ 0xfffff9e8
    47fc:	052f0605 	streq	r0, [pc, #-1541]!	@ 41ff <_Min_Stack_Size+0x3dff>
    4800:	05010614 	streq	r0, [r1, #-1556]	@ 0xfffff9ec
    4804:	76210605 	strtvc	r0, [r1], -r5, lsl #12
    4808:	01061605 	tsteq	r6, r5, lsl #12
    480c:	2f060505 	svccs	0x00060505
    4810:	01061805 	tsteq	r6, r5, lsl #16
    4814:	2f060505 	svccs	0x00060505
    4818:	01061405 	tsteq	r6, r5, lsl #8
    481c:	21060505 	tstcs	r6, r5, lsl #10
    4820:	060e0584 	streq	r0, [lr], -r4, lsl #11
    4824:	3c0b0501 	cfstr32cc	mvfx0, [fp], {1}
    4828:	4b060505 	blmi	185c44 <_Min_Stack_Size+0x185844>
    482c:	01060e05 	tsteq	r6, r5, lsl #28
    4830:	053c0b05 	ldreq	r0, [ip, #-2821]!	@ 0xfffff4fb
    4834:	053d0605 	ldreq	r0, [sp, #-1541]!	@ 0xfffff9fb
    4838:	0501060e 	streq	r0, [r1, #-1550]	@ 0xfffff9f2
    483c:	04020005 	streq	r0, [r2], #-5
    4840:	053d0602 	ldreq	r0, [sp, #-1538]!	@ 0xfffff9fe
    4844:	04020002 	streq	r0, [r2], #-2
    4848:	0b051502 	bleq	149c58 <_Min_Stack_Size+0x149858>
    484c:	02040200 	andeq	r0, r4, #0, 4
    4850:	0014020f 	andseq	r0, r4, pc, lsl #4
    4854:	00800101 	addeq	r0, r0, r1, lsl #2
    4858:	00030000 	andeq	r0, r3, r0
    485c:	00000039 	andeq	r0, r0, r9, lsr r0
    4860:	0efb0102 	cdpeq	1, 15, cr0, cr11, cr2, {0}
    4864:	0101000d 	tsteq	r1, sp
    4868:	00000101 	andeq	r0, r0, r1, lsl #2
    486c:	00000100 	andeq	r0, r0, r0, lsl #2
    4870:	2f2e2e01 	svccs	0x002e2e01
    4874:	72617453 	rsbvc	r7, r1, #1392508928	@ 0x53000000
    4878:	00707574 	rsbseq	r7, r0, r4, ror r5
    487c:	61747300 	cmnvs	r4, r0, lsl #6
    4880:	70757472 	rsbsvc	r7, r5, r2, ror r4
    4884:	6d74735f 	ldclvs	3, cr7, [r4, #-380]!	@ 0xfffffe84
    4888:	31663233 	cmncc	r6, r3, lsr r2
    488c:	36633330 			@ <UNDEFINED> instruction: 0x36633330
    4890:	732e7874 			@ <UNDEFINED> instruction: 0x732e7874
    4894:	00000100 	andeq	r0, r0, r0, lsl #2
    4898:	02050000 	andeq	r0, r5, #0
    489c:	08000624 	stmdaeq	r0, {r2, r5, r9, sl}
    48a0:	21013903 	tstcs	r1, r3, lsl #18
    48a4:	21213122 			@ <UNDEFINED> instruction: 0x21213122
    48a8:	21232121 			@ <UNDEFINED> instruction: 0x21232121
    48ac:	21212321 			@ <UNDEFINED> instruction: 0x21212321
    48b0:	21212123 			@ <UNDEFINED> instruction: 0x21212123
    48b4:	21232123 			@ <UNDEFINED> instruction: 0x21232123
    48b8:	03313023 	teqeq	r1, #35	@ 0x23
    48bc:	2f342056 	svccs	0x00342056
    48c0:	2e0f032f 	cdpcs	3, 0, cr0, cr15, cr15, {1}
    48c4:	0002022f 	andeq	r0, r2, pc, lsr #4
    48c8:	05000101 	streq	r0, [r0, #-257]	@ 0xfffffeff
    48cc:	00067402 	andeq	r7, r6, r2, lsl #8
    48d0:	00f20308 	rscseq	r0, r2, r8, lsl #6
    48d4:	00010201 	andeq	r0, r1, r1, lsl #4
    48d8:	Address 0x48d8 is out of bounds.


Disassembly of section .debug_str:

