NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
00000000 <.debug_str>:
       0:	505f534f 	subspl	r5, pc, pc, asr #6
       4:	535f5053 	cmppl	pc, #83	@ 0x53
       8:	20292850 	eorcs	r2, r9, r0, asr r8
       c:	73615f5f 	cmnvc	r1, #380	@ 0x17c
      10:	6f76206d 	svcvs	0x0076206d
      14:	6974616c 	ldmdbvs	r4!, {r2, r3, r5, r6, r8, sp, lr}^
      18:	2228656c 	eorcs	r6, r8, #108, 10	@ 0x1b000000
      1c:	2073726d 	rsbscs	r7, r3, sp, ror #4
      20:	2c203072 	stccs	0, cr3, [r0], #-456	@ 0xfffffe38
      24:	544e4f43 	strbpl	r4, [lr], #-3907	@ 0xfffff0bd
      28:	204c4f52 	subcs	r4, ip, r2, asr pc
      2c:	745c6e5c 	ldrbvc	r6, [ip], #-3676	@ 0xfffff1a4
      30:	766f6d20 	strbtvc	r6, [pc], -r0, lsr #26
      34:	20317220 	eorscs	r7, r1, r0, lsr #4
      38:	7830232c 	ldmdavc	r0!, {r2, r3, r5, r8, r9, sp}
      3c:	5c203530 	cfstr32pl	mvfx3, [r0], #-192	@ 0xffffff40
      40:	20745c6e 	rsbscs	r5, r4, lr, ror #24
      44:	646e6120 	strbtvs	r6, [lr], #-288	@ 0xfffffee0
      48:	2c307220 	lfmcs	f7, 4, [r0], #-128	@ 0xffffff80
      4c:	722c3072 	eorvc	r3, ip, #114	@ 0x72
      50:	6e5c2031 	mrcvs	0, 2, r2, cr12, cr1, {1}
      54:	6d20745c 	cfstrsvs	mvf7, [r0, #-368]!	@ 0xfffffe90
      58:	43207273 			@ <UNDEFINED> instruction: 0x43207273
      5c:	52544e4f 	subspl	r4, r4, #1264	@ 0x4f0
      60:	2c204c4f 	stccs	12, cr4, [r0], #-316	@ 0xfffffec4
      64:	22307220 	eorscs	r7, r0, #32, 4
      68:	5f5f0029 	svcpl	0x005f0029
      6c:	5f4d5241 	svcpl	0x004d5241
      70:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
      74:	5f455255 	svcpl	0x00455255
      78:	36315046 	ldrtcc	r5, [r1], -r6, asr #32
      7c:	4345565f 	movtmi	r5, #22111	@ 0x565f
      80:	5f524f54 	svcpl	0x00524f54
      84:	54495241 	strbpl	r5, [r9], #-577	@ 0xfffffdbf
      88:	54454d48 	strbpl	r4, [r5], #-3400	@ 0xfffff2b8
      8c:	5f004349 	svcpl	0x00004349
      90:	4749535f 	smlsldmi	r5, r9, pc, r3	@ <UNPREDICTABLE>
      94:	4f54415f 	svcmi	0x0054415f
      98:	5f43494d 	svcpl	0x0043494d
      9c:	5f58414d 	svcpl	0x0058414d
      a0:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
      a4:	66666637 			@ <UNDEFINED> instruction: 0x66666637
      a8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
      ac:	545f5f00 	ldrbpl	r5, [pc], #-3840	@ b4 <_Min_Heap_Size-0x14c>
      b0:	42465f41 	submi	r5, r6, #260	@ 0x104
      b4:	5f5f5449 	svcpl	0x005f5449
      b8:	00333620 	eorseq	r3, r3, r0, lsr #12
      bc:	46555f5f 	usaxmi	r5, r5, pc	@ <UNPREDICTABLE>
      c0:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
      c4:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
      c8:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
      cc:	5f5f0030 	svcpl	0x005f0030
      d0:	33544c46 	cmpcc	r4, #17920	@ 0x4600
      d4:	41485f32 	cmpmi	r8, r2, lsr pc
      d8:	4e495f53 	mcrmi	15, 2, r5, cr9, cr3, {2}
      dc:	494e4946 	stmdbmi	lr, {r1, r2, r6, r8, fp, lr}^
      e0:	5f5f5954 	svcpl	0x005f5954
      e4:	5f003120 	svcpl	0x00003120
      e8:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
      ec:	41465f54 	cmpmi	r6, r4, asr pc
      f0:	5f385453 	svcpl	0x00385453
      f4:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
      f8:	75205f5f 	strvc	r5, [r0, #-3935]!	@ 0xfffff0a1
      fc:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
     100:	2064656e 	rsbcs	r6, r4, lr, ror #10
     104:	00746e69 	rsbseq	r6, r4, r9, ror #28
     108:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     10c:	5f343654 	svcpl	0x00343654
     110:	5f58414d 	svcpl	0x0058414d
     114:	5f505845 	svcpl	0x00505845
     118:	3031205f 	eorscc	r2, r1, pc, asr r0
     11c:	5f003432 	svcpl	0x00003432
     120:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
     124:	5f583233 	svcpl	0x00583233
     128:	5f58414d 	svcpl	0x0058414d
     12c:	5f505845 	svcpl	0x00505845
     130:	3031205f 	eorscc	r2, r1, pc, asr r0
     134:	5f003432 	svcpl	0x00003432
     138:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
     13c:	5341465f 	movtpl	r4, #5727	@ 0x165f
     140:	5f363154 	svcpl	0x00363154
     144:	54444957 	strbpl	r4, [r4], #-2391	@ 0xfffff6a9
     148:	205f5f48 	subscs	r5, pc, r8, asr #30
     14c:	5f003233 	svcpl	0x00003233
     150:	4343475f 	movtmi	r4, #14175	@ 0x375f
     154:	4f54415f 	svcmi	0x0054415f
     158:	5f43494d 	svcpl	0x0043494d
     15c:	54534554 	ldrbpl	r4, [r3], #-1364	@ 0xfffffaac
     160:	444e415f 	strbmi	r4, [lr], #-351	@ 0xfffffea1
     164:	5445535f 	strbpl	r5, [r5], #-863	@ 0xfffffca1
     168:	5552545f 	ldrbpl	r5, [r2, #-1119]	@ 0xfffffba1
     16c:	4c415645 	mcrrmi	6, 4, r5, r1, cr5
     170:	5f003120 	svcpl	0x00003120
     174:	414c555f 	cmpmi	ip, pc, asr r5
     178:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
     17c:	5350455f 	cmppl	r0, #398458880	@ 0x17c00000
     180:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
     184:	30205f5f 	eorcc	r5, r0, pc, asr pc
     188:	2d503178 	ldfcse	f3, [r0, #-480]	@ 0xfffffe20
     18c:	4c553233 	lfmmi	f3, 2, [r5], {51}	@ 0x33
     190:	5f5f004b 	svcpl	0x005f004b
     194:	5f4d5241 	svcpl	0x004d5241
     198:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
     19c:	5f455255 	svcpl	0x00455255
     1a0:	444d4953 	strbmi	r4, [sp], #-2387	@ 0xfffff6ad
     1a4:	5f003233 	svcpl	0x00003233
     1a8:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
     1ac:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ e8 <_Min_Heap_Size-0x118>
     1b0:	5f544e41 	svcpl	0x00544e41
     1b4:	5f474944 	svcpl	0x00474944
     1b8:	3432205f 	ldrtcc	r2, [r2], #-95	@ 0xffffffa1
     1bc:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffff2c4 <_estack+0xdfffcac4>
     1c0:	495f5153 	ldmdbmi	pc, {r0, r1, r4, r6, r8, ip, lr}^	@ <UNPREDICTABLE>
     1c4:	5f544942 	svcpl	0x00544942
     1c8:	0030205f 	eorseq	r2, r0, pc, asr r0
     1cc:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
     1d0:	5f38544e 	svcpl	0x0038544e
     1d4:	29632843 	stmdbcs	r3!, {r0, r1, r6, fp, sp}^
     1d8:	5f006320 	svcpl	0x00006320
     1dc:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     1e0:	4f454e5f 	svcmi	0x00454e5f
     1e4:	005f5f4e 	subseq	r5, pc, lr, asr #30
     1e8:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
     1ec:	464f455a 			@ <UNDEFINED> instruction: 0x464f455a
     1f0:	4e49575f 	mcrmi	7, 2, r5, cr9, cr15, {2}
     1f4:	5f545f54 	svcpl	0x00545f54
     1f8:	0034205f 	eorseq	r2, r4, pc, asr r0
     1fc:	51515f5f 	cmppl	r1, pc, asr pc
     200:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
     204:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
     208:	5f5f0030 	svcpl	0x005f0030
     20c:	5f514455 	svcpl	0x00514455
     210:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
     214:	30205f5f 	eorcc	r5, r0, pc, asr pc
     218:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     21c:	3233544c 	eorscc	r5, r3, #76, 8	@ 0x4c000000
     220:	45445f58 	strbmi	r5, [r4, #-3928]	@ 0xfffff0a8
     224:	414d4943 	cmpmi	sp, r3, asr #18
     228:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     22c:	205f5f47 	subscs	r5, pc, r7, asr #30
     230:	5f003731 	svcpl	0x00003731
     234:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	@ 0x5f
     238:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
     23c:	5058455f 	subspl	r4, r8, pc, asr r5
     240:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
     244:	3230312d 	eorscc	r3, r0, #1073741835	@ 0x4000000b
     248:	5f002931 	svcpl	0x00002931
     24c:	4e4f4c5f 	mcrmi	12, 2, r4, cr15, cr15, {2}
     250:	4f4c5f47 	svcmi	0x004c5f47
     254:	575f474e 	ldrbpl	r4, [pc, -lr, asr #14]
     258:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
     25c:	36205f5f 	qsaxcc	r5, r0, pc	@ <UNPREDICTABLE>
     260:	5f5f0034 	svcpl	0x005f0034
     264:	5f434347 	svcpl	0x00434347
     268:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	@ 16c <_Min_Heap_Size-0x94>
     26c:	435f4349 	cmpmi	pc, #603979777	@ 0x24000001
     270:	31524148 	cmpcc	r2, r8, asr #2
     274:	5f545f36 	svcpl	0x00545f36
     278:	4b434f4c 	blmi	10d3fb0 <_Min_Stack_Size+0x10d3bb0>
     27c:	4552465f 	ldrbmi	r4, [r2, #-1631]	@ 0xfffff9a1
     280:	00322045 	eorseq	r2, r2, r5, asr #32
     284:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
     288:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
     28c:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
     290:	44435f45 	strbmi	r5, [r3], #-3909	@ 0xfffff0bb
     294:	4f435f45 	svcmi	0x00435f45
     298:	434f5250 	movtmi	r5, #62032	@ 0xf250
     29c:	415f5f00 	cmpmi	pc, r0, lsl #30
     2a0:	535f4d52 	cmppl	pc, #5248	@ 0x1480
     2a4:	4f455a49 	svcmi	0x00455a49
     2a8:	43575f46 	cmpmi	r7, #280	@ 0x118
     2ac:	5f524148 	svcpl	0x00524148
     2b0:	00342054 	eorseq	r2, r4, r4, asr r0
     2b4:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
     2b8:	50465f4d 	subpl	r5, r6, sp, asr #30
     2bc:	465f3631 			@ <UNDEFINED> instruction: 0x465f3631
     2c0:	414d524f 	cmpmi	sp, pc, asr #4
     2c4:	45495f54 	strbmi	r5, [r9, #-3924]	@ 0xfffff0ac
     2c8:	5f004545 	svcpl	0x00004545
     2cc:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     2d0:	4145465f 	cmpmi	r5, pc, asr r6
     2d4:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
     2d8:	4d4f435f 	stclmi	3, cr4, [pc, #-380]	@ 164 <_Min_Heap_Size-0x9c>
     2dc:	58454c50 	stmdapl	r5, {r4, r6, sl, fp, lr}^
     2e0:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
     2e4:	4152464c 	cmpmi	r2, ip, asr #12
     2e8:	495f5443 	ldmdbmi	pc, {r0, r1, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
     2ec:	5f544942 	svcpl	0x00544942
     2f0:	0030205f 	eorseq	r2, r0, pc, asr r0
     2f4:	42445f5f 	submi	r5, r4, #380	@ 0x17c
     2f8:	414d5f4c 	cmpmi	sp, ip, asr #30
     2fc:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
     300:	6f642828 	svcvs	0x00642828
     304:	656c6275 	strbvs	r6, [ip, #-629]!	@ 0xfffffd8b
     308:	372e3129 	strcc	r3, [lr, -r9, lsr #2]!
     30c:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
     310:	34333133 	ldrtcc	r3, [r3], #-307	@ 0xfffffecd
     314:	33323638 	teqcc	r2, #56, 12	@ 0x3800000
     318:	65373531 	ldrvs	r3, [r7, #-1329]!	@ 0xfffffacf
     31c:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
     320:	5f00294c 	svcpl	0x0000294c
     324:	4653555f 			@ <UNDEFINED> instruction: 0x4653555f
     328:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
     32c:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
     330:	30205f5f 	eorcc	r5, r0, pc, asr pc
     334:	4855302e 	ldmdami	r5, {r1, r2, r3, r5, ip, sp}^
     338:	5f5f0052 	svcpl	0x005f0052
     33c:	43554e47 	cmpmi	r5, #1136	@ 0x470
     340:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
     344:	5f5f524f 	svcpl	0x005f524f
     348:	5f003320 	svcpl	0x00003320
     34c:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     350:	4d53415f 	ldfmie	f4, [r3, #-380]	@ 0xfffffe84
     354:	4e59535f 	mrcmi	3, 2, r5, cr9, cr15, {2}
     358:	5f584154 	svcpl	0x00584154
     35c:	46494e55 			@ <UNDEFINED> instruction: 0x46494e55
     360:	5f444549 	svcpl	0x00444549
     364:	0031205f 	eorseq	r2, r1, pc, asr r0
     368:	535f534f 	cmppl	pc, #1006632961	@ 0x3c000001
     36c:	63746977 	cmnvs	r4, #1949696	@ 0x1dc000
     370:	6f745f68 	svcvs	0x00745f68
     374:	6972705f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, ip, sp, lr}^
     378:	676c6976 			@ <UNDEFINED> instruction: 0x676c6976
     37c:	29286465 	stmdbcs	r8!, {r0, r2, r5, r6, sl, sp, lr}
     380:	615f5f20 	cmpvs	pc, r0, lsr #30
     384:	22286d73 	eorcs	r6, r8, #7360	@ 0x1cc0
     388:	2073726d 	rsbscs	r7, r3, sp, ror #4
     38c:	202c3372 	eorcs	r3, ip, r2, ror r3
     390:	544e4f43 	strbpl	r4, [lr], #-3907	@ 0xfffff0bd
     394:	204c4f52 	subcs	r4, ip, r2, asr pc
     398:	745c6e5c 	ldrbvc	r6, [ip], #-3676	@ 0xfffff1a4
     39c:	72736c20 	rsbsvc	r6, r3, #32, 24	@ 0x2000
     3a0:	2c337220 	lfmcs	f7, 4, [r3], #-128	@ 0xffffff80
     3a4:	2c337220 	lfmcs	f7, 4, [r3], #-128	@ 0xffffff80
     3a8:	78302320 	ldmdavc	r0!, {r5, r8, r9, sp}
     3ac:	5c203130 	stfpls	f3, [r0], #-192	@ 0xffffff40
     3b0:	20745c6e 	rsbscs	r5, r4, lr, ror #24
     3b4:	2072736c 	rsbscs	r7, r2, ip, ror #6
     3b8:	202c3372 	eorcs	r3, ip, r2, ror r3
     3bc:	202c3372 	eorcs	r3, ip, r2, ror r3
     3c0:	30783023 	rsbscc	r3, r8, r3, lsr #32
     3c4:	6e5c2031 	mrcvs	0, 2, r2, cr12, cr1, {1}
     3c8:	6d20745c 	cfstrsvs	mvf7, [r0, #-368]!	@ 0xfffffe90
     3cc:	43207273 			@ <UNDEFINED> instruction: 0x43207273
     3d0:	52544e4f 	subspl	r4, r4, #1264	@ 0x4f0
     3d4:	2c204c4f 	stccs	12, cr4, [r0], #-316	@ 0xfffffec4
     3d8:	22337220 	eorscs	r7, r3, #32, 4
     3dc:	5f5f0029 	svcpl	0x005f0029
     3e0:	5f4d5241 	svcpl	0x004d5241
     3e4:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
     3e8:	5f455255 	svcpl	0x00455255
     3ec:	50595243 	subspl	r5, r9, r3, asr #4
     3f0:	5f004f54 	svcpl	0x00004f54
     3f4:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	@ 0x5f
     3f8:	524f4e5f 	subpl	r4, pc, #1520	@ 0x5f0
     3fc:	414d5f4d 	cmpmi	sp, sp, asr #30
     400:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
     404:	6f642828 	svcvs	0x00642828
     408:	656c6275 	strbvs	r6, [ip, #-629]!	@ 0xfffffd8b
     40c:	372e3129 	strcc	r3, [lr, -r9, lsr #2]!
     410:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
     414:	34333133 	ldrtcc	r3, [r3], #-307	@ 0xfffffecd
     418:	33323638 	teqcc	r2, #56, 12	@ 0x3800000
     41c:	65373531 	ldrvs	r3, [r7, #-1329]!	@ 0xfffffacf
     420:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
     424:	5f00294c 	svcpl	0x0000294c
     428:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
     42c:	5f363154 	svcpl	0x00363154
     430:	29632843 	stmdbcs	r3!, {r0, r1, r6, fp, sp}^
     434:	5f006320 	svcpl	0x00006320
     438:	5a49535f 	bpl	12551bc <_Min_Stack_Size+0x1254dbc>
     43c:	5f464f45 	svcpl	0x00464f45
     440:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
     444:	5f5f545f 	svcpl	0x005f545f
     448:	5f003420 	svcpl	0x00003420
     44c:	5f41445f 	svcpl	0x0041445f
     450:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
     454:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
     458:	5f5f0032 	svcpl	0x005f0032
     45c:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
     460:	4c5f464f 	mrrcmi	6, 4, r4, pc, cr15	@ <UNPREDICTABLE>
     464:	5f474e4f 	svcpl	0x00474e4f
     468:	42554f44 	subsmi	r4, r5, #68, 30	@ 0x110
     46c:	5f5f454c 	svcpl	0x005f454c
     470:	5f003820 	svcpl	0x00003820
     474:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
     478:	5341465f 	movtpl	r4, #5727	@ 0x165f
     47c:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ 334 <_Min_Heap_Size+0x134>
     480:	5f5f5841 	svcpl	0x005f5841
     484:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
     488:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     48c:	00666666 	rsbeq	r6, r6, r6, ror #12
     490:	524f5f5f 	subpl	r5, pc, #380	@ 0x17c
     494:	5f524544 	svcpl	0x00524544
     498:	5f474942 	svcpl	0x00474942
     49c:	49444e45 	stmdbmi	r4, {r0, r2, r6, r9, sl, fp, lr}^
     4a0:	5f5f4e41 	svcpl	0x005f4e41
     4a4:	32333420 	eorscc	r3, r3, #32, 8	@ 0x20000000
     4a8:	56530031 			@ <UNDEFINED> instruction: 0x56530031
     4ac:	61485f43 	cmpvs	r8, r3, asr #30
     4b0:	656c646e 	strbvs	r6, [ip, #-1134]!	@ 0xfffffb92
     4b4:	5f5f0072 	svcpl	0x005f0072
     4b8:	5f434347 	svcpl	0x00434347
     4bc:	534e4f43 	movtpl	r4, #61251	@ 0xef43
     4c0:	43555254 	cmpmi	r5, #84, 4	@ 0x40000005
     4c4:	45564954 	ldrbmi	r4, [r6, #-2388]	@ 0xfffff6ac
     4c8:	5a49535f 	bpl	125524c <_Min_Stack_Size+0x1254e4c>
     4cc:	34362045 	ldrtcc	r2, [r6], #-69	@ 0xffffffbb
     4d0:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffff5d8 <_estack+0xdfffcdd8>
     4d4:	465f4154 			@ <UNDEFINED> instruction: 0x465f4154
     4d8:	5f544942 	svcpl	0x00544942
     4dc:	3436205f 	ldrtcc	r2, [r6], #-95	@ 0xffffffa1
     4e0:	445f5f00 	ldrbmi	r5, [pc], #-3840	@ 4e8 <_Min_Stack_Size+0xe8>
     4e4:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	@ 3e4 <_Min_Heap_Size+0x1e4>
     4e8:	5f544e41 	svcpl	0x00544e41
     4ec:	5f474944 	svcpl	0x00474944
     4f0:	3335205f 	teqcc	r5, #95	@ 0x5f
     4f4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffff5fc <_estack+0xdfffcdfc>
     4f8:	5f544e49 	svcpl	0x00544e49
     4fc:	5341454c 	movtpl	r4, #5452	@ 0x154c
     500:	5f343654 	svcpl	0x00343654
     504:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
     508:	6c205f5f 	stcvs	15, cr5, [r0], #-380	@ 0xfffffe84
     50c:	20676e6f 	rsbcs	r6, r7, pc, ror #28
     510:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
     514:	736e7520 	cmnvc	lr, #32, 10	@ 0x8000000
     518:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
     51c:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
     520:	5f5f0074 	svcpl	0x005f0074
     524:	5f544e49 	svcpl	0x00544e49
     528:	5f58414d 	svcpl	0x0058414d
     52c:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     530:	66666637 			@ <UNDEFINED> instruction: 0x66666637
     534:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     538:	415f5f00 	cmpmi	pc, r0, lsl #30
     53c:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
     540:	45525f43 	ldrbmi	r5, [r2, #-3907]	@ 0xfffff0bd
     544:	5341454c 	movtpl	r4, #5452	@ 0x154c
     548:	00332045 	eorseq	r2, r3, r5, asr #32
     54c:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     550:	53495f54 	movtpl	r5, #40788	@ 0x9f54
     554:	4345495f 	movtmi	r4, #22879	@ 0x595f
     558:	3530365f 	ldrcc	r3, [r0, #-1631]!	@ 0xfffff9a1
     55c:	5f5f3935 	svcpl	0x005f3935
     560:	5f003220 	svcpl	0x00003220
     564:	5254505f 	subspl	r5, r4, #95	@ 0x5f
     568:	46464944 	strbmi	r4, [r6], -r4, asr #18
     56c:	5059545f 	subspl	r5, r9, pc, asr r4
     570:	205f5f45 	subscs	r5, pc, r5, asr #30
     574:	00746e69 	rsbseq	r6, r4, r9, ror #28
     578:	48435f5f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
     57c:	555f5241 	ldrbpl	r5, [pc, #-577]	@ 343 <_Min_Heap_Size+0x143>
     580:	4749534e 	strbmi	r5, [r9, -lr, asr #6]
     584:	5f44454e 	svcpl	0x0044454e
     588:	0031205f 	eorseq	r2, r1, pc, asr r0
     58c:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
     590:	5f363154 	svcpl	0x00363154
     594:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
     598:	73205f5f 			@ <UNDEFINED> instruction: 0x73205f5f
     59c:	74726f68 	ldrbtvc	r6, [r2], #-3944	@ 0xfffff098
     5a0:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
     5a4:	415f5f00 	cmpmi	pc, r0, lsl #30
     5a8:	465f4d52 			@ <UNDEFINED> instruction: 0x465f4d52
     5ac:	55544145 	ldrbpl	r4, [r4, #-325]	@ 0xfffffebb
     5b0:	515f4552 	cmppl	pc, r2, asr r5	@ <UNPREDICTABLE>
     5b4:	584d4452 	stmdapl	sp, {r1, r4, r6, sl, lr}^
     5b8:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
     5bc:	5f4c4244 	svcpl	0x004c4244
     5c0:	5f474944 	svcpl	0x00474944
     5c4:	3531205f 	ldrcc	r2, [r1, #-95]!	@ 0xffffffa1
     5c8:	4f5f5f00 	svcmi	0x005f5f00
     5cc:	4d495450 	cfstrdmi	mvd5, [r9, #-320]	@ 0xfffffec0
     5d0:	5f455a49 	svcpl	0x00455a49
     5d4:	0031205f 	eorseq	r2, r1, pc, asr r0
     5d8:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     5dc:	5f323354 	svcpl	0x00323354
     5e0:	5f58414d 	svcpl	0x0058414d
     5e4:	2e33205f 	mrccs	0, 1, r2, cr3, cr15, {2}
     5e8:	38323034 	ldmdacc	r2!, {r2, r4, r5, ip, sp}
     5ec:	36343332 			@ <UNDEFINED> instruction: 0x36343332
     5f0:	35383336 	ldrcc	r3, [r8, #-822]!	@ 0xfffffcca
     5f4:	36383832 			@ <UNDEFINED> instruction: 0x36383832
     5f8:	38332b65 	ldmdacc	r3!, {r0, r2, r5, r6, r8, r9, fp, sp}
     5fc:	00323346 	eorseq	r3, r2, r6, asr #6
     600:	4c4c5f5f 	mcrrmi	15, 5, r5, ip, cr15
     604:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
     608:	42495f4d 	submi	r5, r9, #308	@ 0x134
     60c:	5f5f5449 	svcpl	0x005f5449
     610:	00323320 	eorseq	r3, r2, r0, lsr #6
     614:	54415f5f 	strbpl	r5, [r1], #-3935	@ 0xfffff0a1
     618:	43494d4f 	movtmi	r4, #40271	@ 0x9d4f
     61c:	5145535f 	cmppl	r5, pc, asr r3
     620:	5453435f 	ldrbpl	r4, [r3], #-863	@ 0xfffffca1
     624:	5f003520 	svcpl	0x00003520
     628:	5a49535f 	bpl	12553ac <_Min_Stack_Size+0x1254fac>
     62c:	5f464f45 	svcpl	0x00464f45
     630:	524f4853 	subpl	r4, pc, #5439488	@ 0x530000
     634:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
     638:	5f5f0032 	svcpl	0x005f0032
     63c:	5f544e49 	svcpl	0x00544e49
     640:	5341454c 	movtpl	r4, #5452	@ 0x154c
     644:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ 4fc <_Min_Stack_Size+0xfc>
     648:	5f5f5841 	svcpl	0x005f5841
     64c:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
     650:	5f5f0066 	svcpl	0x005f0066
     654:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
     658:	52455453 	subpl	r5, r5, #1392508928	@ 0x53000000
     65c:	4552505f 	ldrbmi	r5, [r2, #-95]	@ 0xffffffa1
     660:	5f584946 	svcpl	0x00584946
     664:	5f00205f 	svcpl	0x0000205f
     668:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
     66c:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ 59c <_Min_Stack_Size+0x19c>
     670:	5f544e41 	svcpl	0x00544e41
     674:	5f474944 	svcpl	0x00474944
     678:	3335205f 	teqcc	r5, #95	@ 0x5f
     67c:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffff784 <_estack+0xdfffcf84>
     680:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
     684:	435f5841 	cmpmi	pc, #4259840	@ 0x410000
     688:	20296328 	eorcs	r6, r9, r8, lsr #6
     68c:	23232063 			@ <UNDEFINED> instruction: 0x23232063
     690:	4c4c5520 	cfstr64mi	mvdx5, [ip], {32}
     694:	425f5f00 	subsmi	r5, pc, #0, 30
     698:	5f455459 	svcpl	0x00455459
     69c:	4544524f 	strbmi	r5, [r4, #-591]	@ 0xfffffdb1
     6a0:	205f5f52 	subscs	r5, pc, r2, asr pc	@ <UNPREDICTABLE>
     6a4:	524f5f5f 	subpl	r5, pc, #380	@ 0x17c
     6a8:	5f524544 	svcpl	0x00524544
     6ac:	5454494c 	ldrbpl	r4, [r4], #-2380	@ 0xfffff6b4
     6b0:	455f454c 	ldrbmi	r4, [pc, #-1356]	@ 16c <_Min_Heap_Size-0x94>
     6b4:	4149444e 	cmpmi	r9, lr, asr #8
     6b8:	005f5f4e 	subseq	r5, pc, lr, asr #30
     6bc:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     6c0:	5f323354 	svcpl	0x00323354
     6c4:	5f4e494d 	svcpl	0x004e494d
     6c8:	455f3031 	ldrbmi	r3, [pc, #-49]	@ 69f <_Min_Stack_Size+0x29f>
     6cc:	5f5f5058 	svcpl	0x005f5058
     6d0:	332d2820 			@ <UNDEFINED> instruction: 0x332d2820
     6d4:	5f002937 	svcpl	0x00002937
     6d8:	52464c5f 	subpl	r4, r6, #24320	@ 0x5f00
     6dc:	5f544341 	svcpl	0x00544341
     6e0:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
     6e4:	30205f5f 	eorcc	r5, r0, pc, asr pc
     6e8:	415f5f00 	cmpmi	pc, r0, lsl #30
     6ec:	415f4d52 	cmpmi	pc, r2, asr sp	@ <UNPREDICTABLE>
     6f0:	20484352 	subcs	r4, r8, r2, asr r3
     6f4:	5f5f0037 	svcpl	0x005f0037
     6f8:	43445453 	movtmi	r5, #17491	@ 0x4453
     6fc:	4654555f 			@ <UNDEFINED> instruction: 0x4654555f
     700:	5f32335f 	svcpl	0x0032335f
     704:	0031205f 	eorseq	r2, r1, pc, asr r0
     708:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
     70c:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
     710:	31545341 	cmpcc	r4, r1, asr #6
     714:	414d5f36 	cmpmi	sp, r6, lsr pc
     718:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
     71c:	66377830 			@ <UNDEFINED> instruction: 0x66377830
     720:	5f006666 	svcpl	0x00006666
     724:	4843535f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
     728:	4d5f5241 	lfmmi	f5, 2, [pc, #-260]	@ 62c <_Min_Stack_Size+0x22c>
     72c:	5f5f5841 	svcpl	0x005f5841
     730:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
     734:	5f5f0066 	svcpl	0x005f0066
     738:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
     73c:	4f4e5f34 	svcmi	0x004e5f34
     740:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 600 <_Min_Stack_Size+0x200>
     744:	5f5f5841 	svcpl	0x005f5841
     748:	372e3120 	strcc	r3, [lr, -r0, lsr #2]!
     74c:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
     750:	34333133 	ldrtcc	r3, [r3], #-307	@ 0xfffffecd
     754:	33323638 	teqcc	r2, #56, 12	@ 0x3800000
     758:	65373531 	ldrvs	r3, [r7, #-1329]!	@ 0xfffffacf
     75c:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
     760:	00343646 	eorseq	r3, r4, r6, asr #12
     764:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
     768:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
     76c:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
     770:	554e5f45 	strbpl	r5, [lr, #-3909]	@ 0xfffff0bb
     774:	4952454d 	ldmdbmi	r2, {r0, r2, r3, r6, r8, sl, lr}^
     778:	414d5f43 	cmpmi	sp, r3, asr #30
