NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     77c:	4e494d58 	mcrmi	13, 2, r4, cr9, cr8, {2}
     780:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffff888 <_estack+0xdfffd088>
     784:	52464c4c 	subpl	r4, r6, #76, 24	@ 0x4c00
     788:	5f544341 	svcpl	0x00544341
     78c:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
     790:	30205f5f 	eorcc	r5, r0, pc, asr pc
     794:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     798:	3436544c 	ldrtcc	r5, [r6], #-1100	@ 0xfffffbb4
     79c:	4749445f 	smlsldmi	r4, r9, pc, r4	@ <UNPREDICTABLE>
     7a0:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
     7a4:	5f5f0035 	svcpl	0x005f0035
     7a8:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	@ 6ac <_Min_Stack_Size+0x2ac>
     7ac:	525f4349 	subspl	r4, pc, #603979777	@ 0x24000001
     7b0:	58414c45 	stmdapl	r1, {r0, r2, r6, sl, fp, lr}^
     7b4:	30204445 	eorcc	r4, r0, r5, asr #8
     7b8:	415f5f00 	cmpmi	pc, r0, lsl #30
     7bc:	465f4d52 			@ <UNDEFINED> instruction: 0x465f4d52
     7c0:	55544145 	ldrbpl	r4, [r4, #-325]	@ 0xfffffebb
     7c4:	465f4552 			@ <UNDEFINED> instruction: 0x465f4552
     7c8:	5f363150 	svcpl	0x00363150
     7cc:	004c4d46 	subeq	r4, ip, r6, asr #26
     7d0:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
     7d4:	4d5f455a 	cfldr64mi	mvdx4, [pc, #-360]	@ 674 <_Min_Stack_Size+0x274>
     7d8:	5f5f5841 	svcpl	0x005f5841
     7dc:	66783020 	ldrbtvs	r3, [r8], -r0, lsr #32
     7e0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     7e4:	55666666 	strbpl	r6, [r6, #-1638]!	@ 0xfffff99a
     7e8:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
     7ec:	5f4c4244 	svcpl	0x004c4244
     7f0:	495f5349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
     7f4:	365f4345 	ldrbcc	r4, [pc], -r5, asr #6
     7f8:	39353530 	ldmdbcc	r5!, {r4, r5, r8, sl, ip, sp}
     7fc:	32205f5f 	eorcc	r5, r0, #380	@ 0x17c
     800:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
     804:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
     808:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     80c:	205f5f4e 	subscs	r5, pc, lr, asr #30
     810:	58302d28 	ldmdapl	r0!, {r3, r5, r8, sl, fp, sp}
     814:	31335031 	teqcc	r3, r1, lsr r0
     818:	302d4b4c 	eorcc	r4, sp, ip, asr #22
     81c:	33503158 	cmpcc	r0, #88, 2
     820:	294b4c31 	stmdbcs	fp, {r0, r4, r5, sl, fp, lr}^
     824:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffff92c <_estack+0xdfffd12c>
     828:	43414c4c 	movtmi	r4, #7244	@ 0x1c4c
     82c:	5f4d5543 	svcpl	0x004d5543
     830:	5f58414d 	svcpl	0x0058414d
     834:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
     838:	46464646 	strbmi	r4, [r6], -r6, asr #12
     83c:	46464646 	strbmi	r4, [r6], -r6, asr #12
     840:	46464646 	strbmi	r4, [r6], -r6, asr #12
     844:	46464646 	strbmi	r4, [r6], -r6, asr #12
     848:	32332d50 	eorscc	r2, r3, #80, 26	@ 0x1400
     84c:	4b4c4c55 	blmi	13139a8 <_Min_Stack_Size+0x13135a8>
     850:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffff958 <_estack+0xdfffd158>
     854:	4343414c 	movtmi	r4, #12620	@ 0x314c
     858:	4d5f4d55 	ldclmi	13, cr4, [pc, #-340]	@ 70c <_Min_Stack_Size+0x30c>
     85c:	5f5f4e49 	svcpl	0x005f4e49
     860:	302e3020 	eorcc	r3, lr, r0, lsr #32
     864:	004b4c55 	subeq	r4, fp, r5, asr ip
     868:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     86c:	41485f54 	cmpmi	r8, r4, asr pc
     870:	4e495f53 	mcrmi	15, 2, r5, cr9, cr3, {2}
     874:	494e4946 	stmdbmi	lr, {r1, r2, r6, r8, fp, lr}^
     878:	5f5f5954 	svcpl	0x005f5954
     87c:	5f003120 	svcpl	0x00003120
     880:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
     884:	455f3233 	ldrbmi	r3, [pc, #-563]	@ 659 <_Min_Stack_Size+0x259>
     888:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
     88c:	5f5f4e4f 	svcpl	0x005f4e4f
     890:	312e3120 			@ <UNDEFINED> instruction: 0x312e3120
     894:	39303239 	ldmdbcc	r0!, {r0, r3, r4, r5, r9, ip, sp}
     898:	35393832 	ldrcc	r3, [r9, #-2098]!	@ 0xfffff7ce
     89c:	38373035 	ldmdacc	r7!, {r0, r2, r4, r5, ip, sp}
     8a0:	65353231 	ldrvs	r3, [r5, #-561]!	@ 0xfffffdcf
     8a4:	3346372d 	movtcc	r3, #26413	@ 0x672d
     8a8:	5f5f0032 	svcpl	0x005f0032
     8ac:	5f414455 	svcpl	0x00414455
     8b0:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
     8b4:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
     8b8:	5f5f0032 	svcpl	0x005f0032
     8bc:	5f544e49 	svcpl	0x00544e49
     8c0:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
     8c4:	545f3436 	ldrbpl	r3, [pc], #-1078	@ 8cc <_Min_Stack_Size+0x4cc>
     8c8:	5f455059 	svcpl	0x00455059
     8cc:	6f6c205f 	svcvs	0x006c205f
     8d0:	6c20676e 	stcvs	7, cr6, [r0], #-440	@ 0xfffffe48
     8d4:	20676e6f 	rsbcs	r6, r7, pc, ror #28
     8d8:	00746e69 	rsbseq	r6, r4, r9, ror #28
     8dc:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
     8e0:	435f3854 	cmpmi	pc, #84, 16	@ 0x540000
     8e4:	20296328 	eorcs	r6, r9, r8, lsr #6
     8e8:	5f5f0063 	svcpl	0x005f0063
     8ec:	6d756874 	ldclvs	8, cr6, [r5, #-464]!	@ 0xfffffe30
     8f0:	5f5f3262 	svcpl	0x005f3262
     8f4:	5f003120 	svcpl	0x00003120
     8f8:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     8fc:	4232335f 	eorsmi	r3, r2, #2080374785	@ 0x7c000001
     900:	535f5449 	cmppl	pc, #1224736768	@ 0x49000000
     904:	45544154 	ldrbmi	r4, [r4, #-340]	@ 0xfffffeac
     908:	5f003120 	svcpl	0x00003120
     90c:	5044465f 	subpl	r4, r4, pc, asr r6
     910:	5f5f4349 	svcpl	0x005f4349
     914:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
     918:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
     91c:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
     920:	575f3631 	smmlarpl	pc, r1, r6, r3	@ <UNPREDICTABLE>
     924:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
     928:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
     92c:	4f430036 	svcmi	0x00430036
     930:	58455452 	stmdapl	r5, {r1, r4, r6, sl, ip, lr}^
     934:	20534f5f 	subscs	r4, r3, pc, asr pc
     938:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffffa40 <_estack+0xdfffd240>
     93c:	43414c4c 	movtmi	r4, #7244	@ 0x1c4c
     940:	5f4d5543 	svcpl	0x004d5543
     944:	5f4e494d 	svcpl	0x004e494d
     948:	2e30205f 	mrccs	0, 1, r2, cr0, cr15, {2}
     94c:	4c4c5530 	cfstr64mi	mvdx5, [ip], {48}	@ 0x30
     950:	5f5f004b 	svcpl	0x005f004b
     954:	5f4d5241 	svcpl	0x004d5241
     958:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
     95c:	5f455255 	svcpl	0x00455255
     960:	50544f44 	subspl	r4, r4, r4, asr #30
     964:	00444f52 	subeq	r4, r4, r2, asr pc
     968:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
     96c:	454e5f4d 	strbmi	r5, [lr, #-3917]	@ 0xfffff0b3
     970:	5f004e4f 	svcpl	0x00004e4f
     974:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     978:	4145465f 	cmpmi	r5, pc, asr r6
     97c:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
     980:	534d435f 	movtpl	r4, #54111	@ 0xd35f
     984:	5f5f0045 	svcpl	0x005f0045
     988:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
     98c:	5f525450 	svcpl	0x00525450
     990:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
     994:	75205f5f 	strvc	r5, [r0, #-3935]!	@ 0xfffff0a1
     998:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
     99c:	2064656e 	rsbcs	r6, r4, lr, ror #10
     9a0:	00746e69 	rsbseq	r6, r4, r9, ror #28
     9a4:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     9a8:	5f343654 	svcpl	0x00343654
     9ac:	495f5349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
     9b0:	365f4345 	ldrbcc	r4, [pc], -r5, asr #6
     9b4:	39353530 	ldmdbcc	r5!, {r4, r5, r8, sl, ip, sp}
     9b8:	32205f5f 	eorcc	r5, r0, #380	@ 0x17c
     9bc:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
     9c0:	3233544c 	eorscc	r5, r3, #76, 8	@ 0x4c000000
     9c4:	5341485f 	movtpl	r4, #6239	@ 0x185f
     9c8:	4e45445f 	mcrmi	4, 2, r4, cr5, cr15, {2}
     9cc:	5f4d524f 	svcpl	0x004d524f
     9d0:	0031205f 	eorseq	r2, r1, pc, asr r0
     9d4:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     9d8:	5f343654 	svcpl	0x00343654
     9dc:	4f4e4544 	svcmi	0x004e4544
     9e0:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 8a0 <_Min_Stack_Size+0x4a0>
     9e4:	5f5f4e49 	svcpl	0x005f4e49
     9e8:	392e3420 	stmdbcc	lr!, {r5, sl, ip, sp}
     9ec:	35363034 	ldrcc	r3, [r6, #-52]!	@ 0xffffffcc
     9f0:	38353436 	ldmdacc	r5!, {r1, r2, r4, r5, sl, ip, sp}
     9f4:	34323134 	ldrtcc	r3, [r2], #-308	@ 0xfffffecc
     9f8:	65343536 	ldrvs	r3, [r4, #-1334]!	@ 0xfffffaca
     9fc:	3432332d 	ldrtcc	r3, [r2], #-813	@ 0xfffffcd3
     a00:	00343646 	eorseq	r3, r4, r6, asr #12
     a04:	43475f5f 	movtmi	r5, #32607	@ 0x7f5f
     a08:	41485f43 	cmpmi	r8, r3, asr #30
     a0c:	535f4556 	cmppl	pc, #360710144	@ 0x15800000
     a10:	5f434e59 	svcpl	0x00434e59
     a14:	504d4f43 	subpl	r4, sp, r3, asr #30
     a18:	5f455241 	svcpl	0x00455241
     a1c:	5f444e41 	svcpl	0x00444e41
     a20:	50415753 	subpl	r5, r1, r3, asr r7
     a24:	3120315f 			@ <UNDEFINED> instruction: 0x3120315f
     a28:	535f5f00 	cmppl	pc, #0, 30
     a2c:	42495f41 	submi	r5, r9, #260	@ 0x104
     a30:	5f5f5449 	svcpl	0x005f5449
     a34:	00363120 	eorseq	r3, r6, r0, lsr #2
     a38:	4c4c5f5f 	mcrrmi	15, 5, r5, ip, cr15
     a3c:	43415246 	movtmi	r5, #4678	@ 0x1246
     a40:	414d5f54 	cmpmi	sp, r4, asr pc
     a44:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
     a48:	46375830 			@ <UNDEFINED> instruction: 0x46375830
     a4c:	46464646 	strbmi	r4, [r6], -r6, asr #12
     a50:	46464646 	strbmi	r4, [r6], -r6, asr #12
     a54:	46464646 	strbmi	r4, [r6], -r6, asr #12
     a58:	2d504646 	ldclcs	6, cr4, [r0, #-280]	@ 0xfffffee8
     a5c:	4c4c3336 	mcrrmi	3, 3, r3, ip, cr6
     a60:	5f5f0052 	svcpl	0x005f0052
     a64:	5f544e49 	svcpl	0x00544e49
     a68:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
     a6c:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ 99c <_Min_Stack_Size+0x59c>
     a70:	5f5f5841 	svcpl	0x005f5841
     a74:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
     a78:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     a7c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     a80:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     a84:	4c666666 	stclmi	6, cr6, [r6], #-408	@ 0xfffffe68
     a88:	5f5f004c 	svcpl	0x005f004c
     a8c:	5f4d5241 	svcpl	0x004d5241
     a90:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
     a94:	5f455255 	svcpl	0x00455255
     a98:	36315046 	ldrtcc	r5, [r1], -r6, asr #32
     a9c:	4143535f 	cmpmi	r3, pc, asr r3
     aa0:	5f52414c 	svcpl	0x0052414c
     aa4:	54495241 	strbpl	r5, [r9], #-577	@ 0xfffffdbf
     aa8:	54454d48 	strbpl	r4, [r5], #-3400	@ 0xfffff2b8
     aac:	5f004349 	svcpl	0x00004349
     ab0:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
     ab4:	4749445f 	smlsldmi	r4, r9, pc, r4	@ <UNPREDICTABLE>
     ab8:	36205f5f 	qsaxcc	r5, r0, pc	@ <UNPREDICTABLE>
     abc:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
     ac0:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
     ac4:	31545341 	cmpcc	r4, r1, asr #6
     ac8:	414d5f36 	cmpmi	sp, r6, lsr pc
     acc:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
     ad0:	66377830 			@ <UNDEFINED> instruction: 0x66377830
     ad4:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     ad8:	5f006666 	svcpl	0x00006666
     adc:	4343475f 	movtmi	r4, #14175	@ 0x375f
     ae0:	5641485f 			@ <UNDEFINED> instruction: 0x5641485f
     ae4:	59535f45 	ldmdbpl	r3, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
     ae8:	435f434e 	cmpmi	pc, #939524097	@ 0x38000001
     aec:	41504d4f 	cmpmi	r0, pc, asr #26
     af0:	415f4552 	cmpmi	pc, r2, asr r5	@ <UNPREDICTABLE>
     af4:	535f444e 	cmppl	pc, #1308622848	@ 0x4e000000
     af8:	5f504157 	svcpl	0x00504157
     afc:	00312032 	eorseq	r2, r1, r2, lsr r0
     b00:	41445f5f 	cmpmi	r4, pc, asr pc
     b04:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
     b08:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
     b0c:	5f003133 	svcpl	0x00003133
     b10:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     b14:	5a49535f 	bpl	1255898 <_Min_Stack_Size+0x1255498>
     b18:	5f464f45 	svcpl	0x00464f45
     b1c:	494e494d 	stmdbmi	lr, {r0, r2, r3, r6, r8, fp, lr}^
     b20:	5f4c414d 	svcpl	0x004c414d
     b24:	4d554e45 	ldclmi	14, cr4, [r5, #-276]	@ 0xfffffeec
     b28:	5f003120 	svcpl	0x00003120
     b2c:	4553555f 	ldrbmi	r5, [r3, #-1375]	@ 0xfffffaa1
     b30:	4e495f53 	mcrmi	15, 2, r5, cr9, cr3, {2}
     b34:	49465449 	stmdbmi	r6, {r0, r3, r6, sl, ip, lr}^
     b38:	5f5f494e 	svcpl	0x005f494e
     b3c:	5f003120 	svcpl	0x00003120
     b40:	4343475f 	movtmi	r4, #14175	@ 0x375f
     b44:	4345495f 	movtmi	r4, #22879	@ 0x595f
     b48:	3935355f 	ldmdbcc	r5!, {r0, r1, r2, r3, r4, r6, r8, sl, ip, sp}
     b4c:	5f003020 	svcpl	0x00003020
     b50:	4153555f 	cmpmi	r3, pc, asr r5
     b54:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
     b58:	5350455f 	cmppl	r0, #398458880	@ 0x17c00000
     b5c:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
     b60:	30205f5f 	eorcc	r5, r0, pc, asr pc
     b64:	2d503178 	ldfcse	f3, [r0, #-480]	@ 0xfffffe20
     b68:	4b485538 	blmi	1216050 <_Min_Stack_Size+0x1215c50>
     b6c:	505f5f00 	subspl	r5, pc, r0, lsl #30
     b70:	49445254 	stmdbmi	r4, {r2, r4, r6, r9, ip, lr}^
     b74:	4d5f4646 	ldclmi	6, cr4, [pc, #-280]	@ a64 <_Min_Stack_Size+0x664>
     b78:	5f5f5841 	svcpl	0x005f5841
     b7c:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
     b80:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     b84:	00666666 	rsbeq	r6, r6, r6, ror #12
     b88:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     b8c:	5f323354 	svcpl	0x00323354
     b90:	5f534148 	svcpl	0x00534148
     b94:	45495551 	strbmi	r5, [r9, #-1361]	@ 0xfffffaaf
     b98:	414e5f54 	cmpmi	lr, r4, asr pc
     b9c:	205f5f4e 	subscs	r5, pc, lr, asr #30
     ba0:	5f5f0031 	svcpl	0x005f0031
     ba4:	43414c55 	movtmi	r4, #7253	@ 0x1c55
     ba8:	5f4d5543 	svcpl	0x004d5543
     bac:	5f58414d 	svcpl	0x0058414d
     bb0:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
     bb4:	46464646 	strbmi	r4, [r6], -r6, asr #12
     bb8:	46464646 	strbmi	r4, [r6], -r6, asr #12
     bbc:	46464646 	strbmi	r4, [r6], -r6, asr #12
     bc0:	46464646 	strbmi	r4, [r6], -r6, asr #12
     bc4:	32332d50 	eorscc	r2, r3, #80, 26	@ 0x1400
     bc8:	004b4c55 	subeq	r4, fp, r5, asr ip
     bcc:	46555f5f 	usaxmi	r5, r5, pc	@ <UNPREDICTABLE>
     bd0:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
     bd4:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
     bd8:	30205f5f 	eorcc	r5, r0, pc, asr pc
     bdc:	46464658 			@ <UNDEFINED> instruction: 0x46464658
     be0:	312d5046 			@ <UNDEFINED> instruction: 0x312d5046
     be4:	00525536 	subseq	r5, r2, r6, lsr r5
     be8:	46535f5f 	usaxmi	r5, r3, pc	@ <UNPREDICTABLE>
     bec:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
     bf0:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
     bf4:	30205f5f 	eorcc	r5, r0, pc, asr pc
     bf8:	50463758 	subpl	r3, r6, r8, asr r7
     bfc:	5248372d 	subpl	r3, r8, #11796480	@ 0xb40000
     c00:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
     c04:	5f43554e 	svcpl	0x0043554e
     c08:	3231205f 	eorscc	r2, r1, #95	@ 0x5f
     c0c:	415f5f00 	cmpmi	pc, r0, lsl #30
     c10:	455f4d52 	ldrbmi	r4, [pc, #-3410]	@ fffffec6 <_estack+0xdfffd6c6>
     c14:	5f494241 	svcpl	0x00494241
     c18:	0031205f 	eorseq	r2, r1, pc, asr r0
     c1c:	334d5453 	movtcc	r5, #54355	@ 0xd453
     c20:	00312032 	eorseq	r2, r1, r2, lsr r0
     c24:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
     c28:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
     c2c:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
     c30:	414d5f38 	cmpmi	sp, r8, lsr pc
     c34:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
     c38:	66667830 			@ <UNDEFINED> instruction: 0x66667830
     c3c:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
     c40:	3436544e 	ldrtcc	r5, [r6], #-1102	@ 0xfffffbb2
     c44:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
     c48:	30205f5f 	eorcc	r5, r0, pc, asr pc
     c4c:	66663778 			@ <UNDEFINED> instruction: 0x66663778
     c50:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     c54:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     c58:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     c5c:	004c4c66 	subeq	r4, ip, r6, ror #24
     c60:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
     c64:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ b1c <_Min_Stack_Size+0x71c>
     c68:	5f5f5841 	svcpl	0x005f5841
     c6c:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
     c70:	5f5f0066 	svcpl	0x005f0066
     c74:	52464c55 	subpl	r4, r6, #21760	@ 0x5500
     c78:	5f544341 	svcpl	0x00544341
     c7c:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
     c80:	5f4e4f4c 	svcpl	0x004e4f4c
     c84:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     c88:	332d5031 			@ <UNDEFINED> instruction: 0x332d5031
     c8c:	524c5532 	subpl	r5, ip, #209715200	@ 0xc800000
     c90:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
     c94:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
     c98:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
     c9c:	545f3233 	ldrbpl	r3, [pc], #-563	@ ca4 <_Min_Stack_Size+0x8a4>
     ca0:	5f455059 	svcpl	0x00455059
     ca4:	6f6c205f 	svcvs	0x006c205f
     ca8:	6920676e 	stmdbvs	r0!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}
     cac:	5f00746e 	svcpl	0x0000746e
     cb0:	464c555f 			@ <UNDEFINED> instruction: 0x464c555f
     cb4:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
     cb8:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
     cbc:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
     cc0:	5f5f0030 	svcpl	0x005f0030
     cc4:	5f515455 	svcpl	0x00515455
     cc8:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
     ccc:	30205f5f 	eorcc	r5, r0, pc, asr pc
     cd0:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffffdd8 <_estack+0xdfffd5d8>
     cd4:	52464c4c 	subpl	r4, r6, #76, 24	@ 0x4c00
     cd8:	5f544341 	svcpl	0x00544341
     cdc:	5f58414d 	svcpl	0x0058414d
     ce0:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
     ce4:	46464646 	strbmi	r4, [r6], -r6, asr #12
     ce8:	46464646 	strbmi	r4, [r6], -r6, asr #12
     cec:	46464646 	strbmi	r4, [r6], -r6, asr #12
     cf0:	46464646 	strbmi	r4, [r6], -r6, asr #12
     cf4:	34362d50 	ldrtcc	r2, [r6], #-3408	@ 0xfffff2b0
     cf8:	524c4c55 	subpl	r4, ip, #21760	@ 0x5500
     cfc:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffffe04 <_estack+0xdfffd604>
     d00:	5f544e49 	svcpl	0x00544e49
     d04:	5341454c 	movtpl	r4, #5452	@ 0x154c
     d08:	5f343654 	svcpl	0x00343654
     d0c:	5f58414d 	svcpl	0x0058414d
     d10:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     d14:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     d18:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     d1c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     d20:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     d24:	004c4c55 	subeq	r4, ip, r5, asr ip
     d28:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
     d2c:	41525f54 	cmpmi	r2, r4, asr pc
     d30:	5f584944 	svcpl	0x00584944
     d34:	0032205f 	eorseq	r2, r2, pc, asr r0
     d38:	4c555f5f 	mrrcmi	15, 5, r5, r5, cr15	@ <UNPREDICTABLE>
     d3c:	4152464c 	cmpmi	r2, ip, asr #12
     d40:	4d5f5443 	cfldrdmi	mvd5, [pc, #-268]	@ c3c <_Min_Stack_Size+0x83c>
     d44:	5f5f4e49 	svcpl	0x005f4e49
     d48:	302e3020 	eorcc	r3, lr, r0, lsr #32
     d4c:	524c4c55 	subpl	r4, ip, #21760	@ 0x5500
     d50:	445f5f00 	ldrbmi	r5, [pc], #-3840	@ d58 <_Min_Stack_Size+0x958>
     d54:	485f4c42 	ldmdami	pc, {r1, r6, sl, fp, lr}^	@ <UNPREDICTABLE>
     d58:	515f5341 	cmppl	pc, r1, asr #6
     d5c:	54454955 	strbpl	r4, [r5], #-2389	@ 0xfffff6ab
     d60:	4e414e5f 	mcrmi	14, 2, r4, cr1, cr15, {2}
     d64:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
     d68:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ fffffe70 <_estack+0xdfffd670>
     d6c:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
     d70:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
     d74:	205f5f4e 	subscs	r5, pc, lr, asr #30
     d78:	55302e30 	ldrpl	r2, [r0, #-3632]!	@ 0xfffff1d0
     d7c:	5f5f004b 	svcpl	0x005f004b
     d80:	4152464c 	cmpmi	r2, ip, asr #12
     d84:	455f5443 	ldrbmi	r5, [pc, #-1091]	@ 949 <_Min_Stack_Size+0x549>
     d88:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
     d8c:	5f5f4e4f 	svcpl	0x005f4e4f
     d90:	31783020 	cmncc	r8, r0, lsr #32
     d94:	31332d50 	teqcc	r3, r0, asr sp
     d98:	5f00524c 	svcpl	0x0000524c
     d9c:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
     da0:	5341465f 	movtpl	r4, #5727	@ 0x165f
     da4:	545f3854 	ldrbpl	r3, [pc], #-2132	@ dac <_Min_Stack_Size+0x9ac>
     da8:	5f455059 	svcpl	0x00455059
     dac:	6e69205f 	mcrvs	0, 3, r2, cr9, cr15, {2}
     db0:	5f5f0074 	svcpl	0x005f0074
     db4:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
     db8:	41485f34 	cmpmi	r8, r4, lsr pc
     dbc:	4e495f53 	mcrmi	15, 2, r5, cr9, cr3, {2}
     dc0:	494e4946 	stmdbmi	lr, {r1, r2, r6, r8, fp, lr}^
     dc4:	5f5f5954 	svcpl	0x005f5954
     dc8:	5f003120 	svcpl	0x00003120
     dcc:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
     dd0:	5f583233 	svcpl	0x00583233
     dd4:	4f4e4544 	svcmi	0x004e4544
     dd8:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ c98 <_Min_Stack_Size+0x898>
     ddc:	5f5f4e49 	svcpl	0x005f4e49
     de0:	392e3420 	stmdbcc	lr!, {r5, sl, ip, sp}
     de4:	35363034 	ldrcc	r3, [r6, #-52]!	@ 0xffffffcc
     de8:	38353436 	ldmdacc	r5!, {r1, r2, r4, r5, sl, ip, sp}
     dec:	34323134 	ldrtcc	r3, [r2], #-308	@ 0xfffffecc
     df0:	65343536 	ldrvs	r3, [r4, #-1334]!	@ 0xfffffaca
     df4:	3432332d 	ldrtcc	r3, [r2], #-813	@ 0xfffffcd3
     df8:	78323346 	ldmdavc	r2!, {r1, r2, r6, r8, r9, ip, sp}
     dfc:	535f5f00 	cmppl	pc, #0, 30
     e00:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
     e04:	42465f4d 	submi	r5, r6, #308	@ 0x134
     e08:	5f5f5449 	svcpl	0x005f5449
     e0c:	5f003720 	svcpl	0x00003720
     e10:	4843575f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
     e14:	545f5241 	ldrbpl	r5, [pc], #-577	@ e1c <_Min_Stack_Size+0xa1c>
     e18:	5f455059 	svcpl	0x00455059
     e1c:	6e75205f 	mrcvs	0, 3, r2, cr5, cr15, {2}
     e20:	6e676973 			@ <UNDEFINED> instruction: 0x6e676973
     e24:	69206465 	stmdbvs	r0!, {r0, r2, r5, r6, sl, sp, lr}
     e28:	5f00746e 	svcpl	0x0000746e
     e2c:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	@ 0x5f
     e30:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
     e34:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
     e38:	756f6428 	strbvc	r6, [pc, #-1064]!	@ a18 <_Min_Stack_Size+0x618>
     e3c:	29656c62 	stmdbcs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
     e40:	32322e32 	eorscc	r2, r2, #800	@ 0x320
     e44:	33373035 	teqcc	r7, #53	@ 0x35
     e48:	35383538 	ldrcc	r3, [r8, #-1336]!	@ 0xfffffac8
     e4c:	30323730 	eorscc	r3, r2, r0, lsr r7
     e50:	2d653431 	cfstrdcs	mvd3, [r5, #-196]!	@ 0xffffff3c
     e54:	4c383033 	ldcmi	0, cr3, [r8], #-204	@ 0xffffff34
     e58:	5f5f0029 	svcpl	0x005f0029
     e5c:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
     e60:	494d5f34 	stmdbmi	sp, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
     e64:	205f5f4e 	subscs	r5, pc, lr, asr #30
     e68:	32322e32 	eorscc	r2, r2, #800	@ 0x320
     e6c:	33373035 	teqcc	r7, #53	@ 0x35
     e70:	35383538 	ldrcc	r3, [r8, #-1336]!	@ 0xfffffac8
     e74:	30323730 	eorscc	r3, r2, r0, lsr r7
     e78:	2d653431 	cfstrdcs	mvd3, [r5, #-196]!	@ 0xffffff3c
     e7c:	46383033 			@ <UNDEFINED> instruction: 0x46383033
     e80:	5f003436 	svcpl	0x00003436
     e84:	4152465f 	cmpmi	r2, pc, asr r6
     e88:	4d5f5443 	cfldrdmi	mvd5, [pc, #-268]	@ d84 <_Min_Stack_Size+0x984>
     e8c:	5f5f4e49 	svcpl	0x005f4e49
     e90:	302d2820 	eorcc	r2, sp, r0, lsr #16
     e94:	2d52352e 	cfldr64cs	mvdx3, [r2, #-184]	@ 0xffffff48
     e98:	52352e30 	eorspl	r2, r5, #48, 28	@ 0x300
     e9c:	5f5f0029 	svcpl	0x005f0029
     ea0:	5f434347 	svcpl	0x00434347
     ea4:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	@ da8 <_Min_Stack_Size+0x9a8>
     ea8:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
     eac:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
     eb0:	5f4b434f 	svcpl	0x004b434f
     eb4:	45455246 	strbmi	r5, [r5, #-582]	@ 0xfffffdba
     eb8:	5f003220 	svcpl	0x00003220
     ebc:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
     ec0:	5f58414d 	svcpl	0x0058414d
     ec4:	5f58414d 	svcpl	0x0058414d
