NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     ec8:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     ecc:	66666637 			@ <UNDEFINED> instruction: 0x66666637
     ed0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     ed4:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     ed8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
     edc:	5f004c4c 	svcpl	0x00004c4c
     ee0:	4341555f 	movtmi	r5, #5471	@ 0x155f
     ee4:	5f4d5543 	svcpl	0x004d5543
     ee8:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
     eec:	5f4e4f4c 	svcpl	0x004e4f4c
     ef0:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
     ef4:	312d5031 			@ <UNDEFINED> instruction: 0x312d5031
     ef8:	004b5536 	subeq	r5, fp, r6, lsr r5
     efc:	43415f5f 	movtmi	r5, #8031	@ 0x1f5f
     f00:	5f4d5543 	svcpl	0x004d5543
     f04:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
     f08:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
     f0c:	5f5f0036 	svcpl	0x005f0036
     f10:	4c42444c 	cfstrdmi	mvd4, [r2], {76}	@ 0x4c
     f14:	4e45445f 	mcrmi	4, 2, r4, cr5, cr15, {2}
     f18:	5f4d524f 	svcpl	0x004d524f
     f1c:	5f4e494d 	svcpl	0x004e494d
     f20:	2e34205f 	mrccs	0, 1, r2, cr4, cr15, {2}
     f24:	36303439 			@ <UNDEFINED> instruction: 0x36303439
     f28:	35343635 	ldrcc	r3, [r4, #-1589]!	@ 0xfffff9cb
     f2c:	32313438 	eorscc	r3, r1, #56, 8	@ 0x38000000
     f30:	34353634 	ldrtcc	r3, [r5], #-1588	@ 0xfffff9cc
     f34:	32332d65 	eorscc	r2, r3, #6464	@ 0x1940
     f38:	5f004c34 	svcpl	0x00004c34
     f3c:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
     f40:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ e70 <_Min_Stack_Size+0xa70>
     f44:	315f5841 	cmpcc	pc, r1, asr #16
     f48:	58455f30 	stmdapl	r5, {r4, r5, r8, r9, sl, fp, ip, lr}^
     f4c:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
     f50:	00383033 	eorseq	r3, r8, r3, lsr r0
     f54:	41535f5f 	cmpmi	r3, pc, asr pc
     f58:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
     f5c:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
     f60:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
     f64:	5f5f0038 	svcpl	0x005f0038
     f68:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
     f6c:	505f464f 	subspl	r4, pc, pc, asr #12
     f70:	49445254 	stmdbmi	r4, {r2, r4, r6, r9, ip, lr}^
     f74:	545f4646 	ldrbpl	r4, [pc], #-1606	@ f7c <_Min_Stack_Size+0xb7c>
     f78:	34205f5f 	strtcc	r5, [r0], #-3935	@ 0xfffff0a1
     f7c:	535f5f00 	cmppl	pc, #0, 30
     f80:	43415246 	movtmi	r5, #4678	@ 0x1246
     f84:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
     f88:	205f5f4e 	subscs	r5, pc, lr, asr #30
     f8c:	2e302d28 	cdpcs	13, 3, cr2, cr0, cr8, {1}
     f90:	2d524835 	ldclcs	8, cr4, [r2, #-212]	@ 0xffffff2c
     f94:	48352e30 	ldmdami	r5!, {r4, r5, r9, sl, fp, sp}
     f98:	5f002952 	svcpl	0x00002952
     f9c:	4153555f 	cmpmi	r3, pc, asr r5
     fa0:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
     fa4:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
     fa8:	5f003631 	svcpl	0x00003631
     fac:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     fb0:	4352415f 	cmpmi	r2, #-1073741801	@ 0xc0000017
     fb4:	58455f48 	stmdapl	r5, {r3, r6, r8, r9, sl, fp, ip, lr}^
     fb8:	44495f54 	strbmi	r5, [r9], #-3924	@ 0xfffff0ac
     fbc:	5f5f5649 	svcpl	0x005f5649
     fc0:	5f003120 	svcpl	0x00003120
     fc4:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
     fc8:	4145465f 	cmpmi	r5, pc, asr r6
     fcc:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
     fd0:	414e555f 	cmpmi	lr, pc, asr r5
     fd4:	4e47494c 	vmlsmi.f16	s9, s14, s24	@ <UNPREDICTABLE>
     fd8:	31204445 			@ <UNDEFINED> instruction: 0x31204445
     fdc:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ e4 <_Min_Heap_Size-0x11c>
     fe0:	33544e49 	cmpcc	r4, #1168	@ 0x490
     fe4:	28435f32 	stmdacs	r3, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
     fe8:	63202963 			@ <UNDEFINED> instruction: 0x63202963
     fec:	20232320 	eorcs	r2, r3, r0, lsr #6
     ff0:	5f004c55 	svcpl	0x00004c55
     ff4:	4144555f 	cmpmi	r4, pc, asr r5
     ff8:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
     ffc:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    1000:	42003233 	andmi	r3, r0, #805306371	@ 0x30000003
    1004:	61467375 	hvcvs	26421	@ 0x6735
    1008:	5f746c75 	svcpl	0x00746c75
    100c:	646e6148 	strbtvs	r6, [lr], #-328	@ 0xfffffeb8
    1010:	0072656c 	rsbseq	r6, r2, ip, ror #10
    1014:	48545f5f 	ldmdami	r4, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1018:	45424d55 	strbmi	r4, [r2, #-3413]	@ 0xfffff2ab
    101c:	205f5f4c 	subscs	r5, pc, ip, asr #30
    1020:	5f5f0031 	svcpl	0x005f0031
    1024:	47474942 	strbmi	r4, [r7, -r2, asr #18]
    1028:	5f545345 	svcpl	0x00545345
    102c:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    1030:	4e454d4e 	cdpmi	13, 4, cr4, cr5, cr14, {2}
    1034:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    1038:	5f5f0038 	svcpl	0x005f0038
    103c:	4343414c 	movtmi	r4, #12620	@ 0x314c
    1040:	495f4d55 	ldmdbmi	pc, {r0, r2, r4, r6, r8, sl, fp, lr}^	@ <UNPREDICTABLE>
    1044:	5f544942 	svcpl	0x00544942
    1048:	3233205f 	eorscc	r2, r3, #95	@ 0x5f
    104c:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 154 <_Min_Heap_Size-0xac>
    1050:	41524653 	cmpmi	r2, r3, asr r6
    1054:	4d5f5443 	cfldrdmi	mvd5, [pc, #-268]	@ f50 <_Min_Stack_Size+0xb50>
    1058:	5f5f5841 	svcpl	0x005f5841
    105c:	46583020 	ldrbmi	r3, [r8], -r0, lsr #32
    1060:	382d5046 	stmdacc	sp!, {r1, r2, r6, ip, lr}
    1064:	00524855 	subseq	r4, r2, r5, asr r8
    1068:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    106c:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    1070:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
    1074:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    1078:	30205f5f 	eorcc	r5, r0, pc, asr pc
    107c:	66666678 			@ <UNDEFINED> instruction: 0x66666678
    1080:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1084:	5f005566 	svcpl	0x00005566
    1088:	44524f5f 	ldrbmi	r4, [r2], #-3935	@ 0xfffff0a1
    108c:	4c5f5245 	lfmmi	f5, 2, [pc], {69}	@ 0x45
    1090:	4c545449 	cfldrdmi	mvd5, [r4], {73}	@ 0x49
    1094:	4e455f45 	cdpmi	15, 4, cr5, cr5, cr5, {2}
    1098:	4e414944 	vmlsmi.f16	s9, s2, s8	@ <UNPREDICTABLE>
    109c:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    10a0:	00343332 	eorseq	r3, r4, r2, lsr r3
    10a4:	41485f5f 	cmpmi	r8, pc, asr pc
    10a8:	535f4556 	cmppl	pc, #360710144	@ 0x15800000
    10ac:	55434550 	strbpl	r4, [r3, #-1360]	@ 0xfffffab0
    10b0:	4954414c 	ldmdbmi	r4, {r2, r3, r6, r8, lr}^
    10b4:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    10b8:	5f454641 	svcpl	0x00454641
    10bc:	554c4156 	strbpl	r4, [ip, #-342]	@ 0xfffffeaa
    10c0:	00312045 	eorseq	r2, r1, r5, asr #32
    10c4:	4c4c5f5f 	mcrrmi	15, 5, r5, ip, cr15
    10c8:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
    10cc:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    10d0:	205f5f4e 	subscs	r5, pc, lr, asr #30
    10d4:	58302d28 	ldmdapl	r0!, {r3, r5, r8, sl, fp, sp}
    10d8:	31335031 	teqcc	r3, r1, lsr r0
    10dc:	2d4b4c4c 	stclcs	12, cr4, [fp, #-304]	@ 0xfffffed0
    10e0:	50315830 	eorspl	r5, r1, r0, lsr r8
    10e4:	4c4c3133 	stfmie	f3, [ip], {51}	@ 0x33
    10e8:	5f00294b 	svcpl	0x0000294b
    10ec:	5f41535f 	svcpl	0x0041535f
    10f0:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    10f4:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    10f8:	5f5f0035 	svcpl	0x005f0035
    10fc:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
    1100:	494d5f34 	stmdbmi	sp, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    1104:	30315f4e 	eorscc	r5, r1, lr, asr #30
    1108:	5058455f 	subspl	r4, r8, pc, asr r5
    110c:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    1110:	3730332d 	ldrcc	r3, [r0, -sp, lsr #6]!
    1114:	5f5f0029 	svcpl	0x005f0029
    1118:	43434153 	movtmi	r4, #12627	@ 0x3153
    111c:	455f4d55 	ldrbmi	r4, [pc, #-3413]	@ 3cf <_Min_Heap_Size+0x1cf>
    1120:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    1124:	5f5f4e4f 	svcpl	0x005f4e4f
    1128:	31783020 	cmncc	r8, r0, lsr #32
    112c:	48372d50 	ldmdami	r7!, {r4, r6, r8, sl, fp, sp}
    1130:	5f5f004b 	svcpl	0x005f004b
    1134:	5f544e49 	svcpl	0x00544e49
    1138:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    113c:	545f3631 	ldrbpl	r3, [pc], #-1585	@ 1144 <_Min_Stack_Size+0xd44>
    1140:	5f455059 	svcpl	0x00455059
    1144:	6e69205f 	mcrvs	0, 3, r2, cr9, cr15, {2}
    1148:	5f5f0074 	svcpl	0x005f0074
    114c:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    1150:	45445f32 	strbmi	r5, [r4, #-3890]	@ 0xfffff0ce
    1154:	414d4943 	cmpmi	sp, r3, asr #18
    1158:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    115c:	205f5f47 	subscs	r5, pc, r7, asr #30
    1160:	5f5f0039 	svcpl	0x005f0039
    1164:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    1168:	545f3631 	ldrbpl	r3, [pc], #-1585	@ 1170 <_Min_Stack_Size+0xd70>
    116c:	5f455059 	svcpl	0x00455059
    1170:	6873205f 	ldmdavs	r3!, {r0, r1, r2, r3, r4, r6, sp}^
    1174:	2074726f 	rsbscs	r7, r4, pc, ror #4
    1178:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    117c:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    1180:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    1184:	575f5f00 	ldrbpl	r5, [pc, -r0, lsl #30]
    1188:	52414843 	subpl	r4, r1, #4390912	@ 0x430000
    118c:	4449575f 	strbmi	r5, [r9], #-1887	@ 0xfffff8a1
    1190:	5f5f4854 	svcpl	0x005f4854
    1194:	00323320 	eorseq	r3, r2, r0, lsr #6
    1198:	43475f5f 	movtmi	r5, #32607	@ 0x7f5f
    119c:	54415f43 	strbpl	r5, [r1], #-3907	@ 0xfffff0bd
    11a0:	43494d4f 	movtmi	r4, #40271	@ 0x9d4f
    11a4:	4148435f 	cmpmi	r8, pc, asr r3
    11a8:	4f4c5f52 	svcmi	0x004c5f52
    11ac:	465f4b43 	ldrbmi	r4, [pc], -r3, asr #22
    11b0:	20454552 	subcs	r4, r5, r2, asr r5
    11b4:	5f5f0032 	svcpl	0x005f0032
    11b8:	5f514855 	svcpl	0x00514855
    11bc:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    11c0:	30205f5f 	eorcc	r5, r0, pc, asr pc
    11c4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 2cc <_Min_Heap_Size+0xcc>
    11c8:	43415246 	movtmi	r5, #4678	@ 0x1246
    11cc:	42465f54 	submi	r5, r6, #84, 30	@ 0x150
    11d0:	5f5f5449 	svcpl	0x005f5449
    11d4:	00363120 	eorseq	r3, r6, r0, lsr #2
    11d8:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    11dc:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
    11e0:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
    11e4:	4c435f45 	mcrrmi	15, 4, r5, r3, cr5
    11e8:	0031205a 	eorseq	r2, r1, sl, asr r0
    11ec:	4f4c5f5f 	svcmi	0x004c5f5f
    11f0:	4c5f474e 	mrrcmi	7, 4, r4, pc, cr14	@ <UNPREDICTABLE>
    11f4:	5f474e4f 	svcpl	0x00474e4f
    11f8:	5f58414d 	svcpl	0x0058414d
    11fc:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    1200:	66666637 			@ <UNDEFINED> instruction: 0x66666637
    1204:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1208:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    120c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1210:	5f004c4c 	svcpl	0x00004c4c
    1214:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    1218:	545f3436 	ldrbpl	r3, [pc], #-1078	@ 1220 <_Min_Stack_Size+0xe20>
    121c:	5f455059 	svcpl	0x00455059
    1220:	6f6c205f 	svcvs	0x006c205f
    1224:	6c20676e 	stcvs	7, cr6, [r0], #-440	@ 0xfffffe48
    1228:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    122c:	00746e69 	rsbseq	r6, r4, r9, ror #28
    1230:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    1234:	414d5f54 	cmpmi	sp, r4, asr pc
    1238:	30315f58 	eorscc	r5, r1, r8, asr pc
    123c:	5058455f 	subspl	r4, r8, pc, asr r5
    1240:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    1244:	5f5f0038 	svcpl	0x005f0038
    1248:	43414c4c 	movtmi	r4, #7244	@ 0x1c4c
    124c:	5f4d5543 	svcpl	0x004d5543
    1250:	5f58414d 	svcpl	0x0058414d
    1254:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    1258:	46464637 			@ <UNDEFINED> instruction: 0x46464637
    125c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    1260:	46464646 	strbmi	r4, [r6], -r6, asr #12
    1264:	46464646 	strbmi	r4, [r6], -r6, asr #12
    1268:	31332d50 	teqcc	r3, r0, asr sp
    126c:	004b4c4c 	subeq	r4, fp, ip, asr #24
    1270:	4c4c5f5f 	mcrrmi	15, 5, r5, ip, cr15
    1274:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
    1278:	50455f4d 	subpl	r5, r5, sp, asr #30
    127c:	4f4c4953 	svcmi	0x004c4953
    1280:	205f5f4e 	subscs	r5, pc, lr, asr #30
    1284:	50317830 	eorspl	r7, r1, r0, lsr r8
    1288:	4c31332d 	ldcmi	3, cr3, [r1], #-180	@ 0xffffff4c
    128c:	5f004b4c 	svcpl	0x00004b4c
    1290:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    1294:	4145465f 	cmpmi	r5, pc, asr r6
    1298:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
    129c:	504f435f 	subpl	r4, pc, pc, asr r3	@ <UNPREDICTABLE>
    12a0:	00434f52 	subeq	r4, r3, r2, asr pc
    12a4:	4c555f5f 	mrrcmi	15, 5, r5, r5, cr15	@ <UNPREDICTABLE>
    12a8:	43415246 	movtmi	r5, #4678	@ 0x1246
    12ac:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    12b0:	205f5f4e 	subscs	r5, pc, lr, asr #30
    12b4:	55302e30 	ldrpl	r2, [r0, #-3632]!	@ 0xfffff1d0
    12b8:	5f00524c 	svcpl	0x0000524c
    12bc:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    12c0:	4e414d5f 	mcrmi	13, 2, r4, cr1, cr15, {2}
    12c4:	49445f54 	stmdbmi	r4, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    12c8:	205f5f47 	subscs	r5, pc, r7, asr #30
    12cc:	5f003432 	svcpl	0x00003432
    12d0:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    12d4:	4352415f 	cmpmi	r2, #-1073741801	@ 0xc0000017
    12d8:	5f5f0048 	svcpl	0x005f0048
    12dc:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
    12e0:	45445f34 	strbmi	r5, [r4, #-3892]	@ 0xfffff0cc
    12e4:	414d4943 	cmpmi	sp, r3, asr #18
    12e8:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    12ec:	205f5f47 	subscs	r5, pc, r7, asr #30
    12f0:	5f003731 	svcpl	0x00003731
    12f4:	4343475f 	movtmi	r4, #14175	@ 0x375f
    12f8:	5641485f 			@ <UNDEFINED> instruction: 0x5641485f
    12fc:	59535f45 	ldmdbpl	r3, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    1300:	435f434e 	cmpmi	pc, #939524097	@ 0x38000001
    1304:	41504d4f 	cmpmi	r0, pc, asr #26
    1308:	415f4552 	cmpmi	pc, r2, asr r5	@ <UNPREDICTABLE>
    130c:	535f444e 	cmppl	pc, #1308622848	@ 0x4e000000
    1310:	5f504157 	svcpl	0x00504157
    1314:	00312034 	eorseq	r2, r1, r4, lsr r0
    1318:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    131c:	5f323354 	svcpl	0x00323354
    1320:	5f4e494d 	svcpl	0x004e494d
    1324:	5f505845 	svcpl	0x00505845
    1328:	2d28205f 	stccs	0, cr2, [r8, #-380]!	@ 0xfffffe84
    132c:	29353231 	ldmdbcs	r5!, {r0, r4, r5, r9, ip, sp}
    1330:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 438 <_Min_Stack_Size+0x38>
    1334:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
    1338:	42495f4d 	submi	r5, r9, #308	@ 0x134
    133c:	5f5f5449 	svcpl	0x005f5449
    1340:	00363120 	eorseq	r3, r6, r0, lsr #2
    1344:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1348:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    134c:	31545341 	cmpcc	r4, r1, asr #6
    1350:	414d5f36 	cmpmi	sp, r6, lsr pc
    1354:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    1358:	66667830 			@ <UNDEFINED> instruction: 0x66667830
    135c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1360:	00556666 	subseq	r6, r5, r6, ror #12
    1364:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1368:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    136c:	31545341 	cmpcc	r4, r1, asr #6
    1370:	59545f36 	ldmdbpl	r4, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    1374:	5f5f4550 	svcpl	0x005f4550
    1378:	736e7520 	cmnvc	lr, #32, 10	@ 0x8000000
    137c:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    1380:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
    1384:	5f5f0074 	svcpl	0x005f0074
    1388:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    138c:	414d5f32 	cmpmi	sp, r2, lsr pc
    1390:	58455f58 	stmdapl	r5, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1394:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
    1398:	00383231 	eorseq	r3, r8, r1, lsr r2
    139c:	42445f5f 	submi	r5, r4, #380	@ 0x17c
    13a0:	494d5f4c 	stmdbmi	sp, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    13a4:	30315f4e 	eorscc	r5, r1, lr, asr #30
    13a8:	5058455f 	subspl	r4, r8, pc, asr r5
    13ac:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    13b0:	3730332d 	ldrcc	r3, [r0, -sp, lsr #6]!
    13b4:	5f5f0029 	svcpl	0x005f0029
    13b8:	43415355 	movtmi	r5, #4949	@ 0x1355
    13bc:	5f4d5543 	svcpl	0x004d5543
    13c0:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    13c4:	38205f5f 	stmdacc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    13c8:	545f5f00 	ldrbpl	r5, [pc], #-3840	@ 13d0 <_Min_Stack_Size+0xfd0>
    13cc:	424d5548 	submi	r5, sp, #72, 10	@ 0x12000000
    13d0:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    13d4:	4f575245 	svcmi	0x00575245
    13d8:	5f5f4b52 	svcpl	0x005f4b52
    13dc:	5f003120 	svcpl	0x00003120
    13e0:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    13e4:	445f3233 	ldrbmi	r3, [pc], #-563	@ 13ec <_Min_Stack_Size+0xfec>
    13e8:	5f5f4749 	svcpl	0x005f4749
    13ec:	5f003620 	svcpl	0x00003620
    13f0:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    13f4:	485f3436 	ldmdami	pc, {r1, r2, r4, r5, sl, ip, sp}^	@ <UNPREDICTABLE>
    13f8:	445f5341 	ldrbmi	r5, [pc], #-833	@ 1400 <_Min_Stack_Size+0x1000>
    13fc:	524f4e45 	subpl	r4, pc, #1104	@ 0x450
    1400:	205f5f4d 	subscs	r5, pc, sp, asr #30
    1404:	5f5f0031 	svcpl	0x005f0031
    1408:	5f544c46 	svcpl	0x00544c46
    140c:	4c415645 	mcrrmi	6, 4, r5, r1, cr5
    1410:	54454d5f 	strbpl	r4, [r5], #-3423	@ 0xfffff2a1
    1414:	5f444f48 	svcpl	0x00444f48
    1418:	0030205f 	eorseq	r2, r0, pc, asr r0
    141c:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    1420:	58323354 	ldmdapl	r2!, {r2, r4, r6, r8, r9, ip, sp}
    1424:	5341485f 	movtpl	r4, #6239	@ 0x185f
    1428:	4e45445f 	mcrmi	4, 2, r4, cr5, cr15, {2}
    142c:	5f4d524f 	svcpl	0x004d524f
    1430:	0031205f 	eorseq	r2, r1, pc, asr r0
    1434:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    1438:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    143c:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    1440:	414d5f34 	cmpmi	sp, r4, lsr pc
    1444:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    1448:	66377830 			@ <UNDEFINED> instruction: 0x66377830
    144c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1450:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1454:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1458:	4c4c6666 	mcrrmi	6, 6, r6, ip, cr6
    145c:	415f5f00 	cmpmi	pc, r0, lsl #30
    1460:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    1464:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    1468:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    146c:	5f003531 	svcpl	0x00003531
    1470:	4343475f 	movtmi	r4, #14175	@ 0x375f
    1474:	4f54415f 	svcmi	0x0054415f
    1478:	5f43494d 	svcpl	0x0043494d
    147c:	41484357 	cmpmi	r8, r7, asr r3
    1480:	5f545f52 	svcpl	0x00545f52
    1484:	4b434f4c 	blmi	10d51bc <_Min_Stack_Size+0x10d4dbc>
    1488:	4552465f 	ldrbmi	r4, [r2, #-1631]	@ 0xfffff9a1
    148c:	00322045 	eorseq	r2, r2, r5, asr #32
    1490:	4c555f5f 	mrrcmi	15, 5, r5, r5, cr15	@ <UNPREDICTABLE>
    1494:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
    1498:	42495f4d 	submi	r5, r9, #308	@ 0x134
    149c:	5f5f5449 	svcpl	0x005f5449
    14a0:	00323320 	eorseq	r3, r2, r0, lsr #6
    14a4:	4c4c5f5f 	mcrrmi	15, 5, r5, ip, cr15
    14a8:	43415246 	movtmi	r5, #4678	@ 0x1246
    14ac:	42465f54 	submi	r5, r6, #84, 30	@ 0x150
    14b0:	5f5f5449 	svcpl	0x005f5449
    14b4:	00333620 	eorseq	r3, r3, r0, lsr #12
    14b8:	43475f5f 	movtmi	r5, #32607	@ 0x7f5f
    14bc:	54415f43 	strbpl	r5, [r1], #-3907	@ 0xfffff0bd
    14c0:	43494d4f 	movtmi	r4, #40271	@ 0x9d4f
    14c4:	4f4c4c5f 	svcmi	0x004c4c5f
    14c8:	4c5f474e 	mrrcmi	7, 4, r4, pc, cr14	@ <UNPREDICTABLE>
    14cc:	5f4b434f 	svcpl	0x004b434f
    14d0:	45455246 	strbmi	r5, [r5, #-582]	@ 0xfffffdba
    14d4:	5f003120 	svcpl	0x00003120
    14d8:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    14dc:	41454c5f 	cmpmi	r5, pc, asr ip
    14e0:	5f385453 	svcpl	0x00385453
    14e4:	54444957 	strbpl	r4, [r4], #-2391	@ 0xfffff6a9
    14e8:	205f5f48 	subscs	r5, pc, r8, asr #30
    14ec:	5f5f0038 	svcpl	0x005f0038
    14f0:	5f415355 	svcpl	0x00415355
    14f4:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    14f8:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    14fc:	5f5f0036 	svcpl	0x005f0036
    1500:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    1504:	414d5f38 	cmpmi	sp, r8, lsr pc
    1508:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    150c:	66667830 			@ <UNDEFINED> instruction: 0x66667830
    1510:	2f3a4300 	svccs	0x003a4300
    1514:	72657355 	rsbvc	r7, r5, #1409286145	@ 0x54000001
    1518:	63782f73 	cmnvs	r8, #460	@ 0x1cc
    151c:	2f657469 	svccs	0x00657469
    1520:	44656e4f 	strbtmi	r6, [r5], #-3663	@ 0xfffff1b1
    1524:	65766972 	ldrbvs	r6, [r6, #-2418]!	@ 0xfffff68e
    1528:	7365442f 	cmnvc	r5, #788529152	@ 0x2f000000
    152c:	706f746b 	rsbvc	r7, pc, fp, ror #8
    1530:	61654c2f 	cmnvs	r5, pc, lsr #24
    1534:	69206e72 	stmdbvs	r0!, {r1, r4, r5, r6, r9, sl, fp, sp, lr}
    1538:	6564206e 	strbvs	r2, [r4, #-110]!	@ 0xffffff92
    153c:	2f687470 	svccs	0x00687470
    1540:	336d7453 	cmncc	sp, #1392508928	@ 0x53000000
    1544:	65442f32 	strbvs	r2, [r4, #-3890]	@ 0xfffff0ce
    1548:	00677562 	rsbeq	r7, r7, r2, ror #10
    154c:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1550:	3631544e 	ldrtcc	r5, [r1], -lr, asr #8
    1554:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    1558:	30205f5f 	eorcc	r5, r0, pc, asr pc
    155c:	66666678 			@ <UNDEFINED> instruction: 0x66666678
    1560:	45440066 	strbmi	r0, [r4, #-102]	@ 0xffffff9a
    1564:	20475542 	subcs	r5, r7, r2, asr #10
    1568:	5f5f0031 	svcpl	0x005f0031
    156c:	5f4d5241 	svcpl	0x004d5241
    1570:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
    1574:	5f455255 	svcpl	0x00455255
    1578:	00414d46 	subeq	r4, r1, r6, asr #26
    157c:	41555f5f 	cmpmi	r5, pc, asr pc
    1580:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    1584:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    1588:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    158c:	5f003631 	svcpl	0x00003631
    1590:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    1594:	45565f43 	ldrbmi	r5, [r6, #-3907]	@ 0xfffff0bd
    1598:	4f495352 	svcmi	0x00495352
    159c:	205f5f4e 	subscs	r5, pc, lr, asr #30
    15a0:	31313032 	teqcc	r1, r2, lsr r0
    15a4:	004c3231 	subeq	r3, ip, r1, lsr r2
    15a8:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    15ac:	58414d54 	stmdapl	r1, {r2, r4, r6, r8, sl, fp, lr}^
    15b0:	4449575f 	strbmi	r5, [r9], #-1887	@ 0xfffff8a1
    15b4:	5f5f4854 	svcpl	0x005f4854
    15b8:	00343620 	eorseq	r3, r4, r0, lsr #12
    15bc:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    15c0:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
    15c4:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
    15c8:	44435f45 	strbmi	r5, [r3], #-3909	@ 0xfffff0bb
    15cc:	5f5f0045 	svcpl	0x005f0045
    15d0:	4152464c 	cmpmi	r2, ip, asr #12
    15d4:	465f5443 	ldrbmi	r5, [pc], -r3, asr #8
    15d8:	5f544942 	svcpl	0x00544942
    15dc:	3133205f 	teqcc	r3, pc, asr r0
    15e0:	445f5f00 	ldrbmi	r5, [pc], #-3840	@ 15e8 <_Min_Stack_Size+0x11e8>
    15e4:	495f4c42 	ldmdbmi	pc, {r1, r6, sl, fp, lr}^	@ <UNPREDICTABLE>
    15e8:	45495f53 	strbmi	r5, [r9, #-3923]	@ 0xfffff0ad
    15ec:	30365f43 	eorscc	r5, r6, r3, asr #30
    15f0:	5f393535 	svcpl	0x00393535
    15f4:	0032205f 	eorseq	r2, r2, pc, asr r0
    15f8:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    15fc:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    1600:	31545341 	cmpcc	r4, r1, asr #6
    1604:	59545f36 	ldmdbpl	r4, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    1608:	5f5f4550 	svcpl	0x005f4550
    160c:	6f687320 	svcvs	0x00687320
    1610:	69207472 	stmdbvs	r0!, {r1, r4, r5, r6, sl, ip, sp, lr}
    1614:	5f00746e 	svcpl	0x0000746e
    1618:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
