NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    161c:	485f3436 	ldmdami	pc, {r1, r2, r4, r5, sl, ip, sp}^	@ <UNPREDICTABLE>
    1620:	515f5341 	cmppl	pc, r1, asr #6
    1624:	54454955 	strbpl	r4, [r5], #-2389	@ 0xfffff6ab
    1628:	4e414e5f 	mcrmi	14, 2, r4, cr1, cr15, {2}
    162c:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    1630:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    1634:	5f43554e 	svcpl	0x0043554e
    1638:	43445453 	movtmi	r5, #17491	@ 0x4453
    163c:	4c4e495f 	mcrrmi	9, 5, r4, lr, cr15	@ <UNPREDICTABLE>
    1640:	5f454e49 	svcpl	0x00454e49
    1644:	0031205f 	eorseq	r2, r1, pc, asr r0
    1648:	42445f5f 	submi	r5, r4, #380	@ 0x17c
    164c:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1650:	205f5f47 	subscs	r5, pc, r7, asr #30
    1654:	5f003531 	svcpl	0x00003531
    1658:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    165c:	5f5f4c45 	svcpl	0x005f4c45
    1660:	5f003120 	svcpl	0x00003120
    1664:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    1668:	4352415f 	cmpmi	r2, #-1073741801	@ 0xc0000017
    166c:	53495f48 	movtpl	r5, #40776	@ 0x9f48
    1670:	48545f41 	ldmdami	r4, {r0, r6, r8, r9, sl, fp, ip, lr}^
    1674:	00424d55 	subeq	r4, r2, r5, asr sp
    1678:	414c5f5f 	cmpmi	ip, pc, asr pc
    167c:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    1680:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    1684:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    1688:	5f003133 	svcpl	0x00003133
    168c:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    1690:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    1694:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    1698:	3537312e 	ldrcc	r3, [r7, #-302]!	@ 0xfffffed2
    169c:	33343934 	teqcc	r4, #52, 18	@ 0xd0000
    16a0:	32383035 	eorscc	r3, r8, #53	@ 0x35
    16a4:	37383232 			@ <UNDEFINED> instruction: 0x37383232
    16a8:	332d6535 			@ <UNDEFINED> instruction: 0x332d6535
    16ac:	5f004638 	svcpl	0x00004638
    16b0:	4343475f 	movtmi	r4, #14175	@ 0x375f
    16b4:	4f54415f 	svcmi	0x0054415f
    16b8:	5f43494d 	svcpl	0x0043494d
    16bc:	474e4f4c 	strbmi	r4, [lr, -ip, asr #30]
    16c0:	434f4c5f 	movtmi	r4, #64607	@ 0xfc5f
    16c4:	52465f4b 	subpl	r5, r6, #300	@ 0x12c
    16c8:	32204545 	eorcc	r4, r0, #289406976	@ 0x11400000
    16cc:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    16d0:	3233544c 	eorscc	r5, r3, #76, 8	@ 0x4c000000
    16d4:	49445f58 	stmdbmi	r4, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    16d8:	205f5f47 	subscs	r5, pc, r7, asr #30
    16dc:	5f003531 	svcpl	0x00003531
    16e0:	4343415f 	movtmi	r4, #12639	@ 0x315f
    16e4:	455f4d55 	ldrbmi	r4, [pc, #-3413]	@ 997 <_Min_Stack_Size+0x597>
    16e8:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    16ec:	5f5f4e4f 	svcpl	0x005f4e4f
    16f0:	31783020 	cmncc	r8, r0, lsr #32
    16f4:	35312d50 	ldrcc	r2, [r1, #-3408]!	@ 0xfffff2b0
    16f8:	5f5f004b 	svcpl	0x005f004b
    16fc:	5f514455 	svcpl	0x00514455
    1700:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    1704:	36205f5f 	qsaxcc	r5, r0, pc	@ <UNPREDICTABLE>
    1708:	5f5f0034 	svcpl	0x005f0034
    170c:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    1710:	4d5f5832 	ldclmi	8, cr5, [pc, #-200]	@ 1650 <_Min_Stack_Size+0x1250>
    1714:	5f544e41 	svcpl	0x00544e41
    1718:	5f474944 	svcpl	0x00474944
    171c:	3335205f 	teqcc	r5, #95	@ 0x5f
    1720:	415f5f00 	cmpmi	pc, r0, lsl #30
    1724:	415f4d52 	cmpmi	pc, r2, asr sp	@ <UNPREDICTABLE>
    1728:	5f484352 	svcpl	0x00484352
    172c:	5f415349 	svcpl	0x00415349
    1730:	4d554854 	ldclmi	8, cr4, [r5, #-336]	@ 0xfffffeb0
    1734:	00322042 	eorseq	r2, r2, r2, asr #32
    1738:	54555f5f 	ldrbpl	r5, [r5], #-3935	@ 0xfffff0a1
    173c:	42465f51 	submi	r5, r6, #324	@ 0x144
    1740:	5f5f5449 	svcpl	0x005f5449
    1744:	38323120 	ldmdacc	r2!, {r5, r8, ip, sp}
    1748:	435f5f00 	cmpmi	pc, #0, 30
    174c:	5f524148 	svcpl	0x00524148
    1750:	5f544942 	svcpl	0x00544942
    1754:	0038205f 	eorseq	r2, r8, pc, asr r0
    1758:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    175c:	58323354 	ldmdapl	r2!, {r2, r4, r6, r8, r9, ip, sp}
    1760:	5f53495f 	svcpl	0x0053495f
    1764:	5f434549 	svcpl	0x00434549
    1768:	35353036 	ldrcc	r3, [r5, #-54]!	@ 0xffffffca
    176c:	205f5f39 	subscs	r5, pc, r9, lsr pc	@ <UNPREDICTABLE>
    1770:	5f5f0032 	svcpl	0x005f0032
    1774:	50544e49 	subspl	r4, r4, r9, asr #28
    1778:	575f5254 			@ <UNDEFINED> instruction: 0x575f5254
    177c:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    1780:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    1784:	5f5f0032 	svcpl	0x005f0032
    1788:	5f434347 	svcpl	0x00434347
    178c:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	@ 1690 <_Min_Stack_Size+0x1290>
    1790:	425f4349 	subsmi	r4, pc, #603979777	@ 0x24000001
    1794:	5f4c4f4f 	svcpl	0x004c4f4f
    1798:	4b434f4c 	blmi	10d54d0 <_Min_Stack_Size+0x10d50d0>
    179c:	4552465f 	ldrbmi	r4, [r2, #-1631]	@ 0xfffff9a1
    17a0:	00322045 	eorseq	r2, r2, r5, asr #32
    17a4:	444c5f5f 	strbmi	r5, [ip], #-3935	@ 0xfffff0a1
    17a8:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	@ 16a8 <_Min_Stack_Size+0x12a8>
    17ac:	5f5f5841 	svcpl	0x005f5841
    17b0:	372e3120 	strcc	r3, [lr, -r0, lsr #2]!
    17b4:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
    17b8:	34333133 	ldrtcc	r3, [r3], #-307	@ 0xfffffecd
    17bc:	33323638 	teqcc	r2, #56, 12	@ 0x3800000
    17c0:	65373531 	ldrvs	r3, [r7, #-1329]!	@ 0xfffffacf
    17c4:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
    17c8:	5f5f004c 	svcpl	0x005f004c
    17cc:	494e4946 	stmdbmi	lr, {r1, r2, r6, r8, fp, lr}^
    17d0:	4d5f4554 	cfldr64mi	mvdx4, [pc, #-336]	@ 1688 <_Min_Stack_Size+0x1288>
    17d4:	5f485441 	svcpl	0x00485441
    17d8:	594c4e4f 	stmdbpl	ip, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
    17dc:	30205f5f 	eorcc	r5, r0, pc, asr pc
    17e0:	535f5f00 	cmppl	pc, #0, 30
    17e4:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
    17e8:	414d5f4d 	cmpmi	sp, sp, asr #30
    17ec:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    17f0:	46375830 			@ <UNDEFINED> instruction: 0x46375830
    17f4:	2d504646 	ldclcs	6, cr4, [r0, #-280]	@ 0xfffffee8
    17f8:	004b4837 	subeq	r4, fp, r7, lsr r8
    17fc:	72615f5f 	rsbvc	r5, r1, #380	@ 0x17c
    1800:	205f5f6d 	subscs	r5, pc, sp, ror #30
    1804:	5f5f0031 	svcpl	0x005f0031
    1808:	4c42444c 	cfstrdmi	mvd4, [r2], {76}	@ 0x4c
    180c:	4e414d5f 	mcrmi	13, 2, r4, cr1, cr15, {2}
    1810:	49445f54 	stmdbmi	r4, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    1814:	205f5f47 	subscs	r5, pc, r7, asr #30
    1818:	5f003335 	svcpl	0x00003335
    181c:	5f51545f 	svcpl	0x0051545f
    1820:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    1824:	30205f5f 	eorcc	r5, r0, pc, asr pc
    1828:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 930 <_Min_Stack_Size+0x530>
    182c:	465f4148 	ldrbmi	r4, [pc], -r8, asr #2
    1830:	5f544942 	svcpl	0x00544942
    1834:	0038205f 	eorseq	r2, r8, pc, asr r0
    1838:	43475f5f 	movtmi	r5, #32607	@ 0x7f5f
    183c:	53415f43 	movtpl	r5, #8003	@ 0x1f43
    1840:	4c465f4d 	mcrrmi	15, 4, r5, r6, cr13
    1844:	4f5f4741 	svcmi	0x005f4741
    1848:	55505455 	ldrbpl	r5, [r0, #-1109]	@ 0xfffffbab
    184c:	5f5f5354 	svcpl	0x005f5354
    1850:	5f003120 	svcpl	0x00003120
    1854:	464c455f 			@ <UNDEFINED> instruction: 0x464c455f
    1858:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    185c:	415f5f00 	cmpmi	pc, r0, lsl #30
    1860:	415f4d52 	cmpmi	pc, r2, asr sp	@ <UNPREDICTABLE>
    1864:	5f484352 	svcpl	0x00484352
    1868:	464f5250 			@ <UNDEFINED> instruction: 0x464f5250
    186c:	00454c49 	subeq	r4, r5, r9, asr #24
    1870:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    1874:	5f363154 	svcpl	0x00363154
    1878:	29632843 	stmdbcs	r3!, {r0, r1, r6, fp, sp}^
    187c:	5f006320 	svcpl	0x00006320
    1880:	4343475f 	movtmi	r4, #14175	@ 0x375f
    1884:	5641485f 			@ <UNDEFINED> instruction: 0x5641485f
    1888:	57445f45 	strbpl	r5, [r4, -r5, asr #30]
    188c:	32465241 	subcc	r5, r6, #268435460	@ 0x10000004
    1890:	4946435f 	stmdbmi	r6, {r0, r1, r2, r3, r4, r6, r8, r9, lr}^
    1894:	4d53415f 	ldfmie	f4, [r3, #-380]	@ 0xfffffe84
    1898:	5f003120 	svcpl	0x00003120
    189c:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    18a0:	5f343654 	svcpl	0x00343654
    18a4:	5f58414d 	svcpl	0x0058414d
    18a8:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    18ac:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    18b0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    18b4:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    18b8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    18bc:	004c4c55 	subeq	r4, ip, r5, asr ip
    18c0:	414c5f5f 	cmpmi	ip, pc, asr pc
    18c4:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    18c8:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    18cc:	30205f5f 	eorcc	r5, r0, pc, asr pc
    18d0:	46463758 			@ <UNDEFINED> instruction: 0x46463758
    18d4:	46464646 	strbmi	r4, [r6], -r6, asr #12
    18d8:	46464646 	strbmi	r4, [r6], -r6, asr #12
    18dc:	46464646 	strbmi	r4, [r6], -r6, asr #12
    18e0:	332d5046 			@ <UNDEFINED> instruction: 0x332d5046
    18e4:	004b4c31 	subeq	r4, fp, r1, lsr ip
    18e8:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    18ec:	41465f54 	cmpmi	r6, r4, asr pc
    18f0:	32335453 	eorscc	r5, r3, #1392508928	@ 0x53000000
    18f4:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    18f8:	30205f5f 	eorcc	r5, r0, pc, asr pc
    18fc:	66663778 			@ <UNDEFINED> instruction: 0x66663778
    1900:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1904:	5f5f0066 	svcpl	0x005f0066
    1908:	52465355 	subpl	r5, r6, #1409286145	@ 0x54000001
    190c:	5f544341 	svcpl	0x00544341
    1910:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
    1914:	5f4e4f4c 	svcpl	0x004e4f4c
    1918:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    191c:	382d5031 	stmdacc	sp!, {r0, r4, r5, ip, lr}
    1920:	00524855 	subseq	r4, r2, r5, asr r8
    1924:	54415f5f 	strbpl	r5, [r1], #-3935	@ 0xfffff0a1
    1928:	43494d4f 	movtmi	r4, #40271	@ 0x9d4f
    192c:	5143415f 	cmppl	r3, pc, asr r1
    1930:	45524955 	ldrbmi	r4, [r2, #-2389]	@ 0xfffff6ab
    1934:	5f003220 	svcpl	0x00003220
    1938:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    193c:	4145465f 	cmpmi	r5, pc, asr r6
    1940:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
    1944:	504f435f 	subpl	r4, pc, pc, asr r3	@ <UNPREDICTABLE>
    1948:	20434f52 	subcs	r4, r3, r2, asr pc
    194c:	5f003531 	svcpl	0x00003531
    1950:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    1954:	205f5f43 	subscs	r5, pc, r3, asr #30
    1958:	5f5f0031 	svcpl	0x005f0031
    195c:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    1960:	4c5f464f 	mrrcmi	6, 4, r4, pc, cr15	@ <UNPREDICTABLE>
    1964:	5f474e4f 	svcpl	0x00474e4f
    1968:	0034205f 	eorseq	r2, r4, pc, asr r0
    196c:	42445f5f 	submi	r5, r4, #380	@ 0x17c
    1970:	414d5f4c 	cmpmi	sp, ip, asr #30
    1974:	58455f58 	stmdapl	r5, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1978:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
    197c:	34323031 	ldrtcc	r3, [r2], #-49	@ 0xffffffcf
    1980:	415f5f00 	cmpmi	pc, r0, lsl #30
    1984:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    1988:	4f435f43 	svcmi	0x00435f43
    198c:	4d55534e 	ldclmi	3, cr5, [r5, #-312]	@ 0xfffffec8
    1990:	00312045 	eorseq	r2, r1, r5, asr #32
    1994:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    1998:	41465f54 	cmpmi	r6, r4, asr pc
    199c:	32335453 	eorscc	r5, r3, #1392508928	@ 0x53000000
    19a0:	4449575f 	strbmi	r5, [r9], #-1887	@ 0xfffff8a1
    19a4:	5f5f4854 	svcpl	0x005f4854
    19a8:	00323320 	eorseq	r3, r2, r0, lsr #6
    19ac:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    19b0:	46425f4d 	strbmi	r5, [r2], -sp, asr #30
    19b4:	465f3631 			@ <UNDEFINED> instruction: 0x465f3631
    19b8:	414d524f 	cmpmi	sp, pc, asr #4
    19bc:	4c415f54 	mcrrmi	15, 5, r5, r1, cr4
    19c0:	4e524554 	mrcmi	5, 2, r4, cr2, cr4, {2}
    19c4:	56495441 	strbpl	r5, [r9], -r1, asr #8
    19c8:	5f5f0045 	svcpl	0x005f0045
    19cc:	544e4957 	strbpl	r4, [lr], #-2391	@ 0xfffff6a9
    19d0:	5059545f 	subspl	r5, r9, pc, asr r4
    19d4:	205f5f45 	subscs	r5, pc, r5, asr #30
    19d8:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    19dc:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    19e0:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    19e4:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    19e8:	5f474e4f 	svcpl	0x00474e4f
    19ec:	5f58414d 	svcpl	0x0058414d
    19f0:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    19f4:	66666637 			@ <UNDEFINED> instruction: 0x66666637
    19f8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    19fc:	5f5f004c 	svcpl	0x005f004c
    1a00:	31544e49 	cmpcc	r4, r9, asr #28
    1a04:	414d5f36 	cmpmi	sp, r6, lsr pc
    1a08:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    1a0c:	66377830 			@ <UNDEFINED> instruction: 0x66377830
    1a10:	5f006666 	svcpl	0x00006666
    1a14:	464c555f 			@ <UNDEFINED> instruction: 0x464c555f
    1a18:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    1a1c:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    1a20:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    1a24:	5f003233 	svcpl	0x00003233
    1a28:	4843535f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    1a2c:	575f5241 	ldrbpl	r5, [pc, -r1, asr #4]
    1a30:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    1a34:	38205f5f 	stmdacc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    1a38:	415f5f00 	cmpmi	pc, r0, lsl #30
    1a3c:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    1a40:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    1a44:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    1a48:	3158302d 	cmpcc	r8, sp, lsr #32
    1a4c:	4b353150 	blmi	d4df94 <_Min_Stack_Size+0xd4db94>
    1a50:	3158302d 	cmpcc	r8, sp, lsr #32
    1a54:	4b353150 	blmi	d4df9c <_Min_Stack_Size+0xd4db9c>
    1a58:	5f5f0029 	svcpl	0x005f0029
    1a5c:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    1a60:	445f464f 	ldrbmi	r4, [pc], #-1615	@ 1a68 <_Min_Stack_Size+0x1668>
    1a64:	4c42554f 	cfstr64mi	mvdx5, [r2], {79}	@ 0x4f
    1a68:	205f5f45 	subscs	r5, pc, r5, asr #30
    1a6c:	5f5f0038 	svcpl	0x005f0038
    1a70:	43554e47 	cmpmi	r5, #1136	@ 0x470
    1a74:	5441505f 	strbpl	r5, [r1], #-95	@ 0xffffffa1
    1a78:	454c4843 	strbmi	r4, [ip, #-2115]	@ 0xfffff7bd
    1a7c:	5f4c4556 	svcpl	0x004c4556
    1a80:	0031205f 	eorseq	r2, r1, pc, asr r0
    1a84:	58475f5f 	stmdapl	r7, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1a88:	59545f58 	ldmdbpl	r4, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1a8c:	4e494550 	mcrmi	5, 2, r4, cr9, cr0, {2}
    1a90:	455f4f46 	ldrbmi	r4, [pc, #-3910]	@ b52 <_Min_Stack_Size+0x752>
    1a94:	4c415551 	cfstr64mi	mvdx5, [r1], {81}	@ 0x51
    1a98:	5f595449 	svcpl	0x00595449
    1a9c:	494c4e49 	stmdbmi	ip, {r0, r3, r6, r9, sl, fp, lr}^
    1aa0:	3020454e 	eorcc	r4, r0, lr, asr #10
    1aa4:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    1aa8:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    1aac:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    1ab0:	30205f5f 	eorcc	r5, r0, pc, asr pc
    1ab4:	46463758 			@ <UNDEFINED> instruction: 0x46463758
    1ab8:	312d5046 			@ <UNDEFINED> instruction: 0x312d5046
    1abc:	5f005235 	svcpl	0x00005235
    1ac0:	4e49575f 	mcrmi	7, 2, r5, cr9, cr15, {2}
    1ac4:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    1ac8:	205f5f4e 	subscs	r5, pc, lr, asr #30
    1acc:	5f005530 	svcpl	0x00005530
    1ad0:	414c555f 	cmpmi	ip, pc, asr r5
    1ad4:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    1ad8:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    1adc:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    1ae0:	5f003233 	svcpl	0x00003233
    1ae4:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    1ae8:	524f4e5f 	subpl	r4, pc, #1520	@ 0x5f0
    1aec:	414d5f4d 	cmpmi	sp, sp, asr #30
    1af0:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    1af4:	30342e33 	eorscc	r2, r4, r3, lsr lr
    1af8:	33323832 	teqcc	r2, #3276800	@ 0x320000
    1afc:	33363634 	teqcc	r6, #52, 12	@ 0x3400000
    1b00:	38323538 	ldmdacc	r2!, {r3, r4, r5, r8, sl, ip, sp}
    1b04:	2b653638 	blcs	194f3ec <_Min_Stack_Size+0x194efec>
    1b08:	00463833 	subeq	r3, r6, r3, lsr r8
    1b0c:	46555f5f 	usaxmi	r5, r5, pc	@ <UNPREDICTABLE>
    1b10:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    1b14:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    1b18:	30205f5f 	eorcc	r5, r0, pc, asr pc
    1b1c:	5255302e 	subspl	r3, r5, #46	@ 0x2e
    1b20:	415f5f00 	cmpmi	pc, r0, lsl #30
    1b24:	4e5f4d52 	mrcmi	13, 2, r4, cr15, cr2, {2}
    1b28:	5f4e4f45 	svcpl	0x004e4f45
    1b2c:	5f005046 	svcpl	0x00005046
    1b30:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    1b34:	54555f43 	ldrbpl	r5, [r5], #-3907	@ 0xfffff0bd
    1b38:	36315f46 	ldrtcc	r5, [r1], -r6, asr #30
    1b3c:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    1b40:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ c48 <_Min_Stack_Size+0x848>
    1b44:	43414c4c 	movtmi	r4, #7244	@ 0x1c4c
    1b48:	5f4d5543 	svcpl	0x004d5543
    1b4c:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    1b50:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    1b54:	5f5f0032 	svcpl	0x005f0032
    1b58:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    1b5c:	53495f32 	movtpl	r5, #40754	@ 0x9f32
    1b60:	4345495f 	movtmi	r4, #22879	@ 0x595f
    1b64:	3530365f 	ldrcc	r3, [r0, #-1631]!	@ 0xfffff9a1
    1b68:	5f5f3935 	svcpl	0x005f3935
    1b6c:	5f003220 	svcpl	0x00003220
    1b70:	4152465f 	cmpmi	r2, pc, asr r6
    1b74:	495f5443 	ldmdbmi	pc, {r0, r1, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    1b78:	5f544942 	svcpl	0x00544942
    1b7c:	0030205f 	eorseq	r2, r0, pc, asr r0
    1b80:	444c5f5f 	strbmi	r5, [ip], #-3935	@ 0xfffff0a1
    1b84:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	@ 1a84 <_Min_Stack_Size+0x1684>
    1b88:	5f5f4e49 	svcpl	0x005f4e49
    1b8c:	322e3220 	eorcc	r3, lr, #32, 4
    1b90:	37303532 			@ <UNDEFINED> instruction: 0x37303532
    1b94:	38353833 	ldmdacc	r5!, {r0, r1, r4, r5, fp, ip, sp}
    1b98:	32373035 	eorscc	r3, r7, #53	@ 0x35
    1b9c:	65343130 	ldrvs	r3, [r4, #-304]!	@ 0xfffffed0
    1ba0:	3830332d 	ldmdacc	r0!, {r0, r2, r3, r5, r8, r9, ip, sp}
    1ba4:	5f5f004c 	svcpl	0x005f004c
    1ba8:	4c42444c 	cfstrdmi	mvd4, [r2], {76}	@ 0x4c
    1bac:	5341485f 	movtpl	r4, #6239	@ 0x185f
    1bb0:	464e495f 			@ <UNDEFINED> instruction: 0x464e495f
    1bb4:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    1bb8:	205f5f59 	subscs	r5, pc, r9, asr pc	@ <UNPREDICTABLE>
    1bbc:	5f5f0031 	svcpl	0x005f0031
    1bc0:	5f434347 	svcpl	0x00434347
    1bc4:	5f434549 	svcpl	0x00434549
    1bc8:	5f393535 	svcpl	0x00393535
    1bcc:	504d4f43 	subpl	r4, sp, r3, asr #30
    1bd0:	2058454c 	subscs	r4, r8, ip, asr #10
    1bd4:	5f5f0030 	svcpl	0x005f0030
    1bd8:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    1bdc:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ 1b18 <_Min_Stack_Size+0x1718>
    1be0:	5f5f5841 	svcpl	0x005f5841
    1be4:	66783020 	ldrbtvs	r3, [r8], -r0, lsr #32
    1be8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1bec:	55666666 	strbpl	r6, [r6, #-1638]!	@ 0xfffff99a
    1bf0:	534f004c 	movtpl	r0, #61516	@ 0xf04c
    1bf4:	5445535f 	strbpl	r5, [r5], #-863	@ 0xfffffca1
    1bf8:	5053505f 	subspl	r5, r3, pc, asr r0
    1bfc:	64646128 	strbtvs	r6, [r4], #-296	@ 0xfffffed8
    1c00:	5f5f2029 	svcpl	0x005f2029
    1c04:	206d7361 	rsbcs	r7, sp, r1, ror #6
    1c08:	616c6f76 	smcvs	50934	@ 0xc6f6
    1c0c:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    1c10:	6f6d2228 	svcvs	0x006d2228
    1c14:	30722076 	rsbscc	r2, r2, r6, ror r0
    1c18:	30252c20 	eorcc	r2, r5, r0, lsr #24
    1c1c:	5c6e5c20 	stclpl	12, cr5, [lr], #-128	@ 0xffffff80
    1c20:	736d2074 	cmnvc	sp, #116	@ 0x74
    1c24:	53502072 	cmppl	r0, #114	@ 0x72
    1c28:	202c2050 	eorcs	r2, ip, r0, asr r0
    1c2c:	22203072 	eorcs	r3, r0, #114	@ 0x72
    1c30:	3a203a20 	bcc	8104b8 <_Min_Stack_Size+0x8100b8>
    1c34:	22722220 	rsbscs	r2, r2, #32, 4
    1c38:	64646128 	strbtvs	r6, [r4], #-296	@ 0xfffffed8
    1c3c:	00292029 	eoreq	r2, r9, r9, lsr #32
    1c40:	444c5f5f 	strbmi	r5, [ip], #-3935	@ 0xfffff0a1
    1c44:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	@ 1b44 <_Min_Stack_Size+0x1744>
    1c48:	455f4e49 	ldrbmi	r4, [pc, #-3657]	@ e07 <_Min_Stack_Size+0xa07>
    1c4c:	5f5f5058 	svcpl	0x005f5058
    1c50:	312d2820 			@ <UNDEFINED> instruction: 0x312d2820
    1c54:	29313230 	ldmdbcs	r1!, {r4, r5, r9, ip, sp}
    1c58:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ d60 <_Min_Stack_Size+0x960>
    1c5c:	52464c4c 	subpl	r4, r6, #76, 24	@ 0x4c00
    1c60:	5f544341 	svcpl	0x00544341
    1c64:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    1c68:	36205f5f 	qsaxcc	r5, r0, pc	@ <UNPREDICTABLE>
    1c6c:	5f5f0034 	svcpl	0x005f0034
    1c70:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    1c74:	575f464f 	ldrbpl	r4, [pc, -pc, asr #12]
    1c78:	52414843 	subpl	r4, r1, #4390912	@ 0x430000
    1c7c:	5f5f545f 	svcpl	0x005f545f
    1c80:	5f003420 	svcpl	0x00003420
    1c84:	4f4c465f 	svcmi	0x004c465f
    1c88:	575f5441 	ldrbpl	r5, [pc, -r1, asr #8]
    1c8c:	5f44524f 	svcpl	0x0044524f
    1c90:	4544524f 	strbmi	r5, [r4, #-591]	@ 0xfffffdb1
    1c94:	205f5f52 	subscs	r5, pc, r2, asr pc	@ <UNPREDICTABLE>
    1c98:	524f5f5f 	subpl	r5, pc, #380	@ 0x17c
    1c9c:	5f524544 	svcpl	0x00524544
    1ca0:	5454494c 	ldrbpl	r4, [r4], #-2380	@ 0xfffff6b4
    1ca4:	455f454c 	ldrbmi	r4, [pc, #-1356]	@ 1760 <_Min_Stack_Size+0x1360>
    1ca8:	4149444e 	cmpmi	r9, lr, asr #8
    1cac:	005f5f4e 	subseq	r5, pc, lr, asr #30
    1cb0:	43415f5f 	movtmi	r5, #8031	@ 0x1f5f
    1cb4:	5f4d5543 	svcpl	0x004d5543
    1cb8:	5f58414d 	svcpl	0x0058414d
    1cbc:	5830205f 	ldmdapl	r0!, {r0, r1, r2, r3, r4, r6, sp}
    1cc0:	46464637 			@ <UNDEFINED> instruction: 0x46464637
    1cc4:	46464646 	strbmi	r4, [r6], -r6, asr #12
    1cc8:	35312d50 	ldrcc	r2, [r1, #-3408]!	@ 0xfffff2b0
    1ccc:	5f5f004b 	svcpl	0x005f004b
    1cd0:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    1cd4:	4449575f 	strbmi	r5, [r9], #-1887	@ 0xfffff8a1
    1cd8:	5f5f4854 	svcpl	0x005f4854
    1cdc:	00323320 	eorseq	r3, r2, r0, lsr #6
    1ce0:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    1ce4:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
    1ce8:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
    1cec:	41535f45 	cmpmi	r3, r5, asr #30
    1cf0:	00312054 	eorseq	r2, r1, r4, asr r0
    1cf4:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1cf8:	54415f47 	strbpl	r5, [r1], #-3911	@ 0xfffff0b9
    1cfc:	43494d4f 	movtmi	r4, #40271	@ 0x9d4f
    1d00:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    1d04:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    1d08:	535f5f2d 	cmppl	pc, #45, 30	@ 0xb4
    1d0c:	415f4749 	cmpmi	pc, r9, asr #14
    1d10:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    1d14:	414d5f43 	cmpmi	sp, r3, asr #30
    1d18:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    1d1c:	2931202d 	ldmdbcs	r1!, {r0, r2, r3, r5, sp}
    1d20:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    1d24:	4152464c 	cmpmi	r2, ip, asr #12
    1d28:	455f5443 	ldrbmi	r5, [pc, #-1091]	@ 18ed <_Min_Stack_Size+0x14ed>
    1d2c:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    1d30:	5f5f4e4f 	svcpl	0x005f4e4f
    1d34:	31783020 	cmncc	r8, r0, lsr #32
    1d38:	33362d50 	teqcc	r6, #80, 26	@ 0x1400
    1d3c:	00524c4c 	subseq	r4, r2, ip, asr #24
    1d40:	4f4c5f5f 	svcmi	0x004c5f5f
    1d44:	575f474e 	ldrbpl	r4, [pc, -lr, asr #14]
    1d48:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    1d4c:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    1d50:	5f5f0032 	svcpl	0x005f0032
    1d54:	41524653 	cmpmi	r2, r3, asr r6
    1d58:	465f5443 	ldrbmi	r5, [pc], -r3, asr #8
    1d5c:	5f544942 	svcpl	0x00544942
    1d60:	0037205f 	eorseq	r2, r7, pc, asr r0
    1d64:	48435f5f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1d68:	32335241 	eorscc	r5, r3, #268435460	@ 0x10000004
    1d6c:	5059545f 	subspl	r5, r9, pc, asr r4
    1d70:	205f5f45 	subscs	r5, pc, r5, asr #30
