NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    1d74:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    1d78:	736e7520 	cmnvc	lr, #32, 10	@ 0x8000000
    1d7c:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    1d80:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
    1d84:	5f5f0074 	svcpl	0x005f0074
    1d88:	41524653 	cmpmi	r2, r3, asr r6
    1d8c:	495f5443 	ldmdbmi	pc, {r0, r1, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    1d90:	5f544942 	svcpl	0x00544942
    1d94:	0030205f 	eorseq	r2, r0, pc, asr r0
    1d98:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    1d9c:	43505f4d 	cmpmi	r0, #308	@ 0x134
    1da0:	00312053 	eorseq	r2, r1, r3, asr r0
    1da4:	51485f5f 	cmppl	r8, pc, asr pc
    1da8:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    1dac:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    1db0:	54530030 	ldrbpl	r0, [r3], #-48	@ 0xffffffd0
    1db4:	4632334d 	ldrtmi	r3, [r2], -sp, asr #6
    1db8:	43333031 	teqmi	r3, #49	@ 0x31
    1dbc:	20785436 	rsbscs	r5, r8, r6, lsr r4
    1dc0:	5f5f0031 	svcpl	0x005f0031
    1dc4:	52455355 	subpl	r5, r5, #1409286145	@ 0x54000001
    1dc8:	42414c5f 	submi	r4, r1, #24320	@ 0x5f00
    1dcc:	505f4c45 	subspl	r4, pc, r5, asr #24
    1dd0:	49464552 	stmdbmi	r6, {r1, r4, r6, r8, sl, lr}^
    1dd4:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    1dd8:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    1ddc:	445f544c 	ldrbmi	r5, [pc], #-1100	@ 1de4 <_Min_Stack_Size+0x19e4>
    1de0:	524f4e45 	subpl	r4, pc, #1104	@ 0x450
    1de4:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    1de8:	205f5f4e 	subscs	r5, pc, lr, asr #30
    1dec:	30342e31 	eorscc	r2, r4, r1, lsr lr
    1df0:	38393231 	ldmdacc	r9!, {r0, r4, r5, r9, ip, sp}
    1df4:	33343634 	teqcc	r4, #52, 12	@ 0x3400000
    1df8:	31383432 	teqcc	r8, r2, lsr r4
    1dfc:	2d653137 	stfcse	f3, [r5, #-220]!	@ 0xffffff24
    1e00:	00463534 	subeq	r3, r6, r4, lsr r5
    1e04:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    1e08:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    1e0c:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    1e10:	545f3233 	ldrbpl	r3, [pc], #-563	@ 1e18 <_Min_Stack_Size+0x1a18>
    1e14:	5f455059 	svcpl	0x00455059
    1e18:	6f6c205f 	svcvs	0x006c205f
    1e1c:	7520676e 	strvc	r6, [r0, #-1902]!	@ 0xfffff892
    1e20:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    1e24:	2064656e 	rsbcs	r6, r4, lr, ror #10
    1e28:	00746e69 	rsbseq	r6, r4, r9, ror #28
    1e2c:	51445f5f 	cmppl	r4, pc, asr pc
    1e30:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    1e34:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    1e38:	5f003336 	svcpl	0x00003336
    1e3c:	4153555f 	cmpmi	r3, pc, asr r5
    1e40:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    1e44:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    1e48:	30205f5f 	eorcc	r5, r0, pc, asr pc
    1e4c:	46464658 			@ <UNDEFINED> instruction: 0x46464658
    1e50:	382d5046 	stmdacc	sp!, {r1, r2, r6, ip, lr}
    1e54:	004b4855 	subeq	r4, fp, r5, asr r8
    1e58:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    1e5c:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
    1e60:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
    1e64:	444c5f45 	strbmi	r5, [ip], #-3909	@ 0xfffff0bb
    1e68:	20584552 	subscs	r4, r8, r2, asr r5
    1e6c:	5f5f0037 	svcpl	0x005f0037
    1e70:	5f474953 	svcpl	0x00474953
    1e74:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	@ 1d78 <_Min_Stack_Size+0x1978>
    1e78:	575f4349 	ldrbpl	r4, [pc, -r9, asr #6]
    1e7c:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    1e80:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    1e84:	5f5f0032 	svcpl	0x005f0032
    1e88:	5f4d5241 	svcpl	0x004d5241
    1e8c:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
    1e90:	5f455255 	svcpl	0x00455255
    1e94:	36314642 	ldrtcc	r4, [r1], -r2, asr #12
    1e98:	4345565f 	movtmi	r5, #22111	@ 0x565f
    1e9c:	5f524f54 	svcpl	0x00524f54
    1ea0:	54495241 	strbpl	r5, [r9], #-577	@ 0xfffffdbf
    1ea4:	54454d48 	strbpl	r4, [r5], #-3400	@ 0xfffff2b8
    1ea8:	2e004349 	cdpcs	3, 0, cr4, cr0, cr9, {2}
    1eac:	54522f2e 	ldrbpl	r2, [r2], #-3886	@ 0xfffff0d2
    1eb0:	432f534f 			@ <UNDEFINED> instruction: 0x432f534f
    1eb4:	6574726f 	ldrbvs	r7, [r4, #-623]!	@ 0xfffffd91
    1eb8:	5f584d78 	svcpl	0x00584d78
    1ebc:	505f734f 	subspl	r7, pc, pc, asr #6
    1ec0:	6974726f 	ldmdbvs	r4!, {r0, r1, r2, r3, r5, r6, r9, ip, sp, lr}^
    1ec4:	632e676e 			@ <UNDEFINED> instruction: 0x632e676e
    1ec8:	535f5f00 	cmppl	pc, #0, 30
    1ecc:	5f545248 	svcpl	0x00545248
    1ed0:	5f58414d 	svcpl	0x0058414d
    1ed4:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    1ed8:	66666637 			@ <UNDEFINED> instruction: 0x66666637
    1edc:	415f5f00 	cmpmi	pc, r0, lsl #30
    1ee0:	465f4d52 			@ <UNDEFINED> instruction: 0x465f4d52
    1ee4:	5f363150 	svcpl	0x00363150
    1ee8:	53475241 	movtpl	r5, #29249	@ 0x7241
    1eec:	4f5f5f00 	svcmi	0x005f5f00
    1ef0:	52454452 	subpl	r4, r5, #1375731712	@ 0x52000000
    1ef4:	5044505f 	subpl	r5, r4, pc, asr r0
    1ef8:	444e455f 	strbmi	r4, [lr], #-1375	@ 0xfffffaa1
    1efc:	5f4e4149 	svcpl	0x004e4149
    1f00:	3433205f 	ldrtcc	r2, [r3], #-95	@ 0xffffffa1
    1f04:	5f003231 	svcpl	0x00003231
    1f08:	5f51535f 	svcpl	0x0051535f
    1f0c:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    1f10:	30205f5f 	eorcc	r5, r0, pc, asr pc
    1f14:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    1f18:	3233544c 	eorscc	r5, r3, #76, 8	@ 0x4c000000
    1f1c:	524f4e5f 	subpl	r4, pc, #1520	@ 0x5f0
    1f20:	414d5f4d 	cmpmi	sp, sp, asr #30
    1f24:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    1f28:	30342e33 	eorscc	r2, r4, r3, lsr lr
    1f2c:	33323832 	teqcc	r2, #3276800	@ 0x320000
    1f30:	33363634 	teqcc	r6, #52, 12	@ 0x3400000
    1f34:	38323538 	ldmdacc	r2!, {r3, r4, r5, r8, sl, ip, sp}
    1f38:	2b653638 	blcs	194f820 <_Min_Stack_Size+0x194f420>
    1f3c:	33463833 	movtcc	r3, #26675	@ 0x6833
    1f40:	5f5f0032 	svcpl	0x005f0032
    1f44:	5f544c46 	svcpl	0x00544c46
    1f48:	49434544 	stmdbmi	r3, {r2, r6, r8, sl, lr}^
    1f4c:	5f4c414d 	svcpl	0x004c414d
    1f50:	5f474944 	svcpl	0x00474944
    1f54:	0039205f 	eorseq	r2, r9, pc, asr r0
    1f58:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    1f5c:	5f323354 	svcpl	0x00323354
    1f60:	5f58414d 	svcpl	0x0058414d
    1f64:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    1f68:	66666637 			@ <UNDEFINED> instruction: 0x66666637
    1f6c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    1f70:	5f5f004c 	svcpl	0x005f004c
    1f74:	544e4957 	strbpl	r4, [lr], #-2391	@ 0xfffff6a9
    1f78:	4449575f 	strbmi	r5, [r9], #-1887	@ 0xfffff8a1
    1f7c:	5f5f4854 	svcpl	0x005f4854
    1f80:	00323320 	eorseq	r3, r2, r0, lsr #6
    1f84:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    1f88:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
    1f8c:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
    1f90:	53445f45 	movtpl	r5, #20293	@ 0x4f45
    1f94:	5f5f0050 	svcpl	0x005f0050
    1f98:	5f515155 	svcpl	0x00515155
    1f9c:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    1fa0:	38205f5f 	stmdacc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    1fa4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 10ac <_Min_Stack_Size+0xcac>
    1fa8:	43415246 	movtmi	r5, #4678	@ 0x1246
    1fac:	50455f54 	subpl	r5, r5, r4, asr pc
    1fb0:	4f4c4953 	svcmi	0x004c4953
    1fb4:	205f5f4e 	subscs	r5, pc, lr, asr #30
    1fb8:	50317830 	eorspl	r7, r1, r0, lsr r8
    1fbc:	5536312d 	ldrpl	r3, [r6, #-301]!	@ 0xfffffed3
    1fc0:	5f5f0052 	svcpl	0x005f0052
    1fc4:	5f585847 	svcpl	0x00585847
    1fc8:	5f494241 	svcpl	0x00494241
    1fcc:	53524556 	cmppl	r2, #360710144	@ 0x15800000
    1fd0:	204e4f49 	subcs	r4, lr, r9, asr #30
    1fd4:	37313031 			@ <UNDEFINED> instruction: 0x37313031
    1fd8:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    1fdc:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    1fe0:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    1fe4:	575f3436 	smmlarpl	pc, r6, r4, r3	@ <UNPREDICTABLE>
    1fe8:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    1fec:	36205f5f 	qsaxcc	r5, r0, pc	@ <UNPREDICTABLE>
    1ff0:	5f5f0034 	svcpl	0x005f0034
    1ff4:	33544e49 	cmpcc	r4, #1168	@ 0x490
    1ff8:	59545f32 	ldmdbpl	r4, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    1ffc:	5f5f4550 	svcpl	0x005f4550
    2000:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    2004:	6e692067 	cdpvs	0, 6, cr2, cr9, cr7, {3}
    2008:	5f5f0074 	svcpl	0x005f0074
    200c:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    2010:	4d5f5832 	ldclmi	8, cr5, [pc, #-200]	@ 1f50 <_Min_Stack_Size+0x1b50>
    2014:	315f4e49 	cmpcc	pc, r9, asr #28
    2018:	58455f30 	stmdapl	r5, {r4, r5, r8, r9, sl, fp, ip, lr}^
    201c:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
    2020:	30332d28 	eorscc	r2, r3, r8, lsr #26
    2024:	5f002937 	svcpl	0x00002937
    2028:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    202c:	4145465f 	cmpmi	r5, pc, asr r6
    2030:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
    2034:	3146425f 	cmpcc	r6, pc, asr r2
    2038:	43535f36 	cmpmi	r3, #54, 30	@ 0xd8
    203c:	52414c41 	subpl	r4, r1, #16640	@ 0x4100
    2040:	4952415f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, lr}^
    2044:	454d4854 	strbmi	r4, [sp, #-2132]	@ 0xfffff7ac
    2048:	00434954 	subeq	r4, r3, r4, asr r9
    204c:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    2050:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    2054:	33545341 	cmpcc	r4, #67108865	@ 0x4000001
    2058:	59545f32 	ldmdbpl	r4, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    205c:	5f5f4550 	svcpl	0x005f4550
    2060:	736e7520 	cmnvc	lr, #32, 10	@ 0x8000000
    2064:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    2068:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
    206c:	5f5f0074 	svcpl	0x005f0074
    2070:	5f4d5241 	svcpl	0x004d5241
    2074:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
    2078:	5f455255 	svcpl	0x00455255
    207c:	56494449 	strbpl	r4, [r9], -r9, asr #8
    2080:	5f003120 	svcpl	0x00003120
    2084:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    2088:	5f583233 	svcpl	0x00583233
    208c:	5f4e494d 	svcpl	0x004e494d
    2090:	2e32205f 	mrccs	0, 1, r2, cr2, cr15, {2}
    2094:	30353232 	eorscc	r3, r5, r2, lsr r2
    2098:	35383337 	ldrcc	r3, [r8, #-823]!	@ 0xfffffcc9
    209c:	37303538 			@ <UNDEFINED> instruction: 0x37303538
    20a0:	34313032 	ldrtcc	r3, [r1], #-50	@ 0xffffffce
    20a4:	30332d65 	eorscc	r2, r3, r5, ror #26
    20a8:	32334638 	eorscc	r4, r3, #56, 12	@ 0x3800000
    20ac:	5f5f0078 	svcpl	0x005f0078
    20b0:	465f5153 			@ <UNDEFINED> instruction: 0x465f5153
    20b4:	5f544942 	svcpl	0x00544942
    20b8:	3133205f 	teqcc	r3, pc, asr r0
    20bc:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    20c0:	43415246 	movtmi	r5, #4678	@ 0x1246
    20c4:	494d5f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    20c8:	205f5f4e 	subscs	r5, pc, lr, asr #30
    20cc:	2e302d28 	cdpcs	13, 3, cr2, cr0, cr8, {1}
    20d0:	2d524c35 	ldclcs	12, cr4, [r2, #-212]	@ 0xffffff2c
    20d4:	4c352e30 	ldcmi	14, cr2, [r5], #-192	@ 0xffffff40
    20d8:	5f002952 	svcpl	0x00002952
    20dc:	4843575f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
    20e0:	4d5f5241 	lfmmi	f5, 2, [pc, #-260]	@ 1fe4 <_Min_Stack_Size+0x1be4>
    20e4:	5f5f4e49 	svcpl	0x005f4e49
    20e8:	00553020 	subseq	r3, r5, r0, lsr #32
    20ec:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    20f0:	5f343654 	svcpl	0x00343654
    20f4:	5f58414d 	svcpl	0x0058414d
    20f8:	2e31205f 	mrccs	0, 1, r2, cr1, cr15, {2}
    20fc:	36373937 			@ <UNDEFINED> instruction: 0x36373937
    2100:	33313339 	teqcc	r1, #-469762048	@ 0xe4000000
    2104:	32363834 	eorscc	r3, r6, #52, 16	@ 0x340000
    2108:	37353133 			@ <UNDEFINED> instruction: 0x37353133
    210c:	30332b65 	eorscc	r2, r3, r5, ror #22
    2110:	34364638 	ldrtcc	r4, [r6], #-1592	@ 0xfffff9c8
    2114:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 121c <_Min_Stack_Size+0xe1c>
    2118:	5f544e49 	svcpl	0x00544e49
    211c:	5341454c 	movtpl	r4, #5452	@ 0x154c
    2120:	5f323354 	svcpl	0x00323354
    2124:	5f58414d 	svcpl	0x0058414d
    2128:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    212c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2130:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2134:	5f004c55 	svcpl	0x00004c55
    2138:	4343475f 	movtmi	r4, #14175	@ 0x375f
    213c:	5345445f 	movtpl	r4, #21599	@ 0x545f
    2140:	43555254 	cmpmi	r5, #84, 4	@ 0x40000005
    2144:	45564954 	ldrbmi	r4, [r6, #-2388]	@ 0xfffff6ac
    2148:	5a49535f 	bpl	1256ecc <_Min_Stack_Size+0x1256acc>
    214c:	34362045 	ldrtcc	r2, [r6], #-69	@ 0xffffffbb
    2150:	745f5f00 	ldrbvc	r5, [pc], #-3840	@ 2158 <_Min_Stack_Size+0x1d58>
    2154:	626d7568 	rsbvs	r7, sp, #104, 10	@ 0x1a000000
    2158:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    215c:	6d654d00 	stclvs	13, cr4, [r5, #-0]
    2160:	616e614d 	cmnvs	lr, sp, asr #2
    2164:	485f6567 	ldmdami	pc, {r0, r1, r2, r5, r6, r8, sl, sp, lr}^	@ <UNPREDICTABLE>
    2168:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
    216c:	5f007265 	svcpl	0x00007265
    2170:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    2174:	59545f38 	ldmdbpl	r4, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    2178:	5f5f4550 	svcpl	0x005f4550
    217c:	67697320 	strbvs	r7, [r9, -r0, lsr #6]!
    2180:	2064656e 	rsbcs	r6, r4, lr, ror #10
    2184:	72616863 	rsbvc	r6, r1, #6488064	@ 0x630000
    2188:	575f5f00 	ldrbpl	r5, [pc, -r0, lsl #30]
    218c:	5f544e49 	svcpl	0x00544e49
    2190:	5f58414d 	svcpl	0x0058414d
    2194:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    2198:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    219c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    21a0:	5f5f0055 	svcpl	0x005f0055
    21a4:	4c42444c 	cfstrdmi	mvd4, [r2], {76}	@ 0x4c
    21a8:	4345445f 	movtmi	r4, #21599	@ 0x545f
    21ac:	4c414d49 	mcrrmi	13, 4, r4, r1, cr9
    21b0:	4749445f 	smlsldmi	r4, r9, pc, r4	@ <UNPREDICTABLE>
    21b4:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    21b8:	5f5f0037 	svcpl	0x005f0037
    21bc:	465f5154 			@ <UNDEFINED> instruction: 0x465f5154
    21c0:	5f544942 	svcpl	0x00544942
    21c4:	3231205f 	eorscc	r2, r1, #95	@ 0x5f
    21c8:	5f5f0037 	svcpl	0x005f0037
    21cc:	5f514855 	svcpl	0x00514855
    21d0:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    21d4:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    21d8:	5f5f0036 	svcpl	0x005f0036
    21dc:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    21e0:	5341465f 	movtpl	r4, #5727	@ 0x165f
    21e4:	5f343654 	svcpl	0x00343654
    21e8:	5f58414d 	svcpl	0x0058414d
    21ec:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    21f0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    21f4:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    21f8:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    21fc:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2200:	004c4c55 	subeq	r4, ip, r5, asr ip
    2204:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    2208:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    220c:	33545341 	cmpcc	r4, #67108865	@ 0x4000001
    2210:	414d5f32 	cmpmi	sp, r2, lsr pc
    2214:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    2218:	66667830 			@ <UNDEFINED> instruction: 0x66667830
    221c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2220:	00556666 	subseq	r6, r5, r6, ror #12
    2224:	53555f5f 	cmppl	r5, #380	@ 0x17c
    2228:	43415246 	movtmi	r5, #4678	@ 0x1246
    222c:	42465f54 	submi	r5, r6, #84, 30	@ 0x150
    2230:	5f5f5449 	svcpl	0x005f5449
    2234:	5f003820 	svcpl	0x00003820
    2238:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    223c:	435f3436 	cmpmi	pc, #905969664	@ 0x36000000
    2240:	20296328 	eorcs	r6, r9, r8, lsr #6
    2244:	23232063 			@ <UNDEFINED> instruction: 0x23232063
    2248:	004c4c20 	subeq	r4, ip, r0, lsr #24
    224c:	51485f5f 	cmppl	r8, pc, asr pc
    2250:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    2254:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    2258:	5f003531 	svcpl	0x00003531
    225c:	4148555f 	cmpmi	r8, pc, asr r5
    2260:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    2264:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    2268:	5f5f0038 	svcpl	0x005f0038
    226c:	41484357 	cmpmi	r8, r7, asr r3
    2270:	414d5f52 	cmpmi	sp, r2, asr pc
    2274:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    2278:	66667830 			@ <UNDEFINED> instruction: 0x66667830
    227c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2280:	00556666 	subseq	r6, r5, r6, ror #12
    2284:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    2288:	464f455a 			@ <UNDEFINED> instruction: 0x464f455a
    228c:	4e4f4c5f 	mcrmi	12, 2, r4, cr15, cr15, {2}
    2290:	4f4c5f47 	svcmi	0x004c5f47
    2294:	5f5f474e 	svcpl	0x005f474e
    2298:	5f003820 	svcpl	0x00003820
    229c:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    22a0:	545f3854 	ldrbpl	r3, [pc], #-2132	@ 22a8 <_Min_Stack_Size+0x1ea8>
    22a4:	5f455059 	svcpl	0x00455059
    22a8:	6e75205f 	mrcvs	0, 3, r2, cr5, cr15, {2}
    22ac:	6e676973 			@ <UNDEFINED> instruction: 0x6e676973
    22b0:	63206465 			@ <UNDEFINED> instruction: 0x63206465
    22b4:	00726168 	rsbseq	r6, r2, r8, ror #2
    22b8:	48535f5f 	ldmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    22bc:	575f5452 			@ <UNDEFINED> instruction: 0x575f5452
    22c0:	48544449 	ldmdami	r4, {r0, r3, r6, sl, lr}^
    22c4:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    22c8:	5f5f0036 	svcpl	0x005f0036
    22cc:	5f4d5241 	svcpl	0x004d5241
    22d0:	4f005046 	svcmi	0x00005046
    22d4:	77535f53 			@ <UNDEFINED> instruction: 0x77535f53
    22d8:	68637469 	stmdavs	r3!, {r0, r3, r5, r6, sl, ip, sp, lr}^
    22dc:	5f6f745f 	svcpl	0x006f745f
    22e0:	72706e75 	rsbsvc	r6, r0, #1872	@ 0x750
    22e4:	6c697669 	stclvs	6, cr7, [r9], #-420	@ 0xfffffe5c
    22e8:	28646567 	stmdacs	r4!, {r0, r1, r2, r5, r6, r8, sl, sp, lr}^
    22ec:	5f5f2029 	svcpl	0x005f2029
    22f0:	286d7361 	stmdacs	sp!, {r0, r5, r6, r8, r9, ip, sp, lr}^
    22f4:	73726d22 	cmnvc	r2, #2176	@ 0x880
    22f8:	2c337220 	lfmcs	f7, 4, [r3], #-128	@ 0xffffff80
    22fc:	4e4f4320 	cdpmi	3, 4, cr4, cr15, cr0, {1}
    2300:	4c4f5254 	sfmmi	f5, 2, [pc], {84}	@ 0x54
    2304:	5c6e5c20 	stclpl	12, cr5, [lr], #-128	@ 0xffffff80
    2308:	726f2074 	rsbvc	r2, pc, #116	@ 0x74
    230c:	33722072 	cmncc	r2, #114	@ 0x72
    2310:	3372202c 	cmncc	r2, #44	@ 0x2c
    2314:	3023202c 	eorcc	r2, r3, ip, lsr #32
    2318:	20313078 	eorscs	r3, r1, r8, ror r0
    231c:	745c6e5c 	ldrbvc	r6, [ip], #-3676	@ 0xfffff1a4
    2320:	72736d20 	rsbsvc	r6, r3, #32, 26	@ 0x800
    2324:	4e4f4320 	cdpmi	3, 4, cr4, cr15, cr0, {1}
    2328:	4c4f5254 	sfmmi	f5, 2, [pc], {84}	@ 0x54
    232c:	72202c20 	eorvc	r2, r0, #32, 24	@ 0x2000
    2330:	00292233 	eoreq	r2, r9, r3, lsr r2
    2334:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    2338:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    233c:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
    2340:	5059545f 	subspl	r5, r9, pc, asr r4
    2344:	205f5f45 	subscs	r5, pc, r5, asr #30
    2348:	6e676973 			@ <UNDEFINED> instruction: 0x6e676973
    234c:	63206465 			@ <UNDEFINED> instruction: 0x63206465
    2350:	00726168 	rsbseq	r6, r2, r8, ror #2
    2354:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    2358:	50455f54 	subpl	r5, r5, r4, asr pc
    235c:	4f4c4953 	svcmi	0x004c4953
    2360:	205f5f4e 	subscs	r5, pc, lr, asr #30
    2364:	39312e31 	ldmdbcc	r1!, {r0, r4, r5, r9, sl, fp, sp}
    2368:	32393032 	eorscc	r3, r9, #50	@ 0x32
    236c:	35353938 	ldrcc	r3, [r5, #-2360]!	@ 0xfffff6c8
    2370:	31383730 	teqcc	r8, r0, lsr r7
    2374:	2d653532 	cfstr64cs	mvdx3, [r5, #-200]!	@ 0xffffff38
    2378:	5f004637 	svcpl	0x00004637
    237c:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    2380:	41454c5f 	cmpmi	r5, pc, asr ip
    2384:	34365453 	ldrtcc	r5, [r6], #-1107	@ 0xfffffbad
    2388:	5059545f 	subspl	r5, r9, pc, asr r4
    238c:	205f5f45 	subscs	r5, pc, r5, asr #30
    2390:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    2394:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    2398:	6e692067 	cdpvs	0, 6, cr2, cr9, cr7, {3}
    239c:	5f5f0074 	svcpl	0x005f0074
    23a0:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    23a4:	545f3233 	ldrbpl	r3, [pc], #-563	@ 23ac <_Min_Stack_Size+0x1fac>
    23a8:	5f455059 	svcpl	0x00455059
    23ac:	6f6c205f 	svcvs	0x006c205f
    23b0:	7520676e 	strvc	r6, [r0, #-1902]!	@ 0xfffff892
    23b4:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    23b8:	2064656e 	rsbcs	r6, r4, lr, ror #10
    23bc:	00746e69 	rsbseq	r6, r4, r9, ror #28
    23c0:	444c5f5f 	strbmi	r5, [ip], #-3935	@ 0xfffff0a1
    23c4:	4d5f4c42 	ldclmi	12, cr4, [pc, #-264]	@ 22c4 <_Min_Stack_Size+0x1ec4>
    23c8:	315f4e49 	cmpcc	pc, r9, asr #28
    23cc:	58455f30 	stmdapl	r5, {r4, r5, r8, r9, sl, fp, ip, lr}^
    23d0:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
    23d4:	30332d28 	eorscc	r2, r3, r8, lsr #26
    23d8:	53002937 	movwpl	r2, #2359	@ 0x937
    23dc:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    23e0:	31203146 			@ <UNDEFINED> instruction: 0x31203146
    23e4:	535f5f00 	cmppl	pc, #0, 30
    23e8:	4f455a49 	svcmi	0x00455a49
    23ec:	4f505f46 	svcmi	0x00505f46
    23f0:	45544e49 	ldrbmi	r4, [r4, #-3657]	@ 0xfffff1b7
    23f4:	205f5f52 	subscs	r5, pc, r2, asr pc	@ <UNPREDICTABLE>
    23f8:	5f5f0034 	svcpl	0x005f0034
    23fc:	43434155 	movtmi	r4, #12629	@ 0x3155
    2400:	4d5f4d55 	ldclmi	13, cr4, [pc, #-340]	@ 22b4 <_Min_Stack_Size+0x1eb4>
    2404:	5f5f5841 	svcpl	0x005f5841
    2408:	46583020 	ldrbmi	r3, [r8], -r0, lsr #32
    240c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    2410:	50464646 	subpl	r4, r6, r6, asr #12
    2414:	5536312d 	ldrpl	r3, [r6, #-301]!	@ 0xfffffed3
    2418:	5f5f004b 	svcpl	0x005f004b
    241c:	5f504656 	svcpl	0x00504656
    2420:	5f5f5046 	svcpl	0x005f5046
    2424:	5f003120 	svcpl	0x00003120
    2428:	464c555f 			@ <UNDEFINED> instruction: 0x464c555f
    242c:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    2430:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2434:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2438:	46464658 			@ <UNDEFINED> instruction: 0x46464658
    243c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    2440:	332d5046 			@ <UNDEFINED> instruction: 0x332d5046
    2444:	524c5532 	subpl	r5, ip, #209715200	@ 0xc800000
    2448:	485f5f00 	ldmdami	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    244c:	42465f41 	submi	r5, r6, #260	@ 0x104
    2450:	5f5f5449 	svcpl	0x005f5449
    2454:	5f003720 	svcpl	0x00003720
    2458:	5254505f 	subspl	r5, r4, #95	@ 0x5f
    245c:	46464944 	strbmi	r4, [r6], -r4, asr #18
    2460:	4449575f 	strbmi	r5, [r9], #-1887	@ 0xfffff8a1
    2464:	5f5f4854 	svcpl	0x005f4854
    2468:	00323320 	eorseq	r3, r2, r0, lsr #6
    246c:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    2470:	5f323354 	svcpl	0x00323354
    2474:	4f4e4544 	svcmi	0x004e4544
    2478:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 2338 <_Min_Stack_Size+0x1f38>
    247c:	5f5f4e49 	svcpl	0x005f4e49
    2480:	342e3120 	strtcc	r3, [lr], #-288	@ 0xfffffee0
    2484:	39323130 	ldmdbcc	r2!, {r4, r5, r8, ip, sp}
    2488:	34363438 	ldrtcc	r3, [r6], #-1080	@ 0xfffffbc8
    248c:	38343233 	ldmdacc	r4!, {r0, r1, r4, r5, r9, ip, sp}
    2490:	65313731 	ldrvs	r3, [r1, #-1841]!	@ 0xfffff8cf
    2494:	4635342d 	ldrtmi	r3, [r5], -sp, lsr #8
    2498:	5f003233 	svcpl	0x00003233
    249c:	42444c5f 	submi	r4, r4, #24320	@ 0x5f00
    24a0:	41485f4c 	cmpmi	r8, ip, asr #30
    24a4:	55515f53 	ldrbpl	r5, [r1, #-3923]	@ 0xfffff0ad
    24a8:	5f544549 	svcpl	0x00544549
    24ac:	5f4e414e 	svcpl	0x004e414e
    24b0:	0031205f 	eorseq	r2, r1, pc, asr r0
    24b4:	41535f5f 	cmpmi	r3, pc, asr pc
    24b8:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    24bc:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    24c0:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    24c4:	3158302d 	cmpcc	r8, sp, lsr #32
    24c8:	4b483750 	blmi	1210210 <_Min_Stack_Size+0x120fe10>
    24cc:	3158302d 	cmpcc	r8, sp, lsr #32
