NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    24d0:	4b483750 	blmi	1210218 <_Min_Stack_Size+0x120fe18>
    24d4:	5f5f0029 	svcpl	0x005f0029
    24d8:	5f544e49 	svcpl	0x00544e49
    24dc:	54444957 	strbpl	r4, [r4], #-2391	@ 0xfffff6a9
    24e0:	205f5f48 	subscs	r5, pc, r8, asr #30
    24e4:	5f003233 	svcpl	0x00003233
    24e8:	4343475f 	movtmi	r4, #14175	@ 0x375f
    24ec:	4f54415f 	svcmi	0x0054415f
    24f0:	5f43494d 	svcpl	0x0043494d
    24f4:	4e494f50 	mcrmi	15, 2, r4, cr9, cr0, {2}
    24f8:	5f524554 	svcpl	0x00524554
    24fc:	4b434f4c 	blmi	10d6234 <_Min_Stack_Size+0x10d5e34>
    2500:	4552465f 	ldrbmi	r4, [r2, #-1631]	@ 0xfffff9a1
    2504:	00322045 	eorseq	r2, r2, r5, asr #32
    2508:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    250c:	3436544e 	ldrtcc	r5, [r6], #-1102	@ 0xfffffbb2
    2510:	6328435f 			@ <UNDEFINED> instruction: 0x6328435f
    2514:	20632029 	rsbcs	r2, r3, r9, lsr #32
    2518:	55202323 	strpl	r2, [r0, #-803]!	@ 0xfffffcdd
    251c:	5f004c4c 	svcpl	0x00004c4c
    2520:	43414c5f 	movtmi	r4, #7263	@ 0x1c5f
    2524:	5f4d5543 	svcpl	0x004d5543
    2528:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
    252c:	5f4e4f4c 	svcpl	0x004e4f4c
    2530:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    2534:	332d5031 			@ <UNDEFINED> instruction: 0x332d5031
    2538:	004b4c31 	subeq	r4, fp, r1, lsr ip
    253c:	46535f5f 	usaxmi	r5, r3, pc	@ <UNPREDICTABLE>
    2540:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    2544:	5350455f 	cmppl	r0, #398458880	@ 0x17c00000
    2548:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    254c:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2550:	2d503178 	ldfcse	f3, [r0, #-480]	@ 0xfffffe20
    2554:	00524837 	subseq	r4, r2, r7, lsr r8
    2558:	475f534f 	ldrbmi	r5, [pc, -pc, asr #6]
    255c:	505f5445 	subspl	r5, pc, r5, asr #8
    2560:	61285053 	qsubvs	r5, r3, r8
    2564:	20296464 	eorcs	r6, r9, r4, ror #8
    2568:	73615f5f 	cmnvc	r1, #380	@ 0x17c
    256c:	6f76206d 	svcvs	0x0076206d
    2570:	6974616c 	ldmdbvs	r4!, {r2, r3, r5, r6, r8, sp, lr}^
    2574:	2228656c 	eorcs	r6, r8, #108, 10	@ 0x1b000000
    2578:	2073726d 	rsbscs	r7, r3, sp, ror #4
    257c:	2c203072 	stccs	0, cr3, [r0], #-456	@ 0xfffffe38
    2580:	20505350 	subscs	r5, r0, r0, asr r3
    2584:	745c6e5c 	ldrbvc	r6, [ip], #-3676	@ 0xfffff1a4
    2588:	766f6d20 	strbtvc	r6, [pc], -r0, lsr #26
    258c:	20302520 	eorscs	r2, r0, r0, lsr #10
    2590:	3072202c 	rsbscc	r2, r2, ip, lsr #32
    2594:	3a202220 	bcc	80ae1c <_Min_Stack_Size+0x80aa1c>
    2598:	723d2220 	eorsvc	r2, sp, #32, 4
    259c:	64612822 	strbtvs	r2, [r1], #-2082	@ 0xfffff7de
    25a0:	29202964 	stmdbcs	r0!, {r2, r5, r6, r8, fp, sp}
    25a4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 16ac <_Min_Stack_Size+0x12ac>
    25a8:	495f5151 	ldmdbmi	pc, {r0, r4, r6, r8, ip, lr}^	@ <UNPREDICTABLE>
    25ac:	5f544942 	svcpl	0x00544942
    25b0:	0030205f 	eorseq	r2, r0, pc, asr r0
    25b4:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    25b8:	58323354 	ldmdapl	r2!, {r2, r4, r6, r8, r9, ip, sp}
    25bc:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    25c0:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    25c4:	3739372e 	ldrcc	r3, [r9, -lr, lsr #14]!
    25c8:	31333936 	teqcc	r3, r6, lsr r9
    25cc:	36383433 			@ <UNDEFINED> instruction: 0x36383433
    25d0:	35313332 	ldrcc	r3, [r1, #-818]!	@ 0xfffffcce
    25d4:	332b6537 			@ <UNDEFINED> instruction: 0x332b6537
    25d8:	33463830 	movtcc	r3, #26672	@ 0x6830
    25dc:	5f007832 	svcpl	0x00007832
    25e0:	5153555f 	cmppl	r3, pc, asr r5
    25e4:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    25e8:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    25ec:	5f003233 	svcpl	0x00003233
    25f0:	5f41485f 	svcpl	0x0041485f
    25f4:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    25f8:	38205f5f 	stmdacc	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    25fc:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    2600:	415f4343 	cmpmi	pc, r3, asr #6
    2604:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    2608:	48435f43 	stmdami	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    260c:	32335241 	eorscc	r5, r3, #268435460	@ 0x10000004
    2610:	4c5f545f 	cfldrdmi	mvd5, [pc], {95}	@ 0x5f
    2614:	5f4b434f 	svcpl	0x004b434f
    2618:	45455246 	strbmi	r5, [r5, #-582]	@ 0xfffffdba
    261c:	5f003220 	svcpl	0x00003220
    2620:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    2624:	4352415f 	cmpmi	r2, #-1073741801	@ 0xc0000017
    2628:	4d375f48 	ldcmi	15, cr5, [r7, #-288]!	@ 0xfffffee0
    262c:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    2630:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    2634:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    2638:	5350455f 	cmppl	r0, #398458880	@ 0x17c00000
    263c:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    2640:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2644:	2d503178 	ldfcse	f3, [r0, #-480]	@ 0xfffffe20
    2648:	00523531 	subseq	r3, r2, r1, lsr r5
    264c:	54535f5f 	ldrbpl	r5, [r3], #-3935	@ 0xfffff0a1
    2650:	485f4344 	ldmdami	pc, {r2, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    2654:	4554534f 	ldrbmi	r5, [r4, #-847]	@ 0xfffffcb1
    2658:	205f5f44 	subscs	r5, pc, r4, asr #30
    265c:	5f5f0031 	svcpl	0x005f0031
    2660:	50544e49 	subspl	r4, r4, r9, asr #28
    2664:	4d5f5254 	lfmmi	f5, 2, [pc, #-336]	@ 251c <_Min_Stack_Size+0x211c>
    2668:	5f5f5841 	svcpl	0x005f5841
    266c:	37783020 	ldrbcc	r3, [r8, -r0, lsr #32]!
    2670:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2674:	00666666 	rsbeq	r6, r6, r6, ror #12
    2678:	52505f5f 	subspl	r5, r0, #380	@ 0x17c
    267c:	414d4741 	cmpmi	sp, r1, asr #14
    2680:	4445525f 	strbmi	r5, [r5], #-607	@ 0xfffffda1
    2684:	4e494645 	cdpmi	6, 4, cr4, cr9, cr5, {2}
    2688:	58455f45 	stmdapl	r5, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    268c:	4d414e54 	stclmi	14, cr4, [r1, #-336]	@ 0xfffffeb0
    2690:	00312045 	eorseq	r2, r1, r5, asr #32
    2694:	4f535f5f 	svcmi	0x00535f5f
    2698:	50465446 	subpl	r5, r6, r6, asr #8
    269c:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    26a0:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    26a4:	3436544c 	ldrtcc	r5, [r6], #-1100	@ 0xfffffbb4
    26a8:	5350455f 	cmppl	r0, #398458880	@ 0x17c00000
    26ac:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    26b0:	32205f5f 	eorcc	r5, r0, #380	@ 0x17c
    26b4:	3032322e 	eorscc	r3, r2, lr, lsr #4
    26b8:	30363434 	eorscc	r3, r6, r4, lsr r4
    26bc:	35323934 	ldrcc	r3, [r2, #-2356]!	@ 0xfffff6cc
    26c0:	33313330 	teqcc	r1, #48, 6	@ 0xc0000000
    26c4:	312d6531 			@ <UNDEFINED> instruction: 0x312d6531
    26c8:	34364636 	ldrtcc	r4, [r6], #-1590	@ 0xfffff9ca
    26cc:	435f5f00 	cmpmi	pc, #0, 30
    26d0:	31524148 	cmpcc	r2, r8, asr #2
    26d4:	59545f36 	ldmdbpl	r4, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    26d8:	5f5f4550 	svcpl	0x005f4550
    26dc:	6f687320 	svcvs	0x00687320
    26e0:	75207472 	strvc	r7, [r0, #-1138]!	@ 0xfffffb8e
    26e4:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    26e8:	2064656e 	rsbcs	r6, r4, lr, ror #10
    26ec:	00746e69 	rsbseq	r6, r4, r9, ror #28
    26f0:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    26f4:	414d5f54 	cmpmi	sp, r4, asr pc
    26f8:	58455f58 	stmdapl	r5, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    26fc:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
    2700:	00383231 	eorseq	r3, r8, r1, lsr r2
    2704:	54415f5f 	strbpl	r5, [r1], #-3935	@ 0xfffff0a1
    2708:	43494d4f 	movtmi	r4, #40271	@ 0x9d4f
    270c:	5143415f 	cmppl	r3, pc, asr r1
    2710:	4c45525f 	sfmmi	f5, 2, [r5], {95}	@ 0x5f
    2714:	5f003420 	svcpl	0x00003420
    2718:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    271c:	41465f54 	cmpmi	r6, r4, asr pc
    2720:	34365453 	ldrtcc	r5, [r6], #-1107	@ 0xfffffbad
    2724:	5059545f 	subspl	r5, r9, pc, asr r4
    2728:	205f5f45 	subscs	r5, pc, r5, asr #30
    272c:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    2730:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    2734:	6e752067 	cdpvs	0, 7, cr2, cr5, cr7, {3}
    2738:	6e676973 			@ <UNDEFINED> instruction: 0x6e676973
    273c:	69206465 	stmdbvs	r0!, {r0, r2, r5, r6, sl, sp, lr}
    2740:	4f00746e 	svcmi	0x0000746e
    2744:	50535f53 	subspl	r5, r3, r3, asr pc
    2748:	5053505f 	subspl	r5, r3, pc, asr r0
    274c:	5f202928 	svcpl	0x00202928
    2750:	6d73615f 	ldfvse	f6, [r3, #-380]!	@ 0xfffffe84
    2754:	6c6f7620 	stclvs	6, cr7, [pc], #-128	@ 26dc <_Min_Stack_Size+0x22dc>
    2758:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
    275c:	6d222865 	stcvs	8, cr2, [r2, #-404]!	@ 0xfffffe6c
    2760:	72207372 	eorvc	r7, r0, #-939524095	@ 0xc8000001
    2764:	432c2030 			@ <UNDEFINED> instruction: 0x432c2030
    2768:	52544e4f 	subspl	r4, r4, #1264	@ 0x4f0
    276c:	5c204c4f 	stcpl	12, cr4, [r0], #-316	@ 0xfffffec4
    2770:	20745c6e 	rsbscs	r5, r4, lr, ror #24
    2774:	20766f6d 	rsbscs	r6, r6, sp, ror #30
    2778:	2c203172 	stfcss	f3, [r0], #-456	@ 0xfffffe38
    277c:	30783023 	rsbscc	r3, r8, r3, lsr #32
    2780:	6e5c2032 	mrcvs	0, 2, r2, cr12, cr2, {1}
    2784:	2020745c 	eorcs	r7, r0, ip, asr r4
    2788:	2072726f 	rsbscs	r7, r2, pc, ror #4
    278c:	722c3072 	eorvc	r3, ip, #114	@ 0x72
    2790:	31722c30 	cmncc	r2, r0, lsr ip
    2794:	5c6e5c20 	stclpl	12, cr5, [lr], #-128	@ 0xffffff80
    2798:	736d2074 	cmnvc	sp, #116	@ 0x74
    279c:	4f432072 	svcmi	0x00432072
    27a0:	4f52544e 	svcmi	0x0052544e
    27a4:	202c204c 	eorcs	r2, ip, ip, asr #32
    27a8:	29223072 	stmdbcs	r2!, {r1, r4, r5, r6, ip, sp}
    27ac:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 18b4 <_Min_Stack_Size+0x14b4>
    27b0:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    27b4:	545f5841 	ldrbpl	r5, [pc], #-2113	@ 27bc <_Min_Stack_Size+0x23bc>
    27b8:	5f455059 	svcpl	0x00455059
    27bc:	6f6c205f 	svcvs	0x006c205f
    27c0:	6c20676e 	stcvs	7, cr6, [r0], #-440	@ 0xfffffe48
    27c4:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    27c8:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    27cc:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    27d0:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    27d4:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    27d8:	3233544c 	eorscc	r5, r3, #76, 8	@ 0x4c000000
    27dc:	4f4e5f58 	svcmi	0x004e5f58
    27e0:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 26a0 <_Min_Stack_Size+0x22a0>
    27e4:	5f5f5841 	svcpl	0x005f5841
    27e8:	372e3120 	strcc	r3, [lr, -r0, lsr #2]!
    27ec:	39363739 	ldmdbcc	r6!, {r0, r3, r4, r5, r8, r9, sl, ip, sp}
    27f0:	34333133 	ldrtcc	r3, [r3], #-307	@ 0xfffffecd
    27f4:	33323638 	teqcc	r2, #56, 12	@ 0x3800000
    27f8:	65373531 	ldrvs	r3, [r7, #-1329]!	@ 0xfffffacf
    27fc:	3830332b 	ldmdacc	r0!, {r0, r1, r3, r5, r8, r9, ip, sp}
    2800:	78323346 	ldmdavc	r2!, {r1, r2, r6, r8, r9, ip, sp}
    2804:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    2808:	5f4c4244 	svcpl	0x004c4244
    280c:	49535045 	ldmdbmi	r3, {r0, r2, r6, ip, lr}^
    2810:	5f4e4f4c 	svcpl	0x004e4f4c
    2814:	2e32205f 	mrccs	0, 1, r2, cr2, cr15, {2}
    2818:	34303232 	ldrtcc	r3, [r0], #-562	@ 0xfffffdce
    281c:	34303634 	ldrtcc	r3, [r0], #-1588	@ 0xfffff9cc
    2820:	30353239 	eorscc	r3, r5, r9, lsr r2
    2824:	31333133 	teqcc	r3, r3, lsr r1
    2828:	36312d65 	ldrtcc	r2, [r1], -r5, ror #26
    282c:	5f5f004c 	svcpl	0x005f004c
    2830:	50544e49 	subspl	r4, r4, r9, asr #28
    2834:	545f5254 	ldrbpl	r5, [pc], #-596	@ 283c <_Min_Stack_Size+0x243c>
    2838:	5f455059 	svcpl	0x00455059
    283c:	6e69205f 	mcrvs	0, 3, r2, cr9, cr15, {2}
    2840:	5f5f0074 	svcpl	0x005f0074
    2844:	5f434544 	svcpl	0x00434544
    2848:	4c415645 	mcrrmi	6, 4, r5, r1, cr5
    284c:	54454d5f 	strbpl	r4, [r5], #-3423	@ 0xfffff2a1
    2850:	5f444f48 	svcpl	0x00444f48
    2854:	0032205f 	eorseq	r2, r2, pc, asr r0
    2858:	53555f5f 	cmppl	r5, #380	@ 0x17c
    285c:	55434341 	strbpl	r4, [r3, #-833]	@ 0xfffffcbf
    2860:	494d5f4d 	stmdbmi	sp, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2864:	205f5f4e 	subscs	r5, pc, lr, asr #30
    2868:	55302e30 	ldrpl	r2, [r0, #-3632]!	@ 0xfffff1d0
    286c:	5f004b48 	svcpl	0x00004b48
    2870:	4653555f 			@ <UNDEFINED> instruction: 0x4653555f
    2874:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    2878:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    287c:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    2880:	5f5f0030 	svcpl	0x005f0030
    2884:	5f544e49 	svcpl	0x00544e49
    2888:	5341454c 	movtpl	r4, #5452	@ 0x154c
    288c:	5f323354 	svcpl	0x00323354
    2890:	54444957 	strbpl	r4, [r4], #-2391	@ 0xfffff6a9
    2894:	205f5f48 	subscs	r5, pc, r8, asr #30
    2898:	5f003233 	svcpl	0x00003233
    289c:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    28a0:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    28a4:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
    28a8:	5059545f 	subspl	r5, r9, pc, asr r4
    28ac:	205f5f45 	subscs	r5, pc, r5, asr #30
    28b0:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    28b4:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    28b8:	61686320 	cmnvs	r8, r0, lsr #6
    28bc:	5f5f0072 	svcpl	0x005f0072
    28c0:	43554e47 	cmpmi	r5, #1136	@ 0x470
    28c4:	4449575f 	strbmi	r5, [r9], #-1887	@ 0xfffff8a1
    28c8:	58455f45 	stmdapl	r5, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    28cc:	54554345 	ldrbpl	r4, [r5], #-837	@ 0xfffffcbb
    28d0:	5f4e4f49 	svcpl	0x004e4f49
    28d4:	52414843 	subpl	r4, r1, #4390912	@ 0x430000
    28d8:	5f544553 	svcpl	0x00544553
    28dc:	454d414e 	strbmi	r4, [sp, #-334]	@ 0xfffffeb2
    28e0:	54552220 	ldrbpl	r2, [r5], #-544	@ 0xfffffde0
    28e4:	32332d46 	eorscc	r2, r3, #4480	@ 0x1180
    28e8:	0022454c 	eoreq	r4, r2, ip, asr #10
    28ec:	51445f5f 	cmppl	r4, pc, asr pc
    28f0:	4942495f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    28f4:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    28f8:	5f5f0030 	svcpl	0x005f0030
    28fc:	5f544c46 	svcpl	0x00544c46
    2900:	5f58414d 	svcpl	0x0058414d
    2904:	2e33205f 	mrccs	0, 1, r2, cr3, cr15, {2}
    2908:	38323034 	ldmdacc	r2!, {r2, r4, r5, ip, sp}
    290c:	36343332 			@ <UNDEFINED> instruction: 0x36343332
    2910:	35383336 	ldrcc	r3, [r8, #-822]!	@ 0xfffffcca
    2914:	36383832 			@ <UNDEFINED> instruction: 0x36383832
    2918:	38332b65 	ldmdacc	r3!, {r0, r2, r5, r6, r8, r9, fp, sp}
    291c:	5f5f0046 	svcpl	0x005f0046
    2920:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    2924:	494d5f32 	stmdbmi	sp, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    2928:	205f5f4e 	subscs	r5, pc, lr, asr #30
    292c:	37312e31 			@ <UNDEFINED> instruction: 0x37312e31
    2930:	34393435 	ldrtcc	r3, [r9], #-1077	@ 0xfffffbcb
    2934:	38303533 	ldmdacc	r0!, {r0, r1, r4, r5, r8, sl, ip, sp}
    2938:	38323232 	ldmdacc	r2!, {r1, r4, r5, r9, ip, sp}
    293c:	2d653537 	cfstr64cs	mvdx3, [r5, #-220]!	@ 0xffffff24
    2940:	33463833 	movtcc	r3, #26675	@ 0x6833
    2944:	5f5f0032 	svcpl	0x005f0032
    2948:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    294c:	5059545f 	subspl	r5, r9, pc, asr r4
    2950:	205f5f45 	subscs	r5, pc, r5, asr #30
    2954:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    2958:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    295c:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    2960:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 1a68 <_Min_Stack_Size+0x1668>
    2964:	43414c4c 	movtmi	r4, #7244	@ 0x1c4c
    2968:	5f4d5543 	svcpl	0x004d5543
    296c:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    2970:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    2974:	5f5f0032 	svcpl	0x005f0032
    2978:	36544c46 	ldrbcc	r4, [r4], -r6, asr #24
    297c:	494d5f34 	stmdbmi	sp, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    2980:	58455f4e 	stmdapl	r5, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2984:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
    2988:	30312d28 	eorscc	r2, r1, r8, lsr #26
    298c:	00293132 	eoreq	r3, r9, r2, lsr r1
    2990:	52465f5f 	subpl	r5, r6, #380	@ 0x17c
    2994:	5f544341 	svcpl	0x00544341
    2998:	54494246 	strbpl	r4, [r9], #-582	@ 0xfffffdba
    299c:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    29a0:	5f5f0035 	svcpl	0x005f0035
    29a4:	5f434347 	svcpl	0x00434347
    29a8:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	@ 28ac <_Min_Stack_Size+0x24ac>
    29ac:	535f4349 	cmppl	pc, #603979777	@ 0x24000001
    29b0:	54524f48 	ldrbpl	r4, [r2], #-3912	@ 0xfffff0b8
    29b4:	434f4c5f 	movtmi	r4, #64607	@ 0xfc5f
    29b8:	52465f4b 	subpl	r5, r6, #300	@ 0x12c
    29bc:	32204545 	eorcc	r4, r0, #289406976	@ 0x11400000
    29c0:	61735500 	cmnvs	r3, r0, lsl #10
    29c4:	61466567 	cmpvs	r6, r7, ror #10
    29c8:	5f746c75 	svcpl	0x00746c75
    29cc:	646e6148 	strbtvs	r6, [lr], #-328	@ 0xfffffeb8
    29d0:	7272656c 	rsbsvc	r6, r2, #108, 10	@ 0x1b000000
    29d4:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 1adc <_Min_Stack_Size+0x16dc>
    29d8:	495f4154 	ldmdbmi	pc, {r2, r4, r6, r8, lr}^	@ <UNPREDICTABLE>
    29dc:	5f544942 	svcpl	0x00544942
    29e0:	3436205f 	ldrtcc	r2, [r6], #-95	@ 0xffffffa1
    29e4:	69614d00 	stmdbvs	r1!, {r8, sl, fp, lr}^
    29e8:	74535f6e 	ldrbvc	r5, [r3], #-3950	@ 0xfffff092
    29ec:	5f6b6361 	svcpl	0x006b6361
    29f0:	657a6953 	ldrbvs	r6, [sl, #-2387]!	@ 0xfffff6ad
    29f4:	37303320 	ldrcc	r3, [r0, -r0, lsr #6]!
    29f8:	5f5f0032 	svcpl	0x005f0032
    29fc:	5f544c46 	svcpl	0x00544c46
    2a00:	5f4e494d 	svcpl	0x004e494d
    2a04:	455f3031 	ldrbmi	r3, [pc, #-49]	@ 29db <_Min_Stack_Size+0x25db>
    2a08:	5f5f5058 	svcpl	0x005f5058
    2a0c:	332d2820 			@ <UNDEFINED> instruction: 0x332d2820
    2a10:	5f002937 	svcpl	0x00002937
    2a14:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    2a18:	5f583233 	svcpl	0x00583233
    2a1c:	5f4e494d 	svcpl	0x004e494d
    2a20:	5f505845 	svcpl	0x00505845
    2a24:	2d28205f 	stccs	0, cr2, [r8, #-380]!	@ 0xfffffe84
    2a28:	31323031 	teqcc	r2, r1, lsr r0
    2a2c:	5f5f0029 	svcpl	0x005f0029
    2a30:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    2a34:	455f5832 	ldrbmi	r5, [pc, #-2098]	@ 220a <_Min_Stack_Size+0x1e0a>
    2a38:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    2a3c:	5f5f4e4f 	svcpl	0x005f4e4f
    2a40:	322e3220 	eorcc	r3, lr, #32, 4
    2a44:	34343032 	ldrtcc	r3, [r4], #-50	@ 0xffffffce
    2a48:	39343036 	ldmdbcc	r4!, {r1, r2, r4, r5, ip, sp}
    2a4c:	33303532 	teqcc	r0, #209715200	@ 0xc800000
    2a50:	65313331 	ldrvs	r3, [r1, #-817]!	@ 0xfffffccf
    2a54:	4636312d 	ldrtmi	r3, [r6], -sp, lsr #2
    2a58:	00783233 	rsbseq	r3, r8, r3, lsr r2
    2a5c:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    2a60:	56455f54 			@ <UNDEFINED> instruction: 0x56455f54
    2a64:	4d5f4c41 	ldclmi	12, cr4, [pc, #-260]	@ 2968 <_Min_Stack_Size+0x2568>
    2a68:	4f485445 	svcmi	0x00485445
    2a6c:	53545f44 	cmppl	r4, #68, 30	@ 0x110
    2a70:	3638315f 			@ <UNDEFINED> instruction: 0x3638315f
    2a74:	335f3136 	cmpcc	pc, #-2147483635	@ 0x8000000d
    2a78:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2a7c:	445f5f00 	ldrbmi	r5, [pc], #-3840	@ 2a84 <_Min_Stack_Size+0x2684>
    2a80:	485f4c42 	ldmdami	pc, {r1, r6, sl, fp, lr}^	@ <UNPREDICTABLE>
    2a84:	495f5341 	ldmdbmi	pc, {r0, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
    2a88:	4e49464e 	cdpmi	6, 4, cr4, cr9, cr14, {2}
    2a8c:	5f595449 	svcpl	0x00595449
    2a90:	0031205f 	eorseq	r2, r1, pc, asr r0
    2a94:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    2a98:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
    2a9c:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
    2aa0:	42515f45 	subsmi	r5, r1, #276	@ 0x114
    2aa4:	31205449 			@ <UNDEFINED> instruction: 0x31205449
    2aa8:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    2aac:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    2ab0:	33545341 	cmpcc	r4, #67108865	@ 0x4000001
    2ab4:	59545f32 	ldmdbpl	r4, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    2ab8:	5f5f4550 	svcpl	0x005f4550
    2abc:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    2ac0:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    2ac4:	485f544c 	ldmdami	pc, {r2, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    2ac8:	515f5341 	cmppl	pc, r1, asr #6
    2acc:	54454955 	strbpl	r4, [r5], #-2389	@ 0xfffff6ab
    2ad0:	4e414e5f 	mcrmi	14, 2, r4, cr1, cr15, {2}
    2ad4:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    2ad8:	535f5f00 	cmppl	pc, #0, 30
    2adc:	4f455a49 	svcmi	0x00455a49
    2ae0:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    2ae4:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    2ae8:	5f5f0034 	svcpl	0x005f0034
    2aec:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    2af0:	545f5841 	ldrbpl	r5, [pc], #-2113	@ 2af8 <_Min_Stack_Size+0x26f8>
    2af4:	5f455059 	svcpl	0x00455059
    2af8:	6f6c205f 	svcvs	0x006c205f
    2afc:	6c20676e 	stcvs	7, cr6, [r0], #-440	@ 0xfffffe48
    2b00:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    2b04:	00746e69 	rsbseq	r6, r4, r9, ror #28
    2b08:	42445f5f 	submi	r5, r4, #380	@ 0x17c
    2b0c:	50455f4c 	subpl	r5, r5, ip, asr #30
    2b10:	4f4c4953 	svcmi	0x004c4953
    2b14:	205f5f4e 	subscs	r5, pc, lr, asr #30
    2b18:	6f642828 	svcvs	0x00642828
    2b1c:	656c6275 	strbvs	r6, [ip, #-629]!	@ 0xfffffd8b
    2b20:	322e3229 	eorcc	r3, lr, #-1879048190	@ 0x90000002
    2b24:	34343032 	ldrtcc	r3, [r4], #-50	@ 0xffffffce
    2b28:	39343036 	ldmdbcc	r4!, {r1, r2, r4, r5, ip, sp}
    2b2c:	33303532 	teqcc	r0, #209715200	@ 0xc800000
    2b30:	65313331 	ldrvs	r3, [r1, #-817]!	@ 0xfffffccf
    2b34:	4c36312d 	ldfmis	f3, [r6], #-180	@ 0xffffff4c
    2b38:	5f5f0029 	svcpl	0x005f0029
    2b3c:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    2b40:	435f5841 	cmpmi	pc, #4259840	@ 0x410000
    2b44:	20296328 	eorcs	r6, r9, r8, lsr #6
    2b48:	23232063 			@ <UNDEFINED> instruction: 0x23232063
    2b4c:	004c4c20 	subeq	r4, ip, r0, lsr #24
    2b50:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    2b54:	45465f4d 	strbmi	r5, [r6, #-3917]	@ 0xfffff0b3
    2b58:	52555441 	subspl	r5, r5, #1090519040	@ 0x41000000
    2b5c:	564d5f45 	strbpl	r5, [sp], -r5, asr #30
    2b60:	5f5f0045 	svcpl	0x005f0045
    2b64:	53435041 	movtpl	r5, #12353	@ 0x3041
    2b68:	5f32335f 	svcpl	0x0032335f
    2b6c:	0031205f 	eorseq	r2, r1, pc, asr r0
    2b70:	42445f5f 	submi	r5, r4, #380	@ 0x17c
    2b74:	45445f4c 	strbmi	r5, [r4, #-3916]	@ 0xfffff0b4
    2b78:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	@ 0xfffffec8
    2b7c:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    2b80:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    2b84:	756f6428 	strbvc	r6, [pc, #-1064]!	@ 2764 <_Min_Stack_Size+0x2364>
    2b88:	29656c62 	stmdbcs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    2b8c:	34392e34 	ldrtcc	r2, [r9], #-3636	@ 0xfffff1cc
    2b90:	36353630 			@ <UNDEFINED> instruction: 0x36353630
    2b94:	34383534 	ldrtcc	r3, [r8], #-1332	@ 0xfffffacc
    2b98:	36343231 			@ <UNDEFINED> instruction: 0x36343231
    2b9c:	2d653435 	cfstrdcs	mvd3, [r5, #-212]!	@ 0xffffff2c
    2ba0:	4c343233 	lfmmi	f3, 4, [r4], #-204	@ 0xffffff34
    2ba4:	5f5f0029 	svcpl	0x005f0029
    2ba8:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    2bac:	545f3436 	ldrbpl	r3, [pc], #-1078	@ 2bb4 <_Min_Stack_Size+0x27b4>
    2bb0:	5f455059 	svcpl	0x00455059
    2bb4:	6f6c205f 	svcvs	0x006c205f
    2bb8:	6c20676e 	stcvs	7, cr6, [r0], #-440	@ 0xfffffe48
    2bbc:	20676e6f 	rsbcs	r6, r7, pc, ror #28
    2bc0:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    2bc4:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    2bc8:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    2bcc:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    2bd0:	3233544c 	eorscc	r5, r3, #76, 8	@ 0x4c000000
    2bd4:	41485f58 	cmpmi	r8, r8, asr pc
    2bd8:	55515f53 	ldrbpl	r5, [r1, #-3923]	@ 0xfffff0ad
    2bdc:	5f544549 	svcpl	0x00544549
    2be0:	5f4e414e 	svcpl	0x004e414e
    2be4:	0031205f 	eorseq	r2, r1, pc, asr r0
    2be8:	42445f5f 	submi	r5, r4, #380	@ 0x17c
    2bec:	414d5f4c 	cmpmi	sp, ip, asr #30
    2bf0:	30315f58 	eorscc	r5, r1, r8, asr pc
    2bf4:	5058455f 	subspl	r4, r8, pc, asr r5
    2bf8:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    2bfc:	48003830 	stmdami	r0, {r4, r5, fp, ip, sp}
    2c00:	6e495f77 	mcrvs	15, 2, r5, cr9, cr7, {3}
    2c04:	5f007469 	svcpl	0x00007469
    2c08:	5f41545f 	svcpl	0x0041545f
