NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    2c0c:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    2c10:	36205f5f 	qsaxcc	r5, r0, pc	@ <UNPREDICTABLE>
    2c14:	5f5f0034 	svcpl	0x005f0034
    2c18:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    2c1c:	465f464f 	ldrbmi	r4, [pc], -pc, asr #12
    2c20:	54414f4c 	strbpl	r4, [r1], #-3916	@ 0xfffff0b4
    2c24:	34205f5f 	strtcc	r5, [r0], #-3935	@ 0xfffff0a1
    2c28:	72614800 	rsbvc	r4, r1, #0, 16
    2c2c:	75614664 	strbvc	r4, [r1, #-1636]!	@ 0xfffff99c
    2c30:	485f746c 	ldmdami	pc, {r2, r3, r5, r6, sl, ip, sp, lr}^	@ <UNPREDICTABLE>
    2c34:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
    2c38:	5f007265 	svcpl	0x00007265
    2c3c:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    2c40:	5f583233 	svcpl	0x00583233
    2c44:	5f534148 	svcpl	0x00534148
    2c48:	49464e49 	stmdbmi	r6, {r0, r3, r6, r9, sl, fp, lr}^
    2c4c:	5954494e 	ldmdbpl	r4, {r1, r2, r3, r6, r8, fp, lr}^
    2c50:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    2c54:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 1d5c <_Min_Stack_Size+0x195c>
    2c58:	5f544e49 	svcpl	0x00544e49
    2c5c:	5341454c 	movtpl	r4, #5452	@ 0x154c
    2c60:	5f363154 	svcpl	0x00363154
    2c64:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
    2c68:	73205f5f 			@ <UNDEFINED> instruction: 0x73205f5f
    2c6c:	74726f68 	ldrbtvc	r6, [r2], #-3944	@ 0xfffff098
    2c70:	736e7520 	cmnvc	lr, #32, 10	@ 0x8000000
    2c74:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    2c78:	6e692064 	cdpvs	0, 6, cr2, cr9, cr4, {3}
    2c7c:	5f5f0074 	svcpl	0x005f0074
    2c80:	5f4d5241 	svcpl	0x004d5241
    2c84:	48435241 	stmdami	r3, {r0, r6, r9, ip, lr}^
    2c88:	4f52505f 	svcmi	0x0052505f
    2c8c:	454c4946 	strbmi	r4, [ip, #-2374]	@ 0xfffff6ba
    2c90:	00373720 	eorseq	r3, r7, r0, lsr #14
    2c94:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    2c98:	41465f54 	cmpmi	r6, r4, asr pc
    2c9c:	5f385453 	svcpl	0x00385453
    2ca0:	54444957 	strbpl	r4, [r4], #-2391	@ 0xfffff6a9
    2ca4:	205f5f48 	subscs	r5, pc, r8, asr #30
    2ca8:	5f003233 	svcpl	0x00003233
    2cac:	42444c5f 	submi	r4, r4, #24320	@ 0x5f00
    2cb0:	414d5f4c 	cmpmi	sp, ip, asr #30
    2cb4:	58455f58 	stmdapl	r5, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    2cb8:	205f5f50 	subscs	r5, pc, r0, asr pc	@ <UNPREDICTABLE>
    2cbc:	34323031 	ldrtcc	r3, [r2], #-49	@ 0xffffffcf
    2cc0:	565f5f00 	ldrbpl	r5, [pc], -r0, lsl #30
    2cc4:	49535245 	ldmdbmi	r3, {r0, r2, r6, r9, ip, lr}^
    2cc8:	5f5f4e4f 	svcpl	0x005f4e4f
    2ccc:	32312220 	eorscc	r2, r1, #32, 4
    2cd0:	312e332e 			@ <UNDEFINED> instruction: 0x312e332e
    2cd4:	32303220 	eorscc	r3, r0, #32, 4
    2cd8:	32363033 	eorscc	r3, r6, #51	@ 0x33
    2cdc:	5f002236 	svcpl	0x00002236
    2ce0:	544c465f 	strbpl	r4, [ip], #-1631	@ 0xfffff9a1
    2ce4:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    2ce8:	5058455f 	subspl	r4, r8, pc, asr r5
    2cec:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    2cf0:	3532312d 	ldrcc	r3, [r2, #-301]!	@ 0xfffffed3
    2cf4:	5f5f0029 	svcpl	0x005f0029
    2cf8:	5f4d5241 	svcpl	0x004d5241
    2cfc:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
    2d00:	5f455255 	svcpl	0x00455255
    2d04:	4d54414d 	ldfmie	f4, [r4, #-308]	@ 0xfffffecc
    2d08:	495f4c55 	ldmdbmi	pc, {r0, r2, r4, r6, sl, fp, lr}^	@ <UNPREDICTABLE>
    2d0c:	0038544e 	eorseq	r5, r8, lr, asr #8
    2d10:	45445f5f 	strbmi	r5, [r4, #-3935]	@ 0xfffff0a1
    2d14:	414d4943 	cmpmi	sp, r3, asr #18
    2d18:	49445f4c 	stmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    2d1c:	205f5f47 	subscs	r5, pc, r7, asr #30
    2d20:	5f003731 	svcpl	0x00003731
    2d24:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    2d28:	435f3233 	cmpmi	pc, #805306371	@ 0x30000003
    2d2c:	20296328 	eorcs	r6, r9, r8, lsr #6
    2d30:	23232063 			@ <UNDEFINED> instruction: 0x23232063
    2d34:	5f004c20 	svcpl	0x00004c20
    2d38:	4d52415f 	ldfmie	f4, [r2, #-380]	@ 0xfffffe84
    2d3c:	3150465f 	cmpcc	r0, pc, asr r6
    2d40:	4f465f36 	svcmi	0x00465f36
    2d44:	54414d52 	strbpl	r4, [r1], #-3410	@ 0xfffff2ae
    2d48:	544c415f 	strbpl	r4, [ip], #-351	@ 0xfffffea1
    2d4c:	414e5245 	cmpmi	lr, r5, asr #4
    2d50:	45564954 	ldrbmi	r4, [r6, #-2388]	@ 0xfffff6ac
    2d54:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    2d58:	5f4c4244 	svcpl	0x004c4244
    2d5c:	5f58414d 	svcpl	0x0058414d
    2d60:	455f3031 	ldrbmi	r3, [pc, #-49]	@ 2d37 <_Min_Stack_Size+0x2937>
    2d64:	5f5f5058 	svcpl	0x005f5058
    2d68:	38303320 	ldmdacc	r0!, {r5, r8, r9, ip, sp}
    2d6c:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    2d70:	3233544c 	eorscc	r5, r3, #76, 8	@ 0x4c000000
    2d74:	414d5f58 	cmpmi	sp, r8, asr pc
    2d78:	30315f58 	eorscc	r5, r1, r8, asr pc
    2d7c:	5058455f 	subspl	r4, r8, pc, asr r5
    2d80:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    2d84:	5f003830 	svcpl	0x00003830
    2d88:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    2d8c:	52545054 	subspl	r5, r4, #84	@ 0x54
    2d90:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2d94:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2d98:	66666678 			@ <UNDEFINED> instruction: 0x66666678
    2d9c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2da0:	5f005566 	svcpl	0x00005566
    2da4:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	@ 0x5f
    2da8:	5341485f 	movtpl	r4, #6239	@ 0x185f
    2dac:	4e45445f 	mcrmi	4, 2, r4, cr5, cr15, {2}
    2db0:	5f4d524f 	svcpl	0x004d524f
    2db4:	0031205f 	eorseq	r2, r1, pc, asr r0
    2db8:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    2dbc:	455f4355 	ldrbmi	r4, [pc, #-853]	@ 2a6f <_Min_Stack_Size+0x266f>
    2dc0:	55434558 	strbpl	r4, [r3, #-1368]	@ 0xfffffaa8
    2dc4:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    2dc8:	4148435f 	cmpmi	r8, pc, asr r3
    2dcc:	54455352 	strbpl	r5, [r5], #-850	@ 0xfffffcae
    2dd0:	4d414e5f 	stclmi	14, cr4, [r1, #-380]	@ 0xfffffe84
    2dd4:	55222045 	strpl	r2, [r2, #-69]!	@ 0xffffffbb
    2dd8:	382d4654 	stmdacc	sp!, {r2, r4, r6, r9, sl, lr}
    2ddc:	5f5f0022 	svcpl	0x005f0022
    2de0:	5f4d5241 	svcpl	0x004d5241
    2de4:	54414546 	strbpl	r4, [r1], #-1350	@ 0xfffffaba
    2de8:	5f455255 	svcpl	0x00455255
    2dec:	33435243 	movtcc	r5, #12867	@ 0x3243
    2df0:	5f5f0032 	svcpl	0x005f0032
    2df4:	33544c46 	cmpcc	r4, #17920	@ 0x4600
    2df8:	414d5f32 	cmpmi	sp, r2, lsr pc
    2dfc:	30315f58 	eorscc	r5, r1, r8, asr pc
    2e00:	5058455f 	subspl	r4, r8, pc, asr r5
    2e04:	33205f5f 			@ <UNDEFINED> instruction: 0x33205f5f
    2e08:	5f5f0038 	svcpl	0x005f0038
    2e0c:	465f5151 			@ <UNDEFINED> instruction: 0x465f5151
    2e10:	5f544942 	svcpl	0x00544942
    2e14:	0037205f 	eorseq	r2, r7, pc, asr r0
    2e18:	464c5f5f 			@ <UNDEFINED> instruction: 0x464c5f5f
    2e1c:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    2e20:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2e24:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2e28:	46463758 			@ <UNDEFINED> instruction: 0x46463758
    2e2c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    2e30:	332d5046 			@ <UNDEFINED> instruction: 0x332d5046
    2e34:	00524c31 	subseq	r4, r2, r1, lsr ip
    2e38:	20554e47 	subscs	r4, r5, r7, asr #28
    2e3c:	20313143 	eorscs	r3, r1, r3, asr #2
    2e40:	332e3231 			@ <UNDEFINED> instruction: 0x332e3231
    2e44:	3220312e 	eorcc	r3, r0, #-2147483637	@ 0x8000000b
    2e48:	30333230 	eorscc	r3, r3, r0, lsr r2
    2e4c:	20363236 	eorscs	r3, r6, r6, lsr r2
    2e50:	70636d2d 	rsbvc	r6, r3, sp, lsr #26
    2e54:	6f633d75 	svcvs	0x00633d75
    2e58:	78657472 	stmdavc	r5!, {r1, r4, r5, r6, sl, ip, sp, lr}^
    2e5c:	20336d2d 	eorscs	r6, r3, sp, lsr #26
    2e60:	6c666d2d 	stclvs	13, cr6, [r6], #-180	@ 0xffffff4c
    2e64:	2d74616f 	ldfcse	f6, [r4, #-444]!	@ 0xfffffe44
    2e68:	3d696261 	sfmcc	f6, 2, [r9, #-388]!	@ 0xfffffe7c
    2e6c:	74666f73 	strbtvc	r6, [r6], #-3955	@ 0xfffff08d
    2e70:	746d2d20 	strbtvc	r2, [sp], #-3360	@ 0xfffff2e0
    2e74:	626d7568 	rsbvs	r7, sp, #104, 10	@ 0x1a000000
    2e78:	616d2d20 	cmnvs	sp, r0, lsr #26
    2e7c:	3d686372 	stclcc	3, cr6, [r8, #-456]!	@ 0xfffffe38
    2e80:	766d7261 	strbtvc	r7, [sp], -r1, ror #4
    2e84:	206d2d37 	rsbcs	r2, sp, r7, lsr sp
    2e88:	7764672d 	strbvc	r6, [r4, -sp, lsr #14]!
    2e8c:	2d667261 	sfmcs	f7, 2, [r6, #-388]!	@ 0xfffffe7c
    2e90:	672d2032 			@ <UNDEFINED> instruction: 0x672d2032
    2e94:	4f2d2033 	svcmi	0x002d2033
    2e98:	732d2031 			@ <UNDEFINED> instruction: 0x732d2031
    2e9c:	673d6474 			@ <UNDEFINED> instruction: 0x673d6474
    2ea0:	3131756e 	teqcc	r1, lr, ror #10
    2ea4:	66662d20 	strbtvs	r2, [r6], -r0, lsr #26
    2ea8:	74636e75 	strbtvc	r6, [r3], #-3701	@ 0xfffff18b
    2eac:	2d6e6f69 	stclcs	15, cr6, [lr, #-420]!	@ 0xfffffe5c
    2eb0:	74636573 	strbtvc	r6, [r3], #-1395	@ 0xfffffa8d
    2eb4:	736e6f69 	cmnvc	lr, #420	@ 0x1a4
    2eb8:	64662d20 	strbtvs	r2, [r6], #-3360	@ 0xfffff2e0
    2ebc:	2d617461 	cfstrdcs	mvd7, [r1, #-388]!	@ 0xfffffe7c
    2ec0:	74636573 	strbtvc	r6, [r3], #-1395	@ 0xfffffa8d
    2ec4:	736e6f69 	cmnvc	lr, #420	@ 0x1a4
    2ec8:	73662d20 	cmnvc	r6, #32, 26	@ 0x800
    2ecc:	6b636174 	blvs	18db4a4 <_Min_Stack_Size+0x18db0a4>
    2ed0:	6173752d 	cmnvs	r3, sp, lsr #10
    2ed4:	2d206567 	cfstr32cs	mvfx6, [r0, #-412]!	@ 0xfffffe64
    2ed8:	63796366 	cmnvs	r9, #-1744830463	@ 0x98000001
    2edc:	616d6f6c 	cmnvs	sp, ip, ror #30
    2ee0:	2d636974 			@ <UNDEFINED> instruction: 0x2d636974
    2ee4:	706d6f63 	rsbvc	r6, sp, r3, ror #30
    2ee8:	6978656c 	ldmdbvs	r8!, {r2, r3, r5, r6, r8, sl, sp, lr}^
    2eec:	5f007974 	svcpl	0x00007974
    2ef0:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    2ef4:	41454c5f 	cmpmi	r5, pc, asr ip
    2ef8:	32335453 	eorscc	r5, r3, #1392508928	@ 0x53000000
    2efc:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2f00:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2f04:	66663778 			@ <UNDEFINED> instruction: 0x66663778
    2f08:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2f0c:	5f004c66 	svcpl	0x00004c66
    2f10:	414c4c5f 	cmpmi	ip, pc, asr ip
    2f14:	4d554343 	ldclmi	3, cr4, [r5, #-268]	@ 0xfffffef4
    2f18:	4942465f 	stmdbmi	r2, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    2f1c:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    2f20:	5f003133 	svcpl	0x00003133
    2f24:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    2f28:	58414d54 	stmdapl	r1, {r2, r4, r6, r8, sl, fp, lr}^
    2f2c:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2f30:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2f34:	66666678 			@ <UNDEFINED> instruction: 0x66666678
    2f38:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2f3c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2f40:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2f44:	4c4c5566 	cfstr64mi	mvdx5, [ip], {102}	@ 0x66
    2f48:	535f5f00 	cmppl	pc, #0, 30
    2f4c:	415f4749 	cmpmi	pc, r9, asr #14
    2f50:	494d4f54 	stmdbmi	sp, {r2, r4, r6, r8, r9, sl, fp, lr}^
    2f54:	59545f43 	ldmdbpl	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    2f58:	5f5f4550 	svcpl	0x005f4550
    2f5c:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    2f60:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    2f64:	4152464c 	cmpmi	r2, ip, asr #12
    2f68:	4d5f5443 	cfldrdmi	mvd5, [pc, #-268]	@ 2e64 <_Min_Stack_Size+0x2a64>
    2f6c:	5f5f4e49 	svcpl	0x005f4e49
    2f70:	302d2820 	eorcc	r2, sp, r0, lsr #16
    2f74:	4c4c352e 	cfstr64mi	mvdx3, [ip], {46}	@ 0x2e
    2f78:	2e302d52 	mrccs	13, 1, r2, cr0, cr2, {2}
    2f7c:	524c4c35 	subpl	r4, ip, #13568	@ 0x3500
    2f80:	5f5f0029 	svcpl	0x005f0029
    2f84:	464c4c55 			@ <UNDEFINED> instruction: 0x464c4c55
    2f88:	54434152 	strbpl	r4, [r3], #-338	@ 0xfffffeae
    2f8c:	5350455f 	cmppl	r0, #398458880	@ 0x17c00000
    2f90:	4e4f4c49 	cdpmi	12, 4, cr4, cr15, cr9, {2}
    2f94:	30205f5f 	eorcc	r5, r0, pc, asr pc
    2f98:	2d503178 	ldfcse	f3, [r0, #-480]	@ 0xfffffe20
    2f9c:	4c553436 	cfldrdmi	mvd3, [r5], {54}	@ 0x36
    2fa0:	5f00524c 	svcpl	0x0000524c
    2fa4:	42444c5f 	submi	r4, r4, #24320	@ 0x5f00
    2fa8:	41485f4c 	cmpmi	r8, ip, asr #30
    2fac:	45445f53 	strbmi	r5, [r4, #-3923]	@ 0xfffff0ad
    2fb0:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	@ 0xfffffec8
    2fb4:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    2fb8:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 20c0 <_Min_Stack_Size+0x1cc0>
    2fbc:	5f544e49 	svcpl	0x00544e49
    2fc0:	5341454c 	movtpl	r4, #5452	@ 0x154c
    2fc4:	5f363154 	svcpl	0x00363154
    2fc8:	5f58414d 	svcpl	0x0058414d
    2fcc:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    2fd0:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    2fd4:	415f5f00 	cmpmi	pc, r0, lsl #30
    2fd8:	465f4d52 			@ <UNDEFINED> instruction: 0x465f4d52
    2fdc:	55544145 	ldrbpl	r4, [r4, #-325]	@ 0xfffffebb
    2fe0:	4c5f4552 	cfldr64mi	mvdx4, [pc], {82}	@ 0x52
    2fe4:	58455244 	stmdapl	r5, {r2, r6, r9, ip, lr}^
    2fe8:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    2fec:	5f4c4244 	svcpl	0x004c4244
    2ff0:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	@ 0xfffffec8
    2ff4:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    2ff8:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    2ffc:	3739372e 	ldrcc	r3, [r9, -lr, lsr #14]!
    3000:	31333936 	teqcc	r3, r6, lsr r9
    3004:	36383433 			@ <UNDEFINED> instruction: 0x36383433
    3008:	35313332 	ldrcc	r3, [r1, #-818]!	@ 0xfffffcce
    300c:	332b6537 			@ <UNDEFINED> instruction: 0x332b6537
    3010:	004c3830 	subeq	r3, ip, r0, lsr r8
    3014:	4c555f5f 	mrrcmi	15, 5, r5, r5, cr15	@ <UNPREDICTABLE>
    3018:	4343414c 	movtmi	r4, #12620	@ 0x314c
    301c:	455f4d55 	ldrbmi	r4, [pc, #-3413]	@ 22cf <_Min_Stack_Size+0x1ecf>
    3020:	4c495350 	mcrrmi	3, 5, r5, r9, cr0
    3024:	5f5f4e4f 	svcpl	0x005f4e4f
    3028:	31783020 	cmncc	r8, r0, lsr #32
    302c:	32332d50 	eorscc	r2, r3, #80, 26	@ 0x1400
    3030:	4b4c4c55 	blmi	131618c <_Min_Stack_Size+0x1315d8c>
    3034:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 213c <_Min_Stack_Size+0x1d3c>
    3038:	43434153 	movtmi	r4, #12627	@ 0x3153
    303c:	465f4d55 			@ <UNDEFINED> instruction: 0x465f4d55
    3040:	5f544942 	svcpl	0x00544942
    3044:	0038205f 	eorseq	r2, r8, pc, asr r0
    3048:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    304c:	41485f54 	cmpmi	r8, r4, asr pc
    3050:	45445f53 	strbmi	r5, [r4, #-3923]	@ 0xfffff0ad
    3054:	4d524f4e 	ldclmi	15, cr4, [r2, #-312]	@ 0xfffffec8
    3058:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    305c:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    3060:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    3064:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    3068:	49575f34 	ldmdbmi	r7, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    306c:	5f485444 	svcpl	0x00485444
    3070:	3436205f 	ldrtcc	r2, [r6], #-95	@ 0xffffffa1
    3074:	445f5f00 	ldrbmi	r5, [pc], #-3840	@ 307c <_Min_Stack_Size+0x2c7c>
    3078:	445f4c42 	ldrbmi	r4, [pc], #-3138	@ 3080 <_Min_Stack_Size+0x2c80>
    307c:	4d494345 	stclmi	3, cr4, [r9, #-276]	@ 0xfffffeec
    3080:	445f4c41 	ldrbmi	r4, [pc], #-3137	@ 3088 <_Min_Stack_Size+0x2c88>
    3084:	5f5f4749 	svcpl	0x005f4749
    3088:	00373120 	eorseq	r3, r7, r0, lsr #2
    308c:	4d435f5f 	stclmi	15, cr5, [r3, #-380]	@ 0xfffffe84
    3090:	5f534953 	svcpl	0x00534953
    3094:	5f434347 	svcpl	0x00434347
    3098:	5f455355 	svcpl	0x00455355
    309c:	28474552 	stmdacs	r7, {r1, r4, r6, r8, sl, lr}^
    30a0:	22202972 	eorcs	r2, r0, #1867776	@ 0x1c8000
    30a4:	28202272 	stmdacs	r0!, {r1, r4, r5, r6, r9, sp}
    30a8:	4e002972 			@ <UNDEFINED> instruction: 0x4e002972
    30ac:	5f434956 	svcpl	0x00434956
    30b0:	52495453 	subpl	r5, r9, #1392508928	@ 0x53000000
    30b4:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    30b8:	4d5f4449 	cfldrdmi	mvd4, [pc, #-292]	@ 2f9c <_Min_Stack_Size+0x2b9c>
    30bc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    30c0:	46317830 			@ <UNDEFINED> instruction: 0x46317830
    30c4:	204c5546 	subcs	r5, ip, r6, asr #10
    30c8:	43530029 	cmpmi	r3, #41	@ 0x29
    30cc:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    30d0:	5f525343 	svcpl	0x00525343
    30d4:	54535953 	ldrbpl	r5, [r3], #-2387	@ 0xfffff6ad
    30d8:	414b4349 	cmpmi	fp, r9, asr #6
    30dc:	505f5443 	subspl	r5, pc, r3, asr #8
    30e0:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    30e4:	4e005531 	mcrmi	5, 0, r5, cr0, cr1, {1}
    30e8:	5f434956 	svcpl	0x00434956
    30ec:	36515249 	ldrbcc	r5, [r1], -r9, asr #4
    30f0:	5458455f 	ldrbpl	r4, [r8], #-1375	@ 0xfffffaa1
    30f4:	445f3049 	ldrbmi	r3, [pc], #-73	@ 30fc <_Min_Stack_Size+0x2cfc>
    30f8:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
    30fc:	2928656c 	stmdbcs	r8!, {r2, r3, r5, r6, r8, sl, sp, lr}
    3100:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    3104:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    3108:	30524543 	subscc	r4, r2, r3, asr #10
    310c:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    3110:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    3114:	2936203c 	ldmdbcs	r6!, {r2, r3, r4, r5, sp}
    3118:	43520029 	cmpmi	r2, #41	@ 0x29
    311c:	44415f43 	strbmi	r5, [r1], #-3907	@ 0xfffff0bd
    3120:	435f3143 	cmpmi	pc, #-1073741808	@ 0xc0000010
    3124:	455f4b4c 	ldrbmi	r4, [pc, #-2892]	@ 25e0 <_Min_Stack_Size+0x21e0>
    3128:	2029284e 	eorcs	r2, r9, lr, asr #16
    312c:	43435228 	movtmi	r5, #12840	@ 0x3228
    3130:	50413e2d 	subpl	r3, r1, sp, lsr #28
    3134:	4e453242 	cdpmi	2, 4, cr3, cr5, cr2, {2}
    3138:	3d7c2052 	ldclcc	0, cr2, [ip, #-328]!	@ 0xfffffeb8
    313c:	20312820 	eorscs	r2, r1, r0, lsr #16
    3140:	39203c3c 	stmdbcc	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    3144:	49002929 	stmdbmi	r0, {r0, r3, r5, r8, fp, sp}
    3148:	5f324332 	svcpl	0x00324332
    314c:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    3150:	65502820 	ldrbvs	r2, [r0, #-2080]	@ 0xfffff7e0
    3154:	68706972 	ldmdavs	r0!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    3158:	6c617265 	sfmvs	f7, 2, [r1], #-404	@ 0xfffffe6c
    315c:	41425f73 	hvcmi	9715	@ 0x25f3
    3160:	2b204553 	blcs	8146b4 <_Min_Stack_Size+0x8142b4>
    3164:	30783020 	rsbscc	r3, r8, r0, lsr #32
    3168:	35303030 	ldrcc	r3, [r0, #-48]!	@ 0xffffffd0
    316c:	55303038 	ldrpl	r3, [r0, #-56]!	@ 0xffffffc8
    3170:	5500294c 	strpl	r2, [r0, #-2380]	@ 0xfffff6b4
    3174:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    3178:	52495f31 	subpl	r5, r9, #49, 30	@ 0xc4
    317c:	37332051 			@ <UNDEFINED> instruction: 0x37332051
    3180:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    3184:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    3188:	4f495443 	svcmi	0x00495443
    318c:	41445f4e 	cmpmi	r4, lr, asr #30
    3190:	41564154 	cmpmi	r6, r4, asr r1
    3194:	31524444 	cmpcc	r2, r4, asr #8
    3198:	736f505f 	cmnvc	pc, #95	@ 0x5f
    319c:	55363120 	ldrpl	r3, [r6, #-288]!	@ 0xfffffee0
    31a0:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    31a4:	65535f43 	ldrbvs	r5, [r3, #-3907]	@ 0xfffff0bd
    31a8:	69725074 	ldmdbvs	r2!, {r2, r4, r5, r6, ip, lr}^
    31ac:	7469726f 	strbtvc	r7, [r9], #-623	@ 0xfffffd91
    31b0:	5f5f2079 	svcpl	0x005f2079
    31b4:	4349564e 	movtmi	r5, #38478	@ 0x964e
    31b8:	7465535f 	strbtvc	r5, [r5], #-863	@ 0xfffffca1
    31bc:	6f697250 	svcvs	0x00697250
    31c0:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    31c4:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    31c8:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    31cc:	495f314f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
    31d0:	5f304d54 	svcpl	0x00304d54
    31d4:	206b734d 	rsbcs	r7, fp, sp, asr #6
    31d8:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    31dc:	204c5546 	subcs	r5, ip, r6, asr #10
    31e0:	49460029 	stmdbmi	r6, {r0, r3, r5}^
    31e4:	455f4f46 	ldrbmi	r4, [pc, #-3910]	@ 22a6 <_Min_Stack_Size+0x1ea6>
    31e8:	5954504d 	ldmdbpl	r4, {r0, r2, r3, r6, ip, lr}^
    31ec:	43324900 	teqmi	r2, #0, 18
    31f0:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    31f4:	424d535f 	submi	r5, sp, #2080374785	@ 0x7c000001
    31f8:	41464544 	cmpmi	r6, r4, asr #10
    31fc:	20544c55 	subscs	r4, r4, r5, asr ip
    3200:	5f433249 	svcpl	0x00433249
    3204:	5f325253 	svcpl	0x00325253
    3208:	44424d53 	strbmi	r4, [r2], #-3411	@ 0xfffff2ad
    320c:	55414645 	strbpl	r4, [r1, #-1605]	@ 0xfffff9bb
    3210:	4d5f544c 	cfldrdmi	mvd5, [pc, #-304]	@ 30e8 <_Min_Stack_Size+0x2ce8>
    3214:	5f006b73 	svcpl	0x00006b73
    3218:	53494d5f 	movtpl	r4, #40287	@ 0x9d5f
    321c:	49565f43 	ldmdbmi	r6, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    3220:	4c424953 	mcrrmi	9, 5, r4, r2, cr3	@ <UNPREDICTABLE>
    3224:	00312045 	eorseq	r2, r1, r5, asr #32
    3228:	5f55504d 	svcpl	0x0055504d
    322c:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    3230:	4d5f435f 	ldclmi	3, cr4, [pc, #-380]	@ 30bc <_Min_Stack_Size+0x2cbc>
    3234:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    3238:	204c5531 	subcs	r5, ip, r1, lsr r5
    323c:	4d203c3c 	stcmi	12, cr3, [r0, #-240]!	@ 0xffffff10
    3240:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    3244:	5f525341 	svcpl	0x00525341
    3248:	6f505f43 	svcvs	0x00505f43
    324c:	53002973 	movwpl	r2, #2419	@ 0x973
    3250:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    3254:	44495550 	strbmi	r5, [r9], #-1360	@ 0xfffffab0
    3258:	504d495f 	subpl	r4, sp, pc, asr r9
    325c:	454d454c 	strbmi	r4, [sp, #-1356]	@ 0xfffffab4
    3260:	5245544e 	subpl	r5, r5, #1308622848	@ 0x4e000000
    3264:	6b734d5f 	blvs	1cd67e8 <_Min_Stack_Size+0x1cd63e8>
    3268:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    326c:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    3270:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    3274:	5f424353 	svcpl	0x00424353
    3278:	49555043 	ldmdbmi	r5, {r0, r1, r6, ip, lr}^
    327c:	4d495f44 	stclmi	15, cr5, [r9, #-272]	@ 0xfffffef0
    3280:	4d454c50 	stclmi	12, cr4, [r5, #-320]	@ 0xfffffec0
    3284:	45544e45 	ldrbmi	r4, [r4, #-3653]	@ 0xfffff1bb
    3288:	6f505f52 	svcvs	0x00505f52
    328c:	53002973 	movwpl	r2, #2419	@ 0x973
    3290:	43536e43 	cmpmi	r3, #1072	@ 0x430
    3294:	43415f42 	movtmi	r5, #8002	@ 0x1f42
    3298:	5f524c54 	svcpl	0x00524c54
    329c:	4f534944 	svcmi	0x00534944
    32a0:	5f50464f 	svcpl	0x0050464f
    32a4:	206b734d 	rsbcs	r7, fp, sp, asr #6
    32a8:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    32ac:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    32b0:	536e4353 	cmnpl	lr, #1275068417	@ 0x4c000001
    32b4:	415f4243 	cmpmi	pc, r3, asr #4
    32b8:	524c5443 	subpl	r5, ip, #1124073472	@ 0x43000000
    32bc:	5349445f 	movtpl	r4, #37983	@ 0x945f
    32c0:	50464f4f 	subpl	r4, r6, pc, asr #30
    32c4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    32c8:	5f5f0029 	svcpl	0x005f0029
    32cc:	44495753 	strbmi	r5, [r9], #-1875	@ 0xfffff8ad
    32d0:	32783020 	rsbscc	r3, r8, #32
    32d4:	00303030 	eorseq	r3, r0, r0, lsr r0
    32d8:	5f435845 	svcpl	0x00435845
    32dc:	55544552 	ldrbpl	r4, [r4, #-1362]	@ 0xfffffaae
    32e0:	485f4e52 	ldmdami	pc, {r1, r4, r6, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    32e4:	4c444e41 	mcrrmi	14, 4, r4, r4, cr1
    32e8:	28205245 	stmdacs	r0!, {r0, r2, r6, r9, ip, lr}
    32ec:	46467830 			@ <UNDEFINED> instruction: 0x46467830
    32f0:	46464646 	strbmi	r4, [r6], -r6, asr #12
    32f4:	4c553146 	ldfmie	f3, [r5], {70}	@ 0x46
    32f8:	5f5f0029 	svcpl	0x005f0029
    32fc:	4b434150 	blmi	10d3844 <_Min_Stack_Size+0x10d3444>
    3300:	555f4445 	ldrbpl	r4, [pc, #-1093]	@ 2ec3 <_Min_Stack_Size+0x2ac3>
    3304:	4e4f494e 	vmlsmi.f16	s9, s30, s28	@ <UNPREDICTABLE>
    3308:	696e7520 	stmdbvs	lr!, {r5, r8, sl, ip, sp, lr}^
    330c:	5f206e6f 	svcpl	0x00206e6f
    3310:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    3314:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    3318:	5f5f6574 	svcpl	0x005f6574
    331c:	61702828 	cmnvs	r0, r8, lsr #16
    3320:	64656b63 	strbtvs	r6, [r5], #-2915	@ 0xfffff49d
    3324:	6c61202c 	stclvs	0, cr2, [r1], #-176	@ 0xffffff50
    3328:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    332c:	29312864 	ldmdbcs	r1!, {r2, r5, r6, fp, sp}
    3330:	53002929 	movwpl	r2, #2345	@ 0x929
    3334:	65747379 	ldrbvs	r7, [r4, #-889]!	@ 0xfffffc87
    3338:	654d5f6d 	strbvs	r5, [sp, #-3949]	@ 0xfffff093
