NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    333c:	79726f6d 	ldmdbvc	r2!, {r0, r2, r3, r5, r6, r8, r9, sl, fp, sp, lr}^
    3340:	5341425f 	movtpl	r4, #4703	@ 0x125f
    3344:	78302045 	ldmdavc	r0!, {r0, r2, r6, sp}
    3348:	46464631 			@ <UNDEFINED> instruction: 0x46464631
    334c:	30303046 	eorscc	r3, r0, r6, asr #32
    3350:	5f004c55 	svcpl	0x00004c55
    3354:	544e4957 	strbpl	r4, [lr], #-2391	@ 0xfffff6a9
    3358:	0020545f 	eoreq	r5, r0, pc, asr r4
    335c:	4f495047 	svcmi	0x00495047
    3360:	41425f44 	cmpmi	r2, r4, asr #30
    3364:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    3368:	69726550 	ldmdbvs	r2!, {r4, r6, r8, sl, sp, lr}^
    336c:	72656870 	rsbvc	r6, r5, #112, 16	@ 0x700000
    3370:	5f736c61 	svcpl	0x00736c61
    3374:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    3378:	30202b20 	eorcc	r2, r0, r0, lsr #22
    337c:	30303078 	eorscc	r3, r0, r8, ror r0
    3380:	30343131 	eorscc	r3, r4, r1, lsr r1
    3384:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
    3388:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    338c:	5f544e45 	svcpl	0x00544e45
    3390:	41454c43 	cmpmi	r5, r3, asr #24
    3394:	2850554e 	ldmdacs	r0, {r1, r2, r3, r6, r8, sl, ip, lr}^
    3398:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    339c:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    33a0:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    33a4:	5f3e2d29 	svcpl	0x003e2d29
    33a8:	656c635f 	strbvs	r6, [ip, #-863]!	@ 0xfffffca1
    33ac:	70756e61 	rsbsvc	r6, r5, r1, ror #28
    33b0:	4e490029 	cdpmi	0, 4, cr0, cr9, cr9, {1}
    33b4:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    33b8:	31545341 	cmpcc	r4, r1, asr #6
    33bc:	494d5f36 	stmdbmi	sp, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    33c0:	2d28204e 	stccs	0, cr2, [r8, #-312]!	@ 0xfffffec8
    33c4:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    33c8:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    33cc:	31545341 	cmpcc	r4, r1, asr #6
    33d0:	414d5f36 	cmpmi	sp, r6, lsr pc
    33d4:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    33d8:	2931202d 	ldmdbcs	r1!, {r0, r2, r3, r5, sp}
    33dc:	4d544900 	vldrmi.16	s9, [r4, #-0]	@ <UNPREDICTABLE>
    33e0:	5243545f 	subpl	r5, r3, #1593835520	@ 0x5f000000
    33e4:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    33e8:	5f414e45 	svcpl	0x00414e45
    33ec:	20736f50 	rsbscs	r6, r3, r0, asr pc
    33f0:	53005530 	movwpl	r5, #1328	@ 0x530
    33f4:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    33f8:	5f525346 	svcpl	0x00525346
    33fc:	52504d49 	subspl	r4, r0, #4672	@ 0x1240
    3400:	53494345 	movtpl	r4, #37701	@ 0x9345
    3404:	5f525245 	svcpl	0x00525245
    3408:	206b734d 	rsbcs	r7, fp, sp, asr #6
    340c:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    3410:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    3414:	5f424353 	svcpl	0x00424353
    3418:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    341c:	504d495f 	subpl	r4, sp, pc, asr r9
    3420:	49434552 	stmdbmi	r3, {r1, r4, r6, r8, sl, lr}^
    3424:	52524553 	subspl	r4, r2, #348127232	@ 0x14c00000
    3428:	736f505f 	cmnvc	pc, #95	@ 0x5f
    342c:	50540029 	subspl	r0, r4, r9, lsr #32
    3430:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    3434:	5f304f46 	svcpl	0x00304f46
    3438:	304d5445 	subcc	r5, sp, r5, asr #8
    343c:	6b734d5f 	blvs	1cd69c0 <_Min_Stack_Size+0x1cd65c0>
    3440:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    3444:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    3448:	47002920 	strmi	r2, [r0, -r0, lsr #18]
    344c:	5f4f4950 	svcpl	0x004f4950
    3450:	5f4e4950 	svcpl	0x004e4950
    3454:	28282038 	stmdacs	r8!, {r3, r4, r5, sp}
    3458:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    345c:	745f3631 	ldrbvc	r3, [pc], #-1585	@ 3464 <_Min_Stack_Size+0x3064>
    3460:	30783029 	rsbscc	r3, r8, r9, lsr #32
    3464:	29303031 	ldmdbcs	r0!, {r0, r4, r5, ip, sp}
    3468:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    346c:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    3470:	58455f4c 	stmdapl	r5, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    3474:	54564543 	ldrbpl	r4, [r6], #-1347	@ 0xfffffabd
    3478:	5f414e45 	svcpl	0x00414e45
    347c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    3480:	31783028 	cmncc	r8, r8, lsr #32
    3484:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    3488:	5744203c 	smlaldxpl	r2, r4, ip, r0
    348c:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    3490:	455f4c52 	ldrbmi	r4, [pc, #-3154]	@ 2846 <_Min_Stack_Size+0x2446>
    3494:	56454358 			@ <UNDEFINED> instruction: 0x56454358
    3498:	414e4554 	cmpmi	lr, r4, asr r5
    349c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    34a0:	32490029 	subcc	r0, r9, #41	@ 0x29
    34a4:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    34a8:	54535f31 	ldrbpl	r5, [r3], #-3889	@ 0xfffff0cf
    34ac:	5f545241 	svcpl	0x00545241
    34b0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    34b4:	29553828 	ldmdbcs	r5, {r3, r5, fp, ip, sp}^
    34b8:	43324900 	teqmi	r2, #0, 18
    34bc:	3152535f 	cmpcc	r2, pc, asr r3
    34c0:	5245425f 	subpl	r4, r5, #-268435451	@ 0xf0000005
    34c4:	734d5f52 	movtvc	r5, #57170	@ 0xdf52
    34c8:	3028206b 	eorcc	r2, r8, fp, rrx
    34cc:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    34d0:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    34d4:	5f433249 	svcpl	0x00433249
    34d8:	5f315253 	svcpl	0x00315253
    34dc:	52524542 	subspl	r4, r2, #276824064	@ 0x10800000
    34e0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    34e4:	32490029 	subcc	r0, r9, #41	@ 0x29
    34e8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    34ec:	4e455f31 	mcrmi	15, 2, r5, cr5, cr1, {1}
    34f0:	5f434550 	svcpl	0x00434550
    34f4:	206b734d 	rsbcs	r7, fp, sp, asr #6
    34f8:	31783028 	cmncc	r8, r8, lsr #32
    34fc:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    3500:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    3504:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    3508:	4e455f31 	mcrmi	15, 2, r5, cr5, cr1, {1}
    350c:	5f434550 	svcpl	0x00434550
    3510:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    3514:	4c435f00 	mcrrmi	15, 0, r5, r3, cr0
    3518:	5f4b434f 	svcpl	0x004b434f
    351c:	75205f54 	strvc	r5, [r0, #-3924]!	@ 0xfffff0ac
    3520:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    3524:	2064656e 	rsbcs	r6, r4, lr, ror #10
    3528:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    352c:	6e435300 	cdpvs	3, 4, cr5, cr3, cr0, {0}
    3530:	5f424353 	svcpl	0x00424353
    3534:	4c544341 	mrrcmi	3, 4, r4, r4, cr1	@ <UNPREDICTABLE>
    3538:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    353c:	464f4f53 			@ <UNDEFINED> instruction: 0x464f4f53
    3540:	6f505f50 	svcvs	0x00505f50
    3544:	55392073 	ldrpl	r2, [r9, #-115]!	@ 0xffffff8d
    3548:	53504100 	cmppl	r0, #0, 2
    354c:	5f5a5f52 	svcpl	0x005a5f52
    3550:	206b734d 	rsbcs	r7, fp, sp, asr #6
    3554:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    3558:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    355c:	52535041 	subspl	r5, r3, #65	@ 0x41
    3560:	505f5a5f 	subspl	r5, pc, pc, asr sl	@ <UNPREDICTABLE>
    3564:	0029736f 	eoreq	r7, r9, pc, ror #6
    3568:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    356c:	5f58414d 	svcpl	0x0058414d
    3570:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    3574:	52414c43 	subpl	r4, r1, #17152	@ 0x4300
    3578:	00204445 	eoreq	r4, r0, r5, asr #8
    357c:	5f424353 	svcpl	0x00424353
    3580:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    3584:	434f4e5f 	movtmi	r4, #65119	@ 0xfe5f
    3588:	6f505f50 	svcvs	0x00505f50
    358c:	53282073 			@ <UNDEFINED> instruction: 0x53282073
    3590:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    3594:	5f525346 	svcpl	0x00525346
    3598:	46475355 			@ <UNDEFINED> instruction: 0x46475355
    359c:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    35a0:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    35a4:	2b20736f 	blcs	820368 <_Min_Stack_Size+0x81ff68>
    35a8:	29553320 	ldmdbcs	r5, {r5, r8, r9, ip, sp}^
    35ac:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    35b0:	4f4d5f4f 	svcmi	0x004d5f4f
    35b4:	4f5f4544 	svcmi	0x005f4544
    35b8:	55505455 	ldrbpl	r5, [r0, #-1109]	@ 0xfffffbab
    35bc:	50505f54 	subspl	r5, r0, r4, asr pc
    35c0:	30783020 	rsbscc	r3, r8, r0, lsr #32
    35c4:	30303030 	eorscc	r3, r0, r0, lsr r0
    35c8:	75343030 	ldrvc	r3, [r4, #-48]!	@ 0xffffffd0
    35cc:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    35d0:	4c43554e 	cfstr64mi	mvdx5, [r3], {78}	@ 0x4e
    35d4:	5f454b49 	svcpl	0x00454b49
    35d8:	4c495542 	cfstr64mi	mvdx5, [r9], {66}	@ 0x42
    35dc:	5f4e4954 	svcpl	0x004e4954
    35e0:	534e4f43 	movtpl	r4, #61251	@ 0xef43
    35e4:	544e4154 	strbpl	r4, [lr], #-340	@ 0xfffffeac
    35e8:	3120505f 	qsubcc	r5, pc, r0	@ <UNPREDICTABLE>
    35ec:	43324900 	teqmi	r2, #0, 18
    35f0:	52414f5f 	subpl	r4, r1, #380	@ 0x17c
    35f4:	4e455f32 	mcrmi	15, 2, r5, cr5, cr2, {1}
    35f8:	4c415544 	cfstr64mi	mvdx5, [r1], {68}	@ 0x44
    35fc:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    3600:	52414f5f 	subpl	r4, r1, #380	@ 0x17c
    3604:	4e455f32 	mcrmi	15, 2, r5, cr5, cr2, {1}
    3608:	4c415544 	cfstr64mi	mvdx5, [r1], {68}	@ 0x44
    360c:	6b734d5f 	blvs	1cd6b90 <_Min_Stack_Size+0x1cd6790>
    3610:	42435300 	submi	r5, r3, #0, 6
    3614:	5249415f 	subpl	r4, r9, #-1073741801	@ 0xc0000017
    3618:	565f5243 	ldrbpl	r5, [pc], -r3, asr #4
    361c:	4b544345 	blmi	1514338 <_Min_Stack_Size+0x1513f38>
    3620:	54535945 	ldrbpl	r5, [r3], #-2373	@ 0xfffff6bb
    3624:	505f5441 	subspl	r5, pc, r1, asr #8
    3628:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    362c:	5f005536 	svcpl	0x00005536
    3630:	6972705f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, ip, sp, lr}^
    3634:	6c66746e 	cfstrdvs	mvd7, [r6], #-440	@ 0xfffffe48
    3638:	28656b69 	stmdacs	r5!, {r0, r3, r5, r6, r8, r9, fp, sp, lr}^
    363c:	61746d66 	cmnvs	r4, r6, ror #26
    3640:	662c6772 			@ <UNDEFINED> instruction: 0x662c6772
    3644:	74737269 	ldrbtvc	r7, [r3], #-617	@ 0xfffffd97
    3648:	61726176 	cmnvs	r2, r6, ror r1
    364c:	20296772 	eorcs	r6, r9, r2, ror r7
    3650:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    3654:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    3658:	5f657475 	svcpl	0x00657475
    365c:	5f28285f 	svcpl	0x0028285f
    3660:	726f665f 	rsbvc	r6, pc, #99614720	@ 0x5f00000
    3664:	5f74616d 	svcpl	0x0074616d
    3668:	5f28205f 	svcpl	0x0028205f
    366c:	6972705f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, ip, sp, lr}^
    3670:	5f66746e 	svcpl	0x0066746e
    3674:	66202c5f 			@ <UNDEFINED> instruction: 0x66202c5f
    3678:	7261746d 	rsbvc	r7, r1, #1828716544	@ 0x6d000000
    367c:	66202c67 	strtvs	r2, [r0], -r7, ror #24
    3680:	74737269 	ldrbtvc	r7, [r3], #-617	@ 0xfffffd97
    3684:	61726176 	cmnvs	r2, r6, ror r1
    3688:	29296772 	stmdbcs	r9!, {r1, r4, r5, r6, r8, r9, sl, sp, lr}
    368c:	5f5f0029 	svcpl	0x005f0029
    3690:	474f5250 	smlsldmi	r5, pc, r0, r2	@ <UNPREDICTABLE>
    3694:	5f4d4152 	svcpl	0x004d4152
    3698:	52415453 	subpl	r5, r1, #1392508928	@ 0x53000000
    369c:	5f5f2054 	svcpl	0x005f2054
    36a0:	69736d63 	ldmdbvs	r3!, {r0, r1, r5, r6, r8, sl, fp, sp, lr}^
    36a4:	74735f73 	ldrbtvc	r5, [r3], #-3955	@ 0xfffff08d
    36a8:	00747261 	rsbseq	r7, r4, r1, ror #4
    36ac:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    36b0:	454e494c 	strbmi	r4, [lr, #-2380]	@ 0xfffff6b4
    36b4:	6c6e6920 			@ <UNDEFINED> instruction: 0x6c6e6920
    36b8:	00656e69 	rsbeq	r6, r5, r9, ror #28
    36bc:	5f545744 	svcpl	0x00545744
    36c0:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    36c4:	4358455f 	cmpmi	r8, #398458880	@ 0x17c00000
    36c8:	45435254 	strbmi	r5, [r3, #-596]	@ 0xfffffdac
    36cc:	505f414e 	subspl	r4, pc, lr, asr #2
    36d0:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    36d4:	5f005536 	svcpl	0x00005536
    36d8:	6c6c754e 	cfstr64vs	mvdx7, [ip], #-312	@ 0xfffffec8
    36dc:	736e755f 	cmnvc	lr, #398458880	@ 0x17c00000
    36e0:	69636570 	stmdbvs	r3!, {r4, r5, r6, r8, sl, sp, lr}^
    36e4:	64656966 	strbtvs	r6, [r5], #-2406	@ 0xfffff69a
    36e8:	57440020 	strbpl	r0, [r4, -r0, lsr #32]
    36ec:	55465f54 	strbpl	r5, [r6, #-3924]	@ 0xfffff0ac
    36f0:	4954434e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, r9, lr}^
    36f4:	435f4e4f 	cmpmi	pc, #1264	@ 0x4f0
    36f8:	414d4359 	cmpmi	sp, r9, asr r3
    36fc:	5f484354 	svcpl	0x00484354
    3700:	20736f50 	rsbscs	r6, r3, r0, asr pc
    3704:	5f005537 	svcpl	0x00005537
    3708:	44414552 	strbmi	r4, [r1], #-1362	@ 0xfffffaae
    370c:	4952575f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
    3710:	425f4554 	subsmi	r4, pc, #84, 10	@ 0x15000000
    3714:	49534655 	ldmdbmi	r3, {r0, r2, r4, r6, r9, sl, lr}^
    3718:	545f455a 	ldrbpl	r4, [pc], #-1370	@ 3720 <_Min_Stack_Size+0x3320>
    371c:	20455059 	subcs	r5, r5, r9, asr r0
    3720:	00746e69 	rsbseq	r6, r4, r9, ror #28
    3724:	5f433249 	svcpl	0x00433249
    3728:	5f325253 	svcpl	0x00325253
    372c:	5f434550 	svcpl	0x00434550
    3730:	20736f50 	rsbscs	r6, r3, r0, asr pc
    3734:	29553828 	ldmdbcs	r5, {r3, r5, fp, ip, sp}^
    3738:	4d524100 	ldfmie	f4, [r2, #-0]
    373c:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    3740:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    3744:	5f4e4f49 	svcpl	0x004e4f49
    3748:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    374c:	3231355f 	eorscc	r3, r1, #398458880	@ 0x17c00000
    3750:	2820424d 	stmdacs	r0!, {r0, r2, r3, r6, r9, lr}
    3754:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    3758:	745f3874 	ldrbvc	r3, [pc], #-2164	@ 3760 <_Min_Stack_Size+0x3360>
    375c:	31783029 	cmncc	r8, r9, lsr #32
    3760:	00295543 	eoreq	r5, r9, r3, asr #10
    3764:	4f535f5f 	svcmi	0x00535f5f
    3768:	30204452 	eorcc	r4, r0, r2, asr r4
    376c:	30303278 	eorscc	r3, r0, r8, ror r2
    3770:	43530030 	cmpmi	r3, #48	@ 0x30
    3774:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    3778:	5f525343 	svcpl	0x00525343
    377c:	46475355 			@ <UNDEFINED> instruction: 0x46475355
    3780:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    3784:	5f414e45 	svcpl	0x00414e45
    3788:	20736f50 	rsbscs	r6, r3, r0, asr pc
    378c:	00553831 	subseq	r3, r5, r1, lsr r8
    3790:	20495f5f 	subcs	r5, r9, pc, asr pc
    3794:	616c6f76 	smcvs	50934	@ 0xc6f6
    3798:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    379c:	6e6f6320 	cdpvs	3, 6, cr6, cr15, cr0, {1}
    37a0:	55007473 	strpl	r7, [r0, #-1139]	@ 0xfffffb8d
    37a4:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    37a8:	41425f31 	cmpmi	r2, r1, lsr pc
    37ac:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    37b0:	69726550 	ldmdbvs	r2!, {r4, r6, r8, sl, sp, lr}^
    37b4:	72656870 	rsbvc	r6, r5, #112, 16	@ 0x700000
    37b8:	5f736c61 	svcpl	0x00736c61
    37bc:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    37c0:	30202b20 	eorcc	r2, r0, r0, lsr #22
    37c4:	30303078 	eorscc	r3, r0, r8, ror r0
    37c8:	30383331 	eorscc	r3, r8, r1, lsr r3
    37cc:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
    37d0:	4d544900 	vldrmi.16	s9, [r4, #-0]	@ <UNPREDICTABLE>
    37d4:	52534c5f 	subspl	r4, r3, #24320	@ 0x5f00
    37d8:	7479425f 	ldrbtvc	r4, [r9], #-607	@ 0xfffffda1
    37dc:	63634165 	cmnvs	r3, #1073741849	@ 0x40000019
    37e0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    37e4:	54492820 	strbpl	r2, [r9], #-2080	@ 0xfffff7e0
    37e8:	534c5f4d 	movtpl	r5, #53069	@ 0xcf4d
    37ec:	59425f52 	stmdbpl	r2, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    37f0:	43414554 	movtmi	r4, #5460	@ 0x1554
    37f4:	6f505f43 	svcvs	0x00505f43
    37f8:	5f002973 	svcpl	0x00002973
    37fc:	4153555f 	cmpmi	r3, pc, asr r5
    3800:	52412854 	subpl	r2, r1, #84, 16	@ 0x540000
    3804:	412c3147 			@ <UNDEFINED> instruction: 0x412c3147
    3808:	29324752 	ldmdbcs	r2!, {r1, r4, r6, r8, r9, sl, lr}
    380c:	655f5f20 	ldrbvs	r5, [pc, #-3872]	@ 28f4 <_Min_Stack_Size+0x24f4>
    3810:	6e657478 	mcrvs	4, 3, r7, cr5, cr8, {3}
    3814:	6e6f6973 			@ <UNDEFINED> instruction: 0x6e6f6973
    3818:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    381c:	6975207b 	ldmdbvs	r5!, {r0, r1, r3, r4, r5, r6, sp}^
    3820:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
    3824:	5f20745f 	svcpl	0x0020745f
    3828:	5345525f 	movtpl	r5, #21087	@ 0x525f
    382c:	5f5f202c 	svcpl	0x005f202c
    3830:	31475241 	cmpcc	r7, r1, asr #4
    3834:	28203d20 	stmdacs	r0!, {r5, r8, sl, fp, ip, sp}
    3838:	31475241 	cmpcc	r7, r1, asr #4
    383c:	5f203b29 	svcpl	0x00203b29
    3840:	4d53415f 	ldfmie	f4, [r3, #-380]	@ 0xfffffe84
    3844:	6c6f7620 	stclvs	6, cr7, [pc], #-128	@ 37cc <_Min_Stack_Size+0x33cc>
    3848:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
    384c:	22282065 	eorcs	r2, r8, #101	@ 0x65
    3850:	74617375 	strbtvc	r7, [r1], #-885	@ 0xfffffc8b
    3854:	2c302520 	cfldr32cs	mvfx2, [r0], #-128	@ 0xffffff80
    3858:	2c312520 	cfldr32cs	mvfx2, [r1], #-128	@ 0xffffff80
    385c:	22322520 	eorscs	r2, r2, #32, 10	@ 0x8000000
    3860:	22203a20 	eorcs	r3, r0, #32, 20	@ 0x20000
    3864:	2022723d 	eorcs	r7, r2, sp, lsr r2
    3868:	525f5f28 	subspl	r5, pc, #40, 30	@ 0xa0
    386c:	20295345 	eorcs	r5, r9, r5, asr #6
    3870:	4922203a 	stmdbmi	r2!, {r1, r3, r4, r5, sp}
    3874:	41282022 			@ <UNDEFINED> instruction: 0x41282022
    3878:	29324752 	ldmdbcs	r2!, {r1, r4, r6, r8, r9, sl, lr}
    387c:	7222202c 	eorvc	r2, r2, #44	@ 0x2c
    3880:	5f282022 	svcpl	0x00282022
    3884:	4752415f 			@ <UNDEFINED> instruction: 0x4752415f
    3888:	3a202931 	bcc	80dd54 <_Min_Stack_Size+0x80d954>
    388c:	63632220 	cmnvs	r3, #32, 4
    3890:	3b292022 	blcc	a4b920 <_Min_Stack_Size+0xa4b520>
    3894:	525f5f20 	subspl	r5, pc, #32, 30	@ 0x80
    3898:	203b5345 	eorscs	r5, fp, r5, asr #6
    389c:	4500297d 	strmi	r2, [r0, #-2429]	@ 0xfffff683
    38a0:	35495458 	strbcc	r5, [r9, #-1112]	@ 0xfffffba8
    38a4:	5152495f 	cmppl	r2, pc, asr r9
    38a8:	00333220 	eorseq	r3, r3, r0, lsr #4
    38ac:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    38b0:	494c4355 	stmdbmi	ip, {r0, r2, r4, r6, r8, r9, lr}^
    38b4:	5f5f454b 	svcpl	0x005f454b
    38b8:	5059545f 	subspl	r5, r9, pc, asr r4
    38bc:	20464f45 	subcs	r4, r6, r5, asr #30
    38c0:	4e490031 	mcrmi	0, 2, r0, cr9, cr1, {1}
    38c4:	5f323354 	svcpl	0x00323354
    38c8:	29782843 	ldmdbcs	r8!, {r0, r1, r6, fp, sp}^
    38cc:	495f5f20 	ldmdbmi	pc, {r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    38d0:	3233544e 	eorscc	r5, r3, #1308622848	@ 0x4e000000
    38d4:	7828435f 	stmdavc	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, lr}
    38d8:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    38dc:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    38e0:	4c5f4c52 	mrrcmi	12, 5, r4, pc, cr2	@ <UNPREDICTABLE>
    38e4:	56455553 			@ <UNDEFINED> instruction: 0x56455553
    38e8:	414e4554 	cmpmi	lr, r4, asr r5
    38ec:	736f505f 	cmnvc	pc, #95	@ 0x5f
    38f0:	55303220 	ldrpl	r3, [r0, #-544]!	@ 0xfffffde0
    38f4:	725f5f00 	subsvc	r5, pc, #0, 30
    38f8:	746e6565 	strbtvc	r6, [lr], #-1381	@ 0xfffffa9b
    38fc:	7373615f 	cmnvc	r3, #-1073741801	@ 0xc0000017
    3900:	28747265 	ldmdacs	r4!, {r0, r2, r5, r6, r9, ip, sp, lr}^
    3904:	28202978 	stmdacs	r0!, {r3, r4, r5, r6, r8, fp, sp}
    3908:	20297828 	eorcs	r7, r9, r8, lsr #16
    390c:	7628203f 			@ <UNDEFINED> instruction: 0x7628203f
    3910:	2964696f 	stmdbcs	r4!, {r0, r1, r2, r3, r5, r6, r8, fp, sp, lr}^
    3914:	203a2030 	eorscs	r2, sl, r0, lsr r0
    3918:	73615f5f 	cmnvc	r1, #380	@ 0x17c
    391c:	74726573 	ldrbtvc	r6, [r2], #-1395	@ 0xfffffa8d
    3920:	6e75665f 	mrcvs	6, 3, r6, cr5, cr15, {2}
    3924:	5f5f2863 	svcpl	0x005f2863
    3928:	454c4946 	strbmi	r4, [ip, #-2374]	@ 0xfffff6ba
    392c:	202c5f5f 	eorcs	r5, ip, pc, asr pc
    3930:	494c5f5f 	stmdbmi	ip, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    3934:	5f5f454e 	svcpl	0x005f454e
    3938:	6328202c 			@ <UNDEFINED> instruction: 0x6328202c
    393c:	20726168 	rsbscs	r6, r2, r8, ror #2
    3940:	2c30292a 			@ <UNDEFINED> instruction: 0x2c30292a
    3944:	45522220 	ldrbmi	r2, [r2, #-544]	@ 0xfffffde0
    3948:	20544e45 	subscs	r4, r4, r5, asr #28
    394c:	6c6c616d 	stfvse	f6, [ip], #-436	@ 0xfffffe4c
    3950:	7320636f 			@ <UNDEFINED> instruction: 0x7320636f
    3954:	65636375 	strbvs	r6, [r3, #-885]!	@ 0xfffffc8b
    3958:	64656465 	strbtvs	r6, [r5], #-1125	@ 0xfffffb9b
    395c:	00292922 	eoreq	r2, r9, r2, lsr #18
    3960:	65565f5f 	ldrbvs	r5, [r6, #-3935]	@ 0xfffff0a1
    3964:	726f646e 	rsbvc	r6, pc, #1845493760	@ 0x6e000000
    3968:	7379535f 	cmnvc	r9, #2080374785	@ 0x7c000001
    396c:	6b636954 	blvs	18ddec4 <_Min_Stack_Size+0x18ddac4>
    3970:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
    3974:	30206769 	eorcc	r6, r0, r9, ror #14
    3978:	43530055 	cmpmi	r3, #85	@ 0x55
    397c:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    3980:	5f525343 	svcpl	0x00525343
    3984:	46535542 	ldrbmi	r5, [r3], -r2, asr #10
    3988:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    398c:	5f544341 	svcpl	0x00544341
    3990:	206b734d 	rsbcs	r7, fp, sp, asr #6
    3994:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    3998:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    399c:	5f424353 	svcpl	0x00424353
    39a0:	53434853 	movtpl	r4, #14419	@ 0x3853
    39a4:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    39a8:	55414653 	strbpl	r4, [r1, #-1619]	@ 0xfffff9ad
    39ac:	4341544c 	movtmi	r5, #5196	@ 0x144c
    39b0:	6f505f54 	svcvs	0x00505f54
    39b4:	5f002973 	svcpl	0x00002973
    39b8:	4554494c 	ldrbmi	r4, [r4, #-2380]	@ 0xfffff6b4
    39bc:	4958455f 	ldmdbmi	r8, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    39c0:	00312054 	eorseq	r2, r1, r4, asr r0
    39c4:	656e5f5f 	strbvs	r5, [lr, #-3935]!	@ 0xfffff0a1
    39c8:	775f6465 	ldrbvc	r6, [pc, -r5, ror #8]
    39cc:	5f746e69 	svcpl	0x00746e69
    39d0:	5f002074 	svcpl	0x00002074
    39d4:	4341505f 	movtmi	r5, #4191	@ 0x105f
    39d8:	5f44454b 	svcpl	0x0044454b
    39dc:	55525453 	ldrbpl	r5, [r2, #-1107]	@ 0xfffffbad
    39e0:	73205443 			@ <UNDEFINED> instruction: 0x73205443
    39e4:	63757274 	cmnvs	r5, #116, 4	@ 0x40000007
    39e8:	5f5f2074 	svcpl	0x005f2074
    39ec:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    39f0:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    39f4:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    39f8:	63617028 	cmnvs	r1, #40	@ 0x28
    39fc:	2c64656b 	cfstr64cs	mvdx6, [r4], #-428	@ 0xfffffe54
    3a00:	696c6120 	stmdbvs	ip!, {r5, r8, sp, lr}^
    3a04:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    3a08:	29293128 	stmdbcs	r9!, {r3, r5, r8, ip, sp}
    3a0c:	50470029 	subpl	r0, r7, r9, lsr #32
    3a10:	505f4f49 	subspl	r4, pc, r9, asr #30
    3a14:	325f4e49 	subscc	r4, pc, #1168	@ 0x490
    3a18:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    3a1c:	31746e69 	cmncc	r4, r9, ror #28
    3a20:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    3a24:	30307830 	eorscc	r7, r0, r0, lsr r8
    3a28:	00293430 	eoreq	r3, r9, r0, lsr r4
    3a2c:	5f4d5241 	svcpl	0x004d5241
    3a30:	5f55504d 	svcpl	0x0055504d
    3a34:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    3a38:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    3a3c:	5f455a49 	svcpl	0x00455a49
    3a40:	42323135 	eorsmi	r3, r2, #1073741837	@ 0x4000000d
    3a44:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    3a48:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    3a4c:	3029745f 	eorcc	r7, r9, pc, asr r4
    3a50:	55383078 	ldrpl	r3, [r8, #-120]!	@ 0xffffff88
    3a54:	504d0029 	subpl	r0, sp, r9, lsr #32
    3a58:	42525f55 	subsmi	r5, r2, #340	@ 0x154
    3a5c:	565f5241 	ldrbpl	r5, [pc], -r1, asr #4
    3a60:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    3a64:	736f505f 	cmnvc	pc, #95	@ 0x5f
    3a68:	00553420 	subseq	r3, r5, r0, lsr #8
    3a6c:	72727543 	rsbsvc	r7, r2, #281018368	@ 0x10c00000
    3a70:	5f746e65 	svcpl	0x00746e65
    3a74:	00505350 	subseq	r5, r0, r0, asr r3
    3a78:	43575f5f 	cmpmi	r7, #380	@ 0x17c
    3a7c:	5f524148 	svcpl	0x00524148
    3a80:	205f5f54 	subscs	r5, pc, r4, asr pc	@ <UNPREDICTABLE>
    3a84:	42435300 	submi	r5, r3, #0, 6
    3a88:	5343495f 	movtpl	r4, #14687	@ 0x395f
    3a8c:	45565f52 	ldrbmi	r5, [r6, #-3922]	@ 0xfffff0ae
    3a90:	43415443 	movtmi	r5, #5187	@ 0x1443
