NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    3a94:	45564954 	ldrbmi	r4, [r6, #-2388]	@ 0xfffff6ac
    3a98:	736f505f 	cmnvc	pc, #95	@ 0x5f
    3a9c:	00553020 	subseq	r3, r5, r0, lsr #32
    3aa0:	5f424353 	svcpl	0x00424353
    3aa4:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    3aa8:	4345565f 	movtmi	r5, #22111	@ 0x565f
    3aac:	4e455054 	mcrmi	0, 2, r5, cr5, cr4, {2}
    3ab0:	474e4944 	strbmi	r4, [lr, -r4, asr #18]
    3ab4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    3ab8:	55323120 	ldrpl	r3, [r2, #-288]!	@ 0xfffffee0
    3abc:	43575f00 	cmpmi	r7, #0, 30
    3ac0:	5f524148 	svcpl	0x00524148
    3ac4:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    3ac8:	52414c43 	subpl	r4, r1, #17152	@ 0x4300
    3acc:	00204445 	eoreq	r4, r0, r5, asr #8
    3ad0:	656e5f5f 	strbvs	r5, [lr, #-3935]!	@ 0xfffff0a1
    3ad4:	5f5f6465 	svcpl	0x005f6465
    3ad8:	5f61765f 	svcpl	0x0061765f
    3adc:	7473696c 	ldrbtvc	r6, [r3], #-2412	@ 0xfffff694
    3ae0:	565f5f00 	ldrbpl	r5, [pc], -r0, lsl #30
    3ae4:	53494c41 	movtpl	r4, #40001	@ 0x9c41
    3ae8:	5f5f2054 	svcpl	0x005f2054
    3aec:	63756e67 	cmnvs	r5, #1648	@ 0x670
    3af0:	5f61765f 	svcpl	0x0061765f
    3af4:	7473696c 	ldrbtvc	r6, [r3], #-2412	@ 0xfffff694
    3af8:	72747300 	rsbsvc	r7, r4, #0, 6
    3afc:	6d63696e 			@ <UNDEFINED> instruction: 0x6d63696e
    3b00:	74732070 	ldrbtvc	r2, [r3], #-112	@ 0xffffff90
    3b04:	61636e72 	smcvs	14050	@ 0x36e2
    3b08:	6d636573 	cfstr64vs	mvdx6, [r3, #-460]!	@ 0xfffffe34
    3b0c:	504d0070 	subpl	r0, sp, r0, ror r0
    3b10:	41525f55 	cmpmi	r2, r5, asr pc
    3b14:	585f5253 	ldmdapl	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    3b18:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    3b1c:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    3b20:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    3b24:	504d203c 	subpl	r2, sp, ip, lsr r0
    3b28:	41525f55 	cmpmi	r2, r5, asr pc
    3b2c:	585f5253 	ldmdapl	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    3b30:	6f505f4e 	svcvs	0x00505f4e
    3b34:	5f002973 	svcpl	0x00002973
    3b38:	42445453 	submi	r5, r4, #1392508928	@ 0x53000000
    3b3c:	5f4c4f4f 	svcpl	0x004c4f4f
    3b40:	52002048 	andpl	r2, r0, #72	@ 0x48
    3b44:	495f4343 	ldmdbmi	pc, {r0, r1, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    3b48:	5f324332 	svcpl	0x00324332
    3b4c:	65736552 	ldrbvs	r6, [r3, #-1362]!	@ 0xfffffaae
    3b50:	20292874 	eorcs	r2, r9, r4, ror r8
    3b54:	43435228 	movtmi	r5, #12840	@ 0x3228
    3b58:	50413e2d 	subpl	r3, r1, sp, lsr #28
    3b5c:	53523142 	cmppl	r2, #-2147483632	@ 0x80000010
    3b60:	7c205254 	sfmvc	f5, 4, [r0], #-336	@ 0xfffffeb0
    3b64:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    3b68:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    3b6c:	29293032 	stmdbcs	r9!, {r1, r4, r5, ip, sp}
    3b70:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    3b74:	4f4d5f4f 	svcmi	0x004d5f4f
    3b78:	495f4544 	ldmdbmi	pc, {r2, r6, r8, sl, lr}^	@ <UNPREDICTABLE>
    3b7c:	5455504e 	ldrbpl	r5, [r5], #-78	@ 0xffffffb2
    3b80:	2044505f 	subcs	r5, r4, pc, asr r0
    3b84:	30307830 	eorscc	r7, r0, r0, lsr r8
    3b88:	30303030 	eorscc	r3, r0, r0, lsr r0
    3b8c:	00753330 	rsbseq	r3, r5, r0, lsr r3
    3b90:	5f55504d 	svcpl	0x0055504d
    3b94:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    3b98:	414e455f 	cmpmi	lr, pc, asr r5
    3b9c:	5f454c42 	svcpl	0x00454c42
    3ba0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    3ba4:	53005530 	movwpl	r5, #1328	@ 0x530
    3ba8:	415f4243 	cmpmi	pc, r3, asr #4
    3bac:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    3bb0:	4345565f 	movtmi	r5, #22111	@ 0x565f
    3bb4:	524c4354 	subpl	r4, ip, #84, 6	@ 0x50000001
    3bb8:	49544341 	ldmdbmi	r4, {r0, r6, r8, r9, lr}^
    3bbc:	505f4556 	subspl	r4, pc, r6, asr r5	@ <UNPREDICTABLE>
    3bc0:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    3bc4:	5f5f0055 	svcpl	0x005f0055
    3bc8:	72702850 	rsbsvc	r2, r0, #80, 16	@ 0x500000
    3bcc:	736f746f 	cmnvc	pc, #1862270976	@ 0x6f000000
    3bd0:	72702029 	rsbsvc	r2, r0, #41	@ 0x29
    3bd4:	736f746f 	cmnvc	pc, #1862270976	@ 0x6f000000
    3bd8:	42435300 	submi	r5, r3, #0, 6
    3bdc:	5343495f 	movtpl	r4, #14687	@ 0x395f
    3be0:	45565f52 	ldrbmi	r5, [r6, #-3922]	@ 0xfffff0ae
    3be4:	45505443 	ldrbmi	r5, [r0, #-1091]	@ 0xfffffbbd
    3be8:	4e49444e 	cdpmi	4, 4, cr4, cr9, cr14, {2}
    3bec:	734d5f47 	movtvc	r5, #57159	@ 0xdf47
    3bf0:	3028206b 	eorcc	r2, r8, fp, rrx
    3bf4:	46463178 			@ <UNDEFINED> instruction: 0x46463178
    3bf8:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    3bfc:	4353203c 	cmpmi	r3, #60	@ 0x3c
    3c00:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    3c04:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    3c08:	50544345 	subspl	r4, r4, r5, asr #6
    3c0c:	49444e45 	stmdbmi	r4, {r0, r2, r6, r9, sl, fp, lr}^
    3c10:	505f474e 	subspl	r4, pc, lr, asr #14
    3c14:	0029736f 	eoreq	r7, r9, pc, ror #6
    3c18:	505f535f 	subspl	r5, pc, pc, asr r3	@ <UNPREDICTABLE>
    3c1c:	545f5053 	ldrbpl	r5, [pc], #-83	@ 3c24 <_Min_Stack_Size+0x3824>
    3c20:	006b7361 	rsbeq	r7, fp, r1, ror #6
    3c24:	5f4d5449 	svcpl	0x004d5449
    3c28:	5f525054 	svcpl	0x00525054
    3c2c:	56495250 			@ <UNDEFINED> instruction: 0x56495250
    3c30:	4b53414d 	blmi	14d416c <_Min_Stack_Size+0x14d3d6c>
    3c34:	6b734d5f 	blvs	1cd71b8 <_Min_Stack_Size+0x1cd6db8>
    3c38:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    3c3c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    3c40:	46464646 	strbmi	r4, [r6], -r6, asr #12
    3c44:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    3c48:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    3c4c:	2074756f 	rsbscs	r7, r4, pc, ror #10
    3c50:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    3c54:	535f544e 	cmppl	pc, #1308622848	@ 0x4e000000
    3c58:	554f4454 	strbpl	r4, [pc, #-1108]	@ 380c <_Min_Stack_Size+0x340c>
    3c5c:	525f2854 	subspl	r2, pc, #84, 16	@ 0x540000
    3c60:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    3c64:	50470029 	subpl	r0, r7, r9, lsr #32
    3c68:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 3b4c <_Min_Stack_Size+0x374c>
    3c6c:	5f45444f 	svcpl	0x0045444f
    3c70:	55504e49 	ldrbpl	r4, [r0, #-3657]	@ 0xfffff1b7
    3c74:	55505f54 	ldrbpl	r5, [r0, #-3924]	@ 0xfffff0ac
    3c78:	30783020 	rsbscc	r3, r8, r0, lsr #32
    3c7c:	30303030 	eorscc	r3, r0, r0, lsr r0
    3c80:	75323030 	ldrvc	r3, [r2, #-48]!	@ 0xffffffd0
    3c84:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
    3c88:	495f3649 	ldmdbmi	pc, {r0, r3, r6, r9, sl, ip, sp}^	@ <UNPREDICTABLE>
    3c8c:	32205152 	eorcc	r5, r0, #-2147483628	@ 0x80000014
    3c90:	43530033 	cmpmi	r3, #51	@ 0x33
    3c94:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    3c98:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ 3b54 <_Min_Stack_Size+0x3754>
    3c9c:	5652414d 	ldrbpl	r4, [r2], -sp, asr #2
    3ca0:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    3ca4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    3ca8:	43532820 	cmpmi	r3, #32, 16	@ 0x200000
    3cac:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    3cb0:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ 3b6c <_Min_Stack_Size+0x376c>
    3cb4:	41464d45 	cmpmi	r6, r5, asr #26
    3cb8:	53544c55 	cmppl	r4, #21760	@ 0x5500
    3cbc:	6f505f52 	svcvs	0x00505f52
    3cc0:	202b2073 	eorcs	r2, fp, r3, ror r0
    3cc4:	00295537 	eoreq	r5, r9, r7, lsr r5
    3cc8:	5f433249 	svcpl	0x00433249
    3ccc:	3252414f 	subscc	r4, r2, #-1073741805	@ 0xc0000013
    3cd0:	4444415f 	strbmi	r4, [r4], #-351	@ 0xfffffea1
    3cd4:	6f505f32 	svcvs	0x00505f32
    3cd8:	31282073 			@ <UNDEFINED> instruction: 0x31282073
    3cdc:	4d002955 	vstrmi.16	s4, [r0, #-170]	@ 0xffffff56	@ <UNPREDICTABLE>
    3ce0:	28205550 	stmdacs	r0!, {r4, r6, r8, sl, ip, lr}
    3ce4:	55504d28 	ldrbpl	r4, [r0, #-3368]	@ 0xfffff2d8
    3ce8:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    3cec:	292a2065 	stmdbcs	sl!, {r0, r2, r5, r6, sp}
    3cf0:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    3cf4:	5341425f 	movtpl	r4, #4703	@ 0x125f
    3cf8:	00292045 	eoreq	r2, r9, r5, asr #32
    3cfc:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    3d00:	495f544e 	ldmdbmi	pc, {r1, r2, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    3d04:	5f28434e 	svcpl	0x0028434e
    3d08:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    3d0c:	5f282820 	svcpl	0x00282820
    3d10:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    3d14:	695f3e2d 	ldmdbvs	pc, {r0, r2, r3, r5, r9, sl, fp, ip, sp}^	@ <UNPREDICTABLE>
    3d18:	0029636e 	eoreq	r6, r9, lr, ror #6
    3d1c:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    3d20:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    3d24:	00302b20 	eorseq	r2, r0, r0, lsr #22
    3d28:	5f495054 	svcpl	0x00495054
    3d2c:	49564544 	ldmdbmi	r6, {r2, r6, r8, sl, lr}^
    3d30:	73415f44 	movtvc	r5, #8004	@ 0x1f44
    3d34:	6c436e79 	mcrrvs	14, 7, r6, r3, cr9
    3d38:	5f6e496b 	svcpl	0x006e496b
    3d3c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    3d40:	49005535 	stmdbmi	r0, {r0, r2, r4, r5, r8, sl, ip, lr}
    3d44:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    3d48:	415f3152 	cmpmi	pc, r2, asr r1	@ <UNPREDICTABLE>
    3d4c:	5f524444 	svcpl	0x00524444
    3d50:	206b734d 	rsbcs	r7, fp, sp, asr #6
    3d54:	31783028 	cmncc	r8, r8, lsr #32
    3d58:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    3d5c:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    3d60:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    3d64:	44415f31 	strbmi	r5, [r1], #-3889	@ 0xfffff0cf
    3d68:	505f5244 	subspl	r5, pc, r4, asr #4
    3d6c:	0029736f 	eoreq	r7, r9, pc, ror #6
    3d70:	5f433249 	svcpl	0x00433249
    3d74:	5f325253 	svcpl	0x00325253
    3d78:	434e4547 	movtmi	r4, #58695	@ 0xe547
    3d7c:	5f4c4c41 	svcpl	0x004c4c41
    3d80:	20736f50 	rsbscs	r6, r3, r0, asr pc
    3d84:	29553428 	ldmdbcs	r5, {r3, r5, sl, ip, sp}^
    3d88:	53507800 	cmppl	r0, #0, 16
    3d8c:	5f515f52 	svcpl	0x00515f52
    3d90:	206b734d 	rsbcs	r7, fp, sp, asr #6
    3d94:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    3d98:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    3d9c:	52535078 	subspl	r5, r3, #120	@ 0x78
    3da0:	505f515f 	subspl	r5, pc, pc, asr r1	@ <UNPREDICTABLE>
    3da4:	0029736f 	eoreq	r7, r9, pc, ror #6
    3da8:	73695f5f 	cmnvc	r9, #380	@ 0x17c
    3dac:	696c615f 	stmdbvs	ip!, {r0, r1, r2, r3, r4, r6, r8, sp, lr}^
    3db0:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    3db4:	792c7828 	stmdbvc	ip!, {r3, r5, fp, ip, sp, lr}
    3db8:	5f5f2029 	svcpl	0x005f2029
    3dbc:	6c697562 	cfstr64vs	mvdx7, [r9], #-392	@ 0xfffffe78
    3dc0:	5f6e6974 	svcpl	0x006e6974
    3dc4:	615f7369 	cmpvs	pc, r9, ror #6
    3dc8:	6e67696c 	vnmulvs.f16	s13, s14, s25	@ <UNPREDICTABLE>
    3dcc:	78286465 	stmdavc	r8!, {r0, r2, r5, r6, sl, sp, lr}
    3dd0:	2979202c 	ldmdbcs	r9!, {r2, r3, r5, sp}^
    3dd4:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    3dd8:	5341465f 	movtpl	r4, #5727	@ 0x165f
    3ddc:	5f343654 	svcpl	0x00343654
    3de0:	204e494d 	subcs	r4, lr, sp, asr #18
    3de4:	5f5f2d28 	svcpl	0x005f2d28
    3de8:	5f544e49 	svcpl	0x00544e49
    3dec:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    3df0:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ 3d20 <_Min_Stack_Size+0x3920>
    3df4:	5f5f5841 	svcpl	0x005f5841
    3df8:	31202d20 			@ <UNDEFINED> instruction: 0x31202d20
    3dfc:	6f430029 	svcvs	0x00430029
    3e00:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    3e04:	5f677562 	svcpl	0x00677562
    3e08:	434d4544 	movtmi	r4, #54596	@ 0xd544
    3e0c:	43565f52 	cmpmi	r6, #328	@ 0x148
    3e10:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    3e14:	5f525245 	svcpl	0x00525245
    3e18:	206b734d 	rsbcs	r7, fp, sp, asr #6
    3e1c:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    3e20:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    3e24:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    3e28:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    3e2c:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
    3e30:	5f52434d 	svcpl	0x0052434d
    3e34:	495f4356 	ldmdbmi	pc, {r1, r2, r4, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    3e38:	5245544e 	subpl	r5, r5, #1308622848	@ 0x4e000000
    3e3c:	6f505f52 	svcvs	0x00505f52
    3e40:	53002973 	movwpl	r2, #2419	@ 0x973
    3e44:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    3e48:	4c5f6b63 	mrrcmi	11, 6, r6, pc, cr3	@ <UNPREDICTABLE>
    3e4c:	5f44414f 	svcpl	0x0044414f
    3e50:	4f4c4552 	svcmi	0x004c4552
    3e54:	4d5f4441 	cfldrdmi	mvd4, [pc, #-260]	@ 3d58 <_Min_Stack_Size+0x3958>
    3e58:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    3e5c:	46467830 			@ <UNDEFINED> instruction: 0x46467830
    3e60:	46464646 	strbmi	r4, [r6], -r6, asr #12
    3e64:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    3e68:	625f5f00 	subsvs	r5, pc, #0, 30
    3e6c:	746c6975 	strbtvc	r6, [ip], #-2421	@ 0xfffff68b
    3e70:	615f6e69 	cmpvs	pc, r9, ror #28
    3e74:	6e67696c 	vnmulvs.f16	s13, s14, s25	@ <UNPREDICTABLE>
    3e78:	2870755f 	ldmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, sl, ip, sp, lr}^
    3e7c:	6c612c78 	stclvs	12, cr2, [r1], #-480	@ 0xfffffe20
    3e80:	296e6769 	stmdbcs	lr!, {r0, r3, r5, r6, r8, r9, sl, sp, lr}^
    3e84:	5f282820 	svcpl	0x00282820
    3e88:	7079745f 	rsbsvc	r7, r9, pc, asr r4
    3e8c:	5f666f65 	svcpl	0x00666f65
    3e90:	2978285f 	ldmdbcs	r8!, {r0, r1, r2, r3, r4, r6, fp, sp}^
    3e94:	28282829 	stmdacs	r8!, {r0, r3, r5, fp, sp}
    3e98:	69755f5f 	ldmdbvs	r5!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    3e9c:	7470746e 	ldrbtvc	r7, [r0], #-1134	@ 0xfffffb92
    3ea0:	29745f72 	ldmdbcs	r4!, {r1, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
    3ea4:	2b297828 	blcs	a61f4c <_Min_Stack_Size+0xa61b4c>
    3ea8:	6c612828 	stclvs	8, cr2, [r1], #-160	@ 0xffffff60
    3eac:	296e6769 	stmdbcs	lr!, {r0, r3, r5, r6, r8, r9, sl, sp, lr}^
    3eb0:	2929312d 	stmdbcs	r9!, {r0, r2, r3, r5, r8, ip, sp}
    3eb4:	287e2826 	ldmdacs	lr!, {r1, r2, r5, fp, sp}^
    3eb8:	696c6128 	stmdbvs	ip!, {r3, r5, r8, sp, lr}^
    3ebc:	2d296e67 	stccs	14, cr6, [r9, #-412]!	@ 0xfffffe64
    3ec0:	29292931 	stmdbcs	r9!, {r0, r4, r5, r8, fp, sp}
    3ec4:	5f5f0029 	svcpl	0x005f0029
    3ec8:	64657270 	strbtvs	r7, [r5], #-624	@ 0xfffffd90
    3ecc:	5f746369 	svcpl	0x00746369
    3ed0:	65757274 	ldrbvs	r7, [r5, #-628]!	@ 0xfffffd8c
    3ed4:	70786528 	rsbsvc	r6, r8, r8, lsr #10
    3ed8:	5f5f2029 	svcpl	0x005f2029
    3edc:	6c697562 	cfstr64vs	mvdx7, [r9], #-392	@ 0xfffffe78
    3ee0:	5f6e6974 	svcpl	0x006e6974
    3ee4:	65707865 	ldrbvs	r7, [r0, #-2149]!	@ 0xfffff79b
    3ee8:	28287463 	stmdacs	r8!, {r0, r1, r5, r6, sl, ip, sp, lr}
    3eec:	29707865 	ldmdbcs	r0!, {r0, r2, r5, r6, fp, ip, sp, lr}^
    3ef0:	2931202c 	ldmdbcs	r1!, {r2, r3, r5, sp}
    3ef4:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    3ef8:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    3efc:	534c5f4c 	movtpl	r5, #53068	@ 0xcf4c
    3f00:	54564555 	ldrbpl	r4, [r6], #-1365	@ 0xfffffaab
    3f04:	5f414e45 	svcpl	0x00414e45
    3f08:	206b734d 	rsbcs	r7, fp, sp, asr #6
    3f0c:	31783028 	cmncc	r8, r8, lsr #32
    3f10:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    3f14:	5744203c 	smlaldxpl	r2, r4, ip, r0
    3f18:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    3f1c:	4c5f4c52 	mrrcmi	12, 5, r4, pc, cr2	@ <UNPREDICTABLE>
    3f20:	56455553 			@ <UNDEFINED> instruction: 0x56455553
    3f24:	414e4554 	cmpmi	lr, r4, asr r5
    3f28:	736f505f 	cmnvc	pc, #95	@ 0x5f
    3f2c:	43530029 	cmpmi	r3, #41	@ 0x29
    3f30:	43435f42 	movtmi	r5, #16194	@ 0x3f42
    3f34:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    3f38:	5f305f56 	svcpl	0x00305f56
    3f3c:	5f505254 	svcpl	0x00505254
    3f40:	20736f50 	rsbscs	r6, r3, r0, asr pc
    3f44:	2e005534 	mcrcs	5, 0, r5, cr0, cr4, {1}
    3f48:	54522f2e 	ldrbpl	r2, [r2], #-3886	@ 0xfffff0d2
    3f4c:	522f534f 	eorpl	r5, pc, #1006632961	@ 0x3c000001
    3f50:	5f534f54 	svcpl	0x00534f54
    3f54:	4f464946 	svcmi	0x00464946
    3f58:	5400632e 	strpl	r6, [r0], #-814	@ 0xfffffcd2
    3f5c:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    3f60:	5f525346 	svcpl	0x00525346
    3f64:	6e496c46 	cdpvs	12, 4, cr6, cr9, cr6, {2}
    3f68:	676f7250 			@ <UNDEFINED> instruction: 0x676f7250
    3f6c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    3f70:	00553020 	subseq	r3, r5, r0, lsr #32
    3f74:	4c415f5f 	mcrrmi	15, 5, r5, r1, cr15
    3f78:	454e4749 	strbmi	r4, [lr, #-1865]	@ 0xfffff8b7
    3f7c:	29782844 	ldmdbcs	r8!, {r2, r6, fp, sp}^
    3f80:	615f5f20 	cmpvs	pc, r0, lsr #30
    3f84:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    3f88:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    3f8c:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    3f90:	67696c61 	strbvs	r6, [r9, -r1, ror #24]!
    3f94:	2864656e 	stmdacs	r4!, {r1, r2, r3, r5, r6, r8, sl, sp, lr}^
    3f98:	29292978 	stmdbcs	r9!, {r3, r4, r5, r6, r8, fp, sp}
    3f9c:	42435300 	submi	r5, r3, #0, 6
    3fa0:	5346435f 	movtpl	r4, #25439	@ 0x635f
    3fa4:	4e555f52 	mrcmi	15, 2, r5, cr5, cr2, {2}
    3fa8:	49464544 	stmdbmi	r6, {r2, r6, r8, sl, lr}^
    3fac:	5254534e 	subspl	r5, r4, #939524097	@ 0x38000001
    3fb0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    3fb4:	43532820 	cmpmi	r3, #32, 16	@ 0x200000
    3fb8:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    3fbc:	555f5253 	ldrbpl	r5, [pc, #-595]	@ 3d71 <_Min_Stack_Size+0x3971>
    3fc0:	41464753 	cmpmi	r6, r3, asr r7
    3fc4:	53544c55 	cmppl	r4, #21760	@ 0x5500
    3fc8:	6f505f52 	svcvs	0x00505f52
    3fcc:	202b2073 	eorcs	r2, fp, r3, ror r0
    3fd0:	00295530 	eoreq	r5, r9, r0, lsr r5
    3fd4:	676e656c 	strbvs	r6, [lr, -ip, ror #10]!
    3fd8:	5f006874 	svcpl	0x00006874
    3fdc:	696c615f 	stmdbvs	ip!, {r0, r1, r2, r3, r4, r6, r8, sp, lr}^
    3fe0:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    3fe4:	20297828 	eorcs	r7, r9, r8, lsr #16
    3fe8:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    3fec:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    3ff0:	5f657475 	svcpl	0x00657475
    3ff4:	5f28285f 	svcpl	0x0028285f
    3ff8:	696c615f 	stmdbvs	ip!, {r0, r1, r2, r3, r4, r6, r8, sp, lr}^
    3ffc:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    4000:	78285f5f 	stmdavc	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    4004:	00292929 	eoreq	r2, r9, r9, lsr #18
    4008:	5f433249 	svcpl	0x00433249
    400c:	5f325253 	svcpl	0x00325253
    4010:	48424d53 	stmdami	r2, {r0, r1, r4, r6, r8, sl, fp, lr}^
    4014:	5f54534f 	svcpl	0x0054534f
    4018:	206b734d 	rsbcs	r7, fp, sp, asr #6
    401c:	31783028 	cmncc	r8, r8, lsr #32
    4020:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    4024:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    4028:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    402c:	4d535f32 	ldclmi	15, cr5, [r3, #-200]	@ 0xffffff38
    4030:	534f4842 	movtpl	r4, #63554	@ 0xf842
    4034:	6f505f54 	svcvs	0x00505f54
    4038:	5f002973 	svcpl	0x00002973
    403c:	204f495f 	subcs	r4, pc, pc, asr r9	@ <UNPREDICTABLE>
    4040:	616c6f76 	smcvs	50934	@ 0xc6f6
    4044:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    4048:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    404c:	5f544e45 	svcpl	0x00544e45
    4050:	43454843 	movtmi	r4, #22595	@ 0x5843
    4054:	494d5f4b 	stmdbmi	sp, {r0, r1, r3, r6, r8, r9, sl, fp, ip, lr}^
    4058:	76284353 			@ <UNDEFINED> instruction: 0x76284353
    405c:	20297261 	eorcs	r7, r9, r1, ror #4
    4060:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    4064:	435f544e 	cmpmi	pc, #1308622848	@ 0x4e000000
    4068:	4b434548 	blmi	10d5590 <_Min_Stack_Size+0x10d5190>
    406c:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
    4070:	6d5f202c 	ldclvs	0, cr2, [pc, #-176]	@ 3fc8 <_Min_Stack_Size+0x3bc8>
    4074:	2c637369 	stclcs	3, cr7, [r3], #-420	@ 0xfffffe5c
    4078:	72747320 	rsbsvc	r7, r4, #32, 6	@ 0x80000000
    407c:	20746375 	rsbscs	r6, r4, r5, ror r3
    4080:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    4084:	65725f63 	ldrbvs	r5, [r2, #-3939]!	@ 0xfffff09d
    4088:	20746e65 	rsbscs	r6, r4, r5, ror #28
    408c:	73202c2a 			@ <UNDEFINED> instruction: 0x73202c2a
    4090:	6f657a69 	svcvs	0x00657a69
    4094:	282a2066 	stmdacs	sl!, {r1, r2, r5, r6, sp}
    4098:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
    409c:	5f3e2d29 	svcpl	0x003e2d29
    40a0:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    40a4:	5f202c29 	svcpl	0x00202c29
    40a8:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    40ac:	4e495f54 	mcrmi	15, 2, r5, cr9, cr4, {2}
    40b0:	4d5f5449 	cfldrdmi	mvd5, [pc, #-292]	@ 3f94 <_Min_Stack_Size+0x3b94>
    40b4:	28435349 	stmdacs	r3, {r0, r3, r6, r8, r9, ip, lr}^
    40b8:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    40bc:	545f0029 	ldrbpl	r0, [pc], #-41	@ 40c4 <_Min_Stack_Size+0x3cc4>
    40c0:	5254505f 	subspl	r5, r4, #95	@ 0x5f
    40c4:	46464944 	strbmi	r4, [r6], -r4, asr #18
    40c8:	5300205f 	movwpl	r2, #95	@ 0x5f
    40cc:	43536e43 	cmpmi	r3, #1072	@ 0x430
    40d0:	43415f42 	movtmi	r5, #8002	@ 0x1f42
    40d4:	5f524c54 	svcpl	0x00524c54
    40d8:	44534944 	ldrbmi	r4, [r3], #-2372	@ 0xfffff6bc
    40dc:	42574645 	subsmi	r4, r7, #72351744	@ 0x4500000
    40e0:	4d5f4655 	ldclmi	6, cr4, [pc, #-340]	@ 3f94 <_Min_Stack_Size+0x3b94>
    40e4:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    40e8:	204c5531 	subcs	r5, ip, r1, lsr r5
    40ec:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    40f0:	43536e43 	cmpmi	r3, #1072	@ 0x430
    40f4:	43415f42 	movtmi	r5, #8002	@ 0x1f42
    40f8:	5f524c54 	svcpl	0x00524c54
    40fc:	44534944 	ldrbmi	r4, [r3], #-2372	@ 0xfffff6bc
    4100:	42574645 	subsmi	r4, r7, #72351744	@ 0x4500000
    4104:	505f4655 	subspl	r4, pc, r5, asr r6	@ <UNPREDICTABLE>
    4108:	0029736f 	eoreq	r7, r9, pc, ror #6
    410c:	5f495054 	svcpl	0x00495054
    4110:	54564544 	ldrbpl	r4, [r6], #-1348	@ 0xfffffabc
    4114:	5f455059 	svcpl	0x00455059
    4118:	54627553 	strbtpl	r7, [r2], #-1363	@ 0xfffffaad
    411c:	5f657079 	svcpl	0x00657079
    4120:	206b734d 	rsbcs	r7, fp, sp, asr #6
    4124:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    4128:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    412c:	54535f00 	ldrbpl	r5, [r3], #-3840	@ 0xfffff100
    4130:	42494c44 	submi	r4, r9, #68, 24	@ 0x4400
    4134:	205f485f 	subscs	r4, pc, pc, asr r8	@ <UNPREDICTABLE>
    4138:	43435200 	movtmi	r5, #12800	@ 0x3200
    413c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    4140:	435f424f 	cmpmi	pc, #-268435452	@ 0xf0000004
    4144:	455f4b4c 	ldrbmi	r4, [pc, #-2892]	@ 3600 <_Min_Stack_Size+0x3200>
    4148:	2029284e 	eorcs	r2, r9, lr, asr #16
    414c:	43435228 	movtmi	r5, #12840	@ 0x3228
    4150:	50413e2d 	subpl	r3, r1, sp, lsr #28
    4154:	4e453242 	cdpmi	2, 4, cr3, cr5, cr2, {2}
    4158:	3d7c2052 	ldclcc	0, cr2, [ip, #-328]!	@ 0xfffffeb8
    415c:	20312820 	eorscs	r2, r1, r0, lsr #16
    4160:	33203c3c 			@ <UNDEFINED> instruction: 0x33203c3c
    4164:	53002929 	movwpl	r2, #2345	@ 0x929
    4168:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    416c:	5f525346 	svcpl	0x00525346
    4170:	54534e55 	ldrbpl	r4, [r3], #-3669	@ 0xfffff1ab
    4174:	5252454b 	subspl	r4, r2, #314572800	@ 0x12c00000
    4178:	6b734d5f 	blvs	1cd76fc <_Min_Stack_Size+0x1cd72fc>
    417c:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    4180:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    4184:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    4188:	5346435f 	movtpl	r4, #25439	@ 0x635f
    418c:	4e555f52 	mrcmi	15, 2, r5, cr5, cr2, {2}
    4190:	454b5453 	strbmi	r5, [fp, #-1107]	@ 0xfffffbad
    4194:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    4198:	0029736f 	eoreq	r7, r9, pc, ror #6
    419c:	4349564e 	movtmi	r5, #38478	@ 0x964e
    41a0:	5152495f 	cmppl	r2, pc, asr r9
    41a4:	495f3433 	ldmdbmi	pc, {r0, r1, r4, r5, sl, ip, sp}^	@ <UNPREDICTABLE>
    41a8:	5f324332 	svcpl	0x00324332
    41ac:	455f5645 	ldrbmi	r5, [pc, #-1605]	@ 3b6f <_Min_Stack_Size+0x376f>
    41b0:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
    41b4:	20292865 	eorcs	r2, r9, r5, ror #16
    41b8:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    41bc:	53495f43 	movtpl	r5, #40771	@ 0x9f43
    41c0:	20315245 	eorscs	r5, r1, r5, asr #4
    41c4:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
