NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    41c8:	323c3c31 	eorscc	r3, ip, #12544	@ 0x3100
    41cc:	49002929 	stmdbmi	r0, {r0, r3, r5, r8, fp, sp}
    41d0:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    41d4:	525f3152 	subspl	r3, pc, #-2147483628	@ 0x80000014
    41d8:	5f454e58 	svcpl	0x00454e58
    41dc:	20736f50 	rsbscs	r6, r3, r0, asr pc
    41e0:	29553628 	ldmdbcs	r5, {r3, r5, r9, sl, ip, sp}^
    41e4:	535f5f00 	cmppl	pc, #0, 30
    41e8:	2034364c 	eorscs	r3, r4, ip, asr #12
    41ec:	30387830 	eorscc	r7, r8, r0, lsr r8
    41f0:	5f003030 	svcpl	0x00003030
    41f4:	626e755f 	rsbvs	r7, lr, #398458880	@ 0x17c00000
    41f8:	646e756f 	strbtvs	r7, [lr], #-1391	@ 0xfffffa91
    41fc:	00206465 	eoreq	r6, r0, r5, ror #8
    4200:	4f435f5f 	svcmi	0x00435f5f
    4204:	4c49504d 	mcrrmi	0, 4, r5, r9, cr13
    4208:	425f5245 	subsmi	r5, pc, #1342177284	@ 0x50000004
    420c:	49525241 	ldmdbmi	r2, {r0, r6, r9, ip, lr}^
    4210:	29285245 	stmdbcs	r8!, {r0, r2, r6, r9, ip, lr}
    4214:	415f5f20 	cmpmi	pc, r0, lsr #30
    4218:	76204d53 			@ <UNDEFINED> instruction: 0x76204d53
    421c:	74616c6f 	strbtvc	r6, [r1], #-3183	@ 0xfffff391
    4220:	28656c69 	stmdacs	r5!, {r0, r3, r5, r6, sl, fp, sp, lr}^
    4224:	3a3a2222 	bcc	e8cab4 <_Min_Stack_Size+0xe8c6b4>
    4228:	656d223a 	strbvs	r2, [sp, #-570]!	@ 0xfffffdc6
    422c:	79726f6d 	ldmdbvc	r2!, {r0, r2, r3, r5, r6, r8, r9, sl, fp, sp, lr}^
    4230:	53002922 	movwpl	r2, #2338	@ 0x922
    4234:	5f4b4545 	svcpl	0x004b4545
    4238:	20544553 	subscs	r4, r4, r3, asr r5
    423c:	54490030 	strbpl	r0, [r9], #-48	@ 0xffffffd0
    4240:	43545f4d 	cmpmi	r4, #308	@ 0x134
    4244:	72545f52 	subsvc	r5, r4, #328	@ 0x148
    4248:	42656361 	rsbmi	r6, r5, #-2080374783	@ 0x84000001
    424c:	44497375 	strbmi	r7, [r9], #-885	@ 0xfffffc8b
    4250:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4254:	54492820 	strbpl	r2, [r9], #-2080	@ 0xfffff7e0
    4258:	43545f4d 	cmpmi	r4, #308	@ 0x134
    425c:	52545f52 	subspl	r5, r4, #328	@ 0x148
    4260:	42454341 	submi	r4, r5, #67108865	@ 0x4000001
    4264:	44495355 	strbmi	r5, [r9], #-853	@ 0xfffffcab
    4268:	736f505f 	cmnvc	pc, #95	@ 0x5f
    426c:	32490029 	subcc	r0, r9, #41	@ 0x29
    4270:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    4274:	44415f31 	strbmi	r5, [r1], #-3889	@ 0xfffff0cf
    4278:	5f303144 	svcpl	0x00303144
    427c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    4280:	29553328 	ldmdbcs	r5, {r3, r5, r8, r9, ip, sp}^
    4284:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    4288:	4c43554e 	cfstr64mi	mvdx5, [r3], {78}	@ 0x4e
    428c:	5f454b49 	svcpl	0x00454b49
    4290:	4c495542 	cfstr64mi	mvdx5, [r9], {66}	@ 0x42
    4294:	5f4e4954 	svcpl	0x004e4954
    4298:	4c414156 	stfmie	f4, [r1], {86}	@ 0x56
    429c:	20545349 	subscs	r5, r4, r9, asr #6
    42a0:	424d0031 	submi	r0, sp, #49	@ 0x31
    42a4:	5255435f 	subspl	r4, r5, #2080374785	@ 0x7c000001
    42a8:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    42ac:	6c5f5f20 	mrrcvs	15, 2, r5, pc, cr0	@ <UNPREDICTABLE>
    42b0:	6c61636f 	stclvs	3, cr6, [r1], #-444	@ 0xfffffe44
    42b4:	626d5f65 	rsbvs	r5, sp, #404	@ 0x194
    42b8:	7275635f 	rsbsvc	r6, r5, #2080374785	@ 0x7c000001
    42bc:	78616d5f 	stmdavc	r1!, {r0, r1, r2, r3, r4, r6, r8, sl, fp, sp, lr}^
    42c0:	5f002928 	svcpl	0x00002928
    42c4:	4c5f424d 	lfmmi	f4, 2, [pc], {77}	@ 0x4d
    42c8:	4d5f4e45 	ldclmi	14, cr4, [pc, #-276]	@ 41bc <_Min_Stack_Size+0x3dbc>
    42cc:	31205841 			@ <UNDEFINED> instruction: 0x31205841
    42d0:	6e435300 	cdpvs	3, 4, cr5, cr3, cr0, {0}
    42d4:	5f424353 	svcpl	0x00424353
    42d8:	4c544341 	mrrcmi	3, 4, r4, r4, cr1	@ <UNPREDICTABLE>
    42dc:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    42e0:	43504653 	cmpmi	r0, #87031808	@ 0x5300000
    42e4:	6f505f41 	svcvs	0x00505f41
    42e8:	55382073 	ldrpl	r2, [r8, #-115]!	@ 0xffffff8d
    42ec:	6e5f5f00 	cdpvs	15, 5, cr5, cr15, cr0, {0}
    42f0:	6f6c5f6f 	svcvs	0x006c5f6f
    42f4:	615f6b63 	cmpvs	pc, r3, ror #22
    42f8:	796c616e 	stmdbvc	ip!, {r1, r2, r3, r5, r6, r8, sp, lr}^
    42fc:	20736973 	rsbscs	r6, r3, r3, ror r9
    4300:	6f6c5f5f 	svcvs	0x006c5f5f
    4304:	615f6b63 	cmpvs	pc, r3, ror #22
    4308:	746f6e6e 	strbtvc	r6, [pc], #-3694	@ 4310 <_Min_Stack_Size+0x3f10>
    430c:	28657461 	stmdacs	r5!, {r0, r5, r6, sl, ip, sp, lr}^
    4310:	745f6f6e 	ldrbvc	r6, [pc], #-3950	@ 4318 <_Min_Stack_Size+0x3f18>
    4314:	61657268 	cmnvs	r5, r8, ror #4
    4318:	61735f64 	cmnvs	r3, r4, ror #30
    431c:	79746566 	ldmdbvc	r4!, {r1, r2, r5, r6, r8, sl, sp, lr}^
    4320:	616e615f 	cmnvs	lr, pc, asr r1
    4324:	6973796c 	ldmdbvs	r3!, {r2, r3, r5, r6, r8, fp, ip, sp, lr}^
    4328:	44002973 	strmi	r2, [r0], #-2419	@ 0xfffff68d
    432c:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    4330:	4e434950 			@ <UNDEFINED> instruction: 0x4e434950
    4334:	50435f54 	subpl	r5, r3, r4, asr pc
    4338:	544e4349 	strbpl	r4, [lr], #-841	@ 0xfffffcb7
    433c:	6b734d5f 	blvs	1cd78c0 <_Min_Stack_Size+0x1cd74c0>
    4340:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    4344:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    4348:	49002920 	stmdbmi	r0, {r5, r8, fp, sp}
    434c:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ 4354 <_Min_Stack_Size+0x3f54>
    4350:	535f5243 	cmppl	pc, #805306372	@ 0x30000004
    4354:	4e454f57 	mcrmi	15, 2, r4, cr5, cr7, {2}
    4358:	734d5f41 	movtvc	r5, #57153	@ 0xdf41
    435c:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    4360:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    4364:	5449203c 	strbpl	r2, [r9], #-60	@ 0xffffffc4
    4368:	43545f4d 	cmpmi	r4, #308	@ 0x134
    436c:	57535f52 			@ <UNDEFINED> instruction: 0x57535f52
    4370:	414e454f 	cmpmi	lr, pc, asr #10
    4374:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4378:	565f0029 	ldrbpl	r0, [pc], -r9, lsr #32
    437c:	494c5f41 	stmdbmi	ip, {r0, r6, r8, r9, sl, fp, ip, lr}^
    4380:	445f5453 	ldrbmi	r5, [pc], #-1107	@ 4388 <_Min_Stack_Size+0x3f88>
    4384:	4e494645 	cdpmi	6, 4, cr4, cr9, cr5, {2}
    4388:	00204445 	eoreq	r4, r0, r5, asr #8
    438c:	5f544e49 	svcpl	0x00544e49
    4390:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    4394:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ 42d0 <_Min_Stack_Size+0x3ed0>
    4398:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    439c:	495f5f2d 	ldmdbmi	pc, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    43a0:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    43a4:	33545341 	cmpcc	r4, #67108865	@ 0x4000001
    43a8:	414d5f32 	cmpmi	sp, r2, lsr pc
    43ac:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    43b0:	2931202d 	ldmdbcs	r1!, {r0, r2, r3, r5, sp}
    43b4:	43444100 	movtmi	r4, #16640	@ 0x4100
    43b8:	41425f31 	cmpmi	r2, r1, lsr pc
    43bc:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    43c0:	69726550 	ldmdbvs	r2!, {r4, r6, r8, sl, sp, lr}^
    43c4:	72656870 	rsbvc	r6, r5, #112, 16	@ 0x700000
    43c8:	5f736c61 	svcpl	0x00736c61
    43cc:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    43d0:	30202b20 	eorcc	r2, r0, r0, lsr #22
    43d4:	30303078 	eorscc	r3, r0, r8, ror r0
    43d8:	30343231 	eorscc	r3, r4, r1, lsr r2
    43dc:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
    43e0:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    43e4:	5f544e45 	svcpl	0x00544e45
    43e8:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    43ec:	5345525f 	movtpl	r5, #21087	@ 0x525f
    43f0:	45565245 	ldrbmi	r5, [r6, #-581]	@ 0xfffffdbb
    43f4:	20305f44 	eorscs	r5, r0, r4, asr #30
    43f8:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    43fc:	5f58414d 	svcpl	0x0058414d
    4400:	204e494d 	subcs	r4, lr, sp, asr #18
    4404:	4e492d28 	cdpmi	13, 4, cr2, cr9, cr8, {1}
    4408:	58414d54 	stmdapl	r1, {r2, r4, r6, r8, sl, fp, lr}^
    440c:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    4410:	31202d20 			@ <UNDEFINED> instruction: 0x31202d20
    4414:	4e490029 	cdpmi	0, 4, cr0, cr9, cr9, {1}
    4418:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    441c:	33545341 	cmpcc	r4, #67108865	@ 0x4000001
    4420:	414d5f32 	cmpmi	sp, r2, lsr pc
    4424:	5f282058 	svcpl	0x00282058
    4428:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    442c:	41454c5f 	cmpmi	r5, pc, asr ip
    4430:	32335453 	eorscc	r5, r3, #1392508928	@ 0x53000000
    4434:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    4438:	00295f5f 	eoreq	r5, r9, pc, asr pc
    443c:	5f545744 	svcpl	0x00545744
    4440:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    4444:	4359435f 	cmpmi	r9, #2080374785	@ 0x7c000001
    4448:	5f504154 	svcpl	0x00504154
    444c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    4450:	47005539 	smladxmi	r0, r9, r5, r5
    4454:	5f4f4950 	svcpl	0x004f4950
    4458:	5f4e4950 	svcpl	0x004e4950
    445c:	4b53414d 	blmi	14d4998 <_Min_Stack_Size+0x14d4598>
    4460:	30783020 	rsbscc	r3, r8, r0, lsr #32
    4464:	46303030 			@ <UNDEFINED> instruction: 0x46303030
    4468:	75464646 	strbvc	r4, [r6, #-1606]	@ 0xfffff9ba
    446c:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    4470:	65535f43 	ldrbvs	r5, [r3, #-3907]	@ 0xfffff0bd
    4474:	63655674 	cmnvs	r5, #116, 12	@ 0x7400000
    4478:	20726f74 	rsbscs	r6, r2, r4, ror pc
    447c:	564e5f5f 			@ <UNDEFINED> instruction: 0x564e5f5f
    4480:	535f4349 	cmppl	pc, #603979777	@ 0x24000001
    4484:	65567465 	ldrbvs	r7, [r6, #-1125]	@ 0xfffffb9b
    4488:	726f7463 	rsbvc	r7, pc, #1660944384	@ 0x63000000
    448c:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    4490:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    4494:	4f4e5f4c 	svcmi	0x004e5f4c
    4498:	43435943 	movtmi	r5, #14659	@ 0x3943
    449c:	505f544e 	subspl	r5, pc, lr, asr #8
    44a0:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    44a4:	53005535 	movwpl	r5, #1333	@ 0x535
    44a8:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    44ac:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    44b0:	4e4f4d5f 	mcrmi	13, 2, r4, cr15, cr15, {2}
    44b4:	524f5449 	subpl	r5, pc, #1224736768	@ 0x49000000
    44b8:	5f544341 	svcpl	0x00544341
    44bc:	20736f50 	rsbscs	r6, r3, r0, asr pc
    44c0:	73005538 	movwvc	r5, #1336	@ 0x538
    44c4:	636e7274 	cmnvs	lr, #116, 4	@ 0x40000007
    44c8:	2069706d 	rsbcs	r7, r9, sp, rrx
    44cc:	6e727473 	mrcvs	4, 3, r7, cr2, cr3, {3}
    44d0:	65736163 	ldrbvs	r6, [r3, #-355]!	@ 0xfffffe9d
    44d4:	00706d63 	rsbseq	r6, r0, r3, ror #26
    44d8:	494f4e5f 	stmdbmi	pc, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    44dc:	4e494c4e 	cdpmi	12, 4, cr4, cr9, cr14, {2}
    44e0:	54535f45 	ldrbpl	r5, [r3], #-3909	@ 0xfffff0bb
    44e4:	43495441 	movtmi	r5, #37953	@ 0x9441
    44e8:	4f4e5f20 	svcmi	0x004e5f20
    44ec:	494c4e49 	stmdbmi	ip, {r0, r3, r6, r9, sl, fp, lr}^
    44f0:	7320454e 			@ <UNDEFINED> instruction: 0x7320454e
    44f4:	69746174 	ldmdbvs	r4!, {r2, r4, r5, r6, r8, sp, lr}^
    44f8:	5f5f0063 	svcpl	0x005f0063
    44fc:	49534d43 	ldmdbmi	r3, {r0, r1, r6, r8, sl, fp, lr}^
    4500:	45565f53 	ldrbmi	r5, [r6, #-3923]	@ 0xfffff0ad
    4504:	4f495352 	svcmi	0x00495352
    4508:	20485f4e 	subcs	r5, r8, lr, asr #30
    450c:	504d5400 	subpl	r5, sp, r0, lsl #8
    4510:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    4514:	00363220 	eorseq	r3, r6, r0, lsr #4
    4518:	61665f5f 	cmnvs	r6, pc, asr pc
    451c:	61637473 	smcvs	14147	@ 0x3743
    4520:	5f206c6c 	svcpl	0x00206c6c
    4524:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    4528:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    452c:	5f5f6574 	svcpl	0x005f6574
    4530:	5f5f2828 	svcpl	0x005f2828
    4534:	74736166 	ldrbtvc	r6, [r3], #-358	@ 0xfffffe9a
    4538:	6c6c6163 	stfvse	f6, [ip], #-396	@ 0xfffffe74
    453c:	29295f5f 	stmdbcs	r9!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    4540:	46494600 	strbmi	r4, [r9], -r0, lsl #12
    4544:	73695f4f 	cmnvc	r9, #316	@ 0x13c
    4548:	6c75665f 	ldclvs	6, cr6, [r5], #-380	@ 0xfffffe84
    454c:	5241006c 	subpl	r0, r1, #108	@ 0x6c
    4550:	504d5f4d 	subpl	r5, sp, sp, asr #30
    4554:	45525f55 	ldrbmi	r5, [r2, #-3925]	@ 0xfffff0ab
    4558:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    455c:	5a49535f 	bpl	12592e0 <_Min_Stack_Size+0x1258ee0>
    4560:	4d345f45 	ldcmi	15, cr5, [r4, #-276]!	@ 0xfffffeec
    4564:	28282042 	stmdacs	r8!, {r1, r6, sp}
    4568:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    456c:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    4570:	35317830 	ldrcc	r7, [r1, #-2096]!	@ 0xfffff7d0
    4574:	4e002955 			@ <UNDEFINED> instruction: 0x4e002955
    4578:	5f434956 	svcpl	0x00434956
    457c:	34515249 	ldrbcc	r5, [r1], #-585	@ 0xfffffdb7
    4580:	58455f30 	stmdapl	r5, {r4, r5, r8, r9, sl, fp, ip, lr}^
    4584:	30314954 	eorscc	r4, r1, r4, asr r9
    4588:	5f35315f 	svcpl	0x0035315f
    458c:	61736944 	cmnvs	r3, r4, asr #18
    4590:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    4594:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    4598:	5f434956 	svcpl	0x00434956
    459c:	52454349 	subpl	r4, r5, #603979777	@ 0x24000001
    45a0:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	@ 0xffffff3c
    45a4:	20312820 	eorscs	r2, r1, r0, lsr #16
    45a8:	38203c3c 	stmdacc	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    45ac:	49002929 	stmdbmi	r0, {r0, r3, r5, r8, fp, sp}
    45b0:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    45b4:	425f3252 	subsmi	r3, pc, #536870917	@ 0x20000005
    45b8:	5f595355 	svcpl	0x00595355
    45bc:	20736f50 	rsbscs	r6, r3, r0, asr pc
    45c0:	29553128 	ldmdbcs	r5, {r3, r5, r8, ip, sp}^
    45c4:	4f4e5f00 	svcmi	0x004e5f00
    45c8:	494c4e49 	stmdbmi	ip, {r0, r3, r6, r9, sl, fp, lr}^
    45cc:	5f20454e 	svcpl	0x0020454e
    45d0:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    45d4:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    45d8:	5f5f6574 	svcpl	0x005f6574
    45dc:	5f282820 	svcpl	0x00282820
    45e0:	696f6e5f 	stmdbvs	pc!, {r0, r1, r2, r3, r4, r6, r9, sl, fp, sp, lr}^	@ <UNPREDICTABLE>
    45e4:	6e696c6e 	cdpvs	12, 6, cr6, cr9, cr14, {3}
    45e8:	295f5f65 	ldmdbcs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    45ec:	564e0029 	strbpl	r0, [lr], -r9, lsr #32
    45f0:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    45f4:	37335152 			@ <UNDEFINED> instruction: 0x37335152
    45f8:	4153555f 	cmpmi	r3, pc, asr r5
    45fc:	5f315452 	svcpl	0x00315452
    4600:	61736944 	cmnvs	r3, r4, asr #18
    4604:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    4608:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    460c:	5f434956 	svcpl	0x00434956
    4610:	52454349 	subpl	r4, r5, #603979777	@ 0x24000001
    4614:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	@ 0xffffff3c
    4618:	20312820 	eorscs	r2, r1, r0, lsr #16
    461c:	35203c3c 	strcc	r3, [r0, #-3132]!	@ 0xfffff3c4
    4620:	54002929 	strpl	r2, [r0], #-2345	@ 0xfffff6d7
    4624:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    4628:	314f4649 	cmpcc	pc, r9, asr #12
    462c:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    4630:	6f505f32 	svcvs	0x00505f32
    4634:	36312073 			@ <UNDEFINED> instruction: 0x36312073
    4638:	564e0055 			@ <UNDEFINED> instruction: 0x564e0055
    463c:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    4640:	35335152 	ldrcc	r5, [r3, #-338]!	@ 0xfffffeae
    4644:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    4648:	6e455f31 	mcrvs	15, 2, r5, cr5, cr1, {1}
    464c:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    4650:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    4654:	4349564e 	movtmi	r5, #38478	@ 0x964e
    4658:	4553495f 	ldrbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    465c:	7c203152 	stfvcs	f3, [r0], #-328	@ 0xfffffeb8
    4660:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    4664:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    4668:	00292933 	eoreq	r2, r9, r3, lsr r9
    466c:	5f545744 	svcpl	0x00545744
    4670:	434e5546 	movtmi	r5, #58694	@ 0xe546
    4674:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    4678:	4359435f 	cmpmi	r9, #2080374785	@ 0x7c000001
    467c:	4354414d 	cmpmi	r4, #1073741843	@ 0x40000013
    4680:	734d5f48 	movtvc	r5, #57160	@ 0xdf48
    4684:	3028206b 	eorcc	r2, r8, fp, rrx
    4688:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    468c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    4690:	5f545744 	svcpl	0x00545744
    4694:	434e5546 	movtmi	r5, #58694	@ 0xe546
    4698:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    469c:	4359435f 	cmpmi	r9, #2080374785	@ 0x7c000001
    46a0:	4354414d 	cmpmi	r4, #1073741843	@ 0x40000013
    46a4:	6f505f48 	svcvs	0x00505f48
    46a8:	54002973 	strpl	r2, [r0], #-2419	@ 0xfffff68d
    46ac:	425f4950 	subsmi	r4, pc, #80, 18	@ 0x140000
    46b0:	20455341 	subcs	r5, r5, r1, asr #6
    46b4:	45783028 	ldrbmi	r3, [r8, #-40]!	@ 0xffffffd8
    46b8:	30343030 	eorscc	r3, r4, r0, lsr r0
    46bc:	55303030 	ldrpl	r3, [r0, #-48]!	@ 0xffffffd0
    46c0:	5400294c 	strpl	r2, [r0], #-2380	@ 0xfffff6b4
    46c4:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    46c8:	5f525346 	svcpl	0x00525346
    46cc:	74537446 	ldrbvc	r7, [r3], #-1094	@ 0xfffffbba
    46d0:	6570706f 	ldrbvs	r7, [r0, #-111]!	@ 0xffffff91
    46d4:	734d5f64 	movtvc	r5, #57188	@ 0xdf64
    46d8:	3028206b 	eorcc	r2, r8, fp, rrx
    46dc:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    46e0:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    46e4:	5f495054 	svcpl	0x00495054
    46e8:	52534646 	subspl	r4, r3, #73400320	@ 0x4600000
    46ec:	5374465f 	cmnpl	r4, #99614720	@ 0x5f00000
    46f0:	70706f74 	rsbsvc	r6, r0, r4, ror pc
    46f4:	505f6465 	subspl	r6, pc, r5, ror #8
    46f8:	0029736f 	eoreq	r7, r9, pc, ror #6
    46fc:	5f424353 	svcpl	0x00424353
    4700:	53434853 	movtpl	r4, #14419	@ 0x3853
    4704:	59535f52 	ldmdbpl	r3, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    4708:	43495453 	movtmi	r5, #37971	@ 0x9453
    470c:	5443414b 	strbpl	r4, [r3], #-331	@ 0xfffffeb5
    4710:	6b734d5f 	blvs	1cd7c94 <_Min_Stack_Size+0x1cd7894>
    4714:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    4718:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    471c:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    4720:	4348535f 	movtmi	r5, #33631	@ 0x835f
    4724:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    4728:	49545359 	ldmdbmi	r4, {r0, r3, r4, r6, r8, r9, ip, lr}^
    472c:	43414b43 	movtmi	r4, #6979	@ 0x1b43
    4730:	6f505f54 	svcvs	0x00505f54
    4734:	5f002973 	svcpl	0x00002973
    4738:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    473c:	4e495f54 	mcrmi	15, 2, r5, cr9, cr4, {2}
    4740:	525f5449 	subspl	r5, pc, #1224736768	@ 0x49000000
    4744:	52455345 	subpl	r5, r5, #335544321	@ 0x14000001
    4748:	5f444556 	svcpl	0x00444556
    474c:	5f002031 	svcpl	0x00002031
    4750:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    4754:	5f5f3032 	svcpl	0x005f3032
    4758:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    475c:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    4760:	455f3751 	ldrbmi	r3, [pc, #-1873]	@ 4017 <_Min_Stack_Size+0x3c17>
    4764:	31495458 	cmpcc	r9, r8, asr r4
    4768:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
    476c:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    4770:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    4774:	4349564e 	movtmi	r5, #38478	@ 0x964e
    4778:	4543495f 	strbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    477c:	7c203052 	stcvc	0, cr3, [r0], #-328	@ 0xfffffeb8
    4780:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    4784:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    4788:	00292937 	eoreq	r2, r9, r7, lsr r9
    478c:	4349564e 	movtmi	r5, #38478	@ 0x964e
    4790:	4543495f 	strbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    4794:	2a203252 	bcs	8110e4 <_Min_Stack_Size+0x810ce4>
    4798:	6c6f7628 	stclvs	6, cr7, [pc], #-160	@ 4700 <_Min_Stack_Size+0x4300>
    479c:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
    47a0:	69752065 	ldmdbvs	r5!, {r0, r2, r5, r6, sp}^
    47a4:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
    47a8:	2a20745f 	bcs	82192c <_Min_Stack_Size+0x82152c>
    47ac:	564e2829 	strbpl	r2, [lr], -r9, lsr #16
    47b0:	425f4349 	subsmi	r4, pc, #603979777	@ 0x24000001
    47b4:	5f455341 	svcpl	0x00455341
    47b8:	30202b20 	eorcc	r2, r0, r0, lsr #22
    47bc:	29383878 	ldmdbcs	r8!, {r3, r4, r5, r6, fp, ip, sp}
    47c0:	53425f00 	movtpl	r5, #12032	@ 0x2f00
    47c4:	49535f44 	ldmdbmi	r3, {r2, r6, r8, r9, sl, fp, ip, lr}^
    47c8:	545f455a 	ldrbpl	r4, [pc], #-1370	@ 47d0 <_Min_Stack_Size+0x43d0>
    47cc:	4645445f 			@ <UNDEFINED> instruction: 0x4645445f
    47d0:	44454e49 	strbmi	r4, [r5], #-3657	@ 0xfffff1b7
    47d4:	5f00205f 	svcpl	0x0000205f
    47d8:	554e475f 	strbpl	r4, [lr, #-1887]	@ 0xfffff8a1
    47dc:	4b494c43 	blmi	12578f0 <_Min_Stack_Size+0x12574f0>
    47e0:	54435f45 	strbpl	r5, [r3], #-3909	@ 0xfffff0bb
    47e4:	535f524f 	cmppl	pc, #-268435452	@ 0xf0000004
    47e8:	49544345 	ldmdbmi	r4, {r0, r2, r6, r8, r9, lr}^
    47ec:	485f4e4f 	ldmdami	pc, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    47f0:	4c444e41 	mcrrmi	14, 4, r4, r4, cr1
    47f4:	20474e49 	subcs	r4, r7, r9, asr #28
    47f8:	43530031 	cmpmi	r3, #49	@ 0x31
    47fc:	46485f42 	strbmi	r5, [r8], -r2, asr #30
    4800:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    4804:	54544345 	ldrbpl	r4, [r4], #-837	@ 0xfffffcbb
    4808:	505f4c42 	subspl	r4, pc, r2, asr #24
    480c:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    4810:	68730055 	ldmdavs	r3!, {r0, r2, r4, r6}^
    4814:	0074726f 	rsbseq	r7, r4, pc, ror #4
    4818:	5f424353 	svcpl	0x00424353
    481c:	52534644 	subspl	r4, r3, #68, 12	@ 0x4400000
    4820:	5457445f 	ldrbpl	r4, [r7], #-1119	@ 0xfffffba1
    4824:	50415254 	subpl	r5, r1, r4, asr r2
    4828:	736f505f 	cmnvc	pc, #95	@ 0x5f
    482c:	00553220 	subseq	r3, r5, r0, lsr #4
    4830:	4349564e 	movtmi	r5, #38478	@ 0x964e
    4834:	7465535f 	strbtvc	r5, [r5], #-863	@ 0xfffffca1
    4838:	6f697250 	svcvs	0x00697250
    483c:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    4840:	756f7247 	strbvc	r7, [pc, #-583]!	@ 4601 <_Min_Stack_Size+0x4201>
    4844:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
    4848:	4e5f5f20 	cdpmi	15, 5, cr5, cr15, cr0, {1}
    484c:	5f434956 	svcpl	0x00434956
    4850:	50746553 	rsbspl	r6, r4, r3, asr r5
    4854:	726f6972 	rsbvc	r6, pc, #1867776	@ 0x1c8000
    4858:	47797469 	ldrbmi	r7, [r9, -r9, ror #8]!
    485c:	70756f72 	rsbsvc	r6, r5, r2, ror pc
    4860:	00676e69 	rsbeq	r6, r7, r9, ror #28
    4864:	5f433249 	svcpl	0x00433249
    4868:	5f315253 	svcpl	0x00315253
    486c:	2052564f 	subscs	r5, r2, pc, asr #12
    4870:	5f433249 	svcpl	0x00433249
    4874:	5f315253 	svcpl	0x00315253
    4878:	5f52564f 	svcpl	0x0052564f
    487c:	006b734d 	rsbeq	r7, fp, sp, asr #6
    4880:	5f433249 	svcpl	0x00433249
    4884:	5f315253 	svcpl	0x00315253
    4888:	5f455854 	svcpl	0x00455854
    488c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    4890:	29553728 	ldmdbcs	r5, {r3, r5, r8, r9, sl, ip, sp}^
    4894:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    4898:	5341525f 	movtpl	r5, #4703	@ 0x125f
    489c:	52535f52 	subspl	r5, r3, #328	@ 0x148
    48a0:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    48a4:	3028206b 	eorcc	r2, r8, fp, rrx
    48a8:	55464678 	strbpl	r4, [r6, #-1656]	@ 0xfffff988
    48ac:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    48b0:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    48b4:	5341525f 	movtpl	r5, #4703	@ 0x125f
    48b8:	52535f52 	subspl	r5, r3, #328	@ 0x148
    48bc:	6f505f44 	svcvs	0x00505f44
    48c0:	47002973 	smlsdxmi	r0, r3, r9, r2
    48c4:	5f4f4950 	svcpl	0x004f4950
    48c8:	45455053 	strbmi	r5, [r5, #-83]	@ 0xffffffad
    48cc:	30315f44 	eorscc	r5, r1, r4, asr #30
    48d0:	7830204d 	ldmdavc	r0!, {r0, r2, r3, r6, sp}
    48d4:	30303030 	eorscc	r3, r0, r0, lsr r0
    48d8:	31303030 	teqcc	r0, r0, lsr r0
    48dc:	43530075 	cmpmi	r3, #117	@ 0x75
    48e0:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    48e4:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    48e8:	53444e45 	movtpl	r4, #20037	@ 0x4e45
    48ec:	524c4356 	subpl	r4, ip, #1476395009	@ 0x58000001
    48f0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    48f4:	55373220 	ldrpl	r3, [r7, #-544]!	@ 0xfffffde0
    48f8:	735f5f00 	cmpvc	pc, #0, 30
