NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    48fc:	635f6d79 	cmpvs	pc, #7744	@ 0x1e40
    4900:	61706d6f 	cmnvs	r0, pc, ror #26
    4904:	79732874 	ldmdbvc	r3!, {r2, r4, r5, r6, fp, sp}^
    4908:	6d692c6d 	stclvs	12, cr2, [r9, #-436]!	@ 0xfffffe4c
    490c:	762c6c70 			@ <UNDEFINED> instruction: 0x762c6c70
    4910:	64697265 	strbtvs	r7, [r9], #-613	@ 0xfffffd9b
    4914:	5f5f2029 	svcpl	0x005f2029
    4918:	5f6d7361 	svcpl	0x006d7361
    491c:	2e22285f 	mcrcs	8, 1, r2, cr2, cr15, {2}
    4920:	766d7973 			@ <UNDEFINED> instruction: 0x766d7973
    4924:	22207265 	eorcs	r7, r0, #1342177286	@ 0x50000006
    4928:	6d692320 	stclvs	3, cr2, [r9, #-128]!	@ 0xffffff80
    492c:	22206c70 	eorcs	r6, r0, #112, 24	@ 0x7000
    4930:	2022202c 	eorcs	r2, r2, ip, lsr #32
    4934:	6d797323 	ldclvs	3, cr7, [r9, #-140]!	@ 0xffffff74
    4938:	22402220 	subcs	r2, r0, #32, 4
    493c:	65762320 	ldrbvs	r2, [r6, #-800]!	@ 0xfffffce0
    4940:	29646972 	stmdbcs	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    4944:	725f5f00 	subsvc	r5, pc, #0, 30
    4948:	69757165 	ldmdbvs	r5!, {r0, r2, r5, r6, r8, ip, sp, lr}^
    494c:	5f736572 	svcpl	0x00736572
    4950:	6f6c6e75 	svcvs	0x006c6e75
    4954:	64656b63 	strbtvs	r6, [r5], #-2915	@ 0xfffff49d
    4958:	2e2e2e28 	cdpcs	14, 2, cr2, cr14, cr8, {1}
    495c:	5f5f2029 	svcpl	0x005f2029
    4960:	6b636f6c 	blvs	18e0718 <_Min_Stack_Size+0x18e0318>
    4964:	6e6e615f 	mcrvs	1, 3, r6, cr14, cr15, {2}
    4968:	7461746f 	strbtvc	r7, [r1], #-1135	@ 0xfffffb91
    496c:	6f6c2865 	svcvs	0x006c2865
    4970:	5f736b63 	svcpl	0x00736b63
    4974:	6c637865 	stclvs	8, cr7, [r3], #-404	@ 0xfffffe6c
    4978:	64656475 	strbtvs	r6, [r5], #-1141	@ 0xfffffb8b
    497c:	565f5f28 	ldrbpl	r5, [pc], -r8, lsr #30
    4980:	52415f41 	subpl	r5, r1, #260	@ 0x104
    4984:	5f5f5347 	svcpl	0x005f5347
    4988:	5f002929 	svcpl	0x00002929
    498c:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    4990:	72745f6b 	rsbsvc	r5, r4, #428	@ 0x1ac
    4994:	63615f79 	cmnvs	r1, #484	@ 0x1e4
    4998:	72697571 	rsbvc	r7, r9, #473956352	@ 0x1c400000
    499c:	6f6c2865 	svcvs	0x006c2865
    49a0:	20296b63 	eorcs	r6, r9, r3, ror #22
    49a4:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
    49a8:	67726174 			@ <UNDEFINED> instruction: 0x67726174
    49ac:	6c5f7465 	cfldrdvs	mvd7, [pc], {101}	@ 0x65
    49b0:	5f6b636f 	svcpl	0x006b636f
    49b4:	5f797274 	svcpl	0x00797274
    49b8:	75716361 	ldrbvc	r6, [r1, #-865]!	@ 0xfffffc9f
    49bc:	28657269 	stmdacs	r5!, {r0, r3, r5, r6, r9, ip, sp, lr}^
    49c0:	6b636f6c 	blvs	18e0778 <_Min_Stack_Size+0x18e0378>
    49c4:	5f5f0029 	svcpl	0x005f0029
    49c8:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    49cc:	6863775f 	stmdavs	r3!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, sp, lr}^
    49d0:	745f7261 	ldrbvc	r7, [pc], #-609	@ 49d8 <_Min_Stack_Size+0x45d8>
    49d4:	0020685f 	eoreq	r6, r0, pc, asr r8
    49d8:	59535f5f 	ldmdbpl	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    49dc:	4f4c5f53 	svcmi	0x004c5f53
    49e0:	485f4b43 	ldmdami	pc, {r0, r1, r6, r8, r9, fp, lr}^	@ <UNPREDICTABLE>
    49e4:	00205f5f 	eoreq	r5, r0, pc, asr pc
    49e8:	4f495047 	svcmi	0x00495047
    49ec:	444f4d5f 	strbmi	r4, [pc], #-3423	@ 49f4 <_Min_Stack_Size+0x45f4>
    49f0:	554f5f45 	strbpl	r5, [pc, #-3909]	@ 3ab3 <_Min_Stack_Size+0x36b3>
    49f4:	54555054 	ldrbpl	r5, [r5], #-84	@ 0xffffffac
    49f8:	5f46415f 	svcpl	0x0046415f
    49fc:	30205050 	eorcc	r5, r0, r0, asr r0
    4a00:	30303078 	eorscc	r3, r0, r8, ror r0
    4a04:	30303030 	eorscc	r3, r0, r0, lsr r0
    4a08:	5f007536 	svcpl	0x00007536
    4a0c:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    4a10:	4e495f54 	mcrmi	15, 2, r5, cr9, cr4, {2}
    4a14:	525f5449 	subspl	r5, pc, #1224736768	@ 0x49000000
    4a18:	52455345 	subpl	r5, r5, #335544321	@ 0x14000001
    4a1c:	5f444556 	svcpl	0x00444556
    4a20:	5f002032 	svcpl	0x00002032
    4a24:	36544e49 	ldrbcc	r4, [r4], -r9, asr #28
    4a28:	5f545f34 	svcpl	0x00545f34
    4a2c:	4c434544 	cfstr64mi	mvdx4, [r3], {68}	@ 0x44
    4a30:	44455241 	strbmi	r5, [r5], #-577	@ 0xfffffdbf
    4a34:	32490020 	subcc	r0, r9, #32
    4a38:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    4a3c:	55425f32 	strbpl	r5, [r2, #-3890]	@ 0xfffff0ce
    4a40:	4d5f5953 	vldrmi.16	s11, [pc, #-166]	@ 49a2 <_Min_Stack_Size+0x45a2>	@ <UNPREDICTABLE>
    4a44:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    4a48:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    4a4c:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    4a50:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    4a54:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    4a58:	5355425f 	cmppl	r5, #-268435451	@ 0xf0000005
    4a5c:	6f505f59 	svcvs	0x00505f59
    4a60:	45002973 	strmi	r2, [r0, #-2419]	@ 0xfffff68d
    4a64:	525f4358 	subspl	r4, pc, #88, 6	@ 0x60000001
    4a68:	52555445 	subspl	r5, r5, #1157627904	@ 0x45000000
    4a6c:	48545f4e 	ldmdami	r4, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    4a70:	44414552 	strbmi	r4, [r1], #-1362	@ 0xfffffaae
    4a74:	5053505f 	subspl	r5, r3, pc, asr r0
    4a78:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    4a7c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    4a80:	44464646 	strbmi	r4, [r6], #-1606	@ 0xfffff9ba
    4a84:	00294c55 	eoreq	r4, r9, r5, asr ip
    4a88:	41505f5f 	cmpmi	r0, pc, asr pc
    4a8c:	44454b43 	strbmi	r4, [r5], #-2883	@ 0xfffff4bd
    4a90:	615f5f20 	cmpvs	pc, r0, lsr #30
    4a94:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    4a98:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    4a9c:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    4aa0:	6b636170 	blvs	18dd068 <_Min_Stack_Size+0x18dcc68>
    4aa4:	202c6465 	eorcs	r6, ip, r5, ror #8
    4aa8:	67696c61 	strbvs	r6, [r9, -r1, ror #24]!
    4aac:	2864656e 	stmdacs	r4!, {r1, r2, r3, r5, r6, r8, sl, sp, lr}^
    4ab0:	29292931 	stmdbcs	r9!, {r0, r4, r5, r8, fp, sp}
    4ab4:	73795300 	cmnvc	r9, #0, 6
    4ab8:	6b636954 	blvs	18df010 <_Min_Stack_Size+0x18dec10>
    4abc:	414f4c5f 	cmpmi	pc, pc, asr ip	@ <UNPREDICTABLE>
    4ac0:	45525f44 	ldrbmi	r5, [r2, #-3908]	@ 0xfffff0bc
    4ac4:	44414f4c 	strbmi	r4, [r1], #-3916	@ 0xfffff0b4
    4ac8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4acc:	00553020 	subseq	r3, r5, r0, lsr #32
    4ad0:	5f4d5241 	svcpl	0x004d5241
    4ad4:	5f55504d 	svcpl	0x0055504d
    4ad8:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    4adc:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    4ae0:	5f455a49 	svcpl	0x00455a49
    4ae4:	20424b32 	subcs	r4, r2, r2, lsr fp
    4ae8:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    4aec:	5f38746e 	svcpl	0x0038746e
    4af0:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    4af4:	29554130 	ldmdbcs	r5, {r4, r5, r8, lr}^
    4af8:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    4afc:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ 4a2c <_Min_Stack_Size+0x462c>
    4b00:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    4b04:	495f5f2d 	ldmdbmi	pc, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    4b08:	3436544e 	ldrtcc	r5, [r6], #-1102	@ 0xfffffbb2
    4b0c:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    4b10:	2d205f5f 	stccs	15, cr5, [r0, #-380]!	@ 0xfffffe84
    4b14:	00293120 	eoreq	r3, r9, r0, lsr #2
    4b18:	74726f43 	ldrbtvc	r6, [r2], #-3907	@ 0xfffff0bd
    4b1c:	4d5f7865 	ldclmi	8, cr7, [pc, #-404]	@ 4990 <_Min_Stack_Size+0x4590>
    4b20:	6e495f33 	mcrvs	15, 2, r5, cr9, cr3, {1}
    4b24:	6e726574 	mrcvs	5, 3, r6, cr2, cr4, {3}
    4b28:	505f6c61 	subspl	r6, pc, r1, ror #24
    4b2c:	70697265 	rsbvc	r7, r9, r5, ror #4
    4b30:	61726568 	cmnvs	r2, r8, ror #10
    4b34:	425f736c 	subsmi	r7, pc, #108, 6	@ 0xb0000001
    4b38:	20455341 	subcs	r5, r5, r1, asr #6
    4b3c:	30457830 	subcc	r7, r5, r0, lsr r8
    4b40:	30303030 	eorscc	r3, r0, r0, lsr r0
    4b44:	4c553030 	mrrcmi	0, 3, r3, r5, cr0
    4b48:	4d524100 	ldfmie	f4, [r2, #-0]
    4b4c:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    4b50:	4341435f 	movtmi	r4, #4959	@ 0x135f
    4b54:	5f504548 	svcpl	0x00504548
    4b58:	41434f4e 	cmpmi	r3, lr, asr #30
    4b5c:	20454843 	subcs	r4, r5, r3, asr #16
    4b60:	5f005530 	svcpl	0x00005530
    4b64:	534d435f 	movtpl	r4, #54111	@ 0xd35f
    4b68:	435f5349 	cmpmi	pc, #603979777	@ 0x24000001
    4b6c:	49504d4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, sl, fp, lr}^
    4b70:	5f52454c 	svcpl	0x0052454c
    4b74:	43002048 	movwmi	r2, #72	@ 0x48
    4b78:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    4b7c:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    4b80:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    4b84:	565f5243 	ldrbpl	r5, [pc], -r3, asr #4
    4b88:	54535f43 	ldrbpl	r5, [r3], #-3907	@ 0xfffff0bd
    4b8c:	52455441 	subpl	r5, r5, #1090519040	@ 0x41000000
    4b90:	6f505f52 	svcvs	0x00505f52
    4b94:	55372073 	ldrpl	r2, [r7, #-115]!	@ 0xffffff8d
    4b98:	42435300 	submi	r5, r3, #0, 6
    4b9c:	5343495f 	movtpl	r4, #14687	@ 0x395f
    4ba0:	45505f52 	ldrbmi	r5, [r0, #-3922]	@ 0xfffff0ae
    4ba4:	5653444e 	ldrbpl	r4, [r3], -lr, asr #8
    4ba8:	5f544553 	svcpl	0x00544553
    4bac:	20736f50 	rsbscs	r6, r3, r0, asr pc
    4bb0:	00553832 	subseq	r3, r5, r2, lsr r8
    4bb4:	5f545744 	svcpl	0x00545744
    4bb8:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    4bbc:	504f4e5f 	subpl	r4, pc, pc, asr lr	@ <UNPREDICTABLE>
    4bc0:	4e434652 	mcrmi	6, 2, r4, cr3, cr2, {2}
    4bc4:	6f505f54 	svcvs	0x00505f54
    4bc8:	34322073 	ldrtcc	r2, [r2], #-115	@ 0xffffff8d
    4bcc:	49550055 	ldmdbmi	r5, {r0, r2, r4, r6}^
    4bd0:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    4bd4:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    4bd8:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ 4b14 <_Min_Stack_Size+0x4714>
    4bdc:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    4be0:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    4be4:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    4be8:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    4bec:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ 4b28 <_Min_Stack_Size+0x4728>
    4bf0:	5f5f5841 	svcpl	0x005f5841
    4bf4:	32490029 	subcc	r0, r9, #41	@ 0x29
    4bf8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    4bfc:	4d535f31 	ldclmi	15, cr5, [r3, #-196]	@ 0xffffff3c
    4c00:	50595442 	subspl	r5, r9, r2, asr #8
    4c04:	734d5f45 	movtvc	r5, #57157	@ 0xdf45
    4c08:	3028206b 	eorcc	r2, r8, fp, rrx
    4c0c:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    4c10:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    4c14:	5f433249 	svcpl	0x00433249
    4c18:	5f315243 	svcpl	0x00315243
    4c1c:	54424d53 	strbpl	r4, [r2], #-3411	@ 0xfffff2ad
    4c20:	5f455059 	svcpl	0x00455059
    4c24:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    4c28:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    4c2c:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    4c30:	455f314f 	ldrbmi	r3, [pc, #-335]	@ 4ae9 <_Min_Stack_Size+0x46e9>
    4c34:	415f4d54 	cmpmi	pc, r4, asr sp	@ <UNPREDICTABLE>
    4c38:	4c415654 	mcrrmi	6, 5, r5, r1, cr4
    4c3c:	505f4449 	subspl	r4, pc, r9, asr #8
    4c40:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    4c44:	43005536 	movwmi	r5, #1334	@ 0x536
    4c48:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    4c4c:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    4c50:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    4c54:	565f5243 	ldrbpl	r5, [pc], -r3, asr #4
    4c58:	54535f43 	ldrbpl	r5, [r3], #-3907	@ 0xfffff0bd
    4c5c:	52455441 	subpl	r5, r5, #1090519040	@ 0x41000000
    4c60:	734d5f52 	movtvc	r5, #57170	@ 0xdf52
    4c64:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    4c68:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    4c6c:	6f43203c 	svcvs	0x0043203c
    4c70:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    4c74:	5f677562 	svcpl	0x00677562
    4c78:	434d4544 	movtmi	r4, #54596	@ 0xd544
    4c7c:	43565f52 	cmpmi	r6, #328	@ 0x148
    4c80:	4154535f 	cmpmi	r4, pc, asr r3
    4c84:	52524554 	subspl	r4, r2, #84, 10	@ 0x15000000
    4c88:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4c8c:	32490029 	subcc	r0, r9, #41	@ 0x29
    4c90:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    4c94:	4d535f31 	ldclmi	15, cr5, [r3, #-196]	@ 0xffffff3c
    4c98:	454c4142 	strbmi	r4, [ip, #-322]	@ 0xfffffebe
    4c9c:	4d5f5452 	cfldrdmi	mvd5, [pc, #-328]	@ 4b5c <_Min_Stack_Size+0x475c>
    4ca0:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    4ca4:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    4ca8:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    4cac:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    4cb0:	3152535f 	cmpcc	r2, pc, asr r3
    4cb4:	424d535f 	submi	r5, sp, #2080374785	@ 0x7c000001
    4cb8:	52454c41 	subpl	r4, r5, #16640	@ 0x4100
    4cbc:	6f505f54 	svcvs	0x00505f54
    4cc0:	78002973 	stmdavc	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
    4cc4:	5f525350 	svcpl	0x00525350
    4cc8:	6f505f54 	svcvs	0x00505f54
    4ccc:	34322073 	ldrtcc	r2, [r2], #-115	@ 0xffffff8d
    4cd0:	6f430055 	svcvs	0x00430055
    4cd4:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    4cd8:	5f677562 	svcpl	0x00677562
    4cdc:	434d4544 	movtmi	r4, #54596	@ 0xd544
    4ce0:	43565f52 	cmpmi	r6, #328	@ 0x148
    4ce4:	524f435f 	subpl	r4, pc, #2080374785	@ 0x7c000001
    4ce8:	53455245 	movtpl	r5, #21061	@ 0x5245
    4cec:	4d5f5445 	cfldrdmi	mvd5, [pc, #-276]	@ 4be0 <_Min_Stack_Size+0x47e0>
    4cf0:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    4cf4:	204c5531 	subcs	r5, ip, r1, lsr r5
    4cf8:	43530029 	cmpmi	r3, #41	@ 0x29
    4cfc:	46445f42 	strbmi	r5, [r4], -r2, asr #30
    4d00:	445f5253 	ldrbmi	r5, [pc], #-595	@ 4d08 <_Min_Stack_Size+0x4908>
    4d04:	52545457 	subspl	r5, r4, #1459617792	@ 0x57000000
    4d08:	4d5f5041 	ldclmi	0, cr5, [pc, #-260]	@ 4c0c <_Min_Stack_Size+0x480c>
    4d0c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    4d10:	204c5531 	subcs	r5, ip, r1, lsr r5
    4d14:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    4d18:	445f4243 	ldrbmi	r4, [pc], #-579	@ 4d20 <_Min_Stack_Size+0x4920>
    4d1c:	5f525346 	svcpl	0x00525346
    4d20:	54545744 	ldrbpl	r5, [r4], #-1860	@ 0xfffff8bc
    4d24:	5f504152 	svcpl	0x00504152
    4d28:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    4d2c:	726f4300 	rsbvc	r4, pc, #0, 6
    4d30:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    4d34:	445f6775 	ldrbmi	r6, [pc], #-1909	@ 4d3c <_Min_Stack_Size+0x493c>
    4d38:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    4d3c:	525f535f 	subspl	r5, pc, #2080374785	@ 0x7c000001
    4d40:	52495445 	subpl	r5, r9, #1157627904	@ 0x45000000
    4d44:	54535f45 	ldrbpl	r5, [r3], #-3909	@ 0xfffff0bb
    4d48:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4d4c:	55343220 	ldrpl	r3, [r4, #-544]!	@ 0xfffffde0
    4d50:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    4d54:	5f544e45 	svcpl	0x00544e45
    4d58:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    4d5c:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
    4d60:	207b2029 	rsbscs	r2, fp, r9, lsr #32
    4d64:	26202c30 			@ <UNDEFINED> instruction: 0x26202c30
    4d68:	66735f5f 	uhsaxvs	r5, r3, pc	@ <UNPREDICTABLE>
    4d6c:	2c5d305b 	mrrccs	0, 5, r3, sp, cr11
    4d70:	5f5f2620 	svcpl	0x005f2620
    4d74:	315b6673 	cmpcc	fp, r3, ror r6
    4d78:	26202c5d 			@ <UNDEFINED> instruction: 0x26202c5d
    4d7c:	66735f5f 	uhsaxvs	r5, r3, pc	@ <UNPREDICTABLE>
    4d80:	2c5d325b 	lfmcs	f3, 2, [sp], {91}	@ 0x5b
    4d84:	202c3020 	eorcs	r3, ip, r0, lsr #32
    4d88:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    4d8c:	5f202c4c 	svcpl	0x00202c4c
    4d90:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    4d94:	4e495f54 	mcrmi	15, 2, r5, cr9, cr4, {2}
    4d98:	525f5449 	subspl	r5, pc, #1224736768	@ 0x49000000
    4d9c:	52455345 	subpl	r5, r5, #335544321	@ 0x14000001
    4da0:	5f444556 	svcpl	0x00444556
    4da4:	525f2030 	subspl	r2, pc, #48	@ 0x30
    4da8:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    4dac:	494e495f 	stmdbmi	lr, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    4db0:	45525f54 	ldrbmi	r5, [r2, #-3924]	@ 0xfffff0ac
    4db4:	56524553 			@ <UNDEFINED> instruction: 0x56524553
    4db8:	315f4445 	cmpcc	pc, r5, asr #8
    4dbc:	554e5f20 	strbpl	r5, [lr, #-3872]	@ 0xfffff0e0
    4dc0:	202c4c4c 	eorcs	r4, ip, ip, asr #24
    4dc4:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    4dc8:	5f202c4c 	svcpl	0x00202c4c
    4dcc:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    4dd0:	2c30202c 	ldccs	0, cr2, [r0], #-176	@ 0xffffff50
    4dd4:	202c3020 	eorcs	r3, ip, r0, lsr #32
    4dd8:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    4ddc:	5f202c4c 	svcpl	0x00202c4c
    4de0:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    4de4:	4e5f202c 	cdpmi	0, 5, cr2, cr15, cr12, {1}
    4de8:	2c4c4c55 	mcrrcs	12, 5, r4, ip, cr5
    4dec:	554e5f20 	strbpl	r5, [lr, #-3872]	@ 0xfffff0e0
    4df0:	202c4c4c 	eorcs	r4, ip, ip, asr #24
    4df4:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    4df8:	5f202c4c 	svcpl	0x00202c4c
    4dfc:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    4e00:	4e495f54 	mcrmi	15, 2, r5, cr9, cr4, {2}
    4e04:	525f5449 	subspl	r5, pc, #1224736768	@ 0x49000000
    4e08:	52455345 	subpl	r5, r5, #335544321	@ 0x14000001
    4e0c:	5f444556 	svcpl	0x00444556
    4e10:	20375f36 	eorscs	r5, r7, r6, lsr pc
    4e14:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    4e18:	495f544e 	ldmdbmi	pc, {r1, r2, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    4e1c:	5f54494e 	svcpl	0x0054494e
    4e20:	45534552 	ldrbmi	r4, [r3, #-1362]	@ 0xfffffaae
    4e24:	44455652 	strbmi	r5, [r5], #-1618	@ 0xfffff9ae
    4e28:	5f20385f 	svcpl	0x0020385f
    4e2c:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    4e30:	4e5f202c 	cdpmi	0, 5, cr2, cr15, cr12, {1}
    4e34:	2c4c4c55 	mcrrcs	12, 5, r4, ip, cr5
    4e38:	554e5f20 	strbpl	r5, [lr, #-3872]	@ 0xfffff0e0
    4e3c:	7d204c4c 	stcvc	12, cr4, [r0, #-304]!	@ 0xfffffed0
    4e40:	42435300 	submi	r5, r3, #0, 6
    4e44:	5346435f 	movtpl	r4, #25439	@ 0x635f
    4e48:	46425f52 			@ <UNDEFINED> instruction: 0x46425f52
    4e4c:	41565241 	cmpmi	r6, r1, asr #4
    4e50:	5f44494c 	svcpl	0x0044494c
    4e54:	206b734d 	rsbcs	r7, fp, sp, asr #6
    4e58:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    4e5c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    4e60:	5f424353 	svcpl	0x00424353
    4e64:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    4e68:	4146425f 	cmpmi	r6, pc, asr r2
    4e6c:	4c415652 	mcrrmi	6, 5, r5, r1, cr2
    4e70:	505f4449 	subspl	r4, pc, r9, asr #8
    4e74:	0029736f 	eoreq	r7, r9, pc, ror #6
    4e78:	5f434352 	svcpl	0x00434352
    4e7c:	32495053 	subcc	r5, r9, #83	@ 0x53
    4e80:	7365525f 	cmnvc	r5, #-268435451	@ 0xf0000005
    4e84:	29287465 	stmdbcs	r8!, {r0, r2, r5, r6, sl, ip, sp, lr}
    4e88:	43522820 	cmpmi	r2, #32, 16	@ 0x200000
    4e8c:	413e2d43 	teqmi	lr, r3, asr #26
    4e90:	52314250 	eorspl	r4, r1, #80, 4
    4e94:	20525453 	subscs	r5, r2, r3, asr r4
    4e98:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    4e9c:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    4ea0:	29343120 	ldmdbcs	r4!, {r5, r8, ip, sp}
    4ea4:	5f5f0029 	svcpl	0x005f0029
    4ea8:	736e6f63 	cmnvc	lr, #396	@ 0x18c
    4eac:	6f632074 	svcvs	0x00632074
    4eb0:	0074736e 	rsbseq	r7, r4, lr, ror #6
    4eb4:	45535f5f 	ldrbmi	r5, [r3, #-3935]	@ 0xfffff0a1
    4eb8:	3020464f 	eorcc	r4, r0, pc, asr #12
    4ebc:	32303078 	eorscc	r3, r0, #120	@ 0x78
    4ec0:	4d5f0030 	ldclmi	0, cr0, [pc, #-192]	@ 4e08 <_Min_Stack_Size+0x4a08>
    4ec4:	53484341 	movtpl	r4, #33601	@ 0x8341
    4ec8:	494c4454 	stmdbmi	ip, {r2, r4, r6, sl, lr}^
    4ecc:	5f485f42 	svcpl	0x00485f42
    4ed0:	50540020 	subspl	r0, r4, r0, lsr #32
    4ed4:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    4ed8:	5f304f46 	svcpl	0x00304f46
    4edc:	324d5445 	subcc	r5, sp, #1157627904	@ 0x45000000
    4ee0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4ee4:	55363120 	ldrpl	r3, [r6, #-288]!	@ 0xfffffee0
    4ee8:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    4eec:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    4ef0:	455f314f 	ldrbmi	r3, [pc, #-335]	@ 4da9 <_Min_Stack_Size+0x49a9>
    4ef4:	625f4d54 	subsvs	r4, pc, #84, 26	@ 0x1500
    4ef8:	63657479 	cmnvs	r5, #2030043136	@ 0x79000000
    4efc:	746e756f 	strbtvc	r7, [lr], #-1391	@ 0xfffffa91
    4f00:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4f04:	55343220 	ldrpl	r3, [r4, #-544]!	@ 0xfffffde0
    4f08:	42435300 	submi	r5, r3, #0, 6
    4f0c:	5243435f 	subpl	r4, r3, #2080374785	@ 0x7c000001
    4f10:	4b54535f 	blmi	1519c94 <_Min_Stack_Size+0x1519894>
    4f14:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    4f18:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    4f1c:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    4f20:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    4f24:	4353203c 	cmpmi	r3, #60	@ 0x3c
    4f28:	43435f42 	movtmi	r5, #16194	@ 0x3f42
    4f2c:	54535f52 	ldrbpl	r5, [r3], #-3922	@ 0xfffff0ae
    4f30:	494c414b 	stmdbmi	ip, {r0, r1, r3, r6, r8, lr}^
    4f34:	505f4e47 	subspl	r4, pc, r7, asr #28
    4f38:	0029736f 	eoreq	r7, r9, pc, ror #6
    4f3c:	53465542 	movtpl	r5, #25922	@ 0x6542
    4f40:	31205a49 			@ <UNDEFINED> instruction: 0x31205a49
    4f44:	00343230 	eorseq	r3, r4, r0, lsr r2
    4f48:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    4f4c:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    4f50:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
    4f54:	5f52434d 	svcpl	0x0052434d
    4f58:	4d5f4356 	ldclmi	3, cr4, [pc, #-344]	@ 4e08 <_Min_Stack_Size+0x4a08>
    4f5c:	5252454d 	subspl	r4, r2, #322961408	@ 0x13400000
    4f60:	736f505f 	cmnvc	pc, #95	@ 0x5f
    4f64:	00553420 	subseq	r3, r5, r0, lsr #8
    4f68:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    4f6c:	495f544e 	ldmdbmi	pc, {r1, r2, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    4f70:	5f54494e 	svcpl	0x0054494e
    4f74:	4353494d 	cmpmi	r3, #1261568	@ 0x134000
    4f78:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
    4f7c:	6f642029 	svcvs	0x00642029
    4f80:	73207b20 			@ <UNDEFINED> instruction: 0x73207b20
    4f84:	63757274 	cmnvs	r5, #116, 4	@ 0x40000007
    4f88:	725f2074 	subsvc	r2, pc, #116	@ 0x74
    4f8c:	746e6565 	strbtvc	r6, [lr], #-1381	@ 0xfffffa9b
    4f90:	725f2a20 	subsvc	r2, pc, #32, 20	@ 0x20000
    4f94:	28203d20 	stmdacs	r0!, {r5, r8, sl, fp, ip, sp}
    4f98:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    4f9c:	725f203b 	subsvc	r2, pc, #59	@ 0x3b
    4fa0:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 4ef4 <_Min_Stack_Size+0x4af4>
    4fa4:	2d637369 	stclcs	3, cr7, [r3, #-420]!	@ 0xfffffe5c
    4fa8:	74735f3e 	ldrbtvc	r5, [r3], #-3902	@ 0xfffff0c2
    4fac:	6b6f7472 	blvs	1be217c <_Min_Stack_Size+0x1be1d7c>
    4fb0:	73616c5f 	cmnvc	r1, #24320	@ 0x5f00
    4fb4:	203d2074 	eorscs	r2, sp, r4, ror r0
    4fb8:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    4fbc:	5f203b4c 	svcpl	0x00203b4c
    4fc0:	5f3e2d72 	svcpl	0x003e2d72
    4fc4:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    4fc8:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 4f1c <_Min_Stack_Size+0x4b1c>
    4fcc:	6e656c62 	cdpvs	12, 6, cr6, cr5, cr2, {3}
    4fd0:	6174735f 	cmnvs	r4, pc, asr r3
    4fd4:	5f2e6574 	svcpl	0x002e6574
    4fd8:	756f635f 	strbvc	r6, [pc, #-863]!	@ 4c81 <_Min_Stack_Size+0x4881>
    4fdc:	3d20746e 	cfstrscc	mvf7, [r0, #-440]!	@ 0xfffffe48
    4fe0:	203b3020 	eorscs	r3, fp, r0, lsr #32
    4fe4:	3e2d725f 	mcrcc	2, 1, r7, cr13, cr15, {2}
    4fe8:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    4fec:	5f3e2d63 	svcpl	0x003e2d63
    4ff0:	656c626d 	strbvs	r6, [ip, #-621]!	@ 0xfffffd93
    4ff4:	74735f6e 	ldrbtvc	r5, [r3], #-3950	@ 0xfffff092
    4ff8:	2e657461 	cdpcs	4, 6, cr7, cr5, cr1, {3}
    4ffc:	61765f5f 	cmnvs	r6, pc, asr pc
    5000:	2e65756c 	cdpcs	5, 6, cr7, cr5, cr12, {3}
    5004:	63775f5f 	cmnvs	r7, #380	@ 0x17c
    5008:	203d2068 	eorscs	r2, sp, r8, rrx
    500c:	5f203b30 	svcpl	0x00203b30
    5010:	5f3e2d72 	svcpl	0x003e2d72
    5014:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    5018:	775f3e2d 	ldrbvc	r3, [pc, -sp, lsr #28]
    501c:	6d6f7463 	cfstrdvs	mvd7, [pc, #-396]!	@ 4e98 <_Min_Stack_Size+0x4a98>
    5020:	74735f62 	ldrbtvc	r5, [r3], #-3938	@ 0xfffff09e
    5024:	2e657461 	cdpcs	4, 6, cr7, cr5, cr1, {3}
    5028:	6f635f5f 	svcvs	0x00635f5f
    502c:	20746e75 	rsbscs	r6, r4, r5, ror lr
