NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    5030:	3b30203d 	blcc	c0d12c <_Min_Stack_Size+0xc0cd2c>
    5034:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    5038:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    503c:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    5040:	7463775f 	strbtvc	r7, [r3], #-1887	@ 0xfffff8a1
    5044:	5f626d6f 	svcpl	0x00626d6f
    5048:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    504c:	5f5f2e65 	svcpl	0x005f2e65
    5050:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    5054:	5f5f2e65 	svcpl	0x005f2e65
    5058:	20686377 	rsbcs	r6, r8, r7, ror r3
    505c:	3b30203d 	blcc	c0d158 <_Min_Stack_Size+0xc0cd58>
    5060:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    5064:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    5068:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    506c:	74626d5f 	strbtvc	r6, [r2], #-3423	@ 0xfffff2a1
    5070:	5f63776f 	svcpl	0x0063776f
    5074:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    5078:	5f5f2e65 	svcpl	0x005f2e65
    507c:	6e756f63 	cdpvs	15, 7, cr6, cr5, cr3, {3}
    5080:	203d2074 	eorscs	r2, sp, r4, ror r0
    5084:	5f203b30 	svcpl	0x00203b30
    5088:	5f3e2d72 	svcpl	0x003e2d72
    508c:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    5090:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 4fe4 <_Min_Stack_Size+0x4be4>
    5094:	776f7462 	strbvc	r7, [pc, -r2, ror #8]!
    5098:	74735f63 	ldrbtvc	r5, [r3], #-3939	@ 0xfffff09d
    509c:	2e657461 	cdpcs	4, 6, cr7, cr5, cr1, {3}
    50a0:	61765f5f 	cmnvs	r6, pc, asr pc
    50a4:	2e65756c 	cdpcs	5, 6, cr7, cr5, cr12, {3}
    50a8:	63775f5f 	cmnvs	r7, #380	@ 0x17c
    50ac:	203d2068 	eorscs	r2, sp, r8, rrx
    50b0:	5f203b30 	svcpl	0x00203b30
    50b4:	5f3e2d72 	svcpl	0x003e2d72
    50b8:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    50bc:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 5010 <_Min_Stack_Size+0x4c10>
    50c0:	656c7262 	strbvs	r7, [ip, #-610]!	@ 0xfffffd9e
    50c4:	74735f6e 	ldrbtvc	r5, [r3], #-3950	@ 0xfffff092
    50c8:	2e657461 	cdpcs	4, 6, cr7, cr5, cr1, {3}
    50cc:	6f635f5f 	svcvs	0x00635f5f
    50d0:	20746e75 	rsbscs	r6, r4, r5, ror lr
    50d4:	3b30203d 	blcc	c0d1d0 <_Min_Stack_Size+0xc0cdd0>
    50d8:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    50dc:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    50e0:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    50e4:	72626d5f 	rsbvc	r6, r2, #6080	@ 0x17c0
    50e8:	5f6e656c 	svcpl	0x006e656c
    50ec:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    50f0:	5f5f2e65 	svcpl	0x005f2e65
    50f4:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    50f8:	5f5f2e65 	svcpl	0x005f2e65
    50fc:	20686377 	rsbcs	r6, r8, r7, ror r3
    5100:	3b30203d 	blcc	c0d1fc <_Min_Stack_Size+0xc0cdfc>
    5104:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    5108:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    510c:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    5110:	72626d5f 	rsbvc	r6, r2, #6080	@ 0x17c0
    5114:	63776f74 	cmnvs	r7, #116, 30	@ 0x1d0
    5118:	6174735f 	cmnvs	r4, pc, asr r3
    511c:	5f2e6574 	svcpl	0x002e6574
    5120:	756f635f 	strbvc	r6, [pc, #-863]!	@ 4dc9 <_Min_Stack_Size+0x49c9>
    5124:	3d20746e 	cfstrscc	mvf7, [r0, #-440]!	@ 0xfffffe48
    5128:	203b3020 	eorscs	r3, fp, r0, lsr #32
    512c:	3e2d725f 	mcrcc	2, 1, r7, cr13, cr15, {2}
    5130:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    5134:	5f3e2d63 	svcpl	0x003e2d63
    5138:	7472626d 	ldrbtvc	r6, [r2], #-621	@ 0xfffffd93
    513c:	5f63776f 	svcpl	0x0063776f
    5140:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    5144:	5f5f2e65 	svcpl	0x005f2e65
    5148:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    514c:	5f5f2e65 	svcpl	0x005f2e65
    5150:	20686377 	rsbcs	r6, r8, r7, ror r3
    5154:	3b30203d 	blcc	c0d250 <_Min_Stack_Size+0xc0ce50>
    5158:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    515c:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    5160:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    5164:	73626d5f 	cmnvc	r2, #6080	@ 0x17c0
    5168:	776f7472 			@ <UNDEFINED> instruction: 0x776f7472
    516c:	735f7363 	cmpvc	pc, #-1946157055	@ 0x8c000001
    5170:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
    5174:	635f5f2e 	cmpvs	pc, #46, 30	@ 0xb8
    5178:	746e756f 	strbtvc	r7, [lr], #-1391	@ 0xfffffa91
    517c:	30203d20 	eorcc	r3, r0, r0, lsr #26
    5180:	725f203b 	subsvc	r2, pc, #59	@ 0x3b
    5184:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 50d8 <_Min_Stack_Size+0x4cd8>
    5188:	2d637369 	stclcs	3, cr7, [r3, #-420]!	@ 0xfffffe5c
    518c:	626d5f3e 	rsbvs	r5, sp, #62, 30	@ 0xf8
    5190:	6f747273 	svcvs	0x00747273
    5194:	5f736377 	svcpl	0x00736377
    5198:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    519c:	5f5f2e65 	svcpl	0x005f2e65
    51a0:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    51a4:	5f5f2e65 	svcpl	0x005f2e65
    51a8:	20686377 	rsbcs	r6, r8, r7, ror r3
    51ac:	3b30203d 	blcc	c0d2a8 <_Min_Stack_Size+0xc0cea8>
    51b0:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    51b4:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    51b8:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    51bc:	7263775f 	rsbvc	r7, r3, #24903680	@ 0x17c0000
    51c0:	626d6f74 	rsbvs	r6, sp, #116, 30	@ 0x1d0
    51c4:	6174735f 	cmnvs	r4, pc, asr r3
    51c8:	5f2e6574 	svcpl	0x002e6574
    51cc:	756f635f 	strbvc	r6, [pc, #-863]!	@ 4e75 <_Min_Stack_Size+0x4a75>
    51d0:	3d20746e 	cfstrscc	mvf7, [r0, #-440]!	@ 0xfffffe48
    51d4:	203b3020 	eorscs	r3, fp, r0, lsr #32
    51d8:	3e2d725f 	mcrcc	2, 1, r7, cr13, cr15, {2}
    51dc:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    51e0:	5f3e2d63 	svcpl	0x003e2d63
    51e4:	74726377 	ldrbtvc	r6, [r2], #-887	@ 0xfffffc89
    51e8:	5f626d6f 	svcpl	0x00626d6f
    51ec:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    51f0:	5f5f2e65 	svcpl	0x005f2e65
    51f4:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    51f8:	5f5f2e65 	svcpl	0x005f2e65
    51fc:	20686377 	rsbcs	r6, r8, r7, ror r3
    5200:	3b30203d 	blcc	c0d2fc <_Min_Stack_Size+0xc0cefc>
    5204:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    5208:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    520c:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    5210:	7363775f 	cmnvc	r3, #24903680	@ 0x17c0000
    5214:	6d6f7472 	cfstrdvs	mvd7, [pc, #-456]!	@ 5054 <_Min_Stack_Size+0x4c54>
    5218:	735f7362 	cmpvc	pc, #-2013265919	@ 0x88000001
    521c:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
    5220:	635f5f2e 	cmpvs	pc, #46, 30	@ 0xb8
    5224:	746e756f 	strbtvc	r7, [lr], #-1391	@ 0xfffffa91
    5228:	30203d20 	eorcc	r3, r0, r0, lsr #26
    522c:	725f203b 	subsvc	r2, pc, #59	@ 0x3b
    5230:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 5184 <_Min_Stack_Size+0x4d84>
    5234:	2d637369 	stclcs	3, cr7, [r3, #-420]!	@ 0xfffffe5c
    5238:	63775f3e 	cmnvs	r7, #62, 30	@ 0xf8
    523c:	6f747273 	svcvs	0x00747273
    5240:	5f73626d 	svcpl	0x0073626d
    5244:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    5248:	5f5f2e65 	svcpl	0x005f2e65
    524c:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    5250:	5f5f2e65 	svcpl	0x005f2e65
    5254:	20686377 	rsbcs	r6, r8, r7, ror r3
    5258:	3b30203d 	blcc	c0d354 <_Min_Stack_Size+0xc0cf54>
    525c:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    5260:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    5264:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    5268:	34366c5f 	ldrtcc	r6, [r6], #-3167	@ 0xfffff3a1
    526c:	75625f61 	strbvc	r5, [r2, #-3937]!	@ 0xfffff09f
    5270:	5d305b66 	vldmdbpl	r0!, {d5-<overflow reg d55>}
    5274:	27203d20 	strcs	r3, [r0, -r0, lsr #26]!
    5278:	3b27305c 	blcc	9d13f0 <_Min_Stack_Size+0x9d0ff0>
    527c:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    5280:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    5284:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    5288:	7465675f 	strbtvc	r6, [r5], #-1887	@ 0xfffff8a1
    528c:	65746164 	ldrbvs	r6, [r4, #-356]!	@ 0xfffffe9c
    5290:	7272655f 	rsbsvc	r6, r2, #398458880	@ 0x17c00000
    5294:	30203d20 	eorcc	r3, r0, r0, lsr #26
    5298:	207d203b 	rsbscs	r2, sp, fp, lsr r0
    529c:	6c696877 	stclvs	8, cr6, [r9], #-476	@ 0xfffffe24
    52a0:	30282065 	eorcc	r2, r8, r5, rrx
    52a4:	504d0029 	subpl	r0, sp, r9, lsr #32
    52a8:	41525f55 	cmpmi	r2, r5, asr pc
    52ac:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    52b0:	6b734d5f 	blvs	1cd8834 <_Min_Stack_Size+0x1cd8434>
    52b4:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    52b8:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    52bc:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    52c0:	5341525f 	movtpl	r5, #4703	@ 0x125f
    52c4:	5f535f52 	svcpl	0x00535f52
    52c8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    52cc:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    52d0:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    52d4:	495f314f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
    52d8:	5f324d54 	svcpl	0x00324d54
    52dc:	206b734d 	rsbcs	r7, fp, sp, asr #6
    52e0:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    52e4:	204c5546 	subcs	r5, ip, r6, asr #10
    52e8:	54203c3c 	strtpl	r3, [r0], #-3132	@ 0xfffff3c4
    52ec:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    52f0:	314f4649 	cmpcc	pc, r9, asr #12
    52f4:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    52f8:	6f505f32 	svcvs	0x00505f32
    52fc:	5f002973 	svcpl	0x00002973
    5300:	334d435f 	movtcc	r4, #54111	@ 0xd35f
    5304:	534d435f 	movtpl	r4, #54111	@ 0xd35f
    5308:	565f5349 	ldrbpl	r5, [pc], -r9, asr #6
    530c:	49535245 	ldmdbmi	r3, {r0, r2, r6, r9, ip, lr}^
    5310:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    5314:	28204255 	stmdacs	r0!, {r0, r2, r4, r6, r9, lr}
    5318:	4d435f5f 	stclmi	15, cr5, [r3, #-380]	@ 0xfffffe84
    531c:	534d435f 	movtpl	r4, #54111	@ 0xd35f
    5320:	565f5349 	ldrbpl	r5, [pc], -r9, asr #6
    5324:	49535245 	ldmdbmi	r3, {r0, r2, r6, r9, ip, lr}^
    5328:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    532c:	00294255 	eoreq	r4, r9, r5, asr r2
    5330:	5f545744 	svcpl	0x00545744
    5334:	43435845 	movtmi	r5, #14405	@ 0x3845
    5338:	455f544e 	ldrbmi	r5, [pc, #-1102]	@ 4ef2 <_Min_Stack_Size+0x4af2>
    533c:	4e434358 	mcrmi	3, 2, r4, cr3, cr8, {2}
    5340:	6f505f54 	svcvs	0x00505f54
    5344:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    5348:	6c5f5f00 	mrrcvs	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    534c:	5f6b636f 	svcpl	0x006b636f
    5350:	5f797274 	svcpl	0x00797274
    5354:	75716361 	ldrbvc	r6, [r1, #-865]!	@ 0xfffffc9f
    5358:	5f657269 	svcpl	0x00657269
    535c:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    5360:	76697372 			@ <UNDEFINED> instruction: 0x76697372
    5364:	6f6c2865 	svcvs	0x006c2865
    5368:	20296b63 	eorcs	r6, r9, r3, ror #22
    536c:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
    5370:	67726174 			@ <UNDEFINED> instruction: 0x67726174
    5374:	6c5f7465 	cfldrdvs	mvd7, [pc], {101}	@ 0x65
    5378:	5f6b636f 	svcpl	0x006b636f
    537c:	5f797274 	svcpl	0x00797274
    5380:	75716361 	ldrbvc	r6, [r1, #-865]!	@ 0xfffffc9f
    5384:	5f657269 	svcpl	0x00657269
    5388:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    538c:	76697372 			@ <UNDEFINED> instruction: 0x76697372
    5390:	6f6c2865 	svcvs	0x006c2865
    5394:	00296b63 	eoreq	r6, r9, r3, ror #22
    5398:	534e415f 	movtpl	r4, #57695	@ 0xe15f
    539c:	43454449 	movtmi	r4, #21577	@ 0x5449
    53a0:	5f485f4c 	svcpl	0x00485f4c
    53a4:	50540020 	subspl	r0, r4, r0, lsr #32
    53a8:	45445f49 	strbmi	r5, [r4, #-3913]	@ 0xfffff0b7
    53ac:	5f444956 	svcpl	0x00444956
    53b0:	7254724e 	subsvc	r7, r4, #-536870908	@ 0xe0000004
    53b4:	49656361 	stmdbmi	r5!, {r0, r5, r6, r8, r9, sp, lr}^
    53b8:	7475706e 	ldrbtvc	r7, [r5], #-110	@ 0xffffff92
    53bc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    53c0:	00553020 	subseq	r3, r5, r0, lsr #32
    53c4:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    53c8:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    53cc:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
    53d0:	5f52434d 	svcpl	0x0052434d
    53d4:	4e5f4356 	mrcmi	3, 2, r4, cr15, cr6, {2}
    53d8:	4550434f 	ldrbmi	r4, [r0, #-847]	@ 0xfffffcb1
    53dc:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    53e0:	3520736f 	strcc	r7, [r0, #-879]!	@ 0xfffffc91
    53e4:	504d0055 	subpl	r0, sp, r5, asr r0
    53e8:	41525f55 	cmpmi	r2, r5, asr pc
    53ec:	415f5253 	cmpmi	pc, r3, asr r2	@ <UNPREDICTABLE>
    53f0:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    53f4:	3028206b 	eorcc	r2, r8, fp, rrx
    53f8:	4c553778 	mrrcmi	7, 7, r3, r5, cr8
    53fc:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    5400:	5f55504d 	svcpl	0x0055504d
    5404:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    5408:	5f50415f 	svcpl	0x0050415f
    540c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    5410:	204b4f00 	subcs	r4, fp, r0, lsl #30
    5414:	50540031 	subspl	r0, r4, r1, lsr r0
    5418:	45445f49 	strbmi	r5, [r4, #-3913]	@ 0xfffff0b7
    541c:	5f444956 	svcpl	0x00444956
    5420:	565a524e 	ldrbpl	r5, [sl], -lr, asr #4
    5424:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    5428:	736f505f 	cmnvc	pc, #95	@ 0x5f
    542c:	55313120 	ldrpl	r3, [r1, #-288]!	@ 0xfffffee0
    5430:	53504100 	cmppl	r0, #0, 2
    5434:	5f515f52 	svcpl	0x00515f52
    5438:	206b734d 	rsbcs	r7, fp, sp, asr #6
    543c:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    5440:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    5444:	52535041 	subspl	r5, r3, #65	@ 0x41
    5448:	505f515f 	subspl	r5, pc, pc, asr r1	@ <UNPREDICTABLE>
    544c:	0029736f 	eoreq	r7, r9, pc, ror #6
    5450:	535f545f 	cmppl	pc, #1593835520	@ 0x5f000000
    5454:	5f455a49 	svcpl	0x00455a49
    5458:	5f5f0020 	svcpl	0x005f0020
    545c:	5f4f5349 	svcpl	0x004f5349
    5460:	49565f43 	ldmdbmi	r6, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    5464:	4c424953 	mcrrmi	9, 5, r4, r2, cr3	@ <UNPREDICTABLE>
    5468:	30322045 	eorscc	r2, r2, r5, asr #32
    546c:	43003131 	movwmi	r3, #305	@ 0x131
    5470:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    5474:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    5478:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    547c:	4d5f5243 	lfmmi	f5, 2, [pc, #-268]	@ 5378 <_Min_Stack_Size+0x4f78>
    5480:	455f4e4f 	ldrbmi	r4, [pc, #-3663]	@ 4639 <_Min_Stack_Size+0x4239>
    5484:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    5488:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    548c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    5490:	6f43203c 	svcvs	0x0043203c
    5494:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    5498:	5f677562 	svcpl	0x00677562
    549c:	434d4544 	movtmi	r4, #54596	@ 0xd544
    54a0:	4f4d5f52 	svcmi	0x004d5f52
    54a4:	4e455f4e 	cdpmi	15, 4, cr5, cr5, cr14, {2}
    54a8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    54ac:	58450029 	stmdapl	r5, {r0, r3, r5}^
    54b0:	45525f43 	ldrbmi	r5, [r2, #-3907]	@ 0xfffff0bd
    54b4:	4e525554 	mrcmi	5, 2, r5, cr2, cr4, {2}
    54b8:	5248545f 	subpl	r5, r8, #1593835520	@ 0x5f000000
    54bc:	5f444145 	svcpl	0x00444145
    54c0:	2050534d 	subscs	r5, r0, sp, asr #6
    54c4:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    54c8:	46464646 	strbmi	r4, [r6], -r6, asr #12
    54cc:	55394646 	ldrpl	r4, [r9, #-1606]!	@ 0xfffff9ba
    54d0:	4900294c 	stmdbmi	r0, {r2, r3, r6, r8, fp, sp}
    54d4:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    54d8:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    54dc:	4c41424d 	sfmmi	f4, 2, [r1], {77}	@ 0x4d
    54e0:	5f545245 	svcpl	0x00545245
    54e4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    54e8:	55353128 	ldrpl	r3, [r5, #-296]!	@ 0xfffffed8
    54ec:	5f5f0029 	svcpl	0x005f0029
    54f0:	52545441 	subspl	r5, r4, #1090519040	@ 0x41000000
    54f4:	54554249 	ldrbpl	r4, [r5], #-585	@ 0xfffffdb7
    54f8:	4d495f45 	stclmi	15, cr5, [r9, #-276]	@ 0xfffffeec
    54fc:	45525550 	ldrbmi	r5, [r2, #-1360]	@ 0xfffffab0
    5500:	5441445f 	strbpl	r4, [r1], #-1119	@ 0xfffffba1
    5504:	205f5f41 	subscs	r5, pc, r1, asr #30
    5508:	54415f00 	strbpl	r5, [r1], #-3840	@ 0xfffff100
    550c:	54495845 	strbpl	r5, [r9], #-2117	@ 0xfffff7bb
    5510:	5a49535f 	bpl	125a294 <_Min_Stack_Size+0x1259e94>
    5514:	32332045 	eorscc	r2, r3, #69	@ 0x45
    5518:	43324900 	teqmi	r2, #0, 18
    551c:	3152535f 	cmpcc	r2, pc, asr r3
    5520:	5245425f 	subpl	r4, r5, #-268435451	@ 0xf0000005
    5524:	6f505f52 	svcvs	0x00505f52
    5528:	38282073 	stmdacc	r8!, {r0, r1, r4, r5, r6, sp}
    552c:	5f002955 	svcpl	0x00002955
    5530:	4f4e414e 	svcmi	0x004e414e
    5534:	4c414d5f 	mcrrmi	13, 5, r4, r1, cr15
    5538:	20434f4c 	subcs	r4, r3, ip, asr #30
    553c:	43530031 	cmpmi	r3, #49	@ 0x31
    5540:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    5544:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    5548:	53444e45 	movtpl	r4, #20037	@ 0x4e45
    554c:	524c4354 	subpl	r4, ip, #84, 6	@ 0x50000001
    5550:	6b734d5f 	blvs	1cd8ad4 <_Min_Stack_Size+0x1cd86d4>
    5554:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    5558:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    555c:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    5560:	5343495f 	movtpl	r4, #14687	@ 0x395f
    5564:	45505f52 	ldrbmi	r5, [r0, #-3922]	@ 0xfffff0ae
    5568:	5453444e 	ldrbpl	r4, [r3], #-1102	@ 0xfffffbb2
    556c:	5f524c43 	svcpl	0x00524c43
    5570:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    5574:	43324900 	teqmi	r2, #0, 18
    5578:	3152435f 	cmpcc	r2, pc, asr r3
    557c:	534f4e5f 	movtpl	r4, #65119	@ 0xfe5f
    5580:	54455254 	strbpl	r5, [r5], #-596	@ 0xfffffdac
    5584:	49204843 	stmdbmi	r0!, {r0, r1, r6, fp, lr}
    5588:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    558c:	4e5f3152 	mrcmi	1, 2, r3, cr15, cr2, {2}
    5590:	5254534f 	subspl	r5, r4, #1006632961	@ 0x3c000001
    5594:	48435445 	stmdami	r3, {r0, r2, r6, sl, ip, lr}^
    5598:	6b734d5f 	blvs	1cd8b1c <_Min_Stack_Size+0x1cd871c>
    559c:	4e4f4300 	cdpmi	3, 4, cr4, cr15, cr0, {0}
    55a0:	4c4f5254 	sfmmi	f5, 2, [pc], {84}	@ 0x54
    55a4:	52506e5f 	subspl	r6, r0, #1520	@ 0x5f0
    55a8:	505f5649 	subspl	r5, pc, r9, asr #12
    55ac:	3020736f 	eorcc	r7, r0, pc, ror #6
    55b0:	4f430055 	svcmi	0x00430055
    55b4:	4f52544e 	svcmi	0x0052544e
    55b8:	506e5f4c 	rsbpl	r5, lr, ip, asr #30
    55bc:	5f564952 	svcpl	0x00564952
    55c0:	206b734d 	rsbcs	r7, fp, sp, asr #6
    55c4:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    55c8:	5f002920 	svcpl	0x00002920
    55cc:	6972705f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, ip, sp, lr}^
    55d0:	3066746e 	rsbcc	r7, r6, lr, ror #8
    55d4:	656b696c 	strbvs	r6, [fp, #-2412]!	@ 0xfffff694
    55d8:	746d6628 	strbtvc	r6, [sp], #-1576	@ 0xfffff9d8
    55dc:	2c677261 	sfmcs	f7, 2, [r7], #-388	@ 0xfffffe7c
    55e0:	73726966 	cmnvc	r2, #1671168	@ 0x198000
    55e4:	72617674 	rsbvc	r7, r1, #116, 12	@ 0x7400000
    55e8:	29677261 	stmdbcs	r7!, {r0, r5, r6, r9, ip, sp, lr}^
    55ec:	58450020 	stmdapl	r5, {r5}^
    55f0:	30314954 	eorscc	r4, r1, r4, asr r9
    55f4:	5152495f 	cmppl	r2, pc, asr r9
    55f8:	00303420 	eorseq	r3, r0, r0, lsr #8
    55fc:	6d745f4c 	ldclvs	15, cr5, [r4, #-304]!	@ 0xfffffed0
    5600:	6d616e70 	stclvs	14, cr6, [r1, #-448]!	@ 0xfffffe40
    5604:	4c494620 	mcrrmi	6, 2, r4, r9, cr0
    5608:	4d414e45 	stclmi	14, cr4, [r1, #-276]	@ 0xfffffeec
    560c:	414d5f45 	cmpmi	sp, r5, asr #30
    5610:	50540058 	subspl	r0, r4, r8, asr r0
    5614:	43415f49 	movtmi	r5, #8009	@ 0x1f49
    5618:	505f5250 	subspl	r5, pc, r0, asr r2	@ <UNPREDICTABLE>
    561c:	43534552 	cmpmi	r3, #343932928	@ 0x14800000
    5620:	52454c41 	subpl	r4, r5, #16640	@ 0x4100
    5624:	736f505f 	cmnvc	pc, #95	@ 0x5f
    5628:	00553020 	subseq	r3, r5, r0, lsr #32
    562c:	5f434352 	svcpl	0x00434352
    5630:	31495053 	qdaddcc	r5, r3, r9
    5634:	7365525f 	cmnvc	r5, #-268435451	@ 0xf0000005
    5638:	29287465 	stmdbcs	r8!, {r0, r2, r5, r6, sl, ip, sp, lr}
    563c:	43522820 	cmpmi	r2, #32, 16	@ 0x200000
    5640:	413e2d43 	teqmi	lr, r3, asr #26
    5644:	52324250 	eorspl	r4, r2, #80, 4
    5648:	20525453 	subscs	r5, r2, r3, asr r4
    564c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    5650:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    5654:	29323120 	ldmdbcs	r2!, {r5, r8, ip, sp}
    5658:	5f5f0029 	svcpl	0x005f0029
    565c:	535f4343 	cmppl	pc, #201326593	@ 0xc000001
    5660:	4f505055 	svcmi	0x00505055
    5664:	5f535452 	svcpl	0x00535452
    5668:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    566c:	454e494c 	strbmi	r4, [lr, #-2380]	@ 0xfffff6b4
    5670:	73003120 	movwvc	r3, #288	@ 0x120
    5674:	63697274 	cmnvs	r9, #116, 4	@ 0x40000007
    5678:	7320706d 			@ <UNDEFINED> instruction: 0x7320706d
    567c:	61637274 	smcvs	14116	@ 0x3724
    5680:	6d636573 	cfstr64vs	mvdx6, [r3, #-460]!	@ 0xfffffe34
    5684:	525f0070 	subspl	r0, pc, #112	@ 0x70
    5688:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    568c:	4548435f 	strbmi	r4, [r8, #-863]	@ 0xfffffca1
    5690:	76284b43 	strtvc	r4, [r8], -r3, asr #22
    5694:	772c7261 	strvc	r7, [ip, -r1, ror #4]!
    5698:	2c746168 	ldfcse	f6, [r4], #-416	@ 0xfffffe60
    569c:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    56a0:	7a69732c 	bvc	1a62358 <_Min_Stack_Size+0x1a61f58>
    56a4:	6e692c65 	cdpvs	12, 6, cr2, cr9, cr5, {3}
    56a8:	20297469 	eorcs	r7, r9, r9, ror #8
    56ac:	7b206f64 	blvc	821444 <_Min_Stack_Size+0x821044>
    56b0:	72747320 	rsbsvc	r7, r4, #32, 6	@ 0x80000000
    56b4:	20746375 	rsbscs	r6, r4, r5, ror r3
    56b8:	6565725f 	strbvs	r7, [r5, #-607]!	@ 0xfffffda1
    56bc:	2a20746e 	bcs	82287c <_Min_Stack_Size+0x82247c>
    56c0:	3d20725f 	sfmcc	f7, 4, [r0, #-380]!	@ 0xfffffe84
    56c4:	61762820 	cmnvs	r6, r0, lsr #16
    56c8:	203b2972 	eorscs	r2, fp, r2, ror r9
    56cc:	28206669 	stmdacs	r0!, {r0, r3, r5, r6, r9, sl, sp, lr}
    56d0:	3e2d725f 	mcrcc	2, 1, r7, cr13, cr15, {2}
    56d4:	74616877 	strbtvc	r6, [r1], #-2167	@ 0xfffff789
    56d8:	203d3d20 	eorscs	r3, sp, r0, lsr #26
    56dc:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    56e0:	207b2029 	rsbscs	r2, fp, r9, lsr #32
    56e4:	3e2d725f 	mcrcc	2, 1, r7, cr13, cr15, {2}
    56e8:	74616877 	strbtvc	r6, [r1], #-2167	@ 0xfffff789
    56ec:	28203d20 	stmdacs	r0!, {r5, r8, sl, fp, ip, sp}
    56f0:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    56f4:	6c616d29 	stclvs	13, cr6, [r1], #-164	@ 0xffffff5c
    56f8:	28636f6c 	stmdacs	r3!, {r2, r3, r5, r6, r8, r9, sl, fp, sp, lr}^
    56fc:	657a6973 	ldrbvs	r6, [sl, #-2419]!	@ 0xfffff68d
    5700:	5f203b29 	svcpl	0x00203b29
    5704:	6565725f 	strbvs	r7, [r5, #-607]!	@ 0xfffffda1
    5708:	615f746e 	cmpvs	pc, lr, ror #8
    570c:	72657373 	rsbvc	r7, r5, #-872415231	@ 0xcc000001
    5710:	725f2874 	subsvc	r2, pc, #116, 16	@ 0x740000
    5714:	68773e2d 	ldmdavs	r7!, {r0, r2, r3, r5, r9, sl, fp, ip, sp}^
    5718:	3b297461 	blcc	a628a4 <_Min_Stack_Size+0xa624a4>
    571c:	696e6920 	stmdbvs	lr!, {r5, r8, fp, sp, lr}^
    5720:	7d203b74 	vstmdbvc	r0!, {d3-<overflow reg d60>}
    5724:	77207d20 	strvc	r7, [r0, -r0, lsr #26]!
    5728:	656c6968 	strbvs	r6, [ip, #-2408]!	@ 0xfffff698
    572c:	29302820 	ldmdbcs	r0!, {r5, fp, sp}
    5730:	42435300 	submi	r5, r3, #0, 6
    5734:	4348535f 	movtmi	r5, #33631	@ 0x835f
    5738:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ 55f4 <_Min_Stack_Size+0x51f4>
    573c:	41464d45 	cmpmi	r6, r5, asr #26
    5740:	41544c55 	cmpmi	r4, r5, asr ip
    5744:	4d5f5443 	cfldrdmi	mvd5, [pc, #-268]	@ 5640 <_Min_Stack_Size+0x5240>
    5748:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    574c:	204c5531 	subcs	r5, ip, r1, lsr r5
    5750:	50780029 	rsbspl	r0, r8, r9, lsr #32
    5754:	4e5f5253 	mrcmi	2, 2, r5, cr15, cr3, {2}
    5758:	736f505f 	cmnvc	pc, #95	@ 0x5f
    575c:	55313320 	ldrpl	r3, [r1, #-800]!	@ 0xfffffce0
    5760:	43324900 	teqmi	r2, #0, 18
    5764:	3152535f 	cmpcc	r2, pc, asr r3
    5768:	4345505f 	movtmi	r5, #20575	@ 0x505f
    576c:	5f525245 	svcpl	0x00525245
    5770:	20736f50 	rsbscs	r6, r3, r0, asr pc
