NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    5774:	55323128 	ldrpl	r3, [r2, #-296]!	@ 0xfffffed8
    5778:	50530029 	subspl	r0, r3, r9, lsr #32
    577c:	28203149 	stmdacs	r0!, {r0, r3, r6, r8, ip, sp}
    5780:	49505328 	ldmdbmi	r0, {r3, r5, r8, r9, ip, lr}^
    5784:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    5788:	66654465 	strbtvs	r4, [r5], -r5, ror #8
    578c:	53292a20 			@ <UNDEFINED> instruction: 0x53292a20
    5790:	5f314950 	svcpl	0x00314950
    5794:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    5798:	5f5f0029 	svcpl	0x005f0029
    579c:	535f4343 	cmppl	pc, #201326593	@ 0xc000001
    57a0:	4f505055 	svcmi	0x00505055
    57a4:	5f535452 	svcpl	0x00535452
    57a8:	4e524157 	mrcmi	1, 2, r4, cr2, cr7, {2}
    57ac:	20474e49 	subcs	r4, r7, r9, asr #28
    57b0:	32490031 	subcc	r0, r9, #49	@ 0x31
    57b4:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    57b8:	4f4e5f31 	svcmi	0x004e5f31
    57bc:	45525453 	ldrbmi	r5, [r2, #-1107]	@ 0xfffffbad
    57c0:	5f484354 	svcpl	0x00484354
    57c4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    57c8:	29553728 	ldmdbcs	r5, {r3, r5, r8, r9, sl, ip, sp}^
    57cc:	4d544900 	vldrmi.16	s9, [r4, #-0]	@ <UNPREDICTABLE>
    57d0:	5341425f 	movtpl	r4, #4703	@ 0x125f
    57d4:	30282045 	eorcc	r2, r8, r5, asr #32
    57d8:	30304578 	eorscc	r4, r0, r8, ror r5
    57dc:	30303030 	eorscc	r3, r0, r0, lsr r0
    57e0:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
    57e4:	43324900 	teqmi	r2, #0, 18
    57e8:	3152535f 	cmpcc	r2, pc, asr r3
    57ec:	52564f5f 	subspl	r4, r6, #380	@ 0x17c
    57f0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    57f4:	31312820 	teqcc	r1, r0, lsr #16
    57f8:	53002955 	movwpl	r2, #2389	@ 0x955
    57fc:	415f4243 	cmpmi	pc, r3, asr #4
    5800:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    5804:	4345565f 	movtmi	r5, #22111	@ 0x565f
    5808:	59454b54 	stmdbpl	r5, {r2, r4, r6, r8, r9, fp, lr}^
    580c:	6b734d5f 	blvs	1cd8d90 <_Min_Stack_Size+0x1cd8990>
    5810:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    5814:	46464646 	strbmi	r4, [r6], -r6, asr #12
    5818:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    581c:	4353203c 	cmpmi	r3, #60	@ 0x3c
    5820:	49415f42 	stmdbmi	r1, {r1, r6, r8, r9, sl, fp, ip, lr}^
    5824:	5f524352 	svcpl	0x00524352
    5828:	54434556 	strbpl	r4, [r3], #-1366	@ 0xfffffaaa
    582c:	5f59454b 	svcpl	0x0059454b
    5830:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    5834:	46494600 	strbmi	r4, [r9], -r0, lsl #12
    5838:	554e5f4f 	strbpl	r5, [lr, #-3919]	@ 0xfffff0b1
    583c:	5f004c4c 	svcpl	0x00004c4c
    5840:	5f4d435f 	svcpl	0x004d435f
    5844:	49534d43 	ldmdbmi	r3, {r0, r1, r6, r8, sl, fp, lr}^
    5848:	45565f53 	ldrbmi	r5, [r6, #-3923]	@ 0xfffff0ad
    584c:	4f495352 	svcmi	0x00495352
    5850:	414d5f4e 	cmpmi	sp, lr, asr #30
    5854:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    5858:	29553520 	ldmdbcs	r5, {r5, r8, sl, ip, sp}^
    585c:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    5860:	4f4d5f4f 	svcmi	0x004d5f4f
    5864:	415f4544 	cmpmi	pc, r4, asr #10
    5868:	4e495f46 	cdpmi	15, 4, cr5, cr9, cr6, {2}
    586c:	20545550 	subscs	r5, r4, r0, asr r5
    5870:	30307830 	eorscc	r7, r0, r0, lsr r8
    5874:	30303030 	eorscc	r3, r0, r0, lsr r0
    5878:	00753830 	rsbseq	r3, r5, r0, lsr r8
    587c:	52535078 	subspl	r5, r3, #120	@ 0x78
    5880:	505f435f 	subspl	r4, pc, pc, asr r3	@ <UNPREDICTABLE>
    5884:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    5888:	5f005539 	svcpl	0x00005539
    588c:	5058455f 	subspl	r4, r8, pc, asr r5
    5890:	20297828 	eorcs	r7, r9, r8, lsr #16
    5894:	23205f5f 			@ <UNDEFINED> instruction: 0x23205f5f
    5898:	23207823 			@ <UNDEFINED> instruction: 0x23207823
    589c:	005f5f23 	subseq	r5, pc, r3, lsr #30
    58a0:	5f424353 	svcpl	0x00424353
    58a4:	53434853 	movtpl	r4, #14419	@ 0x3853
    58a8:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    58ac:	55414653 	strbpl	r4, [r1, #-1619]	@ 0xfffff9ad
    58b0:	4e45544c 	cdpmi	4, 4, cr5, cr5, cr12, {2}
    58b4:	6f505f41 	svcvs	0x00505f41
    58b8:	37312073 			@ <UNDEFINED> instruction: 0x37312073
    58bc:	54490055 	strbpl	r0, [r9], #-85	@ 0xffffffab
    58c0:	43545f4d 	cmpmi	r4, #308	@ 0x134
    58c4:	53545f52 	cmppl	r4, #328	@ 0x148
    58c8:	5f414e45 	svcpl	0x00414e45
    58cc:	206b734d 	rsbcs	r7, fp, sp, asr #6
    58d0:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    58d4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    58d8:	5f4d5449 	svcpl	0x004d5449
    58dc:	5f524354 	svcpl	0x00524354
    58e0:	4e455354 	mcrmi	3, 2, r5, cr5, cr4, {2}
    58e4:	6f505f41 	svcvs	0x00505f41
    58e8:	78002973 	stmdavc	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
    58ec:	5f525350 	svcpl	0x00525350
    58f0:	5f494349 	svcpl	0x00494349
    58f4:	325f5449 	subscc	r5, pc, #1224736768	@ 0x49000000
    58f8:	6b734d5f 	blvs	1cd8e7c <_Min_Stack_Size+0x1cd8a7c>
    58fc:	55332820 	ldrpl	r2, [r3, #-2080]!	@ 0xfffff7e0
    5900:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    5904:	53507820 	cmppl	r0, #32, 16	@ 0x200000
    5908:	43495f52 	movtmi	r5, #40786	@ 0x9f52
    590c:	54495f49 	strbpl	r5, [r9], #-3913	@ 0xfffff0b7
    5910:	505f325f 	subspl	r3, pc, pc, asr r2	@ <UNPREDICTABLE>
    5914:	0029736f 	eoreq	r7, r9, pc, ror #6
    5918:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    591c:	4d5f3631 	ldclmi	6, cr3, [pc, #-196]	@ 5860 <_Min_Stack_Size+0x5460>
    5920:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    5924:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    5928:	3631544e 	ldrtcc	r5, [r1], -lr, asr #8
    592c:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    5930:	00295f5f 	eoreq	r5, r9, pc, asr pc
    5934:	6f6c5f5f 	svcvs	0x006c5f5f
    5938:	645f676e 	ldrbvs	r6, [pc], #-1902	@ 5940 <_Min_Stack_Size+0x5540>
    593c:	6c62756f 	cfstr64vs	mvdx7, [r2], #-444	@ 0xfffffe44
    5940:	20745f65 	rsbscs	r5, r4, r5, ror #30
    5944:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    5948:	756f6420 	strbvc	r6, [pc, #-1056]!	@ 5530 <_Min_Stack_Size+0x5130>
    594c:	00656c62 	rsbeq	r6, r5, r2, ror #24
    5950:	5f545744 	svcpl	0x00545744
    5954:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    5958:	4d554e5f 	ldclmi	14, cr4, [r5, #-380]	@ 0xfffffe84
    595c:	504d4f43 	subpl	r4, sp, r3, asr #30
    5960:	6b734d5f 	blvs	1cd8ee4 <_Min_Stack_Size+0x1cd8ae4>
    5964:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    5968:	204c5546 	subcs	r5, ip, r6, asr #10
    596c:	44203c3c 	strtmi	r3, [r0], #-3132	@ 0xfffff3c4
    5970:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    5974:	5f4c5254 	svcpl	0x004c5254
    5978:	434d554e 	movtmi	r5, #54606	@ 0xd54e
    597c:	5f504d4f 	svcpl	0x00504d4f
    5980:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    5984:	53507800 	cmppl	r0, #0, 16
    5988:	5f515f52 	svcpl	0x00515f52
    598c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    5990:	00553732 	subseq	r3, r5, r2, lsr r7
    5994:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
    5998:	72697571 	rsbvc	r7, r9, #473956352	@ 0x1c400000
    599c:	655f7365 	ldrbvs	r7, [pc, #-869]	@ 563f <_Min_Stack_Size+0x523f>
    59a0:	756c6378 	strbvc	r6, [ip, #-888]!	@ 0xfffffc88
    59a4:	65766973 	ldrbvs	r6, [r6, #-2419]!	@ 0xfffff68d
    59a8:	2e2e2e28 	cdpcs	14, 2, cr2, cr14, cr8, {1}
    59ac:	5f5f2029 	svcpl	0x005f2029
    59b0:	6b636f6c 	blvs	18e1768 <_Min_Stack_Size+0x18e1368>
    59b4:	6e6e615f 	mcrvs	1, 3, r6, cr14, cr15, {2}
    59b8:	7461746f 	strbtvc	r7, [r1], #-1135	@ 0xfffffb91
    59bc:	78652865 	stmdavc	r5!, {r0, r2, r5, r6, fp, sp}^
    59c0:	73756c63 	cmnvc	r5, #25344	@ 0x6300
    59c4:	5f657669 	svcpl	0x00657669
    59c8:	6b636f6c 	blvs	18e1780 <_Min_Stack_Size+0x18e1380>
    59cc:	65725f73 	ldrbvs	r5, [r2, #-3955]!	@ 0xfffff08d
    59d0:	72697571 	rsbvc	r7, r9, #473956352	@ 0x1c400000
    59d4:	5f286465 	svcpl	0x00286465
    59d8:	5f41565f 	svcpl	0x0041565f
    59dc:	53475241 	movtpl	r5, #29249	@ 0x7241
    59e0:	29295f5f 	stmdbcs	r9!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    59e4:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    59e8:	20727265 	rsbscs	r7, r2, r5, ror #4
    59ec:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    59f0:	535f544e 	cmppl	pc, #1308622848	@ 0x4e000000
    59f4:	52454454 	subpl	r4, r5, #84, 8	@ 0x54000000
    59f8:	525f2852 	subspl	r2, pc, #5373952	@ 0x520000
    59fc:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    5a00:	5f5f0029 	svcpl	0x005f0029
    5a04:	55514544 	ldrbpl	r4, [r1, #-1348]	@ 0xfffffabc
    5a08:	46494c41 	strbmi	r4, [r9], -r1, asr #24
    5a0c:	79742859 	ldmdbvc	r4!, {r0, r3, r4, r6, fp, sp}^
    5a10:	762c6570 			@ <UNDEFINED> instruction: 0x762c6570
    5a14:	20297261 	eorcs	r7, r9, r1, ror #4
    5a18:	79742828 	ldmdbvc	r4!, {r3, r5, fp, sp}^
    5a1c:	28296570 	stmdacs	r9!, {r4, r5, r6, r8, sl, sp, lr}
    5a20:	69755f5f 	ldmdbvs	r5!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    5a24:	7470746e 	ldrbtvc	r7, [r0], #-1134	@ 0xfffffb92
    5a28:	29745f72 	ldmdbcs	r4!, {r1, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
    5a2c:	6e6f6328 	cdpvs	3, 6, cr6, cr15, cr8, {1}
    5a30:	76207473 			@ <UNDEFINED> instruction: 0x76207473
    5a34:	74616c6f 	strbtvc	r6, [r1], #-3183	@ 0xfffff391
    5a38:	20656c69 	rsbcs	r6, r5, r9, ror #24
    5a3c:	64696f76 	strbtvs	r6, [r9], #-3958	@ 0xfffff08a
    5a40:	28292a20 	stmdacs	r9!, {r5, r9, fp, sp}
    5a44:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    5a48:	5f5f0029 	svcpl	0x005f0029
    5a4c:	5f736168 	svcpl	0x00736168
    5a50:	74616566 	strbtvc	r6, [r1], #-1382	@ 0xfffffa9a
    5a54:	28657275 	stmdacs	r5!, {r0, r2, r4, r5, r6, r9, ip, sp, lr}^
    5a58:	30202978 	eorcc	r2, r0, r8, ror r9
    5a5c:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    5a60:	5f544e45 	svcpl	0x00544e45
    5a64:	52454d45 	subpl	r4, r5, #4416	@ 0x1140
    5a68:	434e4547 	movtmi	r4, #58695	@ 0xe547
    5a6c:	49535f59 	ldmdbmi	r3, {r0, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    5a70:	3220455a 	eorcc	r4, r0, #377487360	@ 0x16800000
    5a74:	4e490035 	mcrmi	0, 2, r0, cr9, cr5, {1}
    5a78:	5f343654 	svcpl	0x00343654
    5a7c:	2058414d 	subscs	r4, r8, sp, asr #2
    5a80:	495f5f28 	ldmdbmi	pc, {r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    5a84:	3436544e 	ldrtcc	r5, [r6], #-1102	@ 0xfffffbb2
    5a88:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    5a8c:	00295f5f 	eoreq	r5, r9, pc, asr pc
    5a90:	5f424353 	svcpl	0x00424353
    5a94:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    5a98:	4345565f 	movtmi	r5, #22111	@ 0x565f
    5a9c:	54434154 	strbpl	r4, [r3], #-340	@ 0xfffffeac
    5aa0:	5f455649 	svcpl	0x00455649
    5aa4:	206b734d 	rsbcs	r7, fp, sp, asr #6
    5aa8:	31783028 	cmncc	r8, r8, lsr #32
    5aac:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    5ab0:	5f002920 	svcpl	0x00002920
    5ab4:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    5ab8:	53415f54 	movtpl	r5, #8020	@ 0x1f54
    5abc:	4d495443 	cfstrdmi	mvd5, [r9, #-268]	@ 0xfffffef4
    5ac0:	55425f45 	strbpl	r5, [r2, #-3909]	@ 0xfffff0bb
    5ac4:	74702846 	ldrbtvc	r2, [r0], #-2118	@ 0xfffff7ba
    5ac8:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    5acc:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    5ad0:	5f3e2d29 	svcpl	0x003e2d29
    5ad4:	74637361 	strbtvc	r7, [r3], #-865	@ 0xfffffc9f
    5ad8:	5f656d69 	svcpl	0x00656d69
    5adc:	29667562 	stmdbcs	r6!, {r1, r5, r6, r8, sl, ip, sp, lr}^
    5ae0:	53507800 	cmppl	r0, #0, 16
    5ae4:	5f5a5f52 	svcpl	0x005a5f52
    5ae8:	20736f50 	rsbscs	r6, r3, r0, asr pc
    5aec:	00553033 	subseq	r3, r5, r3, lsr r0
    5af0:	5f4d5241 	svcpl	0x004d5241
    5af4:	5f55504d 	svcpl	0x0055504d
    5af8:	45434341 	strbmi	r4, [r3, #-833]	@ 0xfffffcbf
    5afc:	285f5353 	ldmdacs	pc, {r0, r1, r4, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
    5b00:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
    5b04:	46747845 	ldrbtmi	r7, [r4], -r5, asr #16
    5b08:	646c6569 	strbtvs	r6, [ip], #-1385	@ 0xfffffa97
    5b0c:	5373492c 	cmnpl	r3, #44, 18	@ 0xb0000
    5b10:	65726168 	ldrbvs	r6, [r2, #-360]!	@ 0xfffffe98
    5b14:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    5b18:	4373492c 	cmnmi	r3, #44, 18	@ 0xb0000
    5b1c:	65686361 	strbvs	r6, [r8, #-865]!	@ 0xfffffc9f
    5b20:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    5b24:	4273492c 	rsbsmi	r4, r3, #44, 18	@ 0xb0000
    5b28:	65666675 	strbvs	r6, [r6, #-1653]!	@ 0xfffff98b
    5b2c:	6c626172 	stfvse	f6, [r2], #-456	@ 0xfffffe38
    5b30:	28202965 	stmdacs	r0!, {r0, r2, r5, r6, r8, fp, sp}
    5b34:	54282828 	strtpl	r2, [r8], #-2088	@ 0xfffff7d8
    5b38:	45657079 	strbmi	r7, [r5, #-121]!	@ 0xffffff87
    5b3c:	69467478 	stmdbvs	r6, {r3, r4, r5, r6, sl, ip, sp, lr}^
    5b40:	29646c65 	stmdbcs	r4!, {r0, r2, r5, r6, sl, fp, sp, lr}^
    5b44:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    5b48:	5f55504d 	svcpl	0x0055504d
    5b4c:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    5b50:	5845545f 	stmdapl	r5, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
    5b54:	736f505f 	cmnvc	pc, #95	@ 0x5f
    5b58:	20262029 	eorcs	r2, r6, r9, lsr #32
    5b5c:	5f55504d 	svcpl	0x0055504d
    5b60:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    5b64:	5845545f 	stmdapl	r5, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
    5b68:	6b734d5f 	blvs	1cd90ec <_Min_Stack_Size+0x1cd8cec>
    5b6c:	207c2029 	rsbscs	r2, ip, r9, lsr #32
    5b70:	49282828 	stmdbmi	r8!, {r3, r5, fp, sp}
    5b74:	61685373 	smcvs	34099	@ 0x8533
    5b78:	62616572 	rsbvs	r6, r1, #478150656	@ 0x1c800000
    5b7c:	2029656c 	eorcs	r6, r9, ip, ror #10
    5b80:	4d203c3c 	stcmi	12, cr3, [r0, #-240]!	@ 0xffffff10
    5b84:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    5b88:	5f525341 	svcpl	0x00525341
    5b8c:	6f505f53 	svcvs	0x00505f53
    5b90:	26202973 			@ <UNDEFINED> instruction: 0x26202973
    5b94:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    5b98:	5341525f 	movtpl	r5, #4703	@ 0x125f
    5b9c:	5f535f52 	svcpl	0x00535f52
    5ba0:	296b734d 	stmdbcs	fp!, {r0, r2, r3, r6, r8, r9, ip, sp, lr}^
    5ba4:	28207c20 	stmdacs	r0!, {r5, sl, fp, ip, sp, lr}
    5ba8:	73492828 	movtvc	r2, #38952	@ 0x9828
    5bac:	68636143 	stmdavs	r3!, {r0, r1, r6, r8, sp, lr}^
    5bb0:	6c626165 	stfvse	f6, [r2], #-404	@ 0xfffffe6c
    5bb4:	3c202965 			@ <UNDEFINED> instruction: 0x3c202965
    5bb8:	504d203c 	subpl	r2, sp, ip, lsr r0
    5bbc:	41525f55 	cmpmi	r2, r5, asr pc
    5bc0:	435f5253 	cmpmi	pc, #805306373	@ 0x30000005
    5bc4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    5bc8:	20262029 	eorcs	r2, r6, r9, lsr #32
    5bcc:	5f55504d 	svcpl	0x0055504d
    5bd0:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    5bd4:	4d5f435f 	ldclmi	3, cr4, [pc, #-380]	@ 5a60 <_Min_Stack_Size+0x5660>
    5bd8:	20296b73 	eorcs	r6, r9, r3, ror fp
    5bdc:	2828207c 	stmdacs	r8!, {r2, r3, r4, r5, r6, sp}
    5be0:	42734928 	rsbsmi	r4, r3, #40, 18	@ 0xa0000
    5be4:	65666675 	strbvs	r6, [r6, #-1653]!	@ 0xfffff98b
    5be8:	6c626172 	stfvse	f6, [r2], #-456	@ 0xfffffe38
    5bec:	3c202965 			@ <UNDEFINED> instruction: 0x3c202965
    5bf0:	504d203c 	subpl	r2, sp, ip, lsr r0
    5bf4:	41525f55 	cmpmi	r2, r5, asr pc
    5bf8:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    5bfc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    5c00:	20262029 	eorcs	r2, r6, r9, lsr #32
    5c04:	5f55504d 	svcpl	0x0055504d
    5c08:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    5c0c:	4d5f425f 	lfmmi	f4, 2, [pc, #-380]	@ 5a98 <_Min_Stack_Size+0x5698>
    5c10:	29296b73 	stmdbcs	r9!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    5c14:	545f7000 	ldrbpl	r7, [pc], #-0	@ 5c1c <_Min_Stack_Size+0x581c>
    5c18:	5f6b7361 	svcpl	0x006b7361
    5c1c:	72746e45 	rsbsvc	r6, r4, #1104	@ 0x450
    5c20:	5f5f0079 	svcpl	0x005f0079
    5c24:	38544e49 	ldmdacc	r4, {r0, r3, r6, r9, sl, fp, lr}^
    5c28:	68682220 	stmdavs	r8!, {r5, r9, sp}^
    5c2c:	43530022 	cmpmi	r3, #34	@ 0x22
    5c30:	43435f42 	movtmi	r5, #16194	@ 0x3f42
    5c34:	46425f52 			@ <UNDEFINED> instruction: 0x46425f52
    5c38:	4d4e4648 	stclmi	6, cr4, [lr, #-288]	@ 0xfffffee0
    5c3c:	5f4e4749 	svcpl	0x004e4749
    5c40:	20736f50 	rsbscs	r6, r3, r0, asr pc
    5c44:	5f005538 	svcpl	0x00005538
    5c48:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    5c4c:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    5c50:	6d5f6574 	cfldr64vs	mvdx6, [pc, #-464]	@ 5a88 <_Min_Stack_Size+0x5688>
    5c54:	6f6c6c61 	svcvs	0x006c6c61
    5c58:	205f5f63 	subscs	r5, pc, r3, ror #30
    5c5c:	49535f00 	ldmdbmi	r3, {r8, r9, sl, fp, ip, lr}^
    5c60:	545f455a 	ldrbpl	r4, [pc], #-1370	@ 5c68 <_Min_Stack_Size+0x5868>
    5c64:	4345445f 	movtmi	r4, #21599	@ 0x545f
    5c68:	4552414c 	ldrbmi	r4, [r2, #-332]	@ 0xfffffeb4
    5c6c:	5f002044 	svcpl	0x00002044
    5c70:	6e695f5f 	mcrvs	15, 3, r5, cr9, cr15, {2}
    5c74:	5f363174 	svcpl	0x00363174
    5c78:	65645f74 	strbvs	r5, [r4, #-3956]!	@ 0xfffff08c
    5c7c:	656e6966 	strbvs	r6, [lr, #-2406]!	@ 0xfffff69a
    5c80:	00312064 	eorseq	r2, r1, r4, rrx
    5c84:	5f433249 	svcpl	0x00433249
    5c88:	5f325253 	svcpl	0x00325253
    5c8c:	4c415544 	cfstr64mi	mvdx5, [r1], {68}	@ 0x44
    5c90:	32492046 	subcc	r2, r9, #70	@ 0x46
    5c94:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    5c98:	55445f32 	strbpl	r5, [r4, #-3890]	@ 0xfffff0ce
    5c9c:	5f464c41 	svcpl	0x00464c41
    5ca0:	006b734d 	rsbeq	r7, fp, sp, asr #6
    5ca4:	5f424353 	svcpl	0x00424353
    5ca8:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    5cac:	43532820 	cmpmi	r3, #32, 16	@ 0x200000
    5cb0:	41425f53 	cmpmi	r2, r3, asr pc
    5cb4:	2b204553 	blcs	817208 <_Min_Stack_Size+0x816e08>
    5cb8:	30783020 	rsbscc	r3, r8, r0, lsr #32
    5cbc:	55303044 	ldrpl	r3, [r0, #-68]!	@ 0xffffffbc
    5cc0:	4e00294c 	vmlsmi.f16	s4, s0, s24	@ <UNPREDICTABLE>
    5cc4:	5f434956 	svcpl	0x00434956
    5cc8:	33515249 	cmpcc	r1, #-1879048188	@ 0x90000004
    5ccc:	53555f38 	cmppl	r5, #56, 30	@ 0xe0
    5cd0:	32545241 	subscc	r5, r4, #268435460	@ 0x10000004
    5cd4:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
    5cd8:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    5cdc:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    5ce0:	4349564e 	movtmi	r5, #38478	@ 0x964e
    5ce4:	4543495f 	strbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    5ce8:	7c203152 	stfvcs	f3, [r0], #-328	@ 0xfffffeb8
    5cec:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    5cf0:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    5cf4:	00292936 	eoreq	r2, r9, r6, lsr r9
    5cf8:	5f4d5449 	svcpl	0x004d5449
    5cfc:	5f524354 	svcpl	0x00524354
    5d00:	43415254 	movtmi	r5, #4692	@ 0x1254
    5d04:	53554245 	cmppl	r5, #1342177284	@ 0x50000004
    5d08:	505f4449 	subspl	r4, pc, r9, asr #8
    5d0c:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    5d10:	5f005536 	svcpl	0x00005536
    5d14:	49474542 	stmdbmi	r7, {r1, r6, r8, sl, lr}^
    5d18:	54535f4e 	ldrbpl	r5, [r3], #-3918	@ 0xfffff0b2
    5d1c:	20435f44 	subcs	r5, r3, r4, asr #30
    5d20:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    5d24:	454c535f 	strbmi	r5, [ip, #-863]	@ 0xfffffca1
    5d28:	4e435045 	cdpmi	0, 4, cr5, cr3, cr5, {2}
    5d2c:	4c535f54 	mrrcmi	15, 5, r5, r3, cr4
    5d30:	43504545 	cmpmi	r0, #289406976	@ 0x11400000
    5d34:	505f544e 	subspl	r5, pc, lr, asr #8
    5d38:	3020736f 	eorcc	r7, r0, pc, ror #6
    5d3c:	5f500055 	svcpl	0x00500055
    5d40:	64706d74 	ldrbtvs	r6, [r0], #-3444	@ 0xfffff28c
    5d44:	22207269 	eorcs	r7, r0, #-1879048186	@ 0x90000006
    5d48:	706d742f 	rsbvc	r7, sp, pc, lsr #8
    5d4c:	5f5f0022 	svcpl	0x005f0022
    5d50:	495f4f4e 	ldmdbmi	pc, {r1, r2, r3, r6, r8, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    5d54:	2054494e 	subscs	r4, r4, lr, asr #18
    5d58:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    5d5c:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    5d60:	5f657475 	svcpl	0x00657475
    5d64:	2828205f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, sp}
    5d68:	74636573 	strbtvc	r6, [r3], #-1395	@ 0xfffffa8d
    5d6c:	206e6f69 	rsbcs	r6, lr, r9, ror #30
    5d70:	622e2228 	eorvs	r2, lr, #40, 4	@ 0x80000002
    5d74:	6e2e7373 	mcrvs	3, 1, r7, cr14, cr3, {3}
    5d78:	696e696f 	stmdbvs	lr!, {r0, r1, r2, r3, r5, r6, r8, fp, sp, lr}^
    5d7c:	29292274 	stmdbcs	r9!, {r2, r4, r5, r6, r9, sp}
    5d80:	32490029 	subcc	r0, r9, #41	@ 0x29
    5d84:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    5d88:	55425f32 	strbpl	r5, [r2, #-3890]	@ 0xfffff0ce
    5d8c:	49205953 	stmdbmi	r0!, {r0, r1, r4, r6, r8, fp, ip, lr}
    5d90:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    5d94:	425f3252 	subsmi	r3, pc, #536870917	@ 0x20000005
    5d98:	5f595355 	svcpl	0x00595355
    5d9c:	006b734d 	rsbeq	r7, fp, sp, asr #6
    5da0:	45445f5f 	strbmi	r5, [r4, #-3935]	@ 0xfffff0a1
    5da4:	534e4f43 	movtpl	r4, #61251	@ 0xef43
    5da8:	79742854 	ldmdbvc	r4!, {r2, r4, r6, fp, sp}^
    5dac:	762c6570 			@ <UNDEFINED> instruction: 0x762c6570
    5db0:	20297261 	eorcs	r7, r9, r1, ror #4
    5db4:	79742828 	ldmdbvc	r4!, {r3, r5, fp, sp}^
    5db8:	28296570 	stmdacs	r9!, {r4, r5, r6, r8, sl, sp, lr}
    5dbc:	69755f5f 	ldmdbvs	r5!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    5dc0:	7470746e 	ldrbtvc	r7, [r0], #-1134	@ 0xfffffb92
    5dc4:	29745f72 	ldmdbcs	r4!, {r1, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
    5dc8:	6e6f6328 	cdpvs	3, 6, cr6, cr15, cr8, {1}
    5dcc:	76207473 			@ <UNDEFINED> instruction: 0x76207473
    5dd0:	2064696f 	rsbcs	r6, r4, pc, ror #18
    5dd4:	7628292a 	strtvc	r2, [r8], -sl, lsr #18
    5dd8:	29297261 	stmdbcs	r9!, {r0, r5, r6, r9, ip, sp, lr}
    5ddc:	73615400 	cmnvc	r1, #0, 8
    5de0:	614e5f6b 	cmpvs	lr, fp, ror #30
    5de4:	4e00656d 	cfsh32mi	mvfx6, mvfx0, #61
    5de8:	5f434956 	svcpl	0x00434956
    5dec:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
    5df0:	5249656c 	subpl	r6, r9, #108, 10	@ 0x1b000000
    5df4:	5f5f2051 	svcpl	0x005f2051
    5df8:	4349564e 	movtmi	r5, #38478	@ 0x964e
    5dfc:	616e455f 	cmnvs	lr, pc, asr r5
    5e00:	49656c62 	stmdbmi	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    5e04:	5f005152 	svcpl	0x00005152
    5e08:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    5e0c:	6e615f6b 	cdpvs	15, 6, cr5, cr1, cr11, {3}
    5e10:	61746f6e 	cmnvs	r4, lr, ror #30
    5e14:	78286574 	stmdavc	r8!, {r2, r4, r5, r6, r8, sl, sp, lr}
    5e18:	49002029 	stmdbmi	r0, {r0, r3, r5, sp}
    5e1c:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    5e20:	415f5253 	cmpmi	pc, r3, asr r2	@ <UNPREDICTABLE>
    5e24:	73656363 	cmnvc	r5, #-1946157055	@ 0x8c000001
    5e28:	6f505f73 	svcvs	0x00505f73
    5e2c:	49282073 	stmdbmi	r8!, {r0, r1, r4, r5, r6, sp}
    5e30:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    5e34:	415f5253 	cmpmi	pc, r3, asr r2	@ <UNPREDICTABLE>
    5e38:	53454343 	movtpl	r4, #21315	@ 0x5343
    5e3c:	6f505f53 	svcvs	0x00505f53
    5e40:	49002973 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
    5e44:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    5e48:	31545341 	cmpcc	r4, r1, asr #6
    5e4c:	414d5f36 	cmpmi	sp, r6, lsr pc
    5e50:	5f282058 	svcpl	0x00282058
    5e54:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    5e58:	5341465f 	movtpl	r4, #5727	@ 0x165f
    5e5c:	5f363154 	svcpl	0x00363154
    5e60:	5f58414d 	svcpl	0x0058414d
    5e64:	7300295f 	movwvc	r2, #2399	@ 0x95f
    5e68:	6d637274 	sfmvs	f7, 2, [r3, #-464]!	@ 0xfffffe30
    5e6c:	73206970 			@ <UNDEFINED> instruction: 0x73206970
    5e70:	61637274 	smcvs	14116	@ 0x3724
    5e74:	6d636573 	cfstr64vs	mvdx6, [r3, #-460]!	@ 0xfffffe34
    5e78:	5f4c0070 	svcpl	0x004c0070
    5e7c:	72657463 	rsbvc	r7, r5, #1660944384	@ 0x63000000
    5e80:	2064696d 	rsbcs	r6, r4, sp, ror #18
    5e84:	5f003631 	svcpl	0x00003631
    5e88:	32444c46 	subcc	r4, r4, #17920	@ 0x4600
    5e8c:	284c4156 	stmdacs	ip, {r1, r2, r4, r6, r8, lr}^
    5e90:	6c656966 			@ <UNDEFINED> instruction: 0x6c656966
    5e94:	61762c64 	cmnvs	r6, r4, ror #24
    5e98:	2965756c 	stmdbcs	r5!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    5e9c:	28282820 	stmdacs	r8!, {r5, fp, sp}
    5ea0:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    5ea4:	745f3233 	ldrbvc	r3, [pc], #-563	@ 5eac <_Min_Stack_Size+0x5aac>
    5ea8:	61762829 	cmnvs	r6, r9, lsr #16
    5eac:	2965756c 	stmdbcs	r5!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    5eb0:	66202620 	strtvs	r2, [r0], -r0, lsr #12
    5eb4:	646c6569 	strbtvs	r6, [ip], #-1385	@ 0xfffffa97
