NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    5eb8:	20232320 	eorcs	r2, r3, r0, lsr #6
    5ebc:	6b734d5f 	blvs	1cd9440 <_Min_Stack_Size+0x1cd9040>
    5ec0:	3e3e2029 	cdpcc	0, 3, cr2, cr14, cr9, {1}
    5ec4:	65696620 	strbvs	r6, [r9, #-1568]!	@ 0xfffff9e0
    5ec8:	2320646c 			@ <UNDEFINED> instruction: 0x2320646c
    5ecc:	505f2023 	subspl	r2, pc, r3, lsr #32
    5ed0:	0029736f 	eoreq	r7, r9, pc, ror #6
    5ed4:	6f6c5f5f 	svcvs	0x006c5f5f
    5ed8:	615f6b63 	cmpvs	pc, r3, ror #22
    5edc:	69757163 	ldmdbvs	r5!, {r0, r1, r5, r6, r8, ip, sp, lr}^
    5ee0:	6c286572 	cfstr32vs	mvfx6, [r8], #-456	@ 0xfffffe38
    5ee4:	296b636f 	stmdbcs	fp!, {r0, r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    5ee8:	725f5f20 	subsvc	r5, pc, #32, 30	@ 0x80
    5eec:	72617465 	rsbvc	r7, r1, #1694498816	@ 0x65000000
    5ef0:	5f746567 	svcpl	0x00746567
    5ef4:	6b636f6c 	blvs	18e1cac <_Min_Stack_Size+0x18e18ac>
    5ef8:	7163615f 	cmnvc	r3, pc, asr r1
    5efc:	65726975 	ldrbvs	r6, [r2, #-2421]!	@ 0xfffff68b
    5f00:	636f6c28 	cmnvs	pc, #40, 24	@ 0x2800
    5f04:	4900296b 	stmdbmi	r0, {r0, r1, r3, r5, r6, r8, fp, sp}
    5f08:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    5f0c:	455f3152 	ldrbmi	r3, [pc, #-338]	@ 5dc2 <_Min_Stack_Size+0x59c2>
    5f10:	5f43474e 	svcpl	0x0043474e
    5f14:	206b734d 	rsbcs	r7, fp, sp, asr #6
    5f18:	31783028 	cmncc	r8, r8, lsr #32
    5f1c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    5f20:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    5f24:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    5f28:	4e455f31 	mcrmi	15, 2, r5, cr5, cr1, {1}
    5f2c:	505f4347 	subspl	r4, pc, r7, asr #6
    5f30:	0029736f 	eoreq	r7, r9, pc, ror #6
    5f34:	5f433249 	svcpl	0x00433249
    5f38:	5f315243 	svcpl	0x00315243
    5f3c:	52454c41 	subpl	r4, r5, #16640	@ 0x4100
    5f40:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
    5f44:	3028206b 	eorcc	r2, r8, fp, rrx
    5f48:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    5f4c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    5f50:	5f433249 	svcpl	0x00433249
    5f54:	5f315243 	svcpl	0x00315243
    5f58:	52454c41 	subpl	r4, r5, #16640	@ 0x4100
    5f5c:	6f505f54 	svcvs	0x00505f54
    5f60:	5f002973 	svcpl	0x00002973
    5f64:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    5f68:	364c5f54 			@ <UNDEFINED> instruction: 0x364c5f54
    5f6c:	425f4134 	subsmi	r4, pc, #52, 2
    5f70:	70284655 	eorvc	r4, r8, r5, asr r6
    5f74:	20297274 	eorcs	r7, r9, r4, ror r2
    5f78:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    5f7c:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    5f80:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    5f84:	5f3e2d63 	svcpl	0x003e2d63
    5f88:	6134366c 	teqvs	r4, ip, ror #12
    5f8c:	6675625f 			@ <UNDEFINED> instruction: 0x6675625f
    5f90:	5f5f0029 	svcpl	0x005f0029
    5f94:	28564553 	ldmdacs	r6, {r0, r1, r4, r6, r8, sl, lr}^
    5f98:	5f5f2029 	svcpl	0x005f2029
    5f9c:	204d5341 	subcs	r5, sp, r1, asr #6
    5fa0:	616c6f76 	smcvs	50934	@ 0xc6f6
    5fa4:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    5fa8:	73222820 			@ <UNDEFINED> instruction: 0x73222820
    5fac:	29227665 	stmdbcs	r2!, {r0, r2, r5, r6, r9, sl, ip, sp, lr}
    5fb0:	726f4300 	rsbvc	r4, pc, #0, 6
    5fb4:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    5fb8:	445f6775 	ldrbmi	r6, [pc], #-1909	@ 5fc0 <_Min_Stack_Size+0x5bc0>
    5fbc:	52535243 	subspl	r5, r3, #805306372	@ 0x30000004
    5fc0:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    5fc4:	5f4c4553 	svcpl	0x004c4553
    5fc8:	206b734d 	rsbcs	r7, fp, sp, asr #6
    5fcc:	31783028 	cmncc	r8, r8, lsr #32
    5fd0:	204c5546 	subcs	r5, ip, r6, asr #10
    5fd4:	50780029 	rsbspl	r0, r8, r9, lsr #32
    5fd8:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    5fdc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    5fe0:	55383220 	ldrpl	r3, [r8, #-544]!	@ 0xfffffde0
    5fe4:	6c6c6100 	stfvse	f6, [ip], #-0
    5fe8:	0061636f 	rsbeq	r6, r1, pc, ror #6
    5fec:	5f495054 	svcpl	0x00495054
    5ff0:	49564544 	ldmdbmi	r6, {r2, r6, r8, sl, lr}^
    5ff4:	694d5f44 	stmdbvs	sp, {r2, r6, r8, r9, sl, fp, ip, lr}^
    5ff8:	6675426e 	ldrbtvs	r4, [r5], -lr, ror #4
    5ffc:	505f7a53 	subspl	r7, pc, r3, asr sl	@ <UNPREDICTABLE>
    6000:	3620736f 	strtcc	r7, [r0], -pc, ror #6
    6004:	5f5f0055 	svcpl	0x005f0055
    6008:	32746e69 	rsbscc	r6, r4, #1680	@ 0x690
    600c:	322b2030 	eorcc	r2, fp, #48	@ 0x30
    6010:	43475f00 	movtmi	r5, #32512	@ 0x7f00
    6014:	54505f43 	ldrbpl	r5, [r0], #-3907	@ 0xfffff0bd
    6018:	46494452 			@ <UNDEFINED> instruction: 0x46494452
    601c:	20545f46 	subscs	r5, r4, r6, asr #30
    6020:	73795300 	cmnvc	r9, #0, 6
    6024:	6b636954 	blvs	18e057c <_Min_Stack_Size+0x18e017c>
    6028:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    602c:	4c435f4c 	mcrrmi	15, 4, r5, r3, cr12
    6030:	554f534b 	strbpl	r5, [pc, #-843]	@ 5ced <_Min_Stack_Size+0x58ed>
    6034:	5f454352 	svcpl	0x00454352
    6038:	20736f50 	rsbscs	r6, r3, r0, asr pc
    603c:	49005532 	stmdbmi	r0, {r1, r4, r5, r8, sl, ip, lr}
    6040:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    6044:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    6048:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ 5f78 <_Min_Stack_Size+0x5b78>
    604c:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    6050:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    6054:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    6058:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    605c:	414d5f34 	cmpmi	sp, r4, lsr pc
    6060:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    6064:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    6068:	50535f4f 	subspl	r5, r3, pc, asr #30
    606c:	5f444545 	svcpl	0x00444545
    6070:	204d3035 	subcs	r3, sp, r5, lsr r0
    6074:	30307830 	eorscc	r7, r0, r0, lsr r8
    6078:	30303030 	eorscc	r3, r0, r0, lsr r0
    607c:	00753330 	rsbseq	r3, r5, r0, lsr r3
    6080:	4349564e 	movtmi	r5, #38478	@ 0x964e
    6084:	5152495f 	cmppl	r2, pc, asr r9
    6088:	58455f38 	stmdapl	r5, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    608c:	5f324954 	svcpl	0x00324954
    6090:	61736944 	cmnvs	r3, r4, asr #18
    6094:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    6098:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    609c:	5f434956 	svcpl	0x00434956
    60a0:	52454349 	subpl	r4, r5, #603979777	@ 0x24000001
    60a4:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	@ 0xffffff40
    60a8:	20312820 	eorscs	r2, r1, r0, lsr #16
    60ac:	38203c3c 	stmdacc	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    60b0:	5f002929 	svcpl	0x00002929
    60b4:	45564148 	ldrbmi	r4, [r6, #-328]	@ 0xfffffeb8
    60b8:	494e495f 	stmdbmi	lr, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    60bc:	4e494654 	mcrmi	6, 2, r4, cr9, cr4, {2}
    60c0:	52415f49 	subpl	r5, r1, #292	@ 0x124
    60c4:	20594152 	subscs	r4, r9, r2, asr r1
    60c8:	57440031 	smlaldxpl	r0, r4, r1, r0
    60cc:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    60d0:	4e5f4c52 	mrcmi	12, 2, r4, cr15, cr2, {2}
    60d4:	5458454f 	ldrbpl	r4, [r8], #-1359	@ 0xfffffab1
    60d8:	47495254 	smlsldmi	r5, r9, r4, r2
    60dc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    60e0:	55363220 	ldrpl	r3, [r6, #-544]!	@ 0xfffffde0
    60e4:	53465f00 	movtpl	r5, #28416	@ 0x6f00
    60e8:	4f494454 	svcmi	0x00494454
    60ec:	61660020 	cmnvs	r6, r0, lsr #32
    60f0:	2065736c 	rsbcs	r7, r5, ip, ror #6
    60f4:	525f0030 	subspl	r0, pc, #48	@ 0x30
    60f8:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    60fc:	5f504d5f 	svcpl	0x00504d5f
    6100:	28533550 	ldmdacs	r3, {r4, r6, r8, sl, ip, sp}^
    6104:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    6108:	70282820 	eorvc	r2, r8, r0, lsr #16
    610c:	2d297274 	sfmcs	f7, 4, [r9, #-464]!	@ 0xfffffe30
    6110:	706d5f3e 	rsbvc	r5, sp, lr, lsr pc
    6114:	705f3e2d 	subsvc	r3, pc, sp, lsr #28
    6118:	00297335 	eoreq	r7, r9, r5, lsr r3
    611c:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    6120:	494c4355 	stmdbmi	ip, {r0, r2, r4, r6, r8, r9, lr}^
    6124:	415f454b 	cmpmi	pc, fp, asr #10
    6128:	33204d53 			@ <UNDEFINED> instruction: 0x33204d53
    612c:	535f5f00 	cmppl	pc, #0, 30
    6130:	30204452 	eorcc	r4, r0, r2, asr r4
    6134:	30303078 	eorscc	r3, r0, r8, ror r0
    6138:	525f0034 	subspl	r0, pc, #52	@ 0x34
    613c:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    6140:	5243575f 	subpl	r5, r3, #24903680	@ 0x17c0000
    6144:	424d4f54 	submi	r4, sp, #84, 30	@ 0x150
    6148:	4154535f 	cmpmi	r4, pc, asr r3
    614c:	70284554 	eorvc	r4, r8, r4, asr r5
    6150:	20297274 	eorcs	r7, r9, r4, ror r2
    6154:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    6158:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    615c:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    6160:	5f3e2d63 	svcpl	0x003e2d63
    6164:	74726377 	ldrbtvc	r6, [r2], #-887	@ 0xfffffc89
    6168:	5f626d6f 	svcpl	0x00626d6f
    616c:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    6170:	49002965 	stmdbmi	r0, {r0, r2, r5, r6, r8, fp, sp}
    6174:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    6178:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    617c:	54535257 	ldrbpl	r5, [r3], #-599	@ 0xfffffda9
    6180:	6b734d5f 	blvs	1cd9704 <_Min_Stack_Size+0x1cd9304>
    6184:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    6188:	204c5531 	subcs	r5, ip, r1, lsr r5
    618c:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    6190:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    6194:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    6198:	54535257 	ldrbpl	r5, [r3], #-599	@ 0xfffffda9
    619c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    61a0:	5f5f0029 	svcpl	0x005f0029
    61a4:	44534246 	ldrbmi	r4, [r3], #-582	@ 0xfffffdba
    61a8:	73284449 			@ <UNDEFINED> instruction: 0x73284449
    61ac:	74732029 	ldrbtvc	r2, [r3], #-41	@ 0xffffffd7
    61b0:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    61b4:	685f5f20 	ldmdavs	pc, {r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    61b8:	006b6361 	rsbeq	r6, fp, r1, ror #6
    61bc:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    61c0:	545f3854 	ldrbpl	r3, [pc], #-2132	@ 61c8 <_Min_Stack_Size+0x5dc8>
    61c4:	4345445f 	movtmi	r4, #21599	@ 0x545f
    61c8:	4552414c 	ldrbmi	r4, [r2, #-332]	@ 0xfffffeb4
    61cc:	53002044 	movwpl	r2, #68	@ 0x44
    61d0:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    61d4:	44495550 	strbmi	r5, [r9], #-1360	@ 0xfffffab0
    61d8:	504d495f 	subpl	r4, sp, pc, asr r9
    61dc:	454d454c 	strbmi	r4, [sp, #-1356]	@ 0xfffffab4
    61e0:	5245544e 	subpl	r5, r5, #1308622848	@ 0x4e000000
    61e4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    61e8:	55343220 	ldrpl	r3, [r4, #-544]!	@ 0xfffffde0
    61ec:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    61f0:	575f544e 	ldrbpl	r5, [pc, -lr, asr #8]
    61f4:	52414843 	subpl	r4, r1, #4390912	@ 0x430000
    61f8:	485f545f 	ldmdami	pc, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    61fc:	5f5f0020 	svcpl	0x005f0020
    6200:	656e6567 	strbvs	r6, [lr, #-1383]!	@ 0xfffffa99
    6204:	28636972 	stmdacs	r3!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    6208:	72707865 	rsbsvc	r7, r0, #6619136	@ 0x650000
    620c:	792c742c 	stmdbvc	ip!, {r2, r3, r5, sl, ip, sp, lr}
    6210:	6e2c7365 	cdpvs	3, 2, cr7, cr12, cr5, {3}
    6214:	5f20296f 	svcpl	0x0020296f
    6218:	656e6547 	strbvs	r6, [lr, #-1351]!	@ 0xfffffab9
    621c:	28636972 	stmdacs	r3!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    6220:	72707865 	rsbsvc	r7, r0, #6619136	@ 0x650000
    6224:	3a74202c 	bcc	1d0e2dc <_Min_Stack_Size+0x1d0dedc>
    6228:	73657920 	cmnvc	r5, #32, 18	@ 0x80000
    622c:	6564202c 	strbvs	r2, [r4, #-44]!	@ 0xffffffd4
    6230:	6c756166 	ldfvse	f6, [r5], #-408	@ 0xfffffe68
    6234:	6e203a74 			@ <UNDEFINED> instruction: 0x6e203a74
    6238:	7800296f 	stmdavc	r0, {r0, r1, r2, r3, r5, r6, r8, fp, sp}
    623c:	5f525350 	svcpl	0x00525350
    6240:	5f494349 	svcpl	0x00494349
    6244:	315f5449 	cmpcc	pc, r9, asr #8
    6248:	736f505f 	cmnvc	pc, #95	@ 0x5f
    624c:	55303120 	ldrpl	r3, [r0, #-288]!	@ 0xfffffee0
    6250:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    6254:	5f544e45 	svcpl	0x00544e45
    6258:	4e474953 			@ <UNDEFINED> instruction: 0x4e474953
    625c:	425f4c41 	subsmi	r4, pc, #16640	@ 0x4100
    6260:	70284655 	eorvc	r4, r8, r5, asr r6
    6264:	20297274 	eorcs	r7, r9, r4, ror r2
    6268:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    626c:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    6270:	6769735f 			@ <UNDEFINED> instruction: 0x6769735f
    6274:	5f6c616e 	svcpl	0x006c616e
    6278:	29667562 	stmdbcs	r6!, {r1, r5, r6, r8, sl, ip, sp, lr}^
    627c:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    6280:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    6284:	52505f4c 	subspl	r5, r0, #76, 30	@ 0x130
    6288:	45445649 	strbmi	r5, [r4, #-1609]	@ 0xfffff9b7
    628c:	414e4546 	cmpmi	lr, r6, asr #10
    6290:	736f505f 	cmnvc	pc, #95	@ 0x5f
    6294:	00553220 	subseq	r3, r5, r0, lsr #4
    6298:	36544e49 	ldrbcc	r4, [r4], -r9, asr #28
    629c:	28435f34 	stmdacs	r3, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    62a0:	5f202978 	svcpl	0x00202978
    62a4:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    62a8:	435f3436 	cmpmi	pc, #905969664	@ 0x36000000
    62ac:	00297828 	eoreq	r7, r9, r8, lsr #16
    62b0:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    62b4:	495f544e 	ldmdbmi	pc, {r1, r2, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    62b8:	5f54494e 	svcpl	0x0054494e
    62bc:	45534552 	ldrbmi	r4, [r3, #-1362]	@ 0xfffffaae
    62c0:	44455652 	strbmi	r5, [r5], #-1618	@ 0xfffff9ae
    62c4:	0020385f 	eoreq	r3, r0, pc, asr r8
    62c8:	5f495054 	svcpl	0x00495054
    62cc:	52534646 	subspl	r4, r3, #73400320	@ 0x4600000
    62d0:	5043545f 	subpl	r5, r3, pc, asr r4
    62d4:	65736572 	ldrbvs	r6, [r3, #-1394]!	@ 0xfffffa8e
    62d8:	4d5f746e 	cfldrdmi	mvd7, [pc, #-440]	@ 6128 <_Min_Stack_Size+0x5d28>
    62dc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    62e0:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    62e4:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    62e8:	49505420 	ldmdbmi	r0, {r5, sl, ip, lr}^
    62ec:	5346465f 	movtpl	r4, #26207	@ 0x665f
    62f0:	43545f52 	cmpmi	r4, #328	@ 0x148
    62f4:	73657250 	cmnvc	r5, #80, 4
    62f8:	5f746e65 	svcpl	0x00746e65
    62fc:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    6300:	726f4300 	rsbvc	r4, pc, #0, 6
    6304:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    6308:	445f6775 	ldrbmi	r6, [pc], #-1909	@ 6310 <_Min_Stack_Size+0x5f10>
    630c:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    6310:	525f535f 	subspl	r5, pc, #2080374785	@ 0x7c000001
    6314:	54455345 	strbpl	r5, [r5], #-837	@ 0xfffffcbb
    6318:	5f54535f 	svcpl	0x0054535f
    631c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    6320:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    6324:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    6328:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    632c:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    6330:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    6334:	5f525343 	svcpl	0x00525343
    6338:	45525f53 	ldrbmi	r5, [r2, #-3923]	@ 0xfffff0ad
    633c:	5f544553 	svcpl	0x00544553
    6340:	505f5453 	subspl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
    6344:	0029736f 	eoreq	r7, r9, pc, ror #6
    6348:	5f4d5449 	svcpl	0x004d5449
    634c:	5f524354 	svcpl	0x00524354
    6350:	434e5953 	movtmi	r5, #59731	@ 0xe953
    6354:	5f414e45 	svcpl	0x00414e45
    6358:	20736f50 	rsbscs	r6, r3, r0, asr pc
    635c:	5f005532 	svcpl	0x00005532
    6360:	49534f50 	ldmdbmi	r3, {r4, r6, r8, r9, sl, fp, lr}^
    6364:	4f535f58 	svcmi	0x00535f58
    6368:	45435255 	strbmi	r5, [r3, #-597]	@ 0xfffffdab
    636c:	735f5f00 	cmpvc	pc, #0, 30
    6370:	5f657a69 	svcpl	0x00657a69
    6374:	4d002074 	stcmi	0, cr2, [r0, #-464]	@ 0xfffffe30
    6378:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    637c:	5f524142 	svcpl	0x00524142
    6380:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    6384:	4d5f4e4f 	ldclmi	14, cr4, [pc, #-316]	@ 6250 <_Min_Stack_Size+0x5e50>
    6388:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    638c:	55467830 	strbpl	r7, [r6, #-2096]	@ 0xfffff7d0
    6390:	0029204c 	eoreq	r2, r9, ip, asr #32
    6394:	5f433249 	svcpl	0x00433249
    6398:	5f315243 	svcpl	0x00315243
    639c:	45504e45 	ldrbmi	r4, [r0, #-3653]	@ 0xfffff1bb
    63a0:	32492043 	subcc	r2, r9, #67	@ 0x43
    63a4:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    63a8:	4e455f31 	mcrmi	15, 2, r5, cr5, cr1, {1}
    63ac:	5f434550 	svcpl	0x00434550
    63b0:	006b734d 	rsbeq	r7, fp, sp, asr #6
    63b4:	5f545744 	svcpl	0x00545744
    63b8:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    63bc:	4359435f 	cmpmi	r9, #2080374785	@ 0x7c000001
    63c0:	45544e43 	ldrbmi	r4, [r4, #-3651]	@ 0xfffff1bd
    63c4:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ 6294 <_Min_Stack_Size+0x5e94>
    63c8:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    63cc:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    63d0:	0029204c 	eoreq	r2, r9, ip, asr #32
    63d4:	65737361 	ldrbvs	r7, [r3, #-865]!	@ 0xfffffc9f
    63d8:	5f287472 	svcpl	0x00287472
    63dc:	2029655f 	eorcs	r6, r9, pc, asr r5
    63e0:	5f5f2828 	svcpl	0x005f2828
    63e4:	3f202965 	svccc	0x00202965
    63e8:	6f762820 	svcvs	0x00762820
    63ec:	30296469 	eorcc	r6, r9, r9, ror #8
    63f0:	5f203a20 	svcpl	0x00203a20
    63f4:	7373615f 	cmnvc	r3, #-1073741801	@ 0xc0000017
    63f8:	5f747265 	svcpl	0x00747265
    63fc:	636e7566 	cmnvs	lr, #427819008	@ 0x19800000
    6400:	5f5f2820 	svcpl	0x005f2820
    6404:	454c4946 	strbmi	r4, [ip, #-2374]	@ 0xfffff6ba
    6408:	202c5f5f 	eorcs	r5, ip, pc, asr pc
    640c:	494c5f5f 	stmdbmi	ip, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    6410:	5f5f454e 	svcpl	0x005f454e
    6414:	5f5f202c 	svcpl	0x005f202c
    6418:	45535341 	ldrbmi	r5, [r3, #-833]	@ 0xfffffcbf
    641c:	465f5452 			@ <UNDEFINED> instruction: 0x465f5452
    6420:	2c434e55 	mcrrcs	14, 5, r4, r3, cr5
    6424:	5f5f2320 	svcpl	0x005f2320
    6428:	00292965 	eoreq	r2, r9, r5, ror #18
    642c:	5f424353 	svcpl	0x00424353
    6430:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    6434:	5542495f 	strbpl	r4, [r2, #-2399]	@ 0xfffff6a1
    6438:	52524553 	subspl	r4, r2, #348127232	@ 0x14c00000
    643c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    6440:	43532820 	cmpmi	r3, #32, 16	@ 0x200000
    6444:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    6448:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    644c:	41465355 	cmpmi	r6, r5, asr r3
    6450:	53544c55 	cmppl	r4, #21760	@ 0x5500
    6454:	6f505f52 	svcvs	0x00505f52
    6458:	202b2073 	eorcs	r2, fp, r3, ror r0
    645c:	00295530 	eoreq	r5, r9, r0, lsr r5
    6460:	5f4d5449 	svcpl	0x004d5449
    6464:	5f524354 	svcpl	0x00524354
    6468:	59535542 	ldmdbpl	r3, {r1, r6, r8, sl, ip, lr}^
    646c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    6470:	55333220 	ldrpl	r3, [r3, #-544]!	@ 0xfffffde0
    6474:	43435200 	movtmi	r5, #12800	@ 0x3200
    6478:	4332495f 	teqmi	r2, #1556480	@ 0x17c000
    647c:	4c435f32 	mcrrmi	15, 3, r5, r3, cr2
    6480:	4e455f4b 	cdpmi	15, 4, cr5, cr5, cr11, {2}
    6484:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    6488:	2d434352 	stclcs	3, cr4, [r3, #-328]	@ 0xfffffeb8
    648c:	4250413e 	subsmi	r4, r0, #-2147483633	@ 0x8000000f
    6490:	524e4531 	subpl	r4, lr, #205520896	@ 0xc400000
    6494:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    6498:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    649c:	3232203c 	eorscc	r2, r2, #60	@ 0x3c
    64a0:	5f002929 	svcpl	0x00002929
    64a4:	204d495f 	subcs	r4, sp, pc, asr r9
    64a8:	616c6f76 	smcvs	50934	@ 0xc6f6
    64ac:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    64b0:	6e6f6320 	cdpvs	3, 6, cr6, cr15, cr0, {1}
    64b4:	53007473 	movwpl	r7, #1139	@ 0x473
    64b8:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    64bc:	5f525346 	svcpl	0x00525346
    64c0:	43434149 	movtmi	r4, #12617	@ 0x3149
    64c4:	4c4f4956 	mcrrmi	9, 5, r4, pc, cr6	@ <UNPREDICTABLE>
    64c8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    64cc:	43532820 	cmpmi	r3, #32, 16	@ 0x200000
    64d0:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    64d4:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ 6390 <_Min_Stack_Size+0x5f90>
    64d8:	41464d45 	cmpmi	r6, r5, asr #26
    64dc:	53544c55 	cmppl	r4, #21760	@ 0x5500
    64e0:	6f505f52 	svcvs	0x00505f52
    64e4:	202b2073 	eorcs	r2, fp, r3, ror r0
    64e8:	00295530 	eoreq	r5, r9, r0, lsr r5
    64ec:	5f433249 	svcpl	0x00433249
    64f0:	5f315253 	svcpl	0x00315253
    64f4:	4d5f4253 	lfmmi	f4, 2, [pc, #-332]	@ 63b0 <_Min_Stack_Size+0x5fb0>
    64f8:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    64fc:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    6500:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    6504:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    6508:	3152535f 	cmpcc	r2, pc, asr r3
    650c:	5f42535f 	svcpl	0x0042535f
    6510:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    6514:	43324900 	teqmi	r2, #0, 18
    6518:	3152535f 	cmpcc	r2, pc, asr r3
    651c:	4444415f 	strbmi	r4, [r4], #-351	@ 0xfffffea1
    6520:	6f505f52 	svcvs	0x00505f52
    6524:	31282073 			@ <UNDEFINED> instruction: 0x31282073
    6528:	41002955 	tstmi	r0, r5, asr r9
    652c:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 63ec <_Min_Stack_Size+0x5fec>
    6530:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    6534:	4f494745 	svcmi	0x00494745
    6538:	49535f4e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    653c:	385f455a 	ldmdacc	pc, {r1, r3, r4, r6, r8, sl, lr}^	@ <UNPREDICTABLE>
    6540:	2820424d 	stmdacs	r0!, {r0, r2, r3, r6, r9, lr}
    6544:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    6548:	745f3874 	ldrbvc	r3, [pc], #-2164	@ 6550 <_Min_Stack_Size+0x6150>
    654c:	31783029 	cmncc	r8, r9, lsr #32
    6550:	00295536 	eoreq	r5, r9, r6, lsr r5
    6554:	5f4d5241 	svcpl	0x004d5241
    6558:	5f55504d 	svcpl	0x0055504d
    655c:	45434341 	strbmi	r4, [r3, #-833]	@ 0xfffffcbf
    6560:	445f5353 	ldrbmi	r5, [pc], #-851	@ 6568 <_Min_Stack_Size+0x6168>
    6564:	43495645 	movtmi	r5, #38469	@ 0x9645
    6568:	73492845 	movtvc	r2, #38981	@ 0x9845
    656c:	72616853 	rsbvc	r6, r1, #5439488	@ 0x530000
    6570:	6c626165 	stfvse	f6, [r2], #-404	@ 0xfffffe6c
    6574:	28202965 	stmdacs	r0!, {r0, r2, r5, r6, r8, fp, sp}
    6578:	53734928 	cmnpl	r3, #40, 18	@ 0xa0000
    657c:	65726168 	ldrbvs	r6, [r2, #-360]!	@ 0xfffffe98
    6580:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    6584:	203f2029 	eorscs	r2, pc, r9, lsr #32
    6588:	5f4d5241 	svcpl	0x004d5241
    658c:	5f55504d 	svcpl	0x0055504d
    6590:	45434341 	strbmi	r4, [r3, #-833]	@ 0xfffffcbf
    6594:	285f5353 	ldmdacs	pc, {r0, r1, r4, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
    6598:	202c5530 	eorcs	r5, ip, r0, lsr r5
    659c:	202c5531 	eorcs	r5, ip, r1, lsr r5
    65a0:	202c5530 	eorcs	r5, ip, r0, lsr r5
    65a4:	20295531 	eorcs	r5, r9, r1, lsr r5
    65a8:	5241203a 	subpl	r2, r1, #58	@ 0x3a
    65ac:	504d5f4d 	subpl	r5, sp, sp, asr #30
    65b0:	43415f55 	movtmi	r5, #8021	@ 0x1f55
    65b4:	53534543 	cmppl	r3, #281018368	@ 0x10c00000
    65b8:	5532285f 	ldrpl	r2, [r2, #-2143]!	@ 0xfffff7a1
    65bc:	5530202c 	ldrpl	r2, [r0, #-44]!	@ 0xffffffd4
    65c0:	5530202c 	ldrpl	r2, [r0, #-44]!	@ 0xffffffd4
    65c4:	5530202c 	ldrpl	r2, [r0, #-44]!	@ 0xffffffd4
    65c8:	4d002929 	vstrmi.16	s4, [r0, #-82]	@ 0xffffffae	@ <UNPREDICTABLE>
    65cc:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    65d0:	5f525341 	svcpl	0x00525341
    65d4:	42414e45 	submi	r4, r1, #1104	@ 0x450
    65d8:	4d5f454c 	cfldr64mi	mvdx4, [pc, #-304]	@ 64b0 <_Min_Stack_Size+0x60b0>
    65dc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    65e0:	204c5531 	subcs	r5, ip, r1, lsr r5
    65e4:	32490029 	subcc	r0, r9, #41	@ 0x29
    65e8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    65ec:	45505f31 	ldrbmi	r5, [r0, #-3889]	@ 0xfffff0cf
    65f0:	6b734d5f 	blvs	1cd9b74 <_Min_Stack_Size+0x1cd9774>
    65f4:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    65f8:	204c5531 	subcs	r5, ip, r1, lsr r5
    65fc:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    6600:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    6604:	505f3152 	subspl	r3, pc, r2, asr r1	@ <UNPREDICTABLE>
