NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    6608:	6f505f45 	svcvs	0x00505f45
    660c:	53002973 	movwpl	r2, #2419	@ 0x973
    6610:	415f4243 	cmpmi	pc, r3, asr #4
    6614:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    6618:	4952505f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, ip, lr}^
    661c:	554f5247 	strbpl	r5, [pc, #-583]	@ 63dd <_Min_Stack_Size+0x5fdd>
    6620:	6f505f50 	svcvs	0x00505f50
    6624:	55382073 	ldrpl	r2, [r8, #-115]!	@ 0xffffff8d
    6628:	435f5f00 	cmpmi	pc, #0, 30
    662c:	55535f43 	ldrbpl	r5, [r3, #-3907]	@ 0xfffff0bd
    6630:	524f5050 	subpl	r5, pc, #80	@ 0x50
    6634:	495f5354 	ldmdbmi	pc, {r2, r4, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
    6638:	4e494c4e 	cdpmi	12, 4, cr4, cr9, cr14, {2}
    663c:	00312045 	eorseq	r2, r1, r5, asr #32
    6640:	5f4d5449 	svcpl	0x004d5449
    6644:	55425852 	strbpl	r5, [r2, #-2130]	@ 0xfffff7ae
    6648:	52454646 	subpl	r4, r5, #73400320	@ 0x4600000
    664c:	504d455f 	subpl	r4, sp, pc, asr r5
    6650:	28205954 	stmdacs	r0!, {r2, r4, r6, r8, fp, ip, lr}
    6654:	746e6928 	strbtvc	r6, [lr], #-2344	@ 0xfffff6d8
    6658:	745f3233 	ldrbvc	r3, [pc], #-563	@ 6660 <_Min_Stack_Size+0x6260>
    665c:	35783029 	ldrbcc	r3, [r8, #-41]!	@ 0xffffffd7
    6660:	35354141 	ldrcc	r4, [r5, #-321]!	@ 0xfffffebf
    6664:	55354141 	ldrpl	r4, [r5, #-321]!	@ 0xfffffebf
    6668:	525f0029 	subspl	r0, pc, #41	@ 0x29
    666c:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    6670:	4749535f 	smlsldmi	r5, r9, pc, r3	@ <UNPREDICTABLE>
    6674:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    6678:	705f2843 	subsvc	r2, pc, r3, asr #16
    667c:	20297274 	eorcs	r7, r9, r4, ror r2
    6680:	705f2828 	subsvc	r2, pc, r8, lsr #16
    6684:	2d297274 	sfmcs	f7, 4, [r9, #-464]!	@ 0xfffffe30
    6688:	69735f3e 	ldmdbvs	r3!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    668c:	75665f67 	strbvc	r5, [r6, #-3943]!	@ 0xfffff099
    6690:	0029636e 	eoreq	r6, r9, lr, ror #6
    6694:	454c5f5f 	strbmi	r5, [ip, #-3935]	@ 0xfffff0a1
    6698:	33545341 	cmpcc	r4, #67108865	@ 0x4000001
    669c:	6c222032 	stcvs	0, cr2, [r2], #-200	@ 0xffffff38
    66a0:	5f5f0022 	svcpl	0x005f0022
    66a4:	6b616577 	blvs	185fc88 <_Min_Stack_Size+0x185f888>
    66a8:	6d79735f 	ldclvs	3, cr7, [r9, #-380]!	@ 0xfffffe84
    66ac:	206c6f62 	rsbcs	r6, ip, r2, ror #30
    66b0:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    66b4:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    66b8:	5f657475 	svcpl	0x00657475
    66bc:	5f28285f 	svcpl	0x0028285f
    66c0:	6165775f 	cmnvs	r5, pc, asr r7
    66c4:	295f5f6b 	ldmdbcs	pc, {r0, r1, r3, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    66c8:	5f5f0029 	svcpl	0x005f0029
    66cc:	78656c66 	stmdavc	r5!, {r1, r2, r5, r6, sl, fp, sp, lr}^
    66d0:	20727261 	rsbscs	r7, r2, r1, ror #4
    66d4:	005d305b 	subseq	r3, sp, fp, asr r0
    66d8:	4d4f5f5f 	stclmi	15, cr5, [pc, #-380]	@ 6564 <_Min_Stack_Size+0x6164>
    66dc:	6c6f7620 	stclvs	6, cr7, [pc], #-128	@ 6664 <_Min_Stack_Size+0x6264>
    66e0:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
    66e4:	5f5f0065 	svcpl	0x005f0065
    66e8:	45524f43 	ldrbmi	r4, [r2, #-3907]	@ 0xfffff0bd
    66ec:	334d435f 	movtcc	r4, #54111	@ 0xd35f
    66f0:	475f485f 			@ <UNDEFINED> instruction: 0x475f485f
    66f4:	52454e45 	subpl	r4, r5, #1104	@ 0x450
    66f8:	00204349 	eoreq	r4, r0, r9, asr #6
    66fc:	5f545744 	svcpl	0x00545744
    6700:	43495043 	movtmi	r5, #36931	@ 0x9043
    6704:	435f544e 	cmpmi	pc, #1308622848	@ 0x4e000000
    6708:	4e434950 			@ <UNDEFINED> instruction: 0x4e434950
    670c:	6f505f54 	svcvs	0x00505f54
    6710:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    6714:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    6718:	5f544e45 	svcpl	0x00544e45
    671c:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    6720:	4e41525f 	mcrmi	2, 2, r5, cr1, cr15, {2}
    6724:	28383444 	ldmdacs	r8!, {r2, r6, sl, ip, sp}
    6728:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    672c:	206f6420 	rsbcs	r6, pc, r0, lsr #8
    6730:	7473207b 	ldrbtvc	r2, [r3], #-123	@ 0xffffff85
    6734:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    6738:	65725f20 	ldrbvs	r5, [r2, #-3872]!	@ 0xfffff0e0
    673c:	20746e65 	rsbscs	r6, r4, r5, ror #28
    6740:	20725f2a 	rsbscs	r5, r2, sl, lsr #30
    6744:	7628203d 			@ <UNDEFINED> instruction: 0x7628203d
    6748:	3b297261 	blcc	a630d4 <_Min_Stack_Size+0xa62cd4>
    674c:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    6750:	34725f3e 	ldrbtcc	r5, [r2], #-3902	@ 0xfffff0c2
    6754:	5f3e2d38 	svcpl	0x003e2d38
    6758:	64656573 	strbtvs	r6, [r5], #-1395	@ 0xfffffa8d
    675c:	205d305b 	subscs	r3, sp, fp, asr r0
    6760:	525f203d 	subspl	r2, pc, #61	@ 0x3d
    6764:	34444e41 	strbcc	r4, [r4], #-3649	@ 0xfffff1bf
    6768:	45535f38 	ldrbmi	r5, [r3, #-3896]	@ 0xfffff0c8
    676c:	305f4445 	subscc	r4, pc, r5, asr #8
    6770:	725f203b 	subsvc	r2, pc, #59	@ 0x3b
    6774:	725f3e2d 	subsvc	r3, pc, #720	@ 0x2d0
    6778:	3e2d3834 	mcrcc	8, 1, r3, cr13, cr4, {1}
    677c:	6565735f 	strbvs	r7, [r5, #-863]!	@ 0xfffffca1
    6780:	5d315b64 	vldmdbpl	r1!, {d5-<overflow reg d54>}
    6784:	5f203d20 	svcpl	0x00203d20
    6788:	444e4152 	strbmi	r4, [lr], #-338	@ 0xfffffeae
    678c:	535f3834 	cmppl	pc, #52, 16	@ 0x340000
    6790:	5f444545 	svcpl	0x00444545
    6794:	5f203b31 	svcpl	0x00203b31
    6798:	5f3e2d72 	svcpl	0x003e2d72
    679c:	2d383472 	cfldrscs	mvf3, [r8, #-456]!	@ 0xfffffe38
    67a0:	65735f3e 	ldrbvs	r5, [r3, #-3902]!	@ 0xfffff0c2
    67a4:	325b6465 	subscc	r6, fp, #1694498816	@ 0x65000000
    67a8:	203d205d 	eorscs	r2, sp, sp, asr r0
    67ac:	4e41525f 	mcrmi	2, 2, r5, cr1, cr15, {2}
    67b0:	5f383444 	svcpl	0x00383444
    67b4:	44454553 	strbmi	r4, [r5], #-1363	@ 0xfffffaad
    67b8:	203b325f 	eorscs	r3, fp, pc, asr r2
    67bc:	3e2d725f 	mcrcc	2, 1, r7, cr13, cr15, {2}
    67c0:	3834725f 	ldmdacc	r4!, {r0, r1, r2, r3, r4, r6, r9, ip, sp, lr}
    67c4:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 6718 <_Min_Stack_Size+0x6318>
    67c8:	5b746c75 	blpl	1d219a4 <_Min_Stack_Size+0x1d215a4>
    67cc:	3d205d30 	stccc	13, cr5, [r0, #-192]!	@ 0xffffff40
    67d0:	41525f20 	cmpmi	r2, r0, lsr #30
    67d4:	3834444e 	ldmdacc	r4!, {r1, r2, r3, r6, sl, lr}
    67d8:	4c554d5f 	mrrcmi	13, 5, r4, r5, cr15
    67dc:	3b305f54 	blcc	c1e534 <_Min_Stack_Size+0xc1e134>
    67e0:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    67e4:	34725f3e 	ldrbtcc	r5, [r2], #-3902	@ 0xfffff0c2
    67e8:	5f3e2d38 	svcpl	0x003e2d38
    67ec:	746c756d 	strbtvc	r7, [ip], #-1389	@ 0xfffffa93
    67f0:	205d315b 	subscs	r3, sp, fp, asr r1
    67f4:	525f203d 	subspl	r2, pc, #61	@ 0x3d
    67f8:	34444e41 	strbcc	r4, [r4], #-3649	@ 0xfffff1bf
    67fc:	554d5f38 	strbpl	r5, [sp, #-3896]	@ 0xfffff0c8
    6800:	315f544c 	cmpcc	pc, ip, asr #8
    6804:	725f203b 	subsvc	r2, pc, #59	@ 0x3b
    6808:	725f3e2d 	subsvc	r3, pc, #720	@ 0x2d0
    680c:	3e2d3834 	mcrcc	8, 1, r3, cr13, cr4, {1}
    6810:	6c756d5f 	ldclvs	13, cr6, [r5], #-380	@ 0xfffffe84
    6814:	5d325b74 	vldmdbpl	r2!, {d5-<overflow reg d62>}
    6818:	5f203d20 	svcpl	0x00203d20
    681c:	444e4152 	strbmi	r4, [lr], #-338	@ 0xfffffeae
    6820:	4d5f3834 	ldclmi	8, cr3, [pc, #-208]	@ 6758 <_Min_Stack_Size+0x6358>
    6824:	5f544c55 	svcpl	0x00544c55
    6828:	5f203b32 	svcpl	0x00203b32
    682c:	5f3e2d72 	svcpl	0x003e2d72
    6830:	2d383472 	cfldrscs	mvf3, [r8, #-456]!	@ 0xfffffe38
    6834:	64615f3e 	strbtvs	r5, [r1], #-3902	@ 0xfffff0c2
    6838:	203d2064 	eorscs	r2, sp, r4, rrx
    683c:	4e41525f 	mcrmi	2, 2, r5, cr1, cr15, {2}
    6840:	5f383444 	svcpl	0x00383444
    6844:	3b444441 	blcc	1117950 <_Min_Stack_Size+0x1117550>
    6848:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    684c:	34725f3e 	ldrbtcc	r5, [r2], #-3902	@ 0xfffff0c2
    6850:	5f3e2d38 	svcpl	0x003e2d38
    6854:	646e6172 	strbtvs	r6, [lr], #-370	@ 0xfffffe8e
    6858:	78656e5f 	stmdavc	r5!, {r0, r1, r2, r3, r4, r6, r9, sl, fp, sp, lr}^
    685c:	203d2074 	eorscs	r2, sp, r4, ror r0
    6860:	7d203b31 	fstmdbxvc	r0!, {d3-d26}	@ Deprecated
    6864:	69687720 	stmdbvs	r8!, {r5, r8, r9, sl, ip, sp, lr}^
    6868:	2820656c 	stmdacs	r0!, {r2, r3, r5, r6, r8, sl, sp, lr}
    686c:	52002930 	andpl	r2, r0, #48, 18	@ 0xc0000
    6870:	555f4343 	ldrbpl	r4, [pc, #-835]	@ 6535 <_Min_Stack_Size+0x6135>
    6874:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    6878:	65525f33 	ldrbvs	r5, [r2, #-3891]	@ 0xfffff0cd
    687c:	28746573 	ldmdacs	r4!, {r0, r1, r4, r5, r6, r8, sl, sp, lr}^
    6880:	52282029 	eorpl	r2, r8, #41	@ 0x29
    6884:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    6888:	31425041 	cmpcc	r2, r1, asr #32
    688c:	52545352 	subspl	r5, r4, #1207959553	@ 0x48000001
    6890:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    6894:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    6898:	3831203c 	ldmdacc	r1!, {r2, r3, r4, r5, sp}
    689c:	5f002929 	svcpl	0x00002929
    68a0:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    68a4:	424d5f54 	submi	r5, sp, #84, 30	@ 0x150
    68a8:	4f545253 	svcmi	0x00545253
    68ac:	5f534357 	svcpl	0x00534357
    68b0:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
    68b4:	74702845 	ldrbtvc	r2, [r0], #-2117	@ 0xfffff7bb
    68b8:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    68bc:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    68c0:	5f3e2d29 	svcpl	0x003e2d29
    68c4:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    68c8:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 681c <_Min_Stack_Size+0x641c>
    68cc:	74727362 	ldrbtvc	r7, [r2], #-866	@ 0xfffffc9e
    68d0:	7363776f 	cmnvc	r3, #29097984	@ 0x1bc0000
    68d4:	6174735f 	cmnvs	r4, pc, asr r3
    68d8:	00296574 	eoreq	r6, r9, r4, ror r5
    68dc:	53415f5f 	movtpl	r5, #8031	@ 0x1f5f
    68e0:	54524553 	ldrbpl	r4, [r2], #-1363	@ 0xfffffaad
    68e4:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    68e8:	5f5f2043 	svcpl	0x005f2043
    68ec:	636e7566 	cmnvs	lr, #427819008	@ 0x19800000
    68f0:	49005f5f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    68f4:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    68f8:	415f3152 	cmpmi	pc, r2, asr r1	@ <UNPREDICTABLE>
    68fc:	4d5f4b43 	vldrmi	d20, [pc, #-268]	@ 67f8 <_Min_Stack_Size+0x63f8>
    6900:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    6904:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    6908:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    690c:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    6910:	3152435f 	cmpcc	r2, pc, asr r3
    6914:	4b43415f 	blmi	10d6e98 <_Min_Stack_Size+0x10d6a98>
    6918:	736f505f 	cmnvc	pc, #95	@ 0x5f
    691c:	50540029 	subspl	r0, r4, r9, lsr #32
    6920:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    6924:	5f304f46 	svcpl	0x00304f46
    6928:	5f4d5449 	svcpl	0x004d5449
    692c:	65747962 	ldrbvs	r7, [r4, #-2402]!	@ 0xfffff69e
    6930:	6e756f63 	cdpvs	15, 7, cr6, cr5, cr3, {3}
    6934:	6f505f74 	svcvs	0x00505f74
    6938:	37322073 			@ <UNDEFINED> instruction: 0x37322073
    693c:	32490055 	subcc	r0, r9, #85	@ 0x55
    6940:	455f3243 	ldrbmi	r3, [pc, #-579]	@ 6705 <_Min_Stack_Size+0x6305>
    6944:	52495f56 	subpl	r5, r9, #344	@ 0x158
    6948:	33332051 	teqcc	r3, #81	@ 0x51
    694c:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    6950:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    6954:	455f304f 	ldrbmi	r3, [pc, #-79]	@ 690d <_Min_Stack_Size+0x650d>
    6958:	415f4d54 	cmpmi	pc, r4, asr sp	@ <UNPREDICTABLE>
    695c:	4c415654 	mcrrmi	6, 5, r5, r1, cr4
    6960:	505f4449 	subspl	r4, pc, r9, asr #8
    6964:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    6968:	53005536 	movwpl	r5, #1334	@ 0x536
    696c:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    6970:	44495550 	strbmi	r5, [r9], #-1360	@ 0xfffffab0
    6974:	5241505f 	subpl	r5, r1, #95	@ 0x5f
    6978:	5f4f4e54 	svcpl	0x004f4e54
    697c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    6980:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    6984:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    6988:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    698c:	5f424353 	svcpl	0x00424353
    6990:	49555043 	ldmdbmi	r5, {r0, r1, r6, ip, lr}^
    6994:	41505f44 	cmpmi	r0, r4, asr #30
    6998:	4f4e5452 	svcmi	0x004e5452
    699c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    69a0:	50470029 	subpl	r0, r7, r9, lsr #32
    69a4:	20424f49 	subcs	r4, r2, r9, asr #30
    69a8:	50472828 	subpl	r2, r7, r8, lsr #16
    69ac:	545f4f49 	ldrbpl	r4, [pc], #-3913	@ 69b4 <_Min_Stack_Size+0x65b4>
    69b0:	44657079 	strbtmi	r7, [r5], #-121	@ 0xffffff87
    69b4:	2a206665 	bcs	820350 <_Min_Stack_Size+0x81ff50>
    69b8:	49504729 	ldmdbmi	r0, {r0, r3, r5, r8, r9, sl, lr}^
    69bc:	425f424f 	subsmi	r4, pc, #-268435452	@ 0xf0000004
    69c0:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    69c4:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    69c8:	65535f43 	ldrbvs	r5, [r3, #-3907]	@ 0xfffff0bd
    69cc:	6e655074 	mcrvs	0, 3, r5, cr5, cr4, {3}
    69d0:	676e6964 	strbvs	r6, [lr, -r4, ror #18]!
    69d4:	20515249 	subscs	r5, r1, r9, asr #4
    69d8:	564e5f5f 			@ <UNDEFINED> instruction: 0x564e5f5f
    69dc:	535f4349 	cmppl	pc, #603979777	@ 0x24000001
    69e0:	65507465 	ldrbvs	r7, [r0, #-1125]	@ 0xfffffb9b
    69e4:	6e69646e 	cdpvs	4, 6, cr6, cr9, cr14, {3}
    69e8:	51524967 	cmppl	r2, r7, ror #18
    69ec:	615f5f00 	cmpvs	pc, r0, lsl #30
    69f0:	636f6c6c 	cmnvs	pc, #108, 24	@ 0x6c00
    69f4:	7a69735f 	bvc	1a63778 <_Min_Stack_Size+0x1a63378>
    69f8:	6e283265 	cdpvs	2, 2, cr3, cr8, cr5, {3}
    69fc:	2029782c 	eorcs	r7, r9, ip, lsr #16
    6a00:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    6a04:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    6a08:	5f657475 	svcpl	0x00657475
    6a0c:	5f28285f 	svcpl	0x0028285f
    6a10:	6c6c615f 	stfvse	f6, [ip], #-380	@ 0xfffffe84
    6a14:	735f636f 	cmpvc	pc, #-1140850687	@ 0xbc000001
    6a18:	5f657a69 	svcpl	0x00657a69
    6a1c:	2c6e285f 	stclcs	8, cr2, [lr], #-380	@ 0xfffffe84
    6a20:	29297820 	stmdbcs	r9!, {r5, fp, ip, sp, lr}
    6a24:	5f5f0029 	svcpl	0x005f0029
    6a28:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    6a2c:	53002038 	movwpl	r2, #56	@ 0x38
    6a30:	43536e43 	cmpmi	r3, #1072	@ 0x430
    6a34:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    6a38:	495f5254 	ldmdbmi	pc, {r2, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    6a3c:	494c544e 	stmdbmi	ip, {r1, r2, r3, r6, sl, ip, lr}^
    6a40:	4e53454e 	cdpmi	5, 5, cr4, cr3, cr14, {2}
    6a44:	505f4d55 	subspl	r4, pc, r5, asr sp	@ <UNPREDICTABLE>
    6a48:	3020736f 	eorcc	r7, r0, pc, ror #6
    6a4c:	525f0055 	subspl	r0, pc, #85	@ 0x55
    6a50:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    6a54:	54424d5f 	strbpl	r4, [r2], #-3423	@ 0xfffff2a1
    6a58:	5f43574f 	svcpl	0x0043574f
    6a5c:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
    6a60:	74702845 	ldrbtvc	r2, [r0], #-2117	@ 0xfffff7bb
    6a64:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    6a68:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    6a6c:	5f3e2d29 	svcpl	0x003e2d29
    6a70:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    6a74:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 69c8 <_Min_Stack_Size+0x65c8>
    6a78:	776f7462 	strbvc	r7, [pc, -r2, ror #8]!
    6a7c:	74735f63 	ldrbtvc	r5, [r3], #-3939	@ 0xfffff09d
    6a80:	29657461 	stmdbcs	r5!, {r0, r5, r6, sl, ip, sp, lr}^
    6a84:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    6a88:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
    6a8c:	69725074 	ldmdbvs	r2!, {r2, r4, r5, r6, ip, lr}^
    6a90:	7469726f 	strbtvc	r7, [r9], #-623	@ 0xfffffd91
    6a94:	6f724779 	svcvs	0x00724779
    6a98:	6e697075 	mcrvs	0, 3, r7, cr9, cr5, {3}
    6a9c:	5f5f2067 	svcpl	0x005f2067
    6aa0:	4349564e 	movtmi	r5, #38478	@ 0x964e
    6aa4:	7465475f 	strbtvc	r4, [r5], #-1887	@ 0xfffff8a1
    6aa8:	6f697250 	svcvs	0x00697250
    6aac:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    6ab0:	756f7247 	strbvc	r7, [pc, #-583]!	@ 6871 <_Min_Stack_Size+0x6471>
    6ab4:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
    6ab8:	736e7500 	cmnvc	lr, #0, 10
    6abc:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    6ac0:	69732064 	ldmdbvs	r3!, {r2, r5, r6, sp}^
    6ac4:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    6ac8:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    6acc:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6ad0:	20315f4e 	eorscs	r5, r1, lr, asr #30
    6ad4:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    6ad8:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    6adc:	3029745f 	eorcc	r7, r9, pc, asr r4
    6ae0:	30303078 	eorscc	r3, r0, r8, ror r0
    6ae4:	54002932 	strpl	r2, [r0], #-2354	@ 0xfffff6ce
    6ae8:	495f4950 	ldmdbmi	pc, {r4, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
    6aec:	42544154 	subsmi	r4, r4, #84, 2
    6af0:	30525443 	subscc	r5, r2, r3, asr #8
    6af4:	5254415f 	subspl	r4, r4, #-1073741801	@ 0xc0000017
    6af8:	59444145 	stmdbpl	r4, {r0, r2, r6, r8, lr}^
    6afc:	6f505f32 	svcvs	0x00505f32
    6b00:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    6b04:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    6b08:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    6b0c:	4f4e5f4c 	svcmi	0x004e5f4c
    6b10:	43465250 	movtmi	r5, #25168	@ 0x6250
    6b14:	4d5f544e 	cfldrdmi	mvd5, [pc, #-312]	@ 69e4 <_Min_Stack_Size+0x65e4>
    6b18:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    6b1c:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    6b20:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    6b24:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
    6b28:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    6b2c:	4f4e5f4c 	svcmi	0x004e5f4c
    6b30:	43465250 	movtmi	r5, #25168	@ 0x6250
    6b34:	505f544e 	subspl	r5, pc, lr, asr #8
    6b38:	0029736f 	eoreq	r7, r9, pc, ror #6
    6b3c:	756e5f5f 	strbvc	r5, [lr, #-3935]!	@ 0xfffff0a1
    6b40:	735f6c6c 	cmpvc	pc, #108, 24	@ 0x6c00
    6b44:	69746e65 	ldmdbvs	r4!, {r0, r2, r5, r6, r9, sl, fp, sp, lr}^
    6b48:	206c656e 	rsbcs	r6, ip, lr, ror #10
    6b4c:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    6b50:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    6b54:	5f657475 	svcpl	0x00657475
    6b58:	5f28285f 	svcpl	0x0028285f
    6b5c:	6e65735f 	mcrvs	3, 3, r7, cr5, cr15, {2}
    6b60:	656e6974 	strbvs	r6, [lr, #-2420]!	@ 0xfffff68c
    6b64:	295f5f6c 	ldmdbcs	pc, {r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    6b68:	79530029 	ldmdbvc	r3, {r0, r3, r5}^
    6b6c:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    6b70:	54435f6b 	strbpl	r5, [r3], #-3947	@ 0xfffff095
    6b74:	455f4c52 	ldrbmi	r4, [pc, #-3154]	@ 5f2a <_Min_Stack_Size+0x5b2a>
    6b78:	4c42414e 	stfmie	f4, [r2], {78}	@ 0x4e
    6b7c:	734d5f45 	movtvc	r5, #57157	@ 0xdf45
    6b80:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    6b84:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    6b88:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    6b8c:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    6b90:	4e455f4c 	cdpmi	15, 4, cr5, cr5, cr12, {2}
    6b94:	454c4241 	strbmi	r4, [ip, #-577]	@ 0xfffffdbf
    6b98:	6b734d5f 	blvs	1cda11c <_Min_Stack_Size+0x1cd9d1c>
    6b9c:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    6ba0:	0029204c 	eoreq	r2, r9, ip, asr #32
    6ba4:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    6ba8:	494c4355 	stmdbmi	ip, {r0, r2, r4, r6, r8, r9, lr}^
    6bac:	5f5f454b 	svcpl	0x005f454b
    6bb0:	4345535f 	movtmi	r5, #21343	@ 0x535f
    6bb4:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    6bb8:	5f003120 	svcpl	0x00003120
    6bbc:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    6bc0:	43575f54 	cmpmi	r7, #84, 30	@ 0x150
    6bc4:	4f545253 	svcmi	0x00545253
    6bc8:	5f53424d 	svcpl	0x0053424d
    6bcc:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
    6bd0:	74702845 	ldrbtvc	r2, [r0], #-2117	@ 0xfffff7bb
    6bd4:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    6bd8:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    6bdc:	5f3e2d29 	svcpl	0x003e2d29
    6be0:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    6be4:	775f3e2d 	ldrbvc	r3, [pc, -sp, lsr #28]
    6be8:	74727363 	ldrbtvc	r7, [r2], #-867	@ 0xfffffc9d
    6bec:	73626d6f 	cmnvc	r2, #7104	@ 0x1bc0
    6bf0:	6174735f 	cmnvs	r4, pc, asr r3
    6bf4:	00296574 	eoreq	r6, r9, r4, ror r5
    6bf8:	5f433249 	svcpl	0x00433249
    6bfc:	5f315243 	svcpl	0x00315243
    6c00:	5f534f50 	svcpl	0x00534f50
    6c04:	206b734d 	rsbcs	r7, fp, sp, asr #6
    6c08:	31783028 	cmncc	r8, r8, lsr #32
    6c0c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    6c10:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    6c14:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    6c18:	4f505f31 	svcmi	0x00505f31
    6c1c:	6f505f53 	svcvs	0x00505f53
    6c20:	49002973 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
    6c24:	5f525350 	svcpl	0x00525350
    6c28:	5f525349 	svcpl	0x00525349
    6c2c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    6c30:	5f005530 	svcpl	0x00005530
    6c34:	44525450 	ldrbmi	r5, [r2], #-1104	@ 0xfffffbb0
    6c38:	5f464649 	svcpl	0x00464649
    6c3c:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    6c40:	52414c43 	subpl	r4, r1, #17152	@ 0x4300
    6c44:	00204445 	eoreq	r4, r0, r5, asr #8
    6c48:	5f424353 	svcpl	0x00424353
    6c4c:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    6c50:	5445525f 	strbpl	r5, [r5], #-607	@ 0xfffffda1
    6c54:	41424f54 	cmpmi	r2, r4, asr pc
    6c58:	505f4553 	subspl	r4, pc, r3, asr r5	@ <UNPREDICTABLE>
    6c5c:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    6c60:	49005531 	stmdbmi	r0, {r0, r4, r5, r8, sl, ip, lr}
    6c64:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    6c68:	535f3252 	cmppl	pc, #536870917	@ 0x20000005
    6c6c:	4f48424d 	svcmi	0x0048424d
    6c70:	49205453 	stmdbmi	r0!, {r0, r1, r4, r6, sl, ip, lr}
    6c74:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    6c78:	535f3252 	cmppl	pc, #536870917	@ 0x20000005
    6c7c:	4f48424d 	svcmi	0x0048424d
    6c80:	4d5f5453 	cfldrdmi	mvd5, [pc, #-332]	@ 6b3c <_Min_Stack_Size+0x673c>
    6c84:	53006b73 	movwpl	r6, #2931	@ 0xb73
    6c88:	43536e43 	cmpmi	r3, #1072	@ 0x430
    6c8c:	43415f42 	movtmi	r5, #8002	@ 0x1f42
    6c90:	5f524c54 	svcpl	0x00524c54
    6c94:	46534944 	ldrbmi	r4, [r3], -r4, asr #18
    6c98:	5f414350 	svcpl	0x00414350
    6c9c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    6ca0:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    6ca4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    6ca8:	536e4353 	cmnpl	lr, #1275068417	@ 0x4c000001
    6cac:	415f4243 	cmpmi	pc, r3, asr #4
    6cb0:	524c5443 	subpl	r5, ip, #1124073472	@ 0x43000000
    6cb4:	5349445f 	movtpl	r4, #37983	@ 0x945f
    6cb8:	41435046 	cmpmi	r3, r6, asr #32
    6cbc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    6cc0:	52410029 	subpl	r0, r1, #41	@ 0x29
    6cc4:	504d5f4d 	subpl	r5, sp, sp, asr #30
    6cc8:	50415f55 	subpl	r5, r1, r5, asr pc
    6ccc:	4f52555f 	svcmi	0x0052555f
    6cd0:	00553220 	subseq	r3, r5, r0, lsr #4
    6cd4:	4f495047 	svcmi	0x00495047
    6cd8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    6cdc:	2820395f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, fp, ip, sp}
    6ce0:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    6ce4:	5f363174 	svcpl	0x00363174
    6ce8:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    6cec:	30303230 	eorscc	r3, r0, r0, lsr r2
    6cf0:	504d0029 	subpl	r0, sp, r9, lsr #32
    6cf4:	41525f55 	cmpmi	r2, r5, asr pc
    6cf8:	545f5253 	ldrbpl	r5, [pc], #-595	@ 6d00 <_Min_Stack_Size+0x6900>
    6cfc:	505f5845 	subspl	r5, pc, r5, asr #16
    6d00:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    6d04:	49005539 	stmdbmi	r0, {r0, r3, r4, r5, r8, sl, ip, lr}
    6d08:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    6d0c:	535f3252 	cmppl	pc, #536870917	@ 0x20000005
    6d10:	4544424d 	strbmi	r4, [r4, #-589]	@ 0xfffffdb3
    6d14:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    6d18:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
    6d1c:	3028206b 	eorcc	r2, r8, fp, rrx
    6d20:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    6d24:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    6d28:	5f433249 	svcpl	0x00433249
    6d2c:	5f325253 	svcpl	0x00325253
    6d30:	44424d53 	strbmi	r4, [r2], #-3411	@ 0xfffff2ad
    6d34:	55414645 	strbpl	r4, [r1, #-1605]	@ 0xfffff9bb
    6d38:	505f544c 	subspl	r5, pc, ip, asr #8
