NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    6d3c:	0029736f 	eoreq	r7, r9, pc, ror #6
    6d40:	6f665f5f 	svcvs	0x00665f5f
    6d44:	74616d72 	strbtvc	r6, [r1], #-3442	@ 0xfffff28e
    6d48:	6772615f 			@ <UNDEFINED> instruction: 0x6772615f
    6d4c:	746d6628 	strbtvc	r6, [sp], #-1576	@ 0xfffff9d8
    6d50:	29677261 	stmdbcs	r7!, {r0, r5, r6, r9, ip, sp, lr}^
    6d54:	615f5f20 	cmpvs	pc, r0, lsr #30
    6d58:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    6d5c:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    6d60:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    6d64:	6f665f5f 	svcvs	0x00665f5f
    6d68:	74616d72 	strbtvc	r6, [r1], #-3442	@ 0xfffff28e
    6d6c:	6772615f 			@ <UNDEFINED> instruction: 0x6772615f
    6d70:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    6d74:	61746d66 	cmnvs	r4, r6, ror #26
    6d78:	29296772 	stmdbcs	r9!, {r1, r4, r5, r6, r8, r9, sl, sp, lr}
    6d7c:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    6d80:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    6d84:	535f4c52 	cmppl	pc, #20992	@ 0x5200
    6d88:	54434e59 	strbpl	r4, [r3], #-3673	@ 0xfffff1a7
    6d8c:	4d5f5041 	ldclmi	0, cr5, [pc, #-260]	@ 6c90 <_Min_Stack_Size+0x6890>
    6d90:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    6d94:	55337830 	ldrpl	r7, [r3, #-2096]!	@ 0xfffff7d0
    6d98:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    6d9c:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
    6da0:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    6da4:	59535f4c 	ldmdbpl	r3, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    6da8:	4154434e 	cmpmi	r4, lr, asr #6
    6dac:	6f505f50 	svcvs	0x00505f50
    6db0:	53002973 	movwpl	r2, #2419	@ 0x973
    6db4:	5f324950 	svcpl	0x00324950
    6db8:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    6dbc:	65502820 	ldrbvs	r2, [r0, #-2080]	@ 0xfffff7e0
    6dc0:	68706972 	ldmdavs	r0!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    6dc4:	6c617265 	sfmvs	f7, 2, [r1], #-404	@ 0xfffffe6c
    6dc8:	41425f73 	hvcmi	9715	@ 0x25f3
    6dcc:	2b204553 	blcs	818320 <_Min_Stack_Size+0x817f20>
    6dd0:	30783020 	rsbscc	r3, r8, r0, lsr #32
    6dd4:	33303030 	teqcc	r0, #48	@ 0x30
    6dd8:	55303038 	ldrpl	r3, [r0, #-56]!	@ 0xffffffc8
    6ddc:	4400294c 	strmi	r2, [r0], #-2380	@ 0xfffff6b4
    6de0:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    6de4:	5f4c5254 	svcpl	0x004c5254
    6de8:	45435943 	strbmi	r5, [r3, #-2371]	@ 0xfffff6bd
    6dec:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    6df0:	6f505f41 	svcvs	0x00505f41
    6df4:	32322073 	eorscc	r2, r2, #115	@ 0x73
    6df8:	50780055 	rsbspl	r0, r8, r5, asr r0
    6dfc:	435f5253 	cmpmi	pc, #805306373	@ 0x30000005
    6e00:	6b734d5f 	blvs	1cda384 <_Min_Stack_Size+0x1cd9f84>
    6e04:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    6e08:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    6e0c:	53507820 	cmppl	r0, #32, 16	@ 0x200000
    6e10:	5f435f52 	svcpl	0x00435f52
    6e14:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    6e18:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    6e1c:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    6e20:	4f505f4c 	svcmi	0x00505f4c
    6e24:	4e495453 	mcrmi	4, 2, r5, cr9, cr3, {2}
    6e28:	505f5449 	subspl	r5, pc, r9, asr #8
    6e2c:	3520736f 	strcc	r7, [r0, #-879]!	@ 0xfffffc91
    6e30:	43530055 	cmpmi	r3, #85	@ 0x55
    6e34:	50435f42 	subpl	r5, r3, r2, asr #30
    6e38:	5f444955 	svcpl	0x00444955
    6e3c:	48435241 	stmdami	r3, {r0, r6, r9, ip, lr}^
    6e40:	43455449 	movtmi	r5, #21577	@ 0x5449
    6e44:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
    6e48:	736f505f 	cmnvc	pc, #95	@ 0x5f
    6e4c:	55363120 	ldrpl	r3, [r6, #-288]!	@ 0xfffffee0
    6e50:	45445f00 	strbmi	r5, [r4, #-3840]	@ 0xfffff100
    6e54:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    6e58:	4f535f54 	svcmi	0x00535f54
    6e5c:	45435255 	strbmi	r5, [r3, #-597]	@ 0xfffffdab
    6e60:	4d544900 	vldrmi.16	s9, [r4, #-0]	@ <UNPREDICTABLE>
    6e64:	5243545f 	subpl	r5, r3, #1593835520	@ 0x5f000000
    6e68:	5053545f 	subspl	r5, r3, pc, asr r4
    6e6c:	63736572 	cmnvs	r3, #478150656	@ 0x1c800000
    6e70:	5f656c61 	svcpl	0x00656c61
    6e74:	20736f50 	rsbscs	r6, r3, r0, asr pc
    6e78:	4d544928 	vldrmi.16	s9, [r4, #-80]	@ 0xffffffb0	@ <UNPREDICTABLE>
    6e7c:	5243545f 	subpl	r5, r3, #1593835520	@ 0x5f000000
    6e80:	5053545f 	subspl	r5, r3, pc, asr r4
    6e84:	43534552 	cmpmi	r3, #343932928	@ 0x14800000
    6e88:	5f454c41 	svcpl	0x00454c41
    6e8c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    6e90:	43324900 	teqmi	r2, #0, 18
    6e94:	3152535f 	cmpcc	r2, pc, asr r3
    6e98:	4c52415f 	ldfmie	f4, [r2], {95}	@ 0x5f
    6e9c:	734d5f4f 	movtvc	r5, #57167	@ 0xdf4f
    6ea0:	3028206b 	eorcc	r2, r8, fp, rrx
    6ea4:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    6ea8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    6eac:	5f433249 	svcpl	0x00433249
    6eb0:	5f315253 	svcpl	0x00315253
    6eb4:	4f4c5241 	svcmi	0x004c5241
    6eb8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    6ebc:	50470029 	subpl	r0, r7, r9, lsr #32
    6ec0:	5f424f49 	svcpl	0x00424f49
    6ec4:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    6ec8:	65502820 	ldrbvs	r2, [r0, #-2080]	@ 0xfffff7e0
    6ecc:	68706972 	ldmdavs	r0!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    6ed0:	6c617265 	sfmvs	f7, 2, [r1], #-404	@ 0xfffffe6c
    6ed4:	41425f73 	hvcmi	9715	@ 0x25f3
    6ed8:	2b204553 	blcs	81842c <_Min_Stack_Size+0x81802c>
    6edc:	30783020 	rsbscc	r3, r8, r0, lsr #32
    6ee0:	30313030 	eorscc	r3, r1, r0, lsr r0
    6ee4:	55303043 	ldrpl	r3, [r0, #-67]!	@ 0xffffffbd
    6ee8:	5300294c 	movwpl	r2, #2380	@ 0x94c
    6eec:	485f4243 	ldmdami	pc, {r0, r1, r6, r9, lr}^	@ <UNPREDICTABLE>
    6ef0:	5f525346 	svcpl	0x00525346
    6ef4:	55424544 	strbpl	r4, [r2, #-1348]	@ 0xfffffabc
    6ef8:	54564547 	ldrbpl	r4, [r6], #-1351	@ 0xfffffab9
    6efc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    6f00:	55313320 	ldrpl	r3, [r1, #-800]!	@ 0xfffffce0
    6f04:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    6f08:	435f3631 	cmpmi	pc, #51380224	@ 0x3100000
    6f0c:	20297828 	eorcs	r7, r9, r8, lsr #16
    6f10:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    6f14:	5f363154 	svcpl	0x00363154
    6f18:	29782843 	ldmdbcs	r8!, {r0, r1, r6, fp, sp}^
    6f1c:	52545000 	subspl	r5, r4, #0
    6f20:	46464944 	strbmi	r4, [r6], -r4, asr #18
    6f24:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    6f28:	502d2820 	eorpl	r2, sp, r0, lsr #16
    6f2c:	49445254 	stmdbmi	r4, {r2, r4, r6, r9, ip, lr}^
    6f30:	4d5f4646 	ldclmi	6, cr4, [pc, #-280]	@ 6e20 <_Min_Stack_Size+0x6a20>
    6f34:	2d205841 	stccs	8, cr5, [r0, #-260]!	@ 0xfffffefc
    6f38:	00293120 	eoreq	r3, r9, r0, lsr #2
    6f3c:	46575f5f 	usaxmi	r5, r7, pc	@ <UNPREDICTABLE>
    6f40:	20292849 	eorcs	r2, r9, r9, asr #16
    6f44:	53415f5f 	movtpl	r5, #8031	@ 0x1f5f
    6f48:	6f76204d 	svcvs	0x0076204d
    6f4c:	6974616c 	ldmdbvs	r4!, {r2, r3, r5, r6, r8, sp, lr}^
    6f50:	2820656c 	stmdacs	r0!, {r2, r3, r5, r6, r8, sl, sp, lr}
    6f54:	69667722 	stmdbvs	r6!, {r1, r5, r8, r9, sl, ip, sp, lr}^
    6f58:	3a3a3a22 	bcc	e957e8 <_Min_Stack_Size+0xe953e8>
    6f5c:	6d656d22 	stclvs	13, cr6, [r5, #-136]!	@ 0xffffff78
    6f60:	2279726f 	rsbscs	r7, r9, #-268435450	@ 0xf0000006
    6f64:	79530029 	ldmdbvc	r3, {r0, r3, r5}^
    6f68:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    6f6c:	54435f6b 	strbpl	r5, [r3], #-3947	@ 0xfffff095
    6f70:	435f4c52 	cmpmi	pc, #20992	@ 0x5200
    6f74:	544e554f 	strbpl	r5, [lr], #-1359	@ 0xfffffab1
    6f78:	47414c46 	strbmi	r4, [r1, -r6, asr #24]
    6f7c:	6b734d5f 	blvs	1cda500 <_Min_Stack_Size+0x1cda100>
    6f80:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    6f84:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    6f88:	73795320 	cmnvc	r9, #32, 6	@ 0x80000000
    6f8c:	6b636954 	blvs	18e14e4 <_Min_Stack_Size+0x18e10e4>
    6f90:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    6f94:	4f435f4c 	svcmi	0x00435f4c
    6f98:	46544e55 			@ <UNDEFINED> instruction: 0x46544e55
    6f9c:	5f47414c 	svcpl	0x0047414c
    6fa0:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    6fa4:	42435300 	submi	r5, r3, #0, 6
    6fa8:	5346485f 	movtpl	r4, #26719	@ 0x685f
    6fac:	45565f52 	ldrbmi	r5, [r6, #-3922]	@ 0xfffff0ae
    6fb0:	42545443 	subsmi	r5, r4, #1124073472	@ 0x43000000
    6fb4:	734d5f4c 	movtvc	r5, #57164	@ 0xdf4c
    6fb8:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    6fbc:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    6fc0:	4353203c 	cmpmi	r3, #60	@ 0x3c
    6fc4:	46485f42 	strbmi	r5, [r8], -r2, asr #30
    6fc8:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    6fcc:	54544345 	ldrbpl	r4, [r4], #-837	@ 0xfffffcbb
    6fd0:	505f4c42 	subspl	r4, pc, r2, asr #24
    6fd4:	0029736f 	eoreq	r7, r9, pc, ror #6
    6fd8:	5f424353 	svcpl	0x00424353
    6fdc:	52534648 	subspl	r4, r3, #72, 12	@ 0x4800000
    6fe0:	524f465f 	subpl	r4, pc, #99614720	@ 0x5f00000
    6fe4:	5f444543 	svcpl	0x00444543
    6fe8:	20736f50 	rsbscs	r6, r3, r0, asr pc
    6fec:	00553033 	subseq	r3, r5, r3, lsr r0
    6ff0:	5f545744 	svcpl	0x00545744
    6ff4:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    6ff8:	5343505f 	movtpl	r5, #12383	@ 0x305f
    6ffc:	4c504d41 	mrrcmi	13, 4, r4, r0, cr1
    7000:	5f414e45 	svcpl	0x00414e45
    7004:	206b734d 	rsbcs	r7, fp, sp, asr #6
    7008:	31783028 	cmncc	r8, r8, lsr #32
    700c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    7010:	5744203c 	smlaldxpl	r2, r4, ip, r0
    7014:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    7018:	505f4c52 	subspl	r4, pc, r2, asr ip	@ <UNPREDICTABLE>
    701c:	4d415343 	stclmi	3, cr5, [r1, #-268]	@ 0xfffffef4
    7020:	4e454c50 	mcrmi	12, 2, r4, cr5, cr0, {2}
    7024:	6f505f41 	svcvs	0x00505f41
    7028:	78002973 	stmdavc	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
    702c:	5f525350 	svcpl	0x00525350
    7030:	734d5f56 	movtvc	r5, #57174	@ 0xdf56
    7034:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    7038:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    703c:	5078203c 	rsbspl	r2, r8, ip, lsr r0
    7040:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    7044:	736f505f 	cmnvc	pc, #95	@ 0x5f
    7048:	50540029 	subspl	r0, r4, r9, lsr #32
    704c:	45445f49 	strbmi	r5, [r4, #-3913]	@ 0xfffff0b7
    7050:	50595456 	subspl	r5, r9, r6, asr r4
    7054:	75535f45 	ldrbvc	r5, [r3, #-3909]	@ 0xfffff0bb
    7058:	70795462 	rsbsvc	r5, r9, r2, ror #8
    705c:	6f505f65 	svcvs	0x00505f65
    7060:	55342073 	ldrpl	r2, [r4, #-115]!	@ 0xffffff8d
    7064:	6e5f5f00 	cdpvs	15, 5, cr5, cr15, cr0, {0}
    7068:	756e6e6f 	strbvc	r6, [lr, #-3695]!	@ 0xfffff191
    706c:	78286c6c 	stmdavc	r8!, {r2, r3, r5, r6, sl, fp, sp, lr}
    7070:	5f5f2029 	svcpl	0x005f2029
    7074:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    7078:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    707c:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    7080:	6e5f5f28 	cdpvs	15, 5, cr5, cr15, cr8, {1}
    7084:	756e6e6f 	strbvc	r6, [lr, #-3695]!	@ 0xfffff191
    7088:	5f5f6c6c 	svcpl	0x005f6c6c
    708c:	29297820 	stmdbcs	r9!, {r5, fp, ip, sp, lr}
    7090:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    7094:	4f4d5f4f 	svcmi	0x004d5f4f
    7098:	415f4544 	cmpmi	pc, r4, asr #10
    709c:	4f4c414e 	svcmi	0x004c414e
    70a0:	78302047 	ldmdavc	r0!, {r0, r1, r2, r6, sp}
    70a4:	30303030 	eorscc	r3, r0, r0, lsr r0
    70a8:	30303030 	eorscc	r3, r0, r0, lsr r0
    70ac:	79530075 	ldmdbvc	r3, {r0, r2, r4, r5, r6}^
    70b0:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    70b4:	41435f6b 	cmpmi	r3, fp, ror #30
    70b8:	5f42494c 	svcpl	0x0042494c
    70bc:	45524f4e 	ldrbmi	r4, [r2, #-3918]	@ 0xfffff0b2
    70c0:	6f505f46 	svcvs	0x00505f46
    70c4:	31332073 	teqcc	r3, r3, ror r0
    70c8:	54490055 	strbpl	r0, [r9], #-85	@ 0xffffffab
    70cc:	43545f4d 	cmpmi	r4, #308	@ 0x134
    70d0:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    70d4:	4d5f5953 	vldrmi.16	s11, [pc, #-166]	@ 7036 <_Min_Stack_Size+0x6c36>	@ <UNPREDICTABLE>
    70d8:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    70dc:	204c5531 	subcs	r5, ip, r1, lsr r5
    70e0:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    70e4:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ 70ec <_Min_Stack_Size+0x6cec>
    70e8:	425f5243 	subsmi	r5, pc, #805306372	@ 0x30000004
    70ec:	5f595355 	svcpl	0x00595355
    70f0:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    70f4:	43324900 	teqmi	r2, #0, 18
    70f8:	3152535f 	cmpcc	r2, pc, asr r3
    70fc:	5f46415f 	svcpl	0x0046415f
    7100:	206b734d 	rsbcs	r7, fp, sp, asr #6
    7104:	31783028 	cmncc	r8, r8, lsr #32
    7108:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    710c:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    7110:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    7114:	46415f31 			@ <UNDEFINED> instruction: 0x46415f31
    7118:	736f505f 	cmnvc	pc, #95	@ 0x5f
    711c:	50540029 	subspl	r0, r4, r9, lsr #32
    7120:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    7124:	5f304f46 	svcpl	0x00304f46
    7128:	5f4d5445 	svcpl	0x004d5445
    712c:	65747962 	ldrbvs	r7, [r4, #-2402]!	@ 0xfffff69e
    7130:	6e756f63 	cdpvs	15, 7, cr6, cr5, cr3, {3}
    7134:	6f505f74 	svcvs	0x00505f74
    7138:	34322073 	ldrtcc	r2, [r2], #-115	@ 0xffffff8d
    713c:	5f5f0055 	svcpl	0x005f0055
    7140:	61746164 	cmnvs	r4, r4, ror #2
    7144:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    7148:	7079745f 	rsbsvc	r7, r9, pc, asr r4
    714c:	61745f65 	cmnvs	r4, r5, ror #30
    7150:	696b2867 	stmdbvs	fp!, {r0, r1, r2, r5, r6, fp, sp}^
    7154:	742c646e 	strtvc	r6, [ip], #-1134	@ 0xfffffb92
    7158:	29657079 	stmdbcs	r5!, {r0, r3, r4, r5, r6, ip, sp, lr}^
    715c:	50540020 	subspl	r0, r4, r0, lsr #32
    7160:	46465f49 	strbmi	r5, [r6], -r9, asr #30
    7164:	545f5253 	ldrbpl	r5, [pc], #-595	@ 716c <_Min_Stack_Size+0x6d6c>
    7168:	65725043 	ldrbvs	r5, [r2, #-67]!	@ 0xffffffbd
    716c:	746e6573 	strbtvc	r6, [lr], #-1395	@ 0xfffffa8d
    7170:	736f505f 	cmnvc	pc, #95	@ 0x5f
    7174:	00553220 	subseq	r3, r5, r0, lsr #4
    7178:	4349564e 	movtmi	r5, #38478	@ 0x964e
    717c:	4954535f 	ldmdbmi	r4, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    7180:	4e495f52 	mcrmi	15, 2, r5, cr9, cr2, {2}
    7184:	5f444954 	svcpl	0x00444954
    7188:	20736f50 	rsbscs	r6, r3, r0, asr pc
    718c:	5f005530 	svcpl	0x00005530
    7190:	41464544 	cmpmi	r6, r4, asr #10
    7194:	5f544c55 	svcpl	0x00544c55
    7198:	52554f53 	subspl	r4, r5, #332	@ 0x14c
    719c:	31204543 			@ <UNDEFINED> instruction: 0x31204543
    71a0:	43575f00 	cmpmi	r7, #0, 30
    71a4:	5f524148 	svcpl	0x00524148
    71a8:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    71ac:	454e4946 	strbmi	r4, [lr, #-2374]	@ 0xfffff6ba
    71b0:	00205f44 	eoreq	r5, r0, r4, asr #30
    71b4:	5f545744 	svcpl	0x00545744
    71b8:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    71bc:	4c4f465f 	mcrrmi	6, 5, r4, pc, cr15
    71c0:	54564544 	ldrbpl	r4, [r6], #-1348	@ 0xfffffabc
    71c4:	5f414e45 	svcpl	0x00414e45
    71c8:	206b734d 	rsbcs	r7, fp, sp, asr #6
    71cc:	31783028 	cmncc	r8, r8, lsr #32
    71d0:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    71d4:	5744203c 	smlaldxpl	r2, r4, ip, r0
    71d8:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    71dc:	465f4c52 			@ <UNDEFINED> instruction: 0x465f4c52
    71e0:	45444c4f 	strbmi	r4, [r4, #-3151]	@ 0xfffff3b1
    71e4:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    71e8:	6f505f41 	svcvs	0x00505f41
    71ec:	5f002973 	svcpl	0x00002973
    71f0:	53424f5f 	movtpl	r4, #12127	@ 0x2f5f
    71f4:	54454c4f 	strbpl	r4, [r5], #-3151	@ 0xfffff3b1
    71f8:	414d5f45 	cmpmi	sp, r5, asr #30
    71fc:	445f4854 	ldrbmi	r4, [pc], #-2132	@ 7204 <_Min_Stack_Size+0x6e04>
    7200:	55414645 	strbpl	r4, [r1, #-1605]	@ 0xfffff9bb
    7204:	3120544c 			@ <UNDEFINED> instruction: 0x3120544c
    7208:	625f5f00 	subsvs	r5, pc, #0, 30
    720c:	646e756f 	strbtvs	r7, [lr], #-1391	@ 0xfffffa91
    7210:	00206465 	eoreq	r6, r0, r5, ror #8
    7214:	696d6954 	stmdbvs	sp!, {r2, r4, r6, r8, fp, sp, lr}^
    7218:	6157676e 	cmpvs	r7, lr, ror #14
    721c:	6e697469 	cdpvs	4, 6, cr7, cr9, cr9, {3}
    7220:	00745f67 	rsbseq	r5, r4, r7, ror #30
    7224:	5f434352 	svcpl	0x00434352
    7228:	31433249 	cmpcc	r3, r9, asr #4
    722c:	4b4c435f 	blmi	1317fb0 <_Min_Stack_Size+0x1317bb0>
    7230:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    7234:	52282029 	eorpl	r2, r8, #41	@ 0x29
    7238:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    723c:	31425041 	cmpcc	r2, r1, asr #32
    7240:	20524e45 	subscs	r4, r2, r5, asr #28
    7244:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    7248:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    724c:	29313220 	ldmdbcs	r1!, {r5, r9, ip, sp}
    7250:	50470029 	subpl	r0, r7, r9, lsr #32
    7254:	20444f49 	subcs	r4, r4, r9, asr #30
    7258:	50472828 	subpl	r2, r7, r8, lsr #16
    725c:	545f4f49 	ldrbpl	r4, [pc], #-3913	@ 7264 <_Min_Stack_Size+0x6e64>
    7260:	44657079 	strbtmi	r7, [r5], #-121	@ 0xffffff87
    7264:	2a206665 	bcs	820c00 <_Min_Stack_Size+0x820800>
    7268:	49504729 	ldmdbmi	r0, {r0, r3, r5, r8, r9, sl, lr}^
    726c:	425f444f 	subsmi	r4, pc, #1325400064	@ 0x4f000000
    7270:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    7274:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    7278:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    727c:	455f304f 	ldrbmi	r3, [pc, #-79]	@ 7235 <_Min_Stack_Size+0x6e35>
    7280:	5f314d54 	svcpl	0x00314d54
    7284:	206b734d 	rsbcs	r7, fp, sp, asr #6
    7288:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    728c:	204c5546 	subcs	r5, ip, r6, asr #10
    7290:	54203c3c 	strtpl	r3, [r0], #-3132	@ 0xfffff3c4
    7294:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    7298:	304f4649 	subcc	r4, pc, r9, asr #12
    729c:	4d54455f 	cfldr64mi	mvdx4, [r4, #-380]	@ 0xfffffe84
    72a0:	6f505f31 	svcvs	0x00505f31
    72a4:	5f002973 	svcpl	0x00002973
    72a8:	6e695f5f 	mcrvs	15, 3, r5, cr9, cr15, {2}
    72ac:	656c5f74 	strbvs	r5, [ip, #-3956]!	@ 0xfffff08c
    72b0:	38747361 	ldmdacc	r4!, {r0, r5, r6, r8, r9, ip, sp, lr}^
    72b4:	645f745f 	ldrbvs	r7, [pc], #-1119	@ 72bc <_Min_Stack_Size+0x6ebc>
    72b8:	6e696665 	cdpvs	6, 6, cr6, cr9, cr5, {3}
    72bc:	31206465 			@ <UNDEFINED> instruction: 0x31206465
    72c0:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    72c4:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    72c8:	455f314f 	ldrbmi	r3, [pc, #-335]	@ 7181 <_Min_Stack_Size+0x6d81>
    72cc:	625f4d54 	subsvs	r4, pc, #84, 26	@ 0x1500
    72d0:	63657479 	cmnvs	r5, #2030043136	@ 0x79000000
    72d4:	746e756f 	strbtvc	r7, [lr], #-1391	@ 0xfffffa91
    72d8:	6b734d5f 	blvs	1cda85c <_Min_Stack_Size+0x1cda45c>
    72dc:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    72e0:	204c5533 	subcs	r5, ip, r3, lsr r5
    72e4:	54203c3c 	strtpl	r3, [r0], #-3132	@ 0xfffff3c4
    72e8:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    72ec:	314f4649 	cmpcc	pc, r9, asr #12
    72f0:	4d54455f 	cfldr64mi	mvdx4, [r4, #-380]	@ 0xfffffe84
    72f4:	7479625f 	ldrbtvc	r6, [r9], #-607	@ 0xfffffda1
    72f8:	756f6365 	strbvc	r6, [pc, #-869]!	@ 6f9b <_Min_Stack_Size+0x6b9b>
    72fc:	505f746e 	subspl	r7, pc, lr, ror #8
    7300:	0029736f 	eoreq	r7, r9, pc, ror #6
    7304:	6d656c65 	stclvs	12, cr6, [r5, #-404]!	@ 0xfffffe6c
    7308:	5f746e65 	svcpl	0x00746e65
    730c:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    7310:	73615420 	cmnvc	r1, #32, 8	@ 0x20000000
    7314:	65725f6b 	ldrbvs	r5, [r2, #-3947]!	@ 0xfffff095
    7318:	5f002a66 	svcpl	0x00002a66
    731c:	6772615f 			@ <UNDEFINED> instruction: 0x6772615f
    7320:	7079745f 	rsbsvc	r7, r9, pc, asr r4
    7324:	61745f65 	cmnvs	r4, r5, ror #30
    7328:	72612867 	rsbvc	r2, r1, #6750208	@ 0x670000
    732c:	696b5f67 	stmdbvs	fp!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    7330:	612c646e 			@ <UNDEFINED> instruction: 0x612c646e
    7334:	695f6772 	ldmdbvs	pc, {r1, r4, r5, r6, r8, r9, sl, sp, lr}^	@ <UNPREDICTABLE>
    7338:	742c7864 	strtvc	r7, [ip], #-2148	@ 0xfffff79c
    733c:	5f657079 	svcpl	0x00657079
    7340:	5f676174 	svcpl	0x00676174
    7344:	29786469 	ldmdbcs	r8!, {r0, r3, r5, r6, sl, sp, lr}^
    7348:	32490020 	subcc	r0, r9, #32
    734c:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    7350:	43415f31 	movtmi	r5, #7985	@ 0x1f31
    7354:	3249204b 	subcc	r2, r9, #75	@ 0x4b
    7358:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    735c:	43415f31 	movtmi	r5, #7985	@ 0x1f31
    7360:	734d5f4b 	movtvc	r5, #57163	@ 0xdf4b
    7364:	415f006b 	cmpmi	pc, fp, rrx
    7368:	49584554 	ldmdbmi	r8, {r2, r4, r6, r8, sl, lr}^
    736c:	59445f54 	stmdbpl	r4, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    7370:	494d414e 	stmdbmi	sp, {r1, r2, r3, r6, r8, lr}^
    7374:	4c415f43 	mcrrmi	15, 4, r5, r1, cr3
    7378:	20434f4c 	subcs	r4, r3, ip, asr #30
    737c:	525f0031 	subspl	r0, pc, #49	@ 0x31
    7380:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    7384:	4548435f 	strbmi	r4, [r8, #-863]	@ 0xfffffca1
    7388:	535f4b43 	cmppl	pc, #68608	@ 0x10c00
    738c:	414e4749 	cmpmi	lr, r9, asr #14
    7390:	55425f4c 	strbpl	r5, [r2, #-3916]	@ 0xfffff0b4
    7394:	61762846 	cmnvs	r6, r6, asr #16
    7398:	5f202972 	svcpl	0x00202972
    739c:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    73a0:	48435f54 	stmdami	r3, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    73a4:	284b4345 	stmdacs	fp, {r0, r2, r6, r8, r9, lr}^
    73a8:	2c726176 	ldfcse	f6, [r2], #-472	@ 0xfffffe28
    73ac:	69735f20 	ldmdbvs	r3!, {r5, r8, r9, sl, fp, ip, lr}^
    73b0:	6c616e67 	stclvs	14, cr6, [r1], #-412	@ 0xfffffe64
    73b4:	6675625f 			@ <UNDEFINED> instruction: 0x6675625f
    73b8:	6863202c 	stmdavs	r3!, {r2, r3, r5, sp}^
    73bc:	2a207261 	bcs	823d48 <_Min_Stack_Size+0x823948>
    73c0:	525f202c 	subspl	r2, pc, #44	@ 0x2c
    73c4:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    73c8:	4749535f 	smlsldmi	r5, r9, pc, r3	@ <UNPREDICTABLE>
    73cc:	5f4c414e 	svcpl	0x004c414e
    73d0:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    73d4:	0029202c 	eoreq	r2, r9, ip, lsr #32
    73d8:	5f4d5241 	svcpl	0x004d5241
    73dc:	5f55504d 	svcpl	0x0055504d
    73e0:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    73e4:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    73e8:	5f455a49 	svcpl	0x00455a49
    73ec:	4b363532 	blmi	d948bc <_Min_Stack_Size+0xd944bc>
    73f0:	28282042 	stmdacs	r8!, {r1, r6, sp}
    73f4:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    73f8:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    73fc:	31317830 	teqcc	r1, r0, lsr r8
    7400:	41002955 	tstmi	r0, r5, asr r9
    7404:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 72c4 <_Min_Stack_Size+0x6ec4>
    7408:	415f5550 	cmpmi	pc, r0, asr r5	@ <UNPREDICTABLE>
    740c:	53454343 	movtpl	r4, #21315	@ 0x5343
    7410:	4f4e5f53 	svcmi	0x004e5f53
    7414:	4c414d52 	mcrrmi	13, 5, r4, r1, cr2
    7418:	74754f28 	ldrbtvc	r4, [r5], #-3880	@ 0xfffff0d8
    741c:	70437265 	subvc	r7, r3, r5, ror #4
    7420:	6e6e492c 	vmulvs.f16	s9, s28, s25	@ <UNPREDICTABLE>
    7424:	70437265 	subvc	r7, r3, r5, ror #4
    7428:	5373492c 	cmnpl	r3, #44, 18	@ 0xb0000
    742c:	65726168 	ldrbvs	r6, [r2, #-360]!	@ 0xfffffe98
    7430:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    7434:	52412029 	subpl	r2, r1, #41	@ 0x29
    7438:	504d5f4d 	subpl	r5, sp, sp, asr #30
    743c:	43415f55 	movtmi	r5, #8021	@ 0x1f55
    7440:	53534543 	cmppl	r3, #281018368	@ 0x10c00000
    7444:	3428285f 	strtcc	r2, [r8], #-2143	@ 0xfffff7a1
    7448:	207c2055 	rsbscs	r2, ip, r5, asr r0
    744c:	74754f28 	ldrbtvc	r4, [r5], #-3880	@ 0xfffff0d8
    7450:	70437265 	subvc	r7, r3, r5, ror #4
    7454:	202c2929 	eorcs	r2, ip, r9, lsr #18
    7458:	68537349 	ldmdavs	r3, {r0, r3, r6, r8, r9, ip, sp, lr}^
    745c:	61657261 	cmnvs	r5, r1, ror #4
    7460:	2c656c62 	stclcs	12, cr6, [r5], #-392	@ 0xfffffe78
    7464:	49282820 	stmdbmi	r8!, {r5, fp, sp}
    7468:	72656e6e 	rsbvc	r6, r5, #1760	@ 0x6e0
    746c:	20297043 	eorcs	r7, r9, r3, asr #32
    7470:	31203e3e 			@ <UNDEFINED> instruction: 0x31203e3e
    7474:	202c2955 	eorcs	r2, ip, r5, asr r9
