NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    7478:	6e492828 	cdpvs	8, 4, cr2, cr9, cr8, {1}
    747c:	4372656e 	cmnmi	r2, #461373440	@ 0x1b800000
    7480:	26202970 			@ <UNDEFINED> instruction: 0x26202970
    7484:	29553120 	ldmdbcs	r5, {r5, r8, ip, sp}^
    7488:	50470029 	subpl	r0, r7, r9, lsr #32
    748c:	505f4f49 	subspl	r4, pc, r9, asr #30
    7490:	315f4e49 	cmpcc	pc, r9, asr #28
    7494:	28282031 	stmdacs	r8!, {r0, r4, r5, sp}
    7498:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    749c:	745f3631 	ldrbvc	r3, [pc], #-1585	@ 74a4 <_Min_Stack_Size+0x70a4>
    74a0:	30783029 	rsbscc	r3, r8, r9, lsr #32
    74a4:	29303038 	ldmdbcs	r0!, {r3, r4, r5, ip, sp}
    74a8:	41535500 	cmpmi	r3, r0, lsl #10
    74ac:	5f325452 	svcpl	0x00325452
    74b0:	20515249 	subscs	r5, r1, r9, asr #4
    74b4:	5f003833 	svcpl	0x00003833
    74b8:	7373615f 	cmnvc	r3, #-1073741801	@ 0xc0000017
    74bc:	73747265 	cmnvc	r4, #1342177286	@ 0x50000006
    74c0:	6378655f 	cmnvs	r8, #398458880	@ 0x17c00000
    74c4:	6973756c 	ldmdbvs	r3!, {r2, r3, r5, r6, r8, sl, ip, sp, lr}^
    74c8:	2e286576 	mcrcs	5, 1, r6, cr8, cr6, {3}
    74cc:	20292e2e 	eorcs	r2, r9, lr, lsr #28
    74d0:	6f6c5f5f 	svcvs	0x006c5f5f
    74d4:	615f6b63 	cmpvs	pc, r3, ror #22
    74d8:	746f6e6e 	strbtvc	r6, [pc], #-3694	@ 74e0 <_Min_Stack_Size+0x70e0>
    74dc:	28657461 	stmdacs	r5!, {r0, r5, r6, sl, ip, sp, lr}^
    74e0:	65737361 	ldrbvs	r7, [r3, #-865]!	@ 0xfffffc9f
    74e4:	655f7472 	ldrbvs	r7, [pc, #-1138]	@ 707a <_Min_Stack_Size+0x6c7a>
    74e8:	756c6378 	strbvc	r6, [ip, #-888]!	@ 0xfffffc88
    74ec:	65766973 	ldrbvs	r6, [r6, #-2419]!	@ 0xfffff68d
    74f0:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    74f4:	5f5f286b 	svcpl	0x005f286b
    74f8:	415f4156 	cmpmi	pc, r6, asr r1	@ <UNPREDICTABLE>
    74fc:	5f534752 	svcpl	0x00534752
    7500:	0029295f 	eoreq	r2, r9, pc, asr r9
    7504:	5f424353 	svcpl	0x00424353
    7508:	43524941 	cmpmi	r2, #1064960	@ 0x104000
    750c:	45565f52 	ldrbmi	r5, [r6, #-3922]	@ 0xfffff0ae
    7510:	454b5443 	strbmi	r5, [fp, #-1091]	@ 0xfffffbbd
    7514:	6f505f59 	svcvs	0x00505f59
    7518:	36312073 			@ <UNDEFINED> instruction: 0x36312073
    751c:	6f430055 	svcvs	0x00430055
    7520:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    7524:	5f677562 	svcpl	0x00677562
    7528:	434d4544 	movtmi	r4, #54596	@ 0xd544
    752c:	43565f52 	cmpmi	r6, #328	@ 0x148
    7530:	5241485f 	subpl	r4, r1, #6225920	@ 0x5f0000
    7534:	52524544 	subspl	r4, r2, #68, 10	@ 0x11000000
    7538:	736f505f 	cmnvc	pc, #95	@ 0x5f
    753c:	55303120 	ldrpl	r3, [r0, #-288]!	@ 0xfffffee0
    7540:	414c4600 	cmpmi	ip, r0, lsl #12
    7544:	4d5f4853 	ldclmi	8, cr4, [pc, #-332]	@ 7400 <_Min_Stack_Size+0x7000>
    7548:	726f6d65 	rsbvc	r6, pc, #6464	@ 0x1940
    754c:	41425f79 	hvcmi	9721	@ 0x25f9
    7550:	30204553 	eorcc	r4, r0, r3, asr r5
    7554:	30383078 	eorscc	r3, r8, r8, ror r0
    7558:	30303030 	eorscc	r3, r0, r0, lsr r0
    755c:	004c5530 	subeq	r5, ip, r0, lsr r5
    7560:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    7564:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    7568:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    756c:	5f525343 	svcpl	0x00525343
    7570:	4b474244 	blmi	11d7e88 <_Min_Stack_Size+0x11d7a88>
    7574:	505f5945 	subspl	r5, pc, r5, asr #18
    7578:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    757c:	53005536 	movwpl	r5, #1334	@ 0x536
    7580:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    7584:	555f5243 	ldrbpl	r5, [pc, #-579]	@ 7349 <_Min_Stack_Size+0x6f49>
    7588:	53524553 	cmppl	r2, #348127232	@ 0x14c00000
    758c:	504d5445 	subpl	r5, sp, r5, asr #8
    7590:	5f444e45 	svcpl	0x00444e45
    7594:	20736f50 	rsbscs	r6, r3, r0, asr pc
    7598:	5f005531 	svcpl	0x00005531
    759c:	57454e5f 	smlsldpl	r4, r5, pc, lr	@ <UNPREDICTABLE>
    75a0:	5f42494c 	svcpl	0x0042494c
    75a4:	4f4e494d 	svcmi	0x004e494d
    75a8:	205f5f52 	subscs	r5, pc, r2, asr pc	@ <UNPREDICTABLE>
    75ac:	43530033 	cmpmi	r3, #51	@ 0x33
    75b0:	46445f42 	strbmi	r5, [r4], -r2, asr #30
    75b4:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    75b8:	5f54504b 	svcpl	0x0054504b
    75bc:	206b734d 	rsbcs	r7, fp, sp, asr #6
    75c0:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    75c4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    75c8:	5f424353 	svcpl	0x00424353
    75cc:	52534644 	subspl	r4, r3, #68, 12	@ 0x4400000
    75d0:	504b425f 	subpl	r4, fp, pc, asr r2
    75d4:	6f505f54 	svcvs	0x00505f54
    75d8:	54002973 	strpl	r2, [r0], #-2419	@ 0xfffff68d
    75dc:	445f4950 	ldrbmi	r4, [pc], #-2384	@ 75e4 <_Min_Stack_Size+0x71e4>
    75e0:	44495645 	strbmi	r5, [r9], #-1605	@ 0xfffff9bb
    75e4:	54724e5f 	ldrbtpl	r4, [r2], #-3679	@ 0xfffff1a1
    75e8:	65636172 	strbvs	r6, [r3, #-370]!	@ 0xfffffe8e
    75ec:	75706e49 	ldrbvc	r6, [r0, #-3657]!	@ 0xfffff1b7
    75f0:	734d5f74 	movtvc	r5, #57204	@ 0xdf74
    75f4:	3028206b 	eorcc	r2, r8, fp, rrx
    75f8:	55463178 	strbpl	r3, [r6, #-376]	@ 0xfffffe88
    75fc:	0029204c 	eoreq	r2, r9, ip, asr #32
    7600:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    7604:	494c4355 	stmdbmi	ip, {r0, r2, r4, r6, r8, r9, lr}^
    7608:	4d5f454b 	cfldr64mi	mvdx4, [pc, #-300]	@ 74e4 <_Min_Stack_Size+0x70e4>
    760c:	5f485441 	svcpl	0x00485441
    7610:	4c495542 	cfstr64mi	mvdx5, [r9], {66}	@ 0x42
    7614:	5f4e4954 	svcpl	0x004e4954
    7618:	4f4c4552 	svcmi	0x004c4552
    761c:	00205350 	eoreq	r5, r0, r0, asr r3
    7620:	5f545744 	svcpl	0x00545744
    7624:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    7628:	4358455f 	cmpmi	r8, #398458880	@ 0x17c00000
    762c:	45435254 	strbmi	r5, [r3, #-596]	@ 0xfffffdac
    7630:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ 7500 <_Min_Stack_Size+0x7100>
    7634:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    7638:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    763c:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    7640:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
    7644:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    7648:	58455f4c 	stmdapl	r5, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    764c:	43525443 	cmpmi	r2, #1124073472	@ 0x43000000
    7650:	5f414e45 	svcpl	0x00414e45
    7654:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    7658:	42435300 	submi	r5, r3, #0, 6
    765c:	5550435f 	ldrbpl	r4, [r0, #-863]	@ 0xfffffca1
    7660:	415f4449 	cmpmi	pc, r9, asr #8
    7664:	49484352 	stmdbmi	r8, {r1, r4, r6, r8, r9, lr}^
    7668:	54434554 	strbpl	r4, [r3], #-1364	@ 0xfffffaac
    766c:	5f455255 	svcpl	0x00455255
    7670:	206b734d 	rsbcs	r7, fp, sp, asr #6
    7674:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    7678:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    767c:	4353203c 	cmpmi	r3, #60	@ 0x3c
    7680:	50435f42 	subpl	r5, r3, r2, asr #30
    7684:	5f444955 	svcpl	0x00444955
    7688:	48435241 	stmdami	r3, {r0, r6, r9, ip, lr}^
    768c:	43455449 	movtmi	r5, #21577	@ 0x5449
    7690:	45525554 	ldrbmi	r5, [r2, #-1364]	@ 0xfffffaac
    7694:	736f505f 	cmnvc	pc, #95	@ 0x5f
    7698:	555f0029 	ldrbpl	r0, [pc, #-41]	@ 7677 <_Min_Stack_Size+0x7277>
    769c:	31544e49 	cmpcc	r4, r9, asr #28
    76a0:	5f545f36 	svcpl	0x00545f36
    76a4:	4c434544 	cfstr64mi	mvdx4, [r3], {68}	@ 0x44
    76a8:	44455241 	strbmi	r5, [r5], #-577	@ 0xfffffdbf
    76ac:	74530020 	ldrbvc	r0, [r3], #-32	@ 0xffffffe0
    76b0:	5f6b6361 	svcpl	0x006b6361
    76b4:	657a6953 	ldrbvs	r6, [sl, #-2387]!	@ 0xfffff6ad
    76b8:	66696600 	strbtvs	r6, [r9], -r0, lsl #12
    76bc:	6f43006f 	svcvs	0x0043006f
    76c0:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    76c4:	5f677562 	svcpl	0x00677562
    76c8:	53434844 	movtpl	r4, #14404	@ 0x3844
    76cc:	5f435f52 	svcpl	0x00435f52
    76d0:	4b53414d 	blmi	14d7c0c <_Min_Stack_Size+0x14d780c>
    76d4:	53544e49 	cmppl	r4, #1168	@ 0x490
    76d8:	6b734d5f 	blvs	1cdac5c <_Min_Stack_Size+0x1cda85c>
    76dc:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    76e0:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    76e4:	726f4320 	rsbvc	r4, pc, #32, 6	@ 0x80000000
    76e8:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    76ec:	445f6775 	ldrbmi	r6, [pc], #-1909	@ 76f4 <_Min_Stack_Size+0x72f4>
    76f0:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    76f4:	4d5f435f 	ldclmi	3, cr4, [pc, #-380]	@ 7580 <_Min_Stack_Size+0x7180>
    76f8:	494b5341 	stmdbmi	fp, {r0, r6, r8, r9, ip, lr}^
    76fc:	5f53544e 	svcpl	0x0053544e
    7700:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    7704:	6e5f5f00 	cdpvs	15, 5, cr5, cr15, cr0, {0}
    7708:	5f646565 	svcpl	0x00646565
    770c:	61765f5f 	cmnvs	r6, pc, asr pc
    7710:	73696c5f 	cmnvc	r9, #24320	@ 0x5f00
    7714:	53002074 	movwpl	r2, #116	@ 0x74
    7718:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    771c:	445f5243 	ldrbmi	r5, [pc], #-579	@ 7724 <_Min_Stack_Size+0x7324>
    7720:	305f5649 	subscc	r5, pc, r9, asr #12
    7724:	5052545f 	subspl	r5, r2, pc, asr r4
    7728:	6b734d5f 	blvs	1cdacac <_Min_Stack_Size+0x1cda8ac>
    772c:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    7730:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    7734:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    7738:	5243435f 	subpl	r4, r3, #2080374785	@ 0x7c000001
    773c:	5649445f 			@ <UNDEFINED> instruction: 0x5649445f
    7740:	545f305f 	ldrbpl	r3, [pc], #-95	@ 7748 <_Min_Stack_Size+0x7348>
    7744:	505f5052 	subspl	r5, pc, r2, asr r0	@ <UNPREDICTABLE>
    7748:	0029736f 	eoreq	r7, r9, pc, ror #6
    774c:	75625f5f 	strbvc	r5, [r2, #-3935]!	@ 0xfffff0a1
    7750:	69746c69 	ldmdbvs	r4!, {r0, r3, r5, r6, sl, fp, sp, lr}^
    7754:	73695f6e 	cmnvc	r9, #440	@ 0x1b8
    7758:	696c615f 	stmdbvs	ip!, {r0, r1, r2, r3, r4, r6, r8, sp, lr}^
    775c:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    7760:	612c7828 			@ <UNDEFINED> instruction: 0x612c7828
    7764:	6e67696c 	vnmulvs.f16	s13, s14, s25	@ <UNPREDICTABLE>
    7768:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    776c:	755f5f28 	ldrbvc	r5, [pc, #-3880]	@ 684c <_Min_Stack_Size+0x644c>
    7770:	70746e69 	rsbsvc	r6, r4, r9, ror #28
    7774:	745f7274 	ldrbvc	r7, [pc], #-628	@ 777c <_Min_Stack_Size+0x737c>
    7778:	26207829 	strtcs	r7, [r0], -r9, lsr #16
    777c:	61282820 			@ <UNDEFINED> instruction: 0x61282820
    7780:	6e67696c 	vnmulvs.f16	s13, s14, s25	@ <UNPREDICTABLE>
    7784:	202d2029 	eorcs	r2, sp, r9, lsr #32
    7788:	20292931 	eorcs	r2, r9, r1, lsr r9
    778c:	30203d3d 	eorcc	r3, r0, sp, lsr sp
    7790:	65520029 	ldrbvs	r0, [r2, #-41]	@ 0xffffffd7
    7794:	00796461 	rsbseq	r6, r9, r1, ror #8
    7798:	5f434352 	svcpl	0x00434352
    779c:	32495053 	subcc	r5, r9, #83	@ 0x53
    77a0:	4b4c435f 	blmi	1318524 <_Min_Stack_Size+0x1318124>
    77a4:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    77a8:	52282029 	eorpl	r2, r8, #41	@ 0x29
    77ac:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    77b0:	31425041 	cmpcc	r2, r1, asr #32
    77b4:	20524e45 	subscs	r4, r2, r5, asr #28
    77b8:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    77bc:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    77c0:	29343120 	ldmdbcs	r4!, {r5, r8, ip, sp}
    77c4:	49460029 	stmdbmi	r6, {r0, r3, r5}^
    77c8:	465f4f46 	ldrbmi	r4, [pc], -r6, asr #30
    77cc:	004c4c55 	subeq	r4, ip, r5, asr ip
    77d0:	63735f5f 	cmnvs	r3, #380	@ 0x17c
    77d4:	7261656c 	rsbvc	r6, r1, #108, 10	@ 0x1b000000
    77d8:	28727265 	ldmdacs	r2!, {r0, r2, r5, r6, r9, ip, sp, lr}^
    77dc:	28202970 	stmdacs	r0!, {r4, r5, r6, r8, fp, sp}
    77e0:	696f7628 	stmdbvs	pc!, {r3, r5, r9, sl, ip, sp, lr}^	@ <UNPREDICTABLE>
    77e4:	28282964 	stmdacs	r8!, {r2, r5, r6, r8, fp, sp}
    77e8:	3e2d2970 			@ <UNDEFINED> instruction: 0x3e2d2970
    77ec:	616c665f 	cmnvs	ip, pc, asr r6
    77f0:	26207367 	strtcs	r7, [r0], -r7, ror #6
    77f4:	287e203d 	ldmdacs	lr!, {r0, r2, r3, r4, r5, sp}^
    77f8:	45535f5f 	ldrbmi	r5, [r3, #-3935]	@ 0xfffff0a1
    77fc:	5f7c5252 	svcpl	0x007c5252
    7800:	4f45535f 	svcmi	0x0045535f
    7804:	29292946 	stmdbcs	r9!, {r1, r2, r6, r8, fp, sp}
    7808:	745f5f00 	ldrbvc	r5, [pc], #-3840	@ 7810 <_Min_Stack_Size+0x7410>
    780c:	6f6c7972 	svcvs	0x006c7972
    7810:	5f736b63 	svcpl	0x00736b63
    7814:	6c637865 	stclvs	8, cr7, [r3], #-404	@ 0xfffffe6c
    7818:	76697375 			@ <UNDEFINED> instruction: 0x76697375
    781c:	2e2e2865 	cdpcs	8, 2, cr2, cr14, cr5, {3}
    7820:	5f20292e 	svcpl	0x0020292e
    7824:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    7828:	6e615f6b 	cdpvs	15, 6, cr5, cr1, cr11, {3}
    782c:	61746f6e 	cmnvs	r4, lr, ror #30
    7830:	65286574 	strvs	r6, [r8, #-1396]!	@ 0xfffffa8c
    7834:	756c6378 	strbvc	r6, [ip, #-888]!	@ 0xfffffc88
    7838:	65766973 	ldrbvs	r6, [r6, #-2419]!	@ 0xfffff68d
    783c:	7972745f 	ldmdbvc	r2!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}^
    7840:	6b636f6c 	blvs	18e35f8 <_Min_Stack_Size+0x18e31f8>
    7844:	6e75665f 	mrcvs	6, 3, r6, cr5, cr15, {2}
    7848:	6f697463 	svcvs	0x00697463
    784c:	5f5f286e 	svcpl	0x005f286e
    7850:	415f4156 	cmpmi	pc, r6, asr r1	@ <UNPREDICTABLE>
    7854:	5f534752 	svcpl	0x00534752
    7858:	0029295f 	eoreq	r2, r9, pc, asr r9
    785c:	5f433249 	svcpl	0x00433249
    7860:	5f315253 	svcpl	0x00315253
    7864:	454d4954 	strbmi	r4, [sp, #-2388]	@ 0xfffff6ac
    7868:	2054554f 	subscs	r5, r4, pc, asr #10
    786c:	5f433249 	svcpl	0x00433249
    7870:	5f315253 	svcpl	0x00315253
    7874:	454d4954 	strbmi	r4, [sp, #-2388]	@ 0xfffff6ac
    7878:	5f54554f 	svcpl	0x0054554f
    787c:	006b734d 	rsbeq	r7, fp, sp, asr #6
    7880:	5f433249 	svcpl	0x00433249
    7884:	5f325243 	svcpl	0x00325243
    7888:	5453414c 	ldrbpl	r4, [r3], #-332	@ 0xfffffeb4
    788c:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    7890:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    7894:	53414c5f 	movtpl	r4, #7263	@ 0x1c5f
    7898:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
    789c:	5355006b 	cmppl	r5, #107	@ 0x6b
    78a0:	33545241 	cmpcc	r4, #268435460	@ 0x10000004
    78a4:	5341425f 	movtpl	r4, #4703	@ 0x125f
    78a8:	50282045 	eorpl	r2, r8, r5, asr #32
    78ac:	70697265 	rsbvc	r7, r9, r5, ror #4
    78b0:	61726568 	cmnvs	r2, r8, ror #10
    78b4:	425f736c 	subsmi	r7, pc, #108, 6	@ 0xb0000001
    78b8:	20455341 	subcs	r5, r5, r1, asr #6
    78bc:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    78c0:	31303030 	teqcc	r0, r0, lsr r0
    78c4:	30303834 	eorscc	r3, r0, r4, lsr r8
    78c8:	00294c55 	eoreq	r4, r9, r5, asr ip
    78cc:	20746e69 	rsbscs	r6, r4, r9, ror #28
    78d0:	4e00322b 	cdpmi	2, 0, cr3, cr0, cr11, {1}
    78d4:	5f434956 	svcpl	0x00434956
    78d8:	39515249 	ldmdbcc	r1, {r0, r3, r6, r9, ip, lr}^
    78dc:	5458455f 	ldrbpl	r4, [r8], #-1375	@ 0xfffffaa1
    78e0:	445f3349 	ldrbmi	r3, [pc], #-841	@ 78e8 <_Min_Stack_Size+0x74e8>
    78e4:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
    78e8:	2928656c 	stmdbcs	r8!, {r2, r3, r5, r6, r8, sl, sp, lr}
    78ec:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    78f0:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    78f4:	30524543 	subscc	r4, r2, r3, asr #10
    78f8:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    78fc:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    7900:	2939203c 	ldmdbcs	r9!, {r2, r3, r4, r5, sp}
    7904:	665f0029 	ldrbvs	r0, [pc], -r9, lsr #32
    7908:	6f6c6e75 	svcvs	0x006c6e75
    790c:	69666b63 	stmdbvs	r6!, {r0, r1, r5, r6, r8, r9, fp, sp, lr}^
    7910:	6628656c 	strtvs	r6, [r8], -ip, ror #10
    7914:	28202970 	stmdacs	r0!, {r4, r5, r6, r8, fp, sp}
    7918:	70662828 	rsbvc	r2, r6, r8, lsr #16
    791c:	5f3e2d29 	svcpl	0x003e2d29
    7920:	67616c66 	strbvs	r6, [r1, -r6, ror #24]!
    7924:	20262073 	eorcs	r2, r6, r3, ror r0
    7928:	53535f5f 	cmppl	r3, #380	@ 0x17c
    792c:	20295254 	eorcs	r5, r9, r4, asr r2
    7930:	2030203f 	eorscs	r2, r0, pc, lsr r0
    7934:	5f5f203a 	svcpl	0x005f203a
    7938:	6b636f6c 	blvs	18e36f0 <_Min_Stack_Size+0x18e32f0>
    793c:	6c65725f 	sfmvs	f7, 2, [r5], #-380	@ 0xfffffe84
    7940:	65736165 	ldrbvs	r6, [r3, #-357]!	@ 0xfffffe9b
    7944:	6365725f 	cmnvs	r5, #-268435451	@ 0xf0000005
    7948:	69737275 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, ip, sp, lr}^
    794c:	28286576 	stmdacs	r8!, {r1, r2, r4, r5, r6, r8, sl, sp, lr}
    7950:	2d297066 	stccs	0, cr7, [r9, #-408]!	@ 0xfffffe68
    7954:	6f6c5f3e 	svcvs	0x006c5f3e
    7958:	29296b63 	stmdbcs	r9!, {r0, r1, r5, r6, r8, r9, fp, sp, lr}
    795c:	525f5f00 	subspl	r5, pc, #0, 30
    7960:	5f444e41 	svcpl	0x00444e41
    7964:	2058414d 	subscs	r4, r8, sp, asr #2
    7968:	66377830 			@ <UNDEFINED> instruction: 0x66377830
    796c:	66666666 	strbtvs	r6, [r6], -r6, ror #12
    7970:	53006666 	movwpl	r6, #1638	@ 0x666
    7974:	415f4243 	cmpmi	pc, r3, asr #4
    7978:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    797c:	444e455f 	strbmi	r4, [lr], #-1375	@ 0xfffffaa1
    7980:	454e4149 	strbmi	r4, [lr, #-329]	@ 0xfffffeb7
    7984:	4d5f5353 	ldclmi	3, cr5, [pc, #-332]	@ 7840 <_Min_Stack_Size+0x7440>
    7988:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    798c:	204c5531 	subcs	r5, ip, r1, lsr r5
    7990:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    7994:	415f4243 	cmpmi	pc, r3, asr #4
    7998:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    799c:	444e455f 	strbmi	r4, [lr], #-1375	@ 0xfffffaa1
    79a0:	454e4149 	strbmi	r4, [lr, #-329]	@ 0xfffffeb7
    79a4:	505f5353 	subspl	r5, pc, r3, asr r3	@ <UNPREDICTABLE>
    79a8:	0029736f 	eoreq	r7, r9, pc, ror #6
    79ac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    79b0:	5341425f 	movtpl	r4, #4703	@ 0x125f
    79b4:	50282045 	eorpl	r2, r8, r5, asr #32
    79b8:	70697265 	rsbvc	r7, r9, r5, ror #4
    79bc:	61726568 	cmnvs	r2, r8, ror #10
    79c0:	425f736c 	subsmi	r7, pc, #108, 6	@ 0xb0000001
    79c4:	20455341 	subcs	r5, r5, r1, asr #6
    79c8:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    79cc:	31303030 	teqcc	r0, r0, lsr r0
    79d0:	30303430 	eorscc	r3, r0, r0, lsr r4
    79d4:	00294c55 	eoreq	r4, r9, r5, asr ip
    79d8:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    79dc:	5f525450 	svcpl	0x00525450
    79e0:	495f5145 	ldmdbmi	pc, {r0, r2, r6, r8, ip, lr}^	@ <UNPREDICTABLE>
    79e4:	0020544e 	eoreq	r5, r0, lr, asr #8
    79e8:	66735f5f 	uhsaxvs	r5, r3, pc	@ <UNPREDICTABLE>
    79ec:	6e656c69 	cdpvs	12, 6, cr6, cr5, cr9, {3}
    79f0:	2970286f 	ldmdbcs	r0!, {r0, r1, r2, r3, r5, r6, fp, sp}^
    79f4:	70282820 	eorvc	r2, r8, r0, lsr #16
    79f8:	5f3e2d29 	svcpl	0x003e2d29
    79fc:	656c6966 	strbvs	r6, [ip, #-2406]!	@ 0xfffff69a
    7a00:	4f430029 	svcmi	0x00430029
    7a04:	4f52544e 	svcmi	0x0052544e
    7a08:	50535f4c 	subspl	r5, r3, ip, asr #30
    7a0c:	5f4c4553 	svcpl	0x004c4553
    7a10:	206b734d 	rsbcs	r7, fp, sp, asr #6
    7a14:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    7a18:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    7a1c:	544e4f43 	strbpl	r4, [lr], #-3907	@ 0xfffff0bd
    7a20:	5f4c4f52 	svcpl	0x004c4f52
    7a24:	45535053 	ldrbmi	r5, [r3, #-83]	@ 0xffffffad
    7a28:	6f505f4c 	svcvs	0x00505f4c
    7a2c:	49002973 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
    7a30:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    7a34:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    7a38:	5355424d 	cmppl	r5, #-805306364	@ 0xd0000004
    7a3c:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    7a40:	3152435f 	cmpcc	r2, pc, asr r3
    7a44:	424d535f 	submi	r5, sp, #2080374785	@ 0x7c000001
    7a48:	4d5f5355 	ldclmi	3, cr5, [pc, #-340]	@ 78fc <_Min_Stack_Size+0x74fc>
    7a4c:	5f006b73 	svcpl	0x00006b73
    7a50:	544e4157 	strbpl	r4, [lr], #-343	@ 0xfffffea9
    7a54:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    7a58:	535f544e 	cmppl	pc, #1308622848	@ 0x4e000000
    7a5c:	4c4c414d 	stfmie	f4, [ip], {77}	@ 0x4d
    7a60:	4d003120 	stfmis	f3, [r0, #-128]	@ 0xffffff80
    7a64:	435f5550 	cmpmi	pc, #80, 10	@ 0x14000000
    7a68:	5f4c5254 	svcpl	0x004c5254
    7a6c:	42414e45 	submi	r4, r1, #1104	@ 0x450
    7a70:	505f454c 	subspl	r4, pc, ip, asr #10
    7a74:	3020736f 	eorcc	r7, r0, pc, ror #6
    7a78:	57440055 	smlsldpl	r0, r4, r5, r0
    7a7c:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    7a80:	435f4c52 	cmpmi	pc, #20992	@ 0x5200
    7a84:	56454359 			@ <UNDEFINED> instruction: 0x56454359
    7a88:	414e4554 	cmpmi	lr, r4, asr r5
    7a8c:	6b734d5f 	blvs	1cdb010 <_Min_Stack_Size+0x1cdac10>
    7a90:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    7a94:	204c5531 	subcs	r5, ip, r1, lsr r5
    7a98:	44203c3c 	strtmi	r3, [r0], #-3132	@ 0xfffff3c4
    7a9c:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    7aa0:	5f4c5254 	svcpl	0x004c5254
    7aa4:	45435943 	strbmi	r5, [r3, #-2371]	@ 0xfffff6bd
    7aa8:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    7aac:	6f505f41 	svcvs	0x00505f41
    7ab0:	5f002973 	svcpl	0x00002973
    7ab4:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    7ab8:	4e495f54 	mcrmi	15, 2, r5, cr9, cr4, {2}
    7abc:	505f5449 	subspl	r5, pc, r9, asr #8
    7ac0:	76285254 			@ <UNDEFINED> instruction: 0x76285254
    7ac4:	20297261 	eorcs	r7, r9, r1, ror #4
    7ac8:	656d207b 	strbvs	r2, [sp, #-123]!	@ 0xffffff85
    7acc:	7465736d 	strbtvc	r7, [r5], #-877	@ 0xfffffc93
    7ad0:	61762828 	cmnvs	r6, r8, lsr #16
    7ad4:	202c2972 	eorcs	r2, ip, r2, ror r9
    7ad8:	73202c30 			@ <UNDEFINED> instruction: 0x73202c30
    7adc:	6f657a69 	svcvs	0x00657a69
    7ae0:	282a2866 	stmdacs	sl!, {r1, r2, r5, r6, fp, sp}
    7ae4:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    7ae8:	203b2929 	eorscs	r2, fp, r9, lsr #18
    7aec:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    7af0:	495f544e 	ldmdbmi	pc, {r1, r2, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    7af4:	5f54494e 	svcpl	0x0054494e
    7af8:	5f525450 	svcpl	0x00525450
    7afc:	4f52455a 	svcmi	0x0052455a
    7b00:	76284445 	strtvc	r4, [r8], -r5, asr #8
    7b04:	3b297261 	blcc	a64490 <_Min_Stack_Size+0xa64090>
    7b08:	5f007d20 	svcpl	0x00007d20
    7b0c:	57454e5f 	smlsldpl	r4, r5, pc, lr	@ <UNPREDICTABLE>
    7b10:	5f42494c 	svcpl	0x0042494c
    7b14:	43544150 	cmpmi	r4, #80, 2
    7b18:	56454c48 	strbpl	r4, [r5], -r8, asr #24
    7b1c:	5f5f4c45 	svcpl	0x005f4c45
    7b20:	44003020 	strmi	r3, [r0], #-32	@ 0xffffffe0
    7b24:	465f5457 			@ <UNDEFINED> instruction: 0x465f5457
    7b28:	54434e55 	strbpl	r4, [r3], #-3669	@ 0xfffff1ab
    7b2c:	5f4e4f49 	svcpl	0x004e4f49
    7b30:	41544144 	cmpmi	r4, r4, asr #2
    7b34:	54414d56 	strbpl	r4, [r1], #-3414	@ 0xfffff2aa
    7b38:	4d5f4843 	ldclmi	8, cr4, [pc, #-268]	@ 7a34 <_Min_Stack_Size+0x7634>
    7b3c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    7b40:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    7b44:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    7b48:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
    7b4c:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    7b50:	4f495443 	svcmi	0x00495443
    7b54:	41445f4e 	cmpmi	r4, lr, asr #30
    7b58:	4d564154 	ldfmie	f4, [r6, #-336]	@ 0xfffffeb0
    7b5c:	48435441 	stmdami	r3, {r0, r6, sl, ip, lr}^
    7b60:	736f505f 	cmnvc	pc, #95	@ 0x5f
    7b64:	5f5f0029 	svcpl	0x005f0029
    7b68:	204d4f49 	subcs	r4, sp, r9, asr #30
    7b6c:	616c6f76 	smcvs	50934	@ 0xc6f6
    7b70:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    7b74:	4e495f00 	cdpmi	15, 4, cr5, cr9, cr0, {0}
    7b78:	5f323354 	svcpl	0x00323354
    7b7c:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    7b80:	52414c43 	subpl	r4, r1, #17152	@ 0x4300
    7b84:	00204445 	eoreq	r4, r0, r5, asr #8
    7b88:	5f544e49 	svcpl	0x00544e49
    7b8c:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    7b90:	414d5f38 	cmpmi	sp, r8, lsr pc
    7b94:	5f282058 	svcpl	0x00282058
    7b98:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    7b9c:	5341465f 	movtpl	r4, #5727	@ 0x165f
    7ba0:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ 7a58 <_Min_Stack_Size+0x7658>
    7ba4:	5f5f5841 	svcpl	0x005f5841
    7ba8:	50540029 	subspl	r0, r4, r9, lsr #32
    7bac:	45445f49 	strbmi	r5, [r4, #-3913]	@ 0xfffff0b7
    7bb0:	5f444956 	svcpl	0x00444956
    7bb4:	434e414d 	movtmi	r4, #57677	@ 0xe14d
    7bb8:	494c4156 	stmdbmi	ip, {r1, r2, r4, r6, r8, lr}^
    7bbc:	6f505f44 	svcvs	0x00505f44
    7bc0:	30312073 	eorscc	r2, r1, r3, ror r0
