NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    7bc4:	32490055 	subcc	r0, r9, #85	@ 0x55
    7bc8:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    7bcc:	58545f31 	ldmdapl	r4, {r0, r4, r5, r8, r9, sl, fp, ip, lr}^
    7bd0:	32492045 	subcc	r2, r9, #69	@ 0x45
    7bd4:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    7bd8:	58545f31 	ldmdapl	r4, {r0, r4, r5, r8, r9, sl, fp, ip, lr}^
    7bdc:	734d5f45 	movtvc	r5, #57157	@ 0xdf45
    7be0:	6f43006b 	svcvs	0x0043006b
    7be4:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    7be8:	5f677562 	svcpl	0x00677562
    7bec:	434d4544 	movtmi	r4, #54596	@ 0xd544
    7bf0:	4f4d5f52 	svcmi	0x004d5f52
    7bf4:	4e455f4e 	cdpmi	15, 4, cr5, cr5, cr14, {2}
    7bf8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    7bfc:	55363120 	ldrpl	r3, [r6, #-288]!	@ 0xfffffee0
    7c00:	43324900 	teqmi	r2, #0, 18
    7c04:	3152535f 	cmpcc	r2, pc, asr r3
    7c08:	4d49545f 	cfstrdmi	mvd5, [r9, #-380]	@ 0xfffffe84
    7c0c:	54554f45 	ldrbpl	r4, [r5], #-3909	@ 0xfffff0bb
    7c10:	6b734d5f 	blvs	1cdb194 <_Min_Stack_Size+0x1cdad94>
    7c14:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    7c18:	204c5531 	subcs	r5, ip, r1, lsr r5
    7c1c:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    7c20:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    7c24:	545f3152 	ldrbpl	r3, [pc], #-338	@ 7c2c <_Min_Stack_Size+0x782c>
    7c28:	4f454d49 	svcmi	0x00454d49
    7c2c:	505f5455 	subspl	r5, pc, r5, asr r4	@ <UNPREDICTABLE>
    7c30:	0029736f 	eoreq	r7, r9, pc, ror #6
    7c34:	5f55504d 	svcpl	0x0055504d
    7c38:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
    7c3c:	4552445f 	ldrbmi	r4, [r2, #-1119]	@ 0xfffffba1
    7c40:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    7c44:	6b734d5f 	blvs	1cdb1c8 <_Min_Stack_Size+0x1cdadc8>
    7c48:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    7c4c:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    7c50:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    7c54:	5f55504d 	svcpl	0x0055504d
    7c58:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
    7c5c:	4552445f 	ldrbmi	r4, [r2, #-1119]	@ 0xfffffba1
    7c60:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    7c64:	736f505f 	cmnvc	pc, #95	@ 0x5f
    7c68:	5f5f0029 	svcpl	0x005f0029
    7c6c:	5f746e69 	svcpl	0x00746e69
    7c70:	74736166 	ldrbtvc	r6, [r3], #-358	@ 0xfffffe9a
    7c74:	5f745f38 	svcpl	0x00745f38
    7c78:	69666564 	stmdbvs	r6!, {r2, r5, r6, r8, sl, sp, lr}^
    7c7c:	2064656e 	rsbcs	r6, r4, lr, ror #10
    7c80:	5f5f0031 	svcpl	0x005f0031
    7c84:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    7c88:	00203631 	eoreq	r3, r0, r1, lsr r6
    7c8c:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    7c90:	4d5f544e 	cfldrdmi	mvd5, [pc, #-312]	@ 7b60 <_Min_Stack_Size+0x7760>
    7c94:	45525f50 	ldrbmi	r5, [r2, #-3920]	@ 0xfffff0b0
    7c98:	544c5553 	strbpl	r5, [ip], #-1363	@ 0xfffffaad
    7c9c:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    7ca0:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    7ca4:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    7ca8:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ 7bfc <_Min_Stack_Size+0x77fc>
    7cac:	5f3e2d70 	svcpl	0x003e2d70
    7cb0:	75736572 	ldrbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    7cb4:	0029746c 	eoreq	r7, r9, ip, ror #8
    7cb8:	5f433249 	svcpl	0x00433249
    7cbc:	5f315253 	svcpl	0x00315253
    7cc0:	504f5453 	subpl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
    7cc4:	6f505f46 	svcvs	0x00505f46
    7cc8:	34282073 	strtcc	r2, [r8], #-115	@ 0xffffff8d
    7ccc:	5f002955 	svcpl	0x00002955
    7cd0:	6e695f5f 	mcrvs	15, 3, r5, cr9, cr15, {2}
    7cd4:	5f343674 	svcpl	0x00343674
    7cd8:	65645f74 	strbvs	r5, [r4, #-3956]!	@ 0xfffff08c
    7cdc:	656e6966 	strbvs	r6, [lr, #-2406]!	@ 0xfffff69a
    7ce0:	00312064 	eorseq	r2, r1, r4, rrx
    7ce4:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    7ce8:	435f544e 	cmpmi	pc, #1308622848	@ 0x4e000000
    7cec:	4b434548 	blmi	10d9214 <_Min_Stack_Size+0x10d8e14>
    7cf0:	5245565f 	subpl	r5, r5, #99614720	@ 0x5f00000
    7cf4:	20594649 	subscs	r4, r9, r9, asr #12
    7cf8:	5f5f0031 	svcpl	0x005f0031
    7cfc:	43554e47 	cmpmi	r5, #1136	@ 0x470
    7d00:	454b494c 	strbmi	r4, [fp, #-2380]	@ 0xfffff6b4
    7d04:	4955425f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r9, lr}^
    7d08:	4e49544c 	cdpmi	4, 4, cr5, cr9, cr12, {2}
    7d0c:	58454e5f 	stmdapl	r5, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^
    7d10:	52415f54 	subpl	r5, r1, #84, 30	@ 0x150
    7d14:	00312047 	eorseq	r2, r1, r7, asr #32
    7d18:	5f495054 	svcpl	0x00495054
    7d1c:	52534646 	subspl	r4, r3, #73400320	@ 0x4600000
    7d20:	5374465f 	cmnpl	r4, #99614720	@ 0x5f00000
    7d24:	70706f74 	rsbsvc	r6, r0, r4, ror pc
    7d28:	505f6465 	subspl	r6, pc, r5, ror #8
    7d2c:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    7d30:	555f0055 	ldrbpl	r0, [pc, #-85]	@ 7ce3 <_Min_Stack_Size+0x78e3>
    7d34:	36544e49 	ldrbcc	r4, [r4], -r9, asr #28
    7d38:	5f545f34 	svcpl	0x00545f34
    7d3c:	4c434544 	cfstr64mi	mvdx4, [r3], {68}	@ 0x44
    7d40:	44455241 	strbmi	r5, [r5], #-577	@ 0xfffffdbf
    7d44:	43530020 	cmpmi	r3, #32
    7d48:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    7d4c:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ 7c08 <_Min_Stack_Size+0x7808>
    7d50:	454b5453 	strbmi	r5, [fp, #-1107]	@ 0xfffffbad
    7d54:	4d5f5252 	lfmmi	f5, 2, [pc, #-328]	@ 7c14 <_Min_Stack_Size+0x7814>
    7d58:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    7d5c:	204c5531 	subcs	r5, ip, r1, lsr r5
    7d60:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    7d64:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    7d68:	5f525346 	svcpl	0x00525346
    7d6c:	4b54534d 	blmi	151caa8 <_Min_Stack_Size+0x151c6a8>
    7d70:	5f525245 	svcpl	0x00525245
    7d74:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    7d78:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    7d7c:	4154495f 	cmpmi	r4, pc, asr r9
    7d80:	54434254 	strbpl	r4, [r3], #-596	@ 0xfffffdac
    7d84:	415f3252 	cmpmi	pc, r2, asr r2	@ <UNPREDICTABLE>
    7d88:	41455254 	cmpmi	r5, r4, asr r2
    7d8c:	5f315944 	svcpl	0x00315944
    7d90:	20736f50 	rsbscs	r6, r3, r0, asr pc
    7d94:	4e005530 	cfmv64hrmi	mvdx0, r5
    7d98:	5f434956 	svcpl	0x00434956
    7d9c:	31515249 	cmpcc	r1, r9, asr #4
    7da0:	44415f38 	strbmi	r5, [r1], #-3896	@ 0xfffff0c8
    7da4:	69445f43 	stmdbvs	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    7da8:	6c626173 	stfvse	f6, [r2], #-460	@ 0xfffffe34
    7dac:	20292865 	eorcs	r2, r9, r5, ror #16
    7db0:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    7db4:	43495f43 	movtmi	r5, #40771	@ 0x9f43
    7db8:	20305245 	eorscs	r5, r0, r5, asr #4
    7dbc:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    7dc0:	313c3c31 	teqcc	ip, r1, lsr ip
    7dc4:	00292938 	eoreq	r2, r9, r8, lsr r9
    7dc8:	5f424353 	svcpl	0x00424353
    7dcc:	53434853 	movtpl	r4, #14419	@ 0x3853
    7dd0:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    7dd4:	55414653 	strbpl	r4, [r1, #-1619]	@ 0xfffff9ad
    7dd8:	4341544c 	movtmi	r5, #5196	@ 0x144c
    7ddc:	6f505f54 	svcvs	0x00505f54
    7de0:	55312073 	ldrpl	r2, [r1, #-115]!	@ 0xffffff8d
    7de4:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    7de8:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    7dec:	5f383351 	svcpl	0x00383351
    7df0:	52415355 	subpl	r5, r1, #1409286145	@ 0x54000001
    7df4:	455f3254 	ldrbmi	r3, [pc, #-596]	@ 7ba8 <_Min_Stack_Size+0x77a8>
    7df8:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
    7dfc:	20292865 	eorcs	r2, r9, r5, ror #16
    7e00:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    7e04:	53495f43 	movtpl	r5, #40771	@ 0x9f43
    7e08:	20315245 	eorscs	r5, r1, r5, asr #4
    7e0c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    7e10:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    7e14:	29293620 	stmdbcs	r9!, {r5, r9, sl, ip, sp}
    7e18:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    7e1c:	5341525f 	movtpl	r5, #4703	@ 0x125f
    7e20:	5f425f52 	svcpl	0x00425f52
    7e24:	206b734d 	rsbcs	r7, fp, sp, asr #6
    7e28:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    7e2c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    7e30:	5f55504d 	svcpl	0x0055504d
    7e34:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    7e38:	505f425f 	subspl	r4, pc, pc, asr r2	@ <UNPREDICTABLE>
    7e3c:	0029736f 	eoreq	r7, r9, pc, ror #6
    7e40:	5f424353 	svcpl	0x00424353
    7e44:	5f524343 	svcpl	0x00524343
    7e48:	52455355 	subpl	r5, r5, #1409286145	@ 0x54000001
    7e4c:	4d544553 	cfldr64mi	mvdx4, [r4, #-332]	@ 0xfffffeb4
    7e50:	444e4550 	strbmi	r4, [lr], #-1360	@ 0xfffffab0
    7e54:	6b734d5f 	blvs	1cdb3d8 <_Min_Stack_Size+0x1cdafd8>
    7e58:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    7e5c:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    7e60:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    7e64:	5243435f 	subpl	r4, r3, #2080374785	@ 0x7c000001
    7e68:	4553555f 	ldrbmi	r5, [r3, #-1375]	@ 0xfffffaa1
    7e6c:	54455352 	strbpl	r5, [r5], #-850	@ 0xfffffcae
    7e70:	4e45504d 	cdpmi	0, 4, cr5, cr5, cr13, {2}
    7e74:	6f505f44 	svcvs	0x00505f44
    7e78:	5f002973 	svcpl	0x00002973
    7e7c:	434f4c5f 	movtmi	r4, #64607	@ 0xfc5f
    7e80:	4e495f4b 	cdpmi	15, 4, cr5, cr9, cr11, {2}
    7e84:	63285449 			@ <UNDEFINED> instruction: 0x63285449
    7e88:	7373616c 	cmnvc	r3, #108, 2
    7e8c:	636f6c2c 	cmnvs	pc, #44, 24	@ 0x2c00
    7e90:	6520296b 	strvs	r2, [r0, #-2411]!	@ 0xfffff695
    7e94:	72657478 	rsbvc	r7, r5, #120, 8	@ 0x78000000
    7e98:	7473206e 	ldrbtvc	r2, [r3], #-110	@ 0xffffff92
    7e9c:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    7ea0:	6c5f5f20 	mrrcvs	15, 2, r5, pc, cr0	@ <UNPREDICTABLE>
    7ea4:	206b636f 	rsbcs	r6, fp, pc, ror #6
    7ea8:	6f6c5f5f 	svcvs	0x006c5f5f
    7eac:	205f6b63 	subscs	r6, pc, r3, ror #22
    7eb0:	6c202323 	stcvs	3, cr2, [r0], #-140	@ 0xffffff74
    7eb4:	3b6b636f 	blcc	1ae0c78 <_Min_Stack_Size+0x1ae0878>
    7eb8:	616c6320 	cmnvs	ip, r0, lsr #6
    7ebc:	5f207373 	svcpl	0x00207373
    7ec0:	4b434f4c 	blmi	10dbbf8 <_Min_Stack_Size+0x10db7f8>
    7ec4:	6c20545f 	cfstrsvs	mvf5, [r0], #-380	@ 0xfffffe84
    7ec8:	206b636f 	rsbcs	r6, fp, pc, ror #6
    7ecc:	5f26203d 	svcpl	0x0026203d
    7ed0:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    7ed4:	23205f6b 			@ <UNDEFINED> instruction: 0x23205f6b
    7ed8:	6f6c2023 	svcvs	0x006c2023
    7edc:	5f006b63 	svcpl	0x00006b63
    7ee0:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    7ee4:	7361665f 	cmnvc	r1, #99614720	@ 0x5f00000
    7ee8:	5f363174 	svcpl	0x00363174
    7eec:	65645f74 	strbvs	r5, [r4, #-3956]!	@ 0xfffff08c
    7ef0:	656e6966 	strbvs	r6, [lr, #-2406]!	@ 0xfffff69a
    7ef4:	00312064 	eorseq	r2, r1, r4, rrx
    7ef8:	6f625f5f 	svcvs	0x00625f5f
    7efc:	745f6c6f 	ldrbvc	r6, [pc], #-3183	@ 7f04 <_Min_Stack_Size+0x7b04>
    7f00:	5f657572 	svcpl	0x00657572
    7f04:	736c6166 	cmnvc	ip, #-2147483623	@ 0x80000019
    7f08:	72615f65 	rsbvc	r5, r1, #404	@ 0x194
    7f0c:	65645f65 	strbvs	r5, [r4, #-3941]!	@ 0xfffff09b
    7f10:	656e6966 	strbvs	r6, [lr, #-2406]!	@ 0xfffff69a
    7f14:	00312064 	eorseq	r2, r1, r4, rrx
    7f18:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    7f1c:	494c4355 	stmdbmi	ip, {r0, r2, r4, r6, r8, r9, lr}^
    7f20:	425f454b 	subsmi	r4, pc, #314572800	@ 0x12c00000
    7f24:	544c4955 	strbpl	r4, [ip], #-2389	@ 0xfffff6ab
    7f28:	4d5f4e49 	ldclmi	14, cr4, [pc, #-292]	@ 7e0c <_Min_Stack_Size+0x7a0c>
    7f2c:	50434d45 	subpl	r4, r3, r5, asr #26
    7f30:	00312059 	eorseq	r2, r1, r9, asr r0
    7f34:	695f5f5f 	ldmdbvs	pc, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    7f38:	735f746e 	cmpvc	pc, #1845493760	@ 0x6e000000
    7f3c:	5f657a69 	svcpl	0x00657a69
    7f40:	20685f74 	rsbcs	r5, r8, r4, ror pc
    7f44:	735f5f00 	cmpvc	pc, #0, 30
    7f48:	645f6d79 	ldrbvs	r6, [pc], #-3449	@ 7f50 <_Min_Stack_Size+0x7b50>
    7f4c:	75616665 	strbvc	r6, [r1, #-1637]!	@ 0xfffff99b
    7f50:	7328746c 			@ <UNDEFINED> instruction: 0x7328746c
    7f54:	692c6d79 	stmdbvs	ip!, {r0, r3, r4, r5, r6, r8, sl, fp, sp, lr}
    7f58:	2c6c706d 	stclcs	0, cr7, [ip], #-436	@ 0xfffffe4c
    7f5c:	69726576 	ldmdbvs	r2!, {r1, r2, r4, r5, r6, r8, sl, sp, lr}^
    7f60:	5f202964 	svcpl	0x00202964
    7f64:	6d73615f 	ldfvse	f6, [r3, #-380]!	@ 0xfffffe84
    7f68:	22285f5f 	eorcs	r5, r8, #380	@ 0x17c
    7f6c:	6d79732e 	ldclvs	3, cr7, [r9, #-184]!	@ 0xffffff48
    7f70:	20726576 	rsbscs	r6, r2, r6, ror r5
    7f74:	69232022 	stmdbvs	r3!, {r1, r5, sp}
    7f78:	206c706d 	rsbcs	r7, ip, sp, rrx
    7f7c:	22202c22 	eorcs	r2, r0, #8704	@ 0x2200
    7f80:	79732320 	ldmdbvc	r3!, {r5, r8, r9, sp}^
    7f84:	4022206d 	eormi	r2, r2, sp, rrx
    7f88:	23202240 			@ <UNDEFINED> instruction: 0x23202240
    7f8c:	69726576 	ldmdbvs	r2!, {r1, r2, r4, r5, r6, r8, sl, sp, lr}^
    7f90:	49002964 	stmdbmi	r0, {r2, r5, r6, r8, fp, sp}
    7f94:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    7f98:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    7f9c:	5954424d 	ldmdbpl	r4, {r0, r2, r3, r6, r9, lr}^
    7fa0:	49204550 	stmdbmi	r0!, {r4, r6, r8, sl, lr}
    7fa4:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    7fa8:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    7fac:	5954424d 	ldmdbpl	r4, {r0, r2, r3, r6, r9, lr}^
    7fb0:	4d5f4550 	cfldr64mi	mvdx4, [pc, #-320]	@ 7e78 <_Min_Stack_Size+0x7a78>
    7fb4:	5f006b73 	svcpl	0x00006b73
    7fb8:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    7fbc:	4f4c5f54 	svcmi	0x004c5f54
    7fc0:	454c4143 	strbmi	r4, [ip, #-323]	@ 0xfffffebd
    7fc4:	74705f28 	ldrbtvc	r5, [r0], #-3880	@ 0xfffff0d8
    7fc8:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    7fcc:	74705f28 	ldrbtvc	r5, [r0], #-3880	@ 0xfffff0d8
    7fd0:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    7fd4:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    7fd8:	29656c61 	stmdbcs	r5!, {r0, r5, r6, sl, fp, sp, lr}^
    7fdc:	43324900 	teqmi	r2, #0, 18
    7fe0:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    7fe4:	4554495f 	ldrbmi	r4, [r4, #-2399]	@ 0xfffff6a1
    7fe8:	4e455252 	mcrmi	2, 2, r5, cr5, cr2, {2}
    7fec:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    7ff0:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    7ff4:	4554495f 	ldrbmi	r4, [r4, #-2399]	@ 0xfffff6a1
    7ff8:	4e455252 	mcrmi	2, 2, r5, cr5, cr2, {2}
    7ffc:	6b734d5f 	blvs	1cdb580 <_Min_Stack_Size+0x1cdb180>
    8000:	695f5f00 	ldmdbvs	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    8004:	665f746e 	ldrbvs	r7, [pc], -lr, ror #8
    8008:	33747361 	cmncc	r4, #-2080374783	@ 0x84000001
    800c:	5f745f32 	svcpl	0x00745f32
    8010:	69666564 	stmdbvs	r6!, {r2, r5, r6, r8, sl, sp, lr}^
    8014:	2064656e 	rsbcs	r6, r4, lr, ror #10
    8018:	43530031 	cmpmi	r3, #49	@ 0x31
    801c:	46445f42 	strbmi	r5, [r4], -r2, asr #30
    8020:	455f5253 	ldrbmi	r5, [pc, #-595]	@ 7dd5 <_Min_Stack_Size+0x79d5>
    8024:	52455458 	subpl	r5, r5, #88, 8	@ 0x58000000
    8028:	5f4c414e 	svcpl	0x004c414e
    802c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    8030:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    8034:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    8038:	5f424353 	svcpl	0x00424353
    803c:	52534644 	subspl	r4, r3, #68, 12	@ 0x4400000
    8040:	5458455f 	ldrbpl	r4, [r8], #-1375	@ 0xfffffaa1
    8044:	414e5245 	cmpmi	lr, r5, asr #4
    8048:	6f505f4c 	svcvs	0x00505f4c
    804c:	44002973 	strmi	r2, [r0], #-2419	@ 0xfffff68d
    8050:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
    8054:	5f00656c 	svcpl	0x0000656c
    8058:	7373615f 	cmnvc	r3, #-1073741801	@ 0xc0000017
    805c:	73747265 	cmnvc	r4, #1342177286	@ 0x50000006
    8060:	6168735f 	cmnvs	r8, pc, asr r3
    8064:	28646572 	stmdacs	r4!, {r1, r4, r5, r6, r8, sl, sp, lr}^
    8068:	292e2e2e 	stmdbcs	lr!, {r1, r2, r3, r5, r9, sl, fp, sp}
    806c:	6c5f5f20 	mrrcvs	15, 2, r5, pc, cr0	@ <UNPREDICTABLE>
    8070:	5f6b636f 	svcpl	0x006b636f
    8074:	6f6e6e61 	svcvs	0x006e6e61
    8078:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
    807c:	73736128 	cmnvc	r3, #40, 2
    8080:	5f747265 	svcpl	0x00747265
    8084:	72616873 	rsbvc	r6, r1, #7536640	@ 0x730000
    8088:	6c5f6465 	cfldrdvs	mvd6, [pc], {101}	@ 0x65
    808c:	286b636f 	stmdacs	fp!, {r0, r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    8090:	41565f5f 	cmpmi	r6, pc, asr pc
    8094:	4752415f 			@ <UNDEFINED> instruction: 0x4752415f
    8098:	295f5f53 	ldmdbcs	pc, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    809c:	50540029 	subspl	r0, r4, r9, lsr #32
    80a0:	45445f49 	strbmi	r5, [r4, #-3913]	@ 0xfffff0b7
    80a4:	5f444956 	svcpl	0x00444956
    80a8:	6e797341 	cdpvs	3, 7, cr7, cr9, cr1, {2}
    80ac:	496b6c43 	stmdbmi	fp!, {r0, r1, r6, sl, fp, sp, lr}^
    80b0:	734d5f6e 	movtvc	r5, #57198	@ 0xdf6e
    80b4:	3028206b 	eorcc	r2, r8, fp, rrx
    80b8:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    80bc:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    80c0:	5f495054 	svcpl	0x00495054
    80c4:	49564544 	ldmdbmi	r6, {r2, r6, r8, sl, lr}^
    80c8:	73415f44 	movtvc	r5, #8004	@ 0x1f44
    80cc:	6c436e79 	mcrrvs	14, 7, r6, r3, cr9
    80d0:	5f6e496b 	svcpl	0x006e496b
    80d4:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    80d8:	59535f00 	ldmdbpl	r3, {r8, r9, sl, fp, ip, lr}^
    80dc:	4c5f5f53 	mrrcmi	15, 5, r5, pc, cr3	@ <UNPREDICTABLE>
    80e0:	4c41434f 	mcrrmi	3, 4, r4, r1, cr15
    80e4:	20485f45 	subcs	r5, r8, r5, asr #30
    80e8:	525f5f00 	subspl	r5, pc, #0, 30
    80ec:	52545345 	subspl	r5, r4, #335544321	@ 0x14000001
    80f0:	20544349 	subscs	r4, r4, r9, asr #6
    80f4:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
    80f8:	69727473 	ldmdbvs	r2!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
    80fc:	5f007463 	svcpl	0x00007463
    8100:	6566735f 	strbvs	r7, [r6, #-863]!	@ 0xfffffca1
    8104:	726f7272 	rsbvc	r7, pc, #536870919	@ 0x20000007
    8108:	20297028 	eorcs	r7, r9, r8, lsr #32
    810c:	6e692828 	cdpvs	8, 6, cr2, cr9, cr8, {1}
    8110:	28282974 	stmdacs	r8!, {r2, r4, r5, r6, r8, fp, sp}
    8114:	2d297028 	stccs	0, cr7, [r9, #-160]!	@ 0xffffff60
    8118:	6c665f3e 	stclvs	15, cr5, [r6], #-248	@ 0xffffff08
    811c:	20736761 	rsbscs	r6, r3, r1, ror #14
    8120:	5f5f2026 	svcpl	0x005f2026
    8124:	52524553 	subspl	r4, r2, #348127232	@ 0x14c00000
    8128:	3d212029 	stccc	0, cr2, [r1, #-164]!	@ 0xffffff5c
    812c:	29293020 	stmdbcs	r9!, {r5, ip, sp}
    8130:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    8134:	5f544e45 	svcpl	0x00544e45
    8138:	52454d45 	subpl	r4, r5, #4416	@ 0x1140
    813c:	434e4547 	movtmi	r4, #58695	@ 0xe547
    8140:	705f2859 	subsvc	r2, pc, r9, asr r8	@ <UNPREDICTABLE>
    8144:	20297274 	eorcs	r7, r9, r4, ror r2
    8148:	705f2828 	subsvc	r2, pc, r8, lsr #16
    814c:	2d297274 	sfmcs	f7, 4, [r9, #-464]!	@ 0xfffffe30
    8150:	6d655f3e 	stclvs	15, cr5, [r5, #-248]!	@ 0xffffff08
    8154:	65677265 	strbvs	r7, [r7, #-613]!	@ 0xfffffd9b
    8158:	2979636e 	ldmdbcs	r9!, {r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    815c:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    8160:	454c535f 	strbmi	r5, [ip, #-863]	@ 0xfffffca1
    8164:	4e435045 	cdpmi	0, 4, cr5, cr3, cr5, {2}
    8168:	4c535f54 	mrrcmi	15, 5, r5, r3, cr4
    816c:	43504545 	cmpmi	r0, #289406976	@ 0x11400000
    8170:	4d5f544e 	cfldrdmi	mvd5, [pc, #-312]	@ 8040 <_Min_Stack_Size+0x7c40>
    8174:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    8178:	46467830 			@ <UNDEFINED> instruction: 0x46467830
    817c:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    8180:	635f5f00 	cmpvs	pc, #0, 30
    8184:	69706d6f 	ldmdbvs	r0!, {r0, r1, r2, r3, r5, r6, r8, sl, fp, sp, lr}^
    8188:	5f72656c 	svcpl	0x0072656c
    818c:	626d656d 	rsbvs	r6, sp, #457179136	@ 0x1b400000
    8190:	29287261 	stmdbcs	r8!, {r0, r5, r6, r9, ip, sp, lr}
    8194:	615f5f20 	cmpvs	pc, r0, lsr #30
    8198:	5f206d73 	svcpl	0x00206d73
    819c:	6c6f765f 	stclvs	6, cr7, [pc], #-380	@ 8028 <_Min_Stack_Size+0x7c28>
    81a0:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
    81a4:	20222865 	eorcs	r2, r2, r5, ror #16
    81a8:	203a2022 	eorscs	r2, sl, r2, lsr #32
    81ac:	203a203a 	eorscs	r2, sl, sl, lsr r0
    81b0:	6d656d22 	stclvs	13, cr6, [r5, #-136]!	@ 0xffffff78
    81b4:	2279726f 	rsbscs	r7, r9, #-268435450	@ 0xf0000006
    81b8:	43530029 	cmpmi	r3, #41	@ 0x29
    81bc:	43435f42 	movtmi	r5, #16194	@ 0x3f42
    81c0:	46425f52 			@ <UNDEFINED> instruction: 0x46425f52
    81c4:	4d4e4648 	stclmi	6, cr4, [lr, #-288]	@ 0xfffffee0
    81c8:	5f4e4749 	svcpl	0x004e4749
    81cc:	206b734d 	rsbcs	r7, fp, sp, asr #6
    81d0:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    81d4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    81d8:	5f424353 	svcpl	0x00424353
    81dc:	5f524343 	svcpl	0x00524343
    81e0:	46484642 	strbmi	r4, [r8], -r2, asr #12
    81e4:	47494d4e 	strbmi	r4, [r9, -lr, asr #26]
    81e8:	6f505f4e 	svcvs	0x00505f4e
    81ec:	5f002973 	svcpl	0x00002973
    81f0:	4956535f 	ldmdbmi	r6, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    81f4:	49565f44 	ldmdbmi	r6, {r2, r6, r8, r9, sl, fp, ip, lr}^
    81f8:	4c424953 	mcrrmi	9, 5, r4, r2, cr3	@ <UNPREDICTABLE>
    81fc:	00312045 	eorseq	r2, r1, r5, asr #32
    8200:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    8204:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    8208:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    820c:	5f525343 	svcpl	0x00525343
    8210:	41485f53 	cmpmi	r8, r3, asr pc
    8214:	4d5f544c 	cfldrdmi	mvd5, [pc, #-304]	@ 80ec <_Min_Stack_Size+0x7cec>
    8218:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    821c:	204c5531 	subcs	r5, ip, r1, lsr r5
    8220:	43203c3c 			@ <UNDEFINED> instruction: 0x43203c3c
    8224:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    8228:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    822c:	4348445f 	movtmi	r4, #33887	@ 0x845f
    8230:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    8234:	4c41485f 	mcrrmi	8, 5, r4, r1, cr15
    8238:	6f505f54 	svcvs	0x00505f54
    823c:	4e002973 			@ <UNDEFINED> instruction: 0x4e002973
    8240:	5f434956 	svcpl	0x00434956
    8244:	33515249 	cmpcc	r1, #-1879048188	@ 0x90000004
    8248:	32495f33 	subcc	r5, r9, #51, 30	@ 0xcc
    824c:	455f3243 	ldrbmi	r3, [pc, #-579]	@ 8011 <_Min_Stack_Size+0x7c11>
    8250:	69445f56 	stmdbvs	r4, {r1, r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    8254:	6c626173 	stfvse	f6, [r2], #-460	@ 0xfffffe34
    8258:	20292865 	eorcs	r2, r9, r5, ror #16
    825c:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    8260:	43495f43 	movtmi	r5, #40771	@ 0x9f43
    8264:	20315245 	eorscs	r5, r1, r5, asr #4
    8268:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    826c:	313c3c31 	teqcc	ip, r1, lsr ip
    8270:	49002929 	stmdbmi	r0, {r0, r3, r5, r8, fp, sp}
    8274:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ 827c <_Min_Stack_Size+0x7e7c>
    8278:	545f5243 	ldrbpl	r5, [pc], #-579	@ 8280 <_Min_Stack_Size+0x7e80>
    827c:	45434152 	strbmi	r4, [r3, #-338]	@ 0xfffffeae
    8280:	49535542 	ldmdbmi	r3, {r1, r6, r8, sl, ip, lr}^
    8284:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    8288:	3028206b 	eorcc	r2, r8, fp, rrx
    828c:	55463778 	strbpl	r3, [r6, #-1912]	@ 0xfffff888
    8290:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    8294:	4d544920 	vldrmi.16	s9, [r4, #-64]	@ 0xffffffc0	@ <UNPREDICTABLE>
    8298:	5243545f 	subpl	r5, r3, #1593835520	@ 0x5f000000
    829c:	4152545f 	cmpmi	r2, pc, asr r4
    82a0:	55424543 	strbpl	r4, [r2, #-1347]	@ 0xfffffabd
    82a4:	5f444953 	svcpl	0x00444953
    82a8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    82ac:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    82b0:	4154495f 	cmpmi	r4, pc, asr r9
    82b4:	54434254 	strbpl	r4, [r3], #-596	@ 0xfffffdac
    82b8:	415f3252 	cmpmi	pc, r2, asr r2	@ <UNPREDICTABLE>
    82bc:	41455254 	cmpmi	r5, r4, asr r2
    82c0:	5f325944 	svcpl	0x00325944
    82c4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    82c8:	43005530 	movwmi	r5, #1328	@ 0x530
    82cc:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    82d0:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    82d4:	4348445f 	movtmi	r4, #33887	@ 0x845f
    82d8:	435f5253 	cmpmi	pc, #805306373	@ 0x30000005
    82dc:	53414d5f 	movtpl	r4, #7519	@ 0x1d5f
    82e0:	544e494b 	strbpl	r4, [lr], #-2379	@ 0xfffff6b5
    82e4:	6f505f53 	svcvs	0x00505f53
