NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    82e8:	55332073 	ldrpl	r2, [r3, #-115]!	@ 0xffffff8d
    82ec:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    82f0:	4346465f 	movtmi	r4, #26207	@ 0x665f
    82f4:	6e455f52 	mcrvs	15, 2, r5, cr5, cr2, {2}
    82f8:	6e6f4346 	cdpvs	3, 6, cr4, cr15, cr6, {2}
    82fc:	6f505f74 	svcvs	0x00505f74
    8300:	55312073 	ldrpl	r2, [r1, #-115]!	@ 0xffffff8d
    8304:	43324900 	teqmi	r2, #0, 18
    8308:	56455f31 			@ <UNDEFINED> instruction: 0x56455f31
    830c:	5152495f 	cmppl	r2, pc, asr r9
    8310:	00313320 	eorseq	r3, r1, r0, lsr #6
    8314:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    8318:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    831c:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    8320:	5f525343 	svcpl	0x00525343
    8324:	4c535f53 	mrrcmi	15, 5, r5, r3, cr3
    8328:	5f504545 	svcpl	0x00504545
    832c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    8330:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    8334:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    8338:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    833c:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    8340:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    8344:	5f525343 	svcpl	0x00525343
    8348:	4c535f53 	mrrcmi	15, 5, r5, r3, cr3
    834c:	5f504545 	svcpl	0x00504545
    8350:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    8354:	43475f00 	movtmi	r5, #32512	@ 0x7f00
    8358:	43575f43 	cmpmi	r7, #268	@ 0x10c
    835c:	5f524148 	svcpl	0x00524148
    8360:	49002054 	stmdbmi	r0, {r2, r4, r6, sp}
    8364:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    8368:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    836c:	414d5f34 	cmpmi	sp, r4, lsr pc
    8370:	5f282058 	svcpl	0x00282058
    8374:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    8378:	5341465f 	movtpl	r4, #5727	@ 0x165f
    837c:	5f343654 	svcpl	0x00343654
    8380:	5f58414d 	svcpl	0x0058414d
    8384:	5300295f 	movwpl	r2, #2399	@ 0x95f
    8388:	565f4243 	ldrbpl	r4, [pc], -r3, asr #4
    838c:	5f524f54 	svcpl	0x00524f54
    8390:	4f4c4254 	svcmi	0x004c4254
    8394:	505f4646 	subspl	r4, pc, r6, asr #12
    8398:	3720736f 	strcc	r7, [r0, -pc, ror #6]!
    839c:	564e0055 			@ <UNDEFINED> instruction: 0x564e0055
    83a0:	535f4349 	cmppl	pc, #603979777	@ 0x24000001
    83a4:	65747379 	ldrbvs	r7, [r4, #-889]!	@ 0xfffffc87
    83a8:	7365526d 	cmnvc	r5, #-805306362	@ 0xd0000006
    83ac:	5f207465 	svcpl	0x00207465
    83b0:	49564e5f 	ldmdbmi	r6, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^
    83b4:	79535f43 	ldmdbvc	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    83b8:	6d657473 	cfstrdvs	mvd7, [r5, #-460]!	@ 0xfffffe34
    83bc:	65736552 	ldrbvs	r6, [r3, #-1362]!	@ 0xfffffaae
    83c0:	5f5f0074 	svcpl	0x005f0074
    83c4:	28504f4e 	ldmdacs	r0, {r1, r2, r3, r6, r8, r9, sl, fp, lr}^
    83c8:	5f5f2029 	svcpl	0x005f2029
    83cc:	204d5341 	subcs	r5, sp, r1, asr #6
    83d0:	616c6f76 	smcvs	50934	@ 0xc6f6
    83d4:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    83d8:	6e222820 	cdpvs	8, 2, cr2, cr2, cr0, {1}
    83dc:	2922706f 	stmdbcs	r2!, {r0, r1, r2, r3, r5, r6, ip, sp, lr}
    83e0:	445f5f00 	ldrbmi	r5, [pc], #-3840	@ 83e8 <_Min_Stack_Size+0x7fe8>
    83e4:	4c42554f 	cfstr64mi	mvdx5, [r2], {79}	@ 0x4f
    83e8:	59545f45 	ldmdbpl	r4, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
    83ec:	64204550 	strtvs	r4, [r0], #-1360	@ 0xfffffab0
    83f0:	6c62756f 	cfstr64vs	mvdx7, [r2], #-444	@ 0xfffffe44
    83f4:	43530065 	cmpmi	r3, #101	@ 0x65
    83f8:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    83fc:	5f525343 	svcpl	0x00525343
    8400:	46475355 			@ <UNDEFINED> instruction: 0x46475355
    8404:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    8408:	5f544341 	svcpl	0x00544341
    840c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    8410:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    8414:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    8418:	5f424353 	svcpl	0x00424353
    841c:	53434853 	movtpl	r4, #14419	@ 0x3853
    8420:	53555f52 	cmppl	r5, #328	@ 0x148
    8424:	55414647 	strbpl	r4, [r1, #-1607]	@ 0xfffff9b9
    8428:	4341544c 	movtmi	r5, #5196	@ 0x144c
    842c:	6f505f54 	svcvs	0x00505f54
    8430:	49002973 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
    8434:	5f314332 	svcpl	0x00314332
    8438:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    843c:	65502820 	ldrbvs	r2, [r0, #-2080]	@ 0xfffff7e0
    8440:	68706972 	ldmdavs	r0!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    8444:	6c617265 	sfmvs	f7, 2, [r1], #-404	@ 0xfffffe6c
    8448:	41425f73 	hvcmi	9715	@ 0x25f3
    844c:	2b204553 	blcs	8199a0 <_Min_Stack_Size+0x8195a0>
    8450:	30783020 	rsbscc	r3, r8, r0, lsr #32
    8454:	35303030 	ldrcc	r3, [r0, #-48]!	@ 0xffffffd0
    8458:	55303034 	ldrpl	r3, [r0, #-52]!	@ 0xffffffcc
    845c:	4900294c 	stmdbmi	r0, {r2, r3, r6, r8, fp, sp}
    8460:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ 8468 <_Min_Stack_Size+0x8068>
    8464:	445f5243 	ldrbmi	r5, [pc], #-579	@ 846c <_Min_Stack_Size+0x806c>
    8468:	4e455457 	mcrmi	4, 2, r5, cr5, cr7, {2}
    846c:	734d5f41 	movtvc	r5, #57153	@ 0xdf41
    8470:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    8474:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    8478:	5449203c 	strbpl	r2, [r9], #-60	@ 0xffffffc4
    847c:	43545f4d 	cmpmi	r4, #308	@ 0x134
    8480:	57445f52 	smlsldpl	r5, r4, r2, pc	@ <UNPREDICTABLE>
    8484:	414e4554 	cmpmi	lr, r4, asr r5
    8488:	736f505f 	cmnvc	pc, #95	@ 0x5f
    848c:	43530029 	cmpmi	r3, #41	@ 0x29
    8490:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    8494:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    8498:	4350564e 	cmpmi	r0, #81788928	@ 0x4e00000
    849c:	6b734d5f 	blvs	1cdba20 <_Min_Stack_Size+0x1cdb620>
    84a0:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    84a4:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    84a8:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    84ac:	5346435f 	movtpl	r4, #25439	@ 0x635f
    84b0:	4e495f52 	mcrmi	15, 2, r5, cr9, cr2, {2}
    84b4:	5f435056 	svcpl	0x00435056
    84b8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    84bc:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    84c0:	4f4d5f4f 	svcmi	0x004d5f4f
    84c4:	4f5f4544 	svcmi	0x005f4544
    84c8:	55505455 	ldrbpl	r5, [r0, #-1109]	@ 0xfffffbab
    84cc:	444f5f54 	strbmi	r5, [pc], #-3924	@ 84d4 <_Min_Stack_Size+0x80d4>
    84d0:	30783020 	rsbscc	r3, r8, r0, lsr #32
    84d4:	30303030 	eorscc	r3, r0, r0, lsr r0
    84d8:	75353030 	ldrvc	r3, [r5, #-48]!	@ 0xffffffd0
    84dc:	645f5f00 	ldrbvs	r5, [pc], #-3840	@ 84e4 <_Min_Stack_Size+0x80e4>
    84e0:	32646165 	rsbcc	r6, r4, #1073741849	@ 0x40000019
    84e4:	615f5f20 	cmpvs	pc, r0, lsr #30
    84e8:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    84ec:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    84f0:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    84f4:	6f6e5f5f 	svcvs	0x006e5f5f
    84f8:	75746572 	ldrbvc	r6, [r4, #-1394]!	@ 0xfffffa8e
    84fc:	5f5f6e72 	svcpl	0x005f6e72
    8500:	5f002929 	svcpl	0x00002929
    8504:	65656e5f 	strbvs	r6, [r5, #-3679]!	@ 0xfffff1a1
    8508:	69735f64 	ldmdbvs	r3!, {r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    850c:	745f657a 	ldrbvc	r6, [pc], #-1402	@ 8514 <_Min_Stack_Size+0x8114>
    8510:	564e0020 	strbpl	r0, [lr], -r0, lsr #32
    8514:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    8518:	5f395152 	svcpl	0x00395152
    851c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    8520:	6e455f33 	mcrvs	15, 2, r5, cr5, cr3, {1}
    8524:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    8528:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    852c:	4349564e 	movtmi	r5, #38478	@ 0x964e
    8530:	4553495f 	ldrbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    8534:	7c203052 	stcvc	0, cr3, [r0], #-328	@ 0xfffffeb8
    8538:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    853c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    8540:	00292939 	eoreq	r2, r9, r9, lsr r9
    8544:	5f424353 	svcpl	0x00424353
    8548:	5f524353 	svcpl	0x00524353
    854c:	4f564553 	svcmi	0x00564553
    8550:	4e45504e 	cdpmi	0, 4, cr5, cr5, cr14, {2}
    8554:	6f505f44 	svcvs	0x00505f44
    8558:	55342073 	ldrpl	r2, [r4, #-115]!	@ 0xffffff8d
    855c:	53425f00 	movtpl	r5, #12032	@ 0x2f00
    8560:	43575f44 	cmpmi	r7, #68, 30	@ 0x110
    8564:	5f524148 	svcpl	0x00524148
    8568:	5f005f54 	svcpl	0x00005f54
    856c:	6f647473 	svcvs	0x00647473
    8570:	725f7475 	subsvc	r7, pc, #1962934272	@ 0x75000000
    8574:	20297828 	eorcs	r7, r9, r8, lsr #16
    8578:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    857c:	535f544e 	cmppl	pc, #1308622848	@ 0x4e000000
    8580:	554f4454 	strbpl	r4, [pc, #-1108]	@ 8134 <_Min_Stack_Size+0x7d34>
    8584:	29782854 	ldmdbcs	r8!, {r2, r4, r6, fp, sp}^
    8588:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    858c:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    8590:	5f313351 	svcpl	0x00313351
    8594:	31433249 	cmpcc	r3, r9, asr #4
    8598:	5f56455f 	svcpl	0x0056455f
    859c:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
    85a0:	2928656c 	stmdbcs	r8!, {r2, r3, r5, r6, r8, sl, sp, lr}
    85a4:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    85a8:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    85ac:	30524553 	subscc	r4, r2, r3, asr r5
    85b0:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    85b4:	3c3c3128 	ldfccs	f3, [ip], #-160	@ 0xffffff60
    85b8:	29293133 	stmdbcs	r9!, {r0, r1, r4, r5, r8, ip, sp}
    85bc:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    85c0:	5050535f 	subspl	r5, r0, pc, asr r3
    85c4:	58545f52 	ldmdapl	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    85c8:	45444f4d 	strbmi	r4, [r4, #-3917]	@ 0xfffff0b3
    85cc:	6b734d5f 	blvs	1cdbb50 <_Min_Stack_Size+0x1cdb750>
    85d0:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    85d4:	204c5533 	subcs	r5, ip, r3, lsr r5
    85d8:	52410029 	subpl	r0, r1, #41	@ 0x29
    85dc:	504d5f4d 	subpl	r5, sp, sp, asr #30
    85e0:	45525f55 	ldrbmi	r5, [r2, #-3925]	@ 0xfffff0ab
    85e4:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    85e8:	5a49535f 	bpl	125d36c <_Min_Stack_Size+0x125cf6c>
    85ec:	47345f45 	ldrmi	r5, [r4, -r5, asr #30]!
    85f0:	28282042 	stmdacs	r8!, {r1, r6, sp}
    85f4:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    85f8:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    85fc:	46317830 			@ <UNDEFINED> instruction: 0x46317830
    8600:	5f002955 	svcpl	0x00002955
    8604:	65656e5f 	strbvs	r6, [r5, #-3679]!	@ 0xfffff1a1
    8608:	69735f64 	ldmdbvs	r3!, {r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    860c:	745f657a 	ldrbvc	r6, [pc], #-1402	@ 8614 <_Min_Stack_Size+0x8214>
    8610:	575f5f00 	ldrbpl	r5, [pc, -r0, lsl #30]
    8614:	29284546 	stmdbcs	r8!, {r1, r2, r6, r8, sl, lr}
    8618:	415f5f20 	cmpmi	pc, r0, lsr #30
    861c:	76204d53 			@ <UNDEFINED> instruction: 0x76204d53
    8620:	74616c6f 	strbtvc	r6, [r1], #-3183	@ 0xfffff391
    8624:	20656c69 	rsbcs	r6, r5, r9, ror #24
    8628:	66772228 	ldrbtvs	r2, [r7], -r8, lsr #4
    862c:	3a3a2265 	bcc	e90fc8 <_Min_Stack_Size+0xe90bc8>
    8630:	656d223a 	strbvs	r2, [sp, #-570]!	@ 0xfffffdc6
    8634:	79726f6d 	ldmdbvc	r2!, {r0, r2, r3, r5, r6, r8, r9, sl, fp, sp, lr}^
    8638:	5f002922 	svcpl	0x00002922
    863c:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    8640:	6e695f6b 	cdpvs	15, 6, cr5, cr9, cr11, {3}
    8644:	725f7469 	subsvc	r7, pc, #1761607680	@ 0x69000000
    8648:	72756365 	rsbsvc	r6, r5, #-1811939327	@ 0x94000001
    864c:	65766973 	ldrbvs	r6, [r6, #-2419]!	@ 0xfffff68d
    8650:	636f6c28 	cmnvs	pc, #40, 24	@ 0x2800
    8654:	5f20296b 	svcpl	0x0020296b
    8658:	7465725f 	strbtvc	r7, [r5], #-607	@ 0xfffffda1
    865c:	65677261 	strbvs	r7, [r7, #-609]!	@ 0xfffffd9f
    8660:	6f6c5f74 	svcvs	0x006c5f74
    8664:	695f6b63 	ldmdbvs	pc, {r0, r1, r5, r6, r8, r9, fp, sp, lr}^	@ <UNPREDICTABLE>
    8668:	5f74696e 	svcpl	0x0074696e
    866c:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    8670:	76697372 			@ <UNDEFINED> instruction: 0x76697372
    8674:	6c262865 	stcvs	8, cr2, [r6], #-404	@ 0xfffffe6c
    8678:	296b636f 	stmdbcs	fp!, {r0, r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    867c:	42435300 	submi	r5, r3, #0, 6
    8680:	5346435f 	movtpl	r4, #25439	@ 0x635f
    8684:	4e555f52 	mrcmi	15, 2, r5, cr5, cr2, {2}
    8688:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    868c:	5f44454e 	svcpl	0x0044454e
    8690:	206b734d 	rsbcs	r7, fp, sp, asr #6
    8694:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    8698:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    869c:	5f424353 	svcpl	0x00424353
    86a0:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    86a4:	414e555f 	cmpmi	lr, pc, asr r5
    86a8:	4e47494c 	vmlsmi.f16	s9, s14, s24	@ <UNPREDICTABLE>
    86ac:	505f4445 	subspl	r4, pc, r5, asr #8
    86b0:	0029736f 	eoreq	r7, r9, pc, ror #6
    86b4:	54737953 	ldrbtpl	r7, [r3], #-2387	@ 0xfffff6ad
    86b8:	5f6b6369 	svcpl	0x006b6369
    86bc:	5f4c4156 	svcpl	0x004c4156
    86c0:	52525543 	subspl	r5, r2, #281018368	@ 0x10c00000
    86c4:	5f544e45 	svcpl	0x00544e45
    86c8:	206b734d 	rsbcs	r7, fp, sp, asr #6
    86cc:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    86d0:	46464646 	strbmi	r4, [r6], -r6, asr #12
    86d4:	204c5546 	subcs	r5, ip, r6, asr #10
    86d8:	32490029 	subcc	r0, r9, #41	@ 0x29
    86dc:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    86e0:	54495f32 	strbpl	r5, [r9], #-3890	@ 0xfffff0ce
    86e4:	45525245 	ldrbmi	r5, [r2, #-581]	@ 0xfffffdbb
    86e8:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    86ec:	3028206b 	eorcc	r2, r8, fp, rrx
    86f0:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    86f4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    86f8:	5f433249 	svcpl	0x00433249
    86fc:	5f325243 	svcpl	0x00325243
    8700:	52455449 	subpl	r5, r5, #1224736768	@ 0x49000000
    8704:	5f4e4552 	svcpl	0x004e4552
    8708:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    870c:	43324900 	teqmi	r2, #0, 18
    8710:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    8714:	53414c5f 	movtpl	r4, #7263	@ 0x1c5f
    8718:	6f505f54 	svcvs	0x00505f54
    871c:	31282073 			@ <UNDEFINED> instruction: 0x31282073
    8720:	00295532 	eoreq	r5, r9, r2, lsr r5
    8724:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    8728:	45282820 	strmi	r2, [r8, #-2080]!	@ 0xfffff7e0
    872c:	5f495458 	svcpl	0x00495458
    8730:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
    8734:	20666544 	rsbcs	r6, r6, r4, asr #10
    8738:	5845292a 	stmdapl	r5, {r1, r3, r5, r8, fp, sp}^
    873c:	425f4954 	subsmi	r4, pc, #84, 18	@ 0x150000
    8740:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    8744:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    8748:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ 8684 <_Min_Stack_Size+0x8284>
    874c:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    8750:	495f5f2d 	ldmdbmi	pc, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    8754:	3233544e 	eorscc	r5, r3, #1308622848	@ 0x4e000000
    8758:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    875c:	2d205f5f 	stccs	15, cr5, [r0, #-380]!	@ 0xfffffe84
    8760:	00293120 	eoreq	r3, r9, r0, lsr #2
    8764:	5f433249 	svcpl	0x00433249
    8768:	5f315253 	svcpl	0x00315253
    876c:	505f4253 	subspl	r4, pc, r3, asr r2	@ <UNPREDICTABLE>
    8770:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    8774:	00295530 	eoreq	r5, r9, r0, lsr r5
    8778:	6f635f5f 	svcvs	0x00635f5f
    877c:	6961746e 	stmdbvs	r1!, {r1, r2, r3, r5, r6, sl, ip, sp, lr}^
    8780:	6f72656e 	svcvs	0x0072656e
    8784:	2c782866 	ldclcs	8, cr2, [r8], #-408	@ 0xfffffe68
    8788:	296d2c73 	stmdbcs	sp!, {r0, r1, r4, r5, r6, sl, fp, sp}^
    878c:	207b2820 	rsbscs	r2, fp, r0, lsr #16
    8790:	736e6f63 	cmnvc	lr, #396	@ 0x18c
    8794:	6f762074 	svcvs	0x00762074
    8798:	6974616c 	ldmdbvs	r4!, {r2, r3, r5, r6, r8, sp, lr}^
    879c:	5f20656c 	svcpl	0x0020656c
    87a0:	7079745f 	rsbsvc	r7, r9, pc, asr r4
    87a4:	28666f65 	stmdacs	r6!, {r0, r2, r5, r6, r8, r9, sl, fp, sp, lr}^
    87a8:	20732828 	rsbscs	r2, r3, r8, lsr #16
    87ac:	2930292a 	ldmdbcs	r0!, {r1, r3, r5, r8, fp, sp}
    87b0:	296d3e2d 	stmdbcs	sp!, {r0, r2, r3, r5, r9, sl, fp, ip, sp}^
    87b4:	5f5f2a20 	svcpl	0x005f2a20
    87b8:	203d2078 	eorscs	r2, sp, r8, ror r0
    87bc:	3b297828 	blcc	a66864 <_Min_Stack_Size+0xa66464>
    87c0:	445f5f20 	ldrbmi	r5, [pc], #-3872	@ 87c8 <_Min_Stack_Size+0x83c8>
    87c4:	41555145 	cmpmi	r5, r5, asr #2
    87c8:	5946494c 	stmdbpl	r6, {r2, r3, r6, r8, fp, lr}^
    87cc:	2a207328 	bcs	825474 <_Min_Stack_Size+0x825074>
    87d0:	6328202c 			@ <UNDEFINED> instruction: 0x6328202c
    87d4:	74736e6f 	ldrbtvc	r6, [r3], #-3695	@ 0xfffff191
    87d8:	6c6f7620 	stclvs	6, cr7, [pc], #-128	@ 8760 <_Min_Stack_Size+0x8360>
    87dc:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
    87e0:	68632065 	stmdavs	r3!, {r0, r2, r5, r6, sp}^
    87e4:	2a207261 	bcs	825170 <_Min_Stack_Size+0x824d70>
    87e8:	785f5f29 	ldmdavc	pc, {r0, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    87ec:	5f202d20 	svcpl	0x00202d20
    87f0:	66666f5f 	uqsaxvs	r6, r6, pc	@ <UNPREDICTABLE>
    87f4:	6f746573 	svcvs	0x00746573
    87f8:	2c732866 	ldclcs	8, cr2, [r3], #-408	@ 0xfffffe68
    87fc:	29296d20 	stmdbcs	r9!, {r5, r8, sl, fp, sp, lr}
    8800:	00297d3b 	eoreq	r7, r9, fp, lsr sp
    8804:	5f424353 	svcpl	0x00424353
    8808:	5f524353 	svcpl	0x00524353
    880c:	45454c53 	strbmi	r4, [r5, #-3155]	@ 0xfffff3ad
    8810:	45454450 	strbmi	r4, [r5, #-1104]	@ 0xfffffbb0
    8814:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    8818:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    881c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    8820:	4353203c 	cmpmi	r3, #60	@ 0x3c
    8824:	43535f42 	cmpmi	r3, #264	@ 0x108
    8828:	4c535f52 	mrrcmi	15, 5, r5, r3, cr2
    882c:	44504545 	ldrbmi	r4, [r0], #-1349	@ 0xfffffabb
    8830:	5f504545 	svcpl	0x00504545
    8834:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    8838:	42435300 	submi	r5, r3, #0, 6
    883c:	5550435f 	ldrbpl	r4, [r0, #-863]	@ 0xfffffca1
    8840:	525f4449 	subspl	r4, pc, #1224736768	@ 0x49000000
    8844:	53495645 	movtpl	r5, #38469	@ 0x9645
    8848:	5f4e4f49 	svcpl	0x004e4f49
    884c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    8850:	52005530 	andpl	r5, r0, #48, 10	@ 0xc000000
    8854:	535f4343 	cmppl	pc, #201326593	@ 0xc000001
    8858:	5f314950 	svcpl	0x00314950
    885c:	5f4b4c43 	svcpl	0x004b4c43
    8860:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    8864:	43522820 	cmpmi	r2, #32, 16	@ 0x200000
    8868:	413e2d43 	teqmi	lr, r3, asr #26
    886c:	45324250 	ldrmi	r4, [r2, #-592]!	@ 0xfffffdb0
    8870:	7c20524e 	sfmvc	f5, 4, [r0], #-312	@ 0xfffffec8
    8874:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    8878:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    887c:	29293231 	stmdbcs	r9!, {r0, r4, r5, r9, ip, sp}
    8880:	726f4300 	rsbvc	r4, pc, #0, 6
    8884:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    8888:	445f6775 	ldrbmi	r6, [pc], #-1909	@ 8890 <_Min_Stack_Size+0x8490>
    888c:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    8890:	535f435f 	cmppl	pc, #2080374785	@ 0x7c000001
    8894:	5350414e 	cmppl	r0, #-2147483629	@ 0x80000013
    8898:	4c4c4154 	stfmie	f4, [ip], {84}	@ 0x54
    889c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    88a0:	00553520 	subseq	r3, r5, r0, lsr #10
    88a4:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    88a8:	435f544e 	cmpmi	pc, #1308622848	@ 0x4e000000
    88ac:	4b434548 	blmi	10d9dd4 <_Min_Stack_Size+0x10d99d4>
    88b0:	284d545f 	stmdacs	sp, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
    88b4:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    88b8:	45525f20 	ldrbmi	r5, [r2, #-3872]	@ 0xfffff0e0
    88bc:	5f544e45 	svcpl	0x00544e45
    88c0:	43454843 	movtmi	r4, #22595	@ 0x5843
    88c4:	6176284b 	cmnvs	r6, fp, asr #16
    88c8:	5f202c72 	svcpl	0x00202c72
    88cc:	61636f6c 	cmnvs	r3, ip, ror #30
    88d0:	6d69746c 	cfstrdvs	mvd7, [r9, #-432]!	@ 0xfffffe50
    88d4:	75625f65 	strbvc	r5, [r2, #-3941]!	@ 0xfffff09b
    88d8:	73202c66 			@ <UNDEFINED> instruction: 0x73202c66
    88dc:	63757274 	cmnvs	r5, #116, 4	@ 0x40000007
    88e0:	5f5f2074 	svcpl	0x005f2074
    88e4:	2a206d74 	bcs	823ebc <_Min_Stack_Size+0x823abc>
    88e8:	6973202c 	ldmdbvs	r3!, {r2, r3, r5, sp}^
    88ec:	666f657a 			@ <UNDEFINED> instruction: 0x666f657a
    88f0:	28282a20 	stmdacs	r8!, {r5, r9, fp, sp}
    88f4:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    88f8:	6c5f3e2d 	mrrcvs	14, 2, r3, pc, cr13	@ <UNPREDICTABLE>
    88fc:	6c61636f 	stclvs	3, cr6, [r1], #-444	@ 0xfffffe44
    8900:	656d6974 	strbvs	r6, [sp, #-2420]!	@ 0xfffff68c
    8904:	6675625f 			@ <UNDEFINED> instruction: 0x6675625f
    8908:	29202c29 	stmdbcs	r0!, {r0, r3, r5, sl, fp, sp}
    890c:	43324900 	teqmi	r2, #0, 18
    8910:	3152435f 	cmpcc	r2, pc, asr r3
    8914:	4f54535f 	svcmi	0x0054535f
    8918:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    891c:	3028206b 	eorcc	r2, r8, fp, rrx
    8920:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    8924:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    8928:	5f433249 	svcpl	0x00433249
    892c:	5f315243 	svcpl	0x00315243
    8930:	504f5453 	subpl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
    8934:	736f505f 	cmnvc	pc, #95	@ 0x5f
    8938:	575f0029 	ldrbpl	r0, [pc, -r9, lsr #32]
    893c:	5f544e41 	svcpl	0x00544e41
    8940:	5f455355 	svcpl	0x00455355
    8944:	4f544447 	svcmi	0x00544447
    8948:	00312041 	eorseq	r2, r1, r1, asr #32
    894c:	52535078 	subspl	r5, r3, #120	@ 0x78
    8950:	4943495f 	stmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    8954:	5f54495f 	svcpl	0x0054495f
    8958:	6f505f32 	svcvs	0x00505f32
    895c:	35322073 	ldrcc	r2, [r2, #-115]!	@ 0xffffff8d
    8960:	5f5f0055 	svcpl	0x005f0055
    8964:	5f55504d 	svcpl	0x0055504d
    8968:	53455250 	movtpl	r5, #21072	@ 0x5250
    896c:	20544e45 	subscs	r4, r4, r5, asr #28
    8970:	5f005531 	svcpl	0x00005531
    8974:	5f434347 	svcpl	0x00434347
    8978:	50415257 	subpl	r5, r1, r7, asr r2
    897c:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    8980:	5f544e49 	svcpl	0x00544e49
    8984:	5f002048 	svcpl	0x00002048
    8988:	534d435f 	movtpl	r4, #54111	@ 0xd35f
    898c:	475f5349 	ldrbmi	r5, [pc, -r9, asr #6]
    8990:	525f4343 	subspl	r4, pc, #201326593	@ 0xc000001
    8994:	45525f57 	ldrbmi	r5, [r2, #-3927]	@ 0xfffff0a9
    8998:	29722847 	ldmdbcs	r2!, {r0, r1, r2, r6, fp, sp}^
    899c:	722b2220 	eorvc	r2, fp, #32, 4
    89a0:	72282022 	eorvc	r2, r8, #34	@ 0x22
    89a4:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    89a8:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    89ac:	4e5f4c52 	mrcmi	12, 2, r4, cr15, cr2, {2}
    89b0:	4f434d55 	svcmi	0x00434d55
    89b4:	505f504d 	subspl	r5, pc, sp, asr #32
    89b8:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    89bc:	53005538 	movwpl	r5, #1336	@ 0x538
    89c0:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    89c4:	435f6b63 	cmpmi	pc, #101376	@ 0x18c00
    89c8:	5f4c5254 	svcpl	0x004c5254
    89cc:	42414e45 	submi	r4, r1, #1104	@ 0x450
    89d0:	505f454c 	subspl	r4, pc, ip, asr #10
    89d4:	3020736f 	eorcc	r7, r0, pc, ror #6
    89d8:	5f5f0055 	svcpl	0x005f0055
    89dc:	67696c61 	strbvs	r6, [r9, -r1, ror #24]!
    89e0:	6f645f6e 	svcvs	0x00645f6e
    89e4:	78286e77 	stmdavc	r8!, {r0, r1, r2, r4, r5, r6, r9, sl, fp, sp, lr}
    89e8:	2029792c 	eorcs	r7, r9, ip, lsr #18
    89ec:	75625f5f 	strbvc	r5, [r2, #-3935]!	@ 0xfffff0a1
    89f0:	69746c69 	ldmdbvs	r4!, {r0, r3, r5, r6, sl, fp, sp, lr}^
    89f4:	6c615f6e 	stclvs	15, cr5, [r1], #-440	@ 0xfffffe48
    89f8:	5f6e6769 	svcpl	0x006e6769
    89fc:	6e776f64 	cdpvs	15, 7, cr6, cr7, cr4, {3}
    8a00:	202c7828 	eorcs	r7, ip, r8, lsr #16
    8a04:	4e002979 			@ <UNDEFINED> instruction: 0x4e002979
    8a08:	5f434956 	svcpl	0x00434956
    8a0c:	33515249 	cmpcc	r1, #-1879048188	@ 0x90000004
    8a10:	50535f36 	subspl	r5, r3, r6, lsr pc
    8a14:	455f3249 	ldrbmi	r3, [pc, #-585]	@ 87d3 <_Min_Stack_Size+0x83d3>
    8a18:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
    8a1c:	20292865 	eorcs	r2, r9, r5, ror #16
    8a20:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
