NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    8a24:	53495f43 	movtpl	r5, #40771	@ 0x9f43
    8a28:	20315245 	eorscs	r5, r1, r5, asr #4
    8a2c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    8a30:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    8a34:	29293420 	stmdbcs	r9!, {r5, sl, ip, sp}
    8a38:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 7b40 <_Min_Stack_Size+0x7740>
    8a3c:	494c414e 	stmdbmi	ip, {r1, r2, r3, r6, r8, lr}^
    8a40:	44454e47 	strbmi	r4, [r5], #-3655	@ 0xfffff1b9
    8a44:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    8a48:	28323354 	ldmdacs	r2!, {r2, r4, r6, r8, r9, ip, sp}
    8a4c:	28202978 	stmdacs	r0!, {r3, r4, r5, r6, r8, fp, sp}
    8a50:	74732828 	ldrbtvc	r2, [r3], #-2088	@ 0xfffff7d8
    8a54:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    8a58:	555f5420 	ldrbpl	r5, [pc, #-1056]	@ 8640 <_Min_Stack_Size+0x8240>
    8a5c:	33544e49 	cmpcc	r4, #1168	@ 0x490
    8a60:	292a2032 	stmdbcs	sl!, {r1, r4, r5, sp}
    8a64:	29297828 	stmdbcs	r9!, {r3, r5, fp, ip, sp, lr}
    8a68:	29763e2d 	ldmdbcs	r6!, {r0, r2, r3, r5, r9, sl, fp, ip, sp}^
    8a6c:	4d524100 	ldfmie	f4, [r2, #-0]
    8a70:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    8a74:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    8a78:	5f4e4f49 	svcpl	0x004e4f49
    8a7c:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    8a80:	3832315f 	ldmdacc	r2!, {r0, r1, r2, r3, r4, r6, r8, ip, sp}
    8a84:	2820424b 	stmdacs	r0!, {r0, r1, r3, r6, r9, lr}
    8a88:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    8a8c:	745f3874 	ldrbvc	r3, [pc], #-2164	@ 8a94 <_Min_Stack_Size+0x8694>
    8a90:	31783029 	cmncc	r8, r9, lsr #32
    8a94:	00295530 	eoreq	r5, r9, r0, lsr r5
    8a98:	5f433249 	svcpl	0x00433249
    8a9c:	5f315243 	svcpl	0x00315243
    8aa0:	53525753 	cmppl	r2, #21757952	@ 0x14c0000
    8aa4:	32492054 	subcc	r2, r9, #84	@ 0x54
    8aa8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    8aac:	57535f31 	smmlarpl	r3, r1, pc, r5	@ <UNPREDICTABLE>
    8ab0:	5f545352 	svcpl	0x00545352
    8ab4:	006b734d 	rsbeq	r7, fp, sp, asr #6
    8ab8:	4f495047 	svcmi	0x00495047
    8abc:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    8ac0:	2820365f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r9, sl, ip, sp}
    8ac4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    8ac8:	5f363174 	svcpl	0x00363174
    8acc:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    8ad0:	30343030 	eorscc	r3, r4, r0, lsr r0
    8ad4:	32490029 	subcc	r0, r9, #41	@ 0x29
    8ad8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    8adc:	54495f32 	strbpl	r5, [r9], #-3890	@ 0xfffff0ce
    8ae0:	45525245 	ldrbmi	r5, [r2, #-581]	@ 0xfffffdbb
    8ae4:	6f505f4e 	svcvs	0x00505f4e
    8ae8:	38282073 	stmdacc	r8!, {r0, r1, r4, r5, r6, sp}
    8aec:	44002955 	strmi	r2, [r0], #-2389	@ 0xfffff6ab
    8af0:	465f5457 			@ <UNDEFINED> instruction: 0x465f5457
    8af4:	54434e55 	strbpl	r4, [r3], #-3669	@ 0xfffff1ab
    8af8:	5f4e4f49 	svcpl	0x004e4f49
    8afc:	314b4e4c 	cmpcc	fp, ip, asr #28
    8b00:	5f414e45 	svcpl	0x00414e45
    8b04:	20736f50 	rsbscs	r6, r3, r0, asr pc
    8b08:	49005539 	stmdbmi	r0, {r0, r3, r4, r5, r8, sl, ip, lr}
    8b0c:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    8b10:	505f3252 	subspl	r3, pc, r2, asr r2	@ <UNPREDICTABLE>
    8b14:	4d5f4345 	ldclmi	3, cr4, [pc, #-276]	@ 8a08 <_Min_Stack_Size+0x8608>
    8b18:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    8b1c:	46467830 			@ <UNDEFINED> instruction: 0x46467830
    8b20:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    8b24:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    8b28:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    8b2c:	45505f32 	ldrbmi	r5, [r0, #-3890]	@ 0xfffff0ce
    8b30:	6f505f43 	svcvs	0x00505f43
    8b34:	4e002973 			@ <UNDEFINED> instruction: 0x4e002973
    8b38:	5f434956 	svcpl	0x00434956
    8b3c:	33515249 	cmpcc	r1, #-1879048188	@ 0x90000004
    8b40:	32495f33 	subcc	r5, r9, #51, 30	@ 0xcc
    8b44:	455f3243 	ldrbmi	r3, [pc, #-579]	@ 8909 <_Min_Stack_Size+0x8509>
    8b48:	6e455f56 	mcrvs	15, 2, r5, cr5, cr6, {2}
    8b4c:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    8b50:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    8b54:	4349564e 	movtmi	r5, #38478	@ 0x964e
    8b58:	4553495f 	ldrbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    8b5c:	7c203152 	stfvcs	f3, [r0], #-328	@ 0xfffffeb8
    8b60:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    8b64:	29313c3c 	ldmdbcs	r1!, {r2, r3, r4, r5, sl, fp, ip, sp}
    8b68:	50540029 	subspl	r0, r4, r9, lsr #32
    8b6c:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    8b70:	5f314f46 	svcpl	0x00314f46
    8b74:	304d5449 	subcc	r5, sp, r9, asr #8
    8b78:	736f505f 	cmnvc	pc, #95	@ 0x5f
    8b7c:	00553020 	subseq	r3, r5, r0, lsr #32
    8b80:	6f6e5f5f 	svcvs	0x006e5f5f
    8b84:	696e6173 	stmdbvs	lr!, {r0, r1, r4, r5, r6, r8, sp, lr}^
    8b88:	657a6974 	ldrbvs	r6, [sl, #-2420]!	@ 0xfffff68c
    8b8c:	72646461 	rsbvc	r6, r4, #1627389952	@ 0x61000000
    8b90:	20737365 	rsbscs	r7, r3, r5, ror #6
    8b94:	726f4300 	rsbvc	r4, pc, #0, 6
    8b98:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    8b9c:	445f6775 	ldrbmi	r6, [pc], #-1909	@ 8ba4 <_Min_Stack_Size+0x87a4>
    8ba0:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    8ba4:	5f43565f 	svcpl	0x0043565f
    8ba8:	45535542 	ldrbmi	r5, [r3, #-1346]	@ 0xfffffabe
    8bac:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    8bb0:	3820736f 	stmdacc	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    8bb4:	5f5f0055 	svcpl	0x005f0055
    8bb8:	6e696f6e 	cdpvs	15, 6, cr6, cr9, cr14, {3}
    8bbc:	656e696c 	strbvs	r6, [lr, #-2412]!	@ 0xfffff694
    8bc0:	615f5f20 	cmpvs	pc, r0, lsr #30
    8bc4:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    8bc8:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    8bcc:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    8bd0:	6e5f5f28 	cdpvs	15, 5, cr5, cr15, cr8, {1}
    8bd4:	6c6e696f 			@ <UNDEFINED> instruction: 0x6c6e696f
    8bd8:	5f656e69 	svcpl	0x00656e69
    8bdc:	0029295f 	eoreq	r2, r9, pc, asr r9
    8be0:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    8be4:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    8be8:	5f657475 	svcpl	0x00657475
    8bec:	65727570 	ldrbvs	r7, [r2, #-1392]!	@ 0xfffffa90
    8bf0:	00205f5f 	eoreq	r5, r0, pc, asr pc
    8bf4:	5641485f 			@ <UNDEFINED> instruction: 0x5641485f
    8bf8:	4f4c5f45 	svcmi	0x004c5f45
    8bfc:	445f474e 	ldrbmi	r4, [pc], #-1870	@ 8c04 <_Min_Stack_Size+0x8804>
    8c00:	4c42554f 	cfstr64mi	mvdx5, [r2], {79}	@ 0x4f
    8c04:	00312045 	eorseq	r2, r1, r5, asr #32
    8c08:	6f6c6c61 	svcvs	0x006c6c61
    8c0c:	73286163 			@ <UNDEFINED> instruction: 0x73286163
    8c10:	29657a69 	stmdbcs	r5!, {r0, r3, r5, r6, r9, fp, ip, sp, lr}^
    8c14:	625f5f20 	subsvs	r5, pc, #32, 30	@ 0x80
    8c18:	746c6975 	strbtvc	r6, [ip], #-2421	@ 0xfffff68b
    8c1c:	615f6e69 	cmpvs	pc, r9, ror #28
    8c20:	636f6c6c 	cmnvs	pc, #108, 24	@ 0x6c00
    8c24:	69732861 	ldmdbvs	r3!, {r0, r5, r6, fp, sp}^
    8c28:	0029657a 	eoreq	r6, r9, sl, ror r5
    8c2c:	57535f5f 			@ <UNDEFINED> instruction: 0x57535f5f
    8c30:	78302052 	ldmdavc	r0!, {r1, r4, r6, sp}
    8c34:	38303030 	ldmdacc	r0!, {r4, r5, ip, sp}
    8c38:	735f5f00 	cmpvc	pc, #0, 30
    8c3c:	69746365 	ldmdbvs	r4!, {r0, r2, r5, r6, r8, r9, sp, lr}^
    8c40:	78286e6f 	stmdavc	r8!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}
    8c44:	5f5f2029 	svcpl	0x005f2029
    8c48:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    8c4c:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    8c50:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    8c54:	735f5f28 	cmpvc	pc, #40, 30	@ 0xa0
    8c58:	69746365 	ldmdbvs	r4!, {r0, r2, r5, r6, r8, r9, sp, lr}^
    8c5c:	5f5f6e6f 	svcpl	0x005f6e6f
    8c60:	29297828 	stmdbcs	r9!, {r3, r5, fp, ip, sp, lr}
    8c64:	54490029 	strbpl	r0, [r9], #-41	@ 0xffffffd7
    8c68:	50545f4d 	subspl	r5, r4, sp, asr #30
    8c6c:	52505f52 	subspl	r5, r0, #328	@ 0x148
    8c70:	414d5649 	cmpmi	sp, r9, asr #12
    8c74:	505f4b53 	subspl	r4, pc, r3, asr fp	@ <UNPREDICTABLE>
    8c78:	3020736f 	eorcc	r7, r0, pc, ror #6
    8c7c:	43530055 	cmpmi	r3, #85	@ 0x55
    8c80:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    8c84:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    8c88:	45505253 	ldrbmi	r5, [r0, #-595]	@ 0xfffffdad
    8c8c:	4e49444e 	cdpmi	4, 4, cr4, cr9, cr14, {2}
    8c90:	734d5f47 	movtvc	r5, #57159	@ 0xdf47
    8c94:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    8c98:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    8c9c:	4353203c 	cmpmi	r3, #60	@ 0x3c
    8ca0:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    8ca4:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    8ca8:	45505253 	ldrbmi	r5, [r0, #-595]	@ 0xfffffdad
    8cac:	4e49444e 	cdpmi	4, 4, cr4, cr9, cr14, {2}
    8cb0:	6f505f47 	svcvs	0x00505f47
    8cb4:	4e002973 			@ <UNDEFINED> instruction: 0x4e002973
    8cb8:	5f434956 	svcpl	0x00434956
    8cbc:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    8cc0:	282a2032 	stmdacs	sl!, {r1, r4, r5, sp}
    8cc4:	616c6f76 	smcvs	50934	@ 0xc6f6
    8cc8:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    8ccc:	6e697520 	cdpvs	5, 6, cr7, cr9, cr0, {1}
    8cd0:	5f323374 	svcpl	0x00323374
    8cd4:	292a2074 	stmdbcs	sl!, {r2, r4, r5, r6, sp}
    8cd8:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    8cdc:	41425f43 	cmpmi	r2, r3, asr #30
    8ce0:	205f4553 	subscs	r4, pc, r3, asr r5	@ <UNPREDICTABLE>
    8ce4:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    8ce8:	5f002938 	svcpl	0x00002938
    8cec:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    8cf0:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    8cf4:	54002065 	strpl	r2, [r0], #-101	@ 0xffffff9b
    8cf8:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    8cfc:	5f524346 	svcpl	0x00524346
    8d00:	43466e45 	movtmi	r6, #28229	@ 0x6e45
    8d04:	5f746e6f 	svcpl	0x00746e6f
    8d08:	206b734d 	rsbcs	r7, fp, sp, asr #6
    8d0c:	31783028 	cmncc	r8, r8, lsr #32
    8d10:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    8d14:	5054203c 	subspl	r2, r4, ip, lsr r0
    8d18:	46465f49 	strbmi	r5, [r6], -r9, asr #30
    8d1c:	455f5243 	ldrbmi	r5, [pc, #-579]	@ 8ae1 <_Min_Stack_Size+0x86e1>
    8d20:	6f43466e 	svcvs	0x0043466e
    8d24:	505f746e 	subspl	r7, pc, lr, ror #8
    8d28:	0029736f 	eoreq	r7, r9, pc, ror #6
    8d2c:	5f424353 	svcpl	0x00424353
    8d30:	43524941 	cmpmi	r2, #1064960	@ 0x104000
    8d34:	59535f52 	ldmdbpl	r3, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    8d38:	53455253 	movtpl	r5, #21075	@ 0x5253
    8d3c:	45525445 	ldrbmi	r5, [r2, #-1093]	@ 0xfffffbbb
    8d40:	734d5f51 	movtvc	r5, #57169	@ 0xdf51
    8d44:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    8d48:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    8d4c:	4353203c 	cmpmi	r3, #60	@ 0x3c
    8d50:	49415f42 	stmdbmi	r1, {r1, r6, r8, r9, sl, fp, ip, lr}^
    8d54:	5f524352 	svcpl	0x00524352
    8d58:	52535953 	subspl	r5, r3, #1359872	@ 0x14c000
    8d5c:	54455345 	strbpl	r5, [r5], #-837	@ 0xfffffcbb
    8d60:	5f514552 	svcpl	0x00514552
    8d64:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    8d68:	535f5f00 	cmppl	pc, #0, 30
    8d6c:	2046424e 	subcs	r4, r6, lr, asr #4
    8d70:	30307830 	eorscc	r7, r0, r0, lsr r8
    8d74:	57003230 	smladxpl	r0, r0, r2, r3
    8d78:	52414843 	subpl	r4, r1, #4390912	@ 0x430000
    8d7c:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    8d80:	5f5f2820 	svcpl	0x005f2820
    8d84:	41484357 	cmpmi	r8, r7, asr r3
    8d88:	414d5f52 	cmpmi	sp, r2, asr pc
    8d8c:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    8d90:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    8d94:	5f544e45 	svcpl	0x00544e45
    8d98:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    8d9c:	28504d5f 	ldmdacs	r0, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    8da0:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    8da4:	206f6420 	rsbcs	r6, pc, r0, lsr #8
    8da8:	7473207b 	ldrbtvc	r2, [r3], #-123	@ 0xffffff85
    8dac:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    8db0:	65725f20 	ldrbvs	r5, [r2, #-3872]!	@ 0xfffff0e0
    8db4:	20746e65 	rsbscs	r6, r4, r5, ror #28
    8db8:	20725f2a 	rsbscs	r5, r2, sl, lsr #30
    8dbc:	7628203d 			@ <UNDEFINED> instruction: 0x7628203d
    8dc0:	3b297261 	blcc	a6574c <_Min_Stack_Size+0xa6534c>
    8dc4:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    8dc8:	706d5f3e 	rsbvc	r5, sp, lr, lsr pc
    8dcc:	725f3e2d 	subsvc	r3, pc, #720	@ 0x2d0
    8dd0:	6c757365 	ldclvs	3, cr7, [r5], #-404	@ 0xfffffe6c
    8dd4:	206b5f74 	rsbcs	r5, fp, r4, ror pc
    8dd8:	3b30203d 	blcc	c10ed4 <_Min_Stack_Size+0xc10ad4>
    8ddc:	2d725f20 	ldclcs	15, cr5, [r2, #-128]!	@ 0xffffff80
    8de0:	706d5f3e 	rsbvc	r5, sp, lr, lsr pc
    8de4:	725f3e2d 	subsvc	r3, pc, #720	@ 0x2d0
    8de8:	6c757365 	ldclvs	3, cr7, [r5], #-404	@ 0xfffffe6c
    8dec:	203d2074 	eorscs	r2, sp, r4, ror r0
    8df0:	3e2d725f 	mcrcc	2, 1, r7, cr13, cr15, {2}
    8df4:	2d706d5f 	ldclcs	13, cr6, [r0, #-380]!	@ 0xfffffe84
    8df8:	35705f3e 	ldrbcc	r5, [r0, #-3902]!	@ 0xfffff0c2
    8dfc:	203d2073 	eorscs	r2, sp, r3, ror r0
    8e00:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    8e04:	5f203b4c 	svcpl	0x00203b4c
    8e08:	5f3e2d72 	svcpl	0x003e2d72
    8e0c:	3e2d706d 	cdpcc	0, 2, cr7, cr13, cr13, {3}
    8e10:	6572665f 	ldrbvs	r6, [r2, #-1631]!	@ 0xfffff9a1
    8e14:	73696c65 	cmnvc	r9, #25856	@ 0x6500
    8e18:	203d2074 	eorscs	r2, sp, r4, ror r0
    8e1c:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    8e20:	7d203b4c 	vstmdbvc	r0!, {d3-<overflow reg d40>}
    8e24:	69687720 	stmdbvs	r8!, {r5, r8, r9, sl, ip, sp, lr}^
    8e28:	2820656c 	stmdacs	r0!, {r2, r3, r5, r6, r8, sl, sp, lr}
    8e2c:	41002930 	tstmi	r0, r0, lsr r9
    8e30:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 8cf0 <_Min_Stack_Size+0x88f0>
    8e34:	435f5550 	cmpmi	pc, #80, 10	@ 0x14000000
    8e38:	45484341 	strbmi	r4, [r8, #-833]	@ 0xfffffcbf
    8e3c:	42575f50 	subsmi	r5, r7, #80, 30	@ 0x140
    8e40:	41574e5f 	cmpmi	r7, pc, asr lr
    8e44:	00553320 	subseq	r3, r5, r0, lsr #6
    8e48:	5f495054 	svcpl	0x00495054
    8e4c:	54564544 	ldrbpl	r4, [r6], #-1348	@ 0xfffffabc
    8e50:	5f455059 	svcpl	0x00455059
    8e54:	6f6a614d 	svcvs	0x006a614d
    8e58:	70795472 	rsbsvc	r5, r9, r2, ror r4
    8e5c:	6f505f65 	svcvs	0x00505f65
    8e60:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    8e64:	42435300 	submi	r5, r3, #0, 6
    8e68:	5346435f 	movtpl	r4, #25439	@ 0x635f
    8e6c:	53555f52 	cmppl	r5, #328	@ 0x148
    8e70:	55414647 	strbpl	r4, [r1, #-1607]	@ 0xfffff9b9
    8e74:	5253544c 	subspl	r5, r3, #76, 8	@ 0x4c000000
    8e78:	6b734d5f 	blvs	1cdc3fc <_Min_Stack_Size+0x1cdbffc>
    8e7c:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    8e80:	46464646 	strbmi	r4, [r6], -r6, asr #12
    8e84:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    8e88:	4353203c 	cmpmi	r3, #60	@ 0x3c
    8e8c:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    8e90:	555f5253 	ldrbpl	r5, [pc, #-595]	@ 8c45 <_Min_Stack_Size+0x8845>
    8e94:	41464753 	cmpmi	r6, r3, asr r7
    8e98:	53544c55 	cmppl	r4, #21760	@ 0x5500
    8e9c:	6f505f52 	svcvs	0x00505f52
    8ea0:	5f002973 	svcpl	0x00002973
    8ea4:	554e475f 	strbpl	r4, [lr, #-1887]	@ 0xfffff8a1
    8ea8:	41565f43 	cmpmi	r6, r3, asr #30
    8eac:	53494c5f 	movtpl	r4, #40031	@ 0x9c5f
    8eb0:	41002054 	qaddmi	r2, r4, r0
    8eb4:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 8d74 <_Min_Stack_Size+0x8974>
    8eb8:	415f5550 	cmpmi	pc, r0, asr r5	@ <UNPREDICTABLE>
    8ebc:	53454343 	movtpl	r4, #21315	@ 0x5343
    8ec0:	524f5f53 	subpl	r5, pc, #332	@ 0x14c
    8ec4:	45524544 	ldrbmi	r4, [r2, #-1348]	@ 0xfffffabc
    8ec8:	52412044 	subpl	r2, r1, #68	@ 0x44
    8ecc:	504d5f4d 	subpl	r5, sp, sp, asr #30
    8ed0:	43415f55 	movtmi	r5, #8021	@ 0x1f55
    8ed4:	53534543 	cmppl	r3, #281018368	@ 0x10c00000
    8ed8:	5530285f 	ldrpl	r2, [r0, #-2143]!	@ 0xfffff7a1
    8edc:	5531202c 	ldrpl	r2, [r1, #-44]!	@ 0xffffffd4
    8ee0:	5530202c 	ldrpl	r2, [r0, #-44]!	@ 0xffffffd4
    8ee4:	5530202c 	ldrpl	r2, [r0, #-44]!	@ 0xffffffd4
    8ee8:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    8eec:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    8ef0:	435f4c52 	cmpmi	pc, #20992	@ 0x5200
    8ef4:	4e434359 	mcrmi	3, 2, r4, cr3, cr9, {2}
    8ef8:	414e4554 	cmpmi	lr, r4, asr r5
    8efc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    8f00:	00553020 	subseq	r3, r5, r0, lsr #32
    8f04:	5f4d5241 	svcpl	0x004d5241
    8f08:	5f55504d 	svcpl	0x0055504d
    8f0c:	48434143 	stmdami	r3, {r0, r1, r6, r8, lr}^
    8f10:	575f5045 	ldrbpl	r5, [pc, -r5, asr #32]
    8f14:	52575f42 	subspl	r5, r7, #264	@ 0x108
    8f18:	55312041 	ldrpl	r2, [r1, #-65]!	@ 0xffffffbf
    8f1c:	43324900 	teqmi	r2, #0, 18
    8f20:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    8f24:	4c534d5f 	mrrcmi	13, 5, r4, r3, cr15
    8f28:	6b734d5f 	blvs	1cdc4ac <_Min_Stack_Size+0x1cdc0ac>
    8f2c:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    8f30:	204c5531 	subcs	r5, ip, r1, lsr r5
    8f34:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    8f38:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    8f3c:	4d5f3252 	lfmmi	f3, 2, [pc, #-328]	@ 8dfc <_Min_Stack_Size+0x89fc>
    8f40:	505f4c53 	subspl	r4, pc, r3, asr ip	@ <UNPREDICTABLE>
    8f44:	0029736f 	eoreq	r7, r9, pc, ror #6
    8f48:	57454e5f 	smlsldpl	r4, r5, pc, lr	@ <UNPREDICTABLE>
    8f4c:	5f42494c 	svcpl	0x0042494c
    8f50:	53524556 	cmppl	r2, #360710144	@ 0x15800000
    8f54:	5f4e4f49 	svcpl	0x004e4f49
    8f58:	205f5f48 	subscs	r5, pc, r8, asr #30
    8f5c:	57440031 	smlaldxpl	r0, r4, r1, r0
    8f60:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    8f64:	535f4c52 	cmppl	pc, #20992	@ 0x5200
    8f68:	5045454c 	subpl	r4, r5, ip, asr #10
    8f6c:	45545645 	ldrbmi	r5, [r4, #-1605]	@ 0xfffff9bb
    8f70:	505f414e 	subspl	r4, pc, lr, asr #2
    8f74:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    8f78:	55005539 	strpl	r5, [r0, #-1337]	@ 0xfffffac7
    8f7c:	50544e49 	subspl	r4, r4, r9, asr #28
    8f80:	4d5f5254 	lfmmi	f5, 2, [pc, #-336]	@ 8e38 <_Min_Stack_Size+0x8a38>
    8f84:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    8f88:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    8f8c:	5450544e 	ldrbpl	r5, [r0], #-1102	@ 0xfffffbb2
    8f90:	414d5f52 	cmpmi	sp, r2, asr pc
    8f94:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    8f98:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    8f9c:	5050535f 	subspl	r5, r0, pc, asr r3
    8fa0:	58545f52 	ldmdapl	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    8fa4:	45444f4d 	strbmi	r4, [r4, #-3917]	@ 0xfffff0b3
    8fa8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    8fac:	00553020 	subseq	r3, r5, r0, lsr #32
    8fb0:	656e5f5f 	strbvs	r5, [lr, #-3935]!	@ 0xfffff0a1
    8fb4:	775f6465 	ldrbvc	r6, [pc, -r5, ror #8]
    8fb8:	5f746e69 	svcpl	0x00746e69
    8fbc:	52410074 	subpl	r0, r1, #116	@ 0x74
    8fc0:	504d5f4d 	subpl	r5, sp, sp, asr #30
    8fc4:	45525f55 	ldrbmi	r5, [r2, #-3925]	@ 0xfffff0ab
    8fc8:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    8fcc:	5a49535f 	bpl	125dd50 <_Min_Stack_Size+0x125d950>
    8fd0:	4d325f45 	ldcmi	15, cr5, [r2, #-276]!	@ 0xfffffeec
    8fd4:	28282042 	stmdacs	r8!, {r1, r6, sp}
    8fd8:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    8fdc:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    8fe0:	34317830 	ldrtcc	r7, [r1], #-2096	@ 0xfffff7d0
    8fe4:	49002955 	stmdbmi	r0, {r0, r2, r4, r6, r8, fp, sp}
    8fe8:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    8fec:	465f3252 			@ <UNDEFINED> instruction: 0x465f3252
    8ff0:	5f514552 	svcpl	0x00514552
    8ff4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    8ff8:	29553028 	ldmdbcs	r5, {r3, r5, ip, sp}^
    8ffc:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    9000:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    9004:	4f495443 	svcmi	0x00495443
    9008:	4d455f4e 	stclmi	15, cr5, [r5, #-312]	@ 0xfffffec8
    900c:	41525449 	cmpmi	r2, r9, asr #8
    9010:	5f45474e 	svcpl	0x0045474e
    9014:	20736f50 	rsbscs	r6, r3, r0, asr pc
    9018:	5f005535 	svcpl	0x00005535
    901c:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    9020:	52455f54 	subpl	r5, r5, #84, 30	@ 0x150
    9024:	284f4e52 	stmdacs	pc, {r1, r4, r6, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    9028:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    902c:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    9030:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    9034:	5f3e2d29 	svcpl	0x003e2d29
    9038:	6e727265 	cdpvs	2, 7, cr7, cr2, cr5, {3}
    903c:	4900296f 	stmdbmi	r0, {r0, r1, r2, r3, r5, r6, r8, fp, sp}
    9040:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    9044:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    9048:	414d5f38 	cmpmi	sp, r8, lsr pc
    904c:	5f282058 	svcpl	0x00282058
    9050:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    9054:	41454c5f 	cmpmi	r5, pc, asr ip
    9058:	5f385453 	svcpl	0x00385453
    905c:	5f58414d 	svcpl	0x0058414d
    9060:	5300295f 	movwpl	r2, #2399	@ 0x95f
    9064:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    9068:	5f525346 	svcpl	0x00525346
    906c:	534e554d 	movtpl	r5, #58701	@ 0xe54d
    9070:	52454b54 	subpl	r4, r5, #84, 22	@ 0x15000
    9074:	6f505f52 	svcvs	0x00505f52
    9078:	53282073 			@ <UNDEFINED> instruction: 0x53282073
    907c:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    9080:	5f525346 	svcpl	0x00525346
    9084:	464d454d 	strbmi	r4, [sp], -sp, asr #10
    9088:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    908c:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    9090:	2b20736f 	blcs	825e54 <_Min_Stack_Size+0x825a54>
    9094:	29553320 	ldmdbcs	r5, {r5, r8, r9, ip, sp}^
    9098:	43435200 	movtmi	r5, #12800	@ 0x3200
    909c:	4344415f 	movtmi	r4, #16735	@ 0x415f
    90a0:	65525f31 	ldrbvs	r5, [r2, #-3889]	@ 0xfffff0cf
    90a4:	28746573 	ldmdacs	r4!, {r0, r1, r4, r5, r6, r8, sl, sp, lr}^
    90a8:	52282029 	eorpl	r2, r8, #41	@ 0x29
    90ac:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    90b0:	32425041 	subcc	r5, r2, #65	@ 0x41
    90b4:	52545352 	subspl	r5, r4, #1207959553	@ 0x48000001
    90b8:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    90bc:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    90c0:	2939203c 	ldmdbcs	r9!, {r2, r3, r4, r5, sp}
    90c4:	5f5f0029 	svcpl	0x005f0029
    90c8:	43554e47 	cmpmi	r5, #1136	@ 0x470
    90cc:	454b494c 	strbmi	r4, [fp, #-2380]	@ 0xfffff6b4
    90d0:	4955425f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r9, lr}^
    90d4:	4e49544c 	cdpmi	4, 4, cr5, cr9, cr12, {2}
    90d8:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    90dc:	20475241 	subcs	r5, r7, r1, asr #4
    90e0:	495f0031 	ldmdbmi	pc, {r0, r4, r5}^	@ <UNPREDICTABLE>
    90e4:	46424e4f 	strbmi	r4, [r2], -pc, asr #28
    90e8:	5f003220 	svcpl	0x00003220
    90ec:	524f435f 	subpl	r4, pc, #2080374785	@ 0x7c000001
    90f0:	4d435f45 	stclmi	15, cr5, [r3, #-276]	@ 0xfffffeec
    90f4:	5f485f33 	svcpl	0x00485f33
    90f8:	45504544 	ldrbmi	r4, [r0, #-1348]	@ 0xfffffabc
    90fc:	4e41444e 	cdpmi	4, 4, cr4, cr1, cr14, {2}
    9100:	5f002054 	svcpl	0x00002054
    9104:	534f505f 	movtpl	r5, #61535	@ 0xf05f
    9108:	565f5849 	ldrbpl	r5, [pc], -r9, asr #16
    910c:	42495349 	submi	r5, r9, #603979777	@ 0x24000001
    9110:	3220454c 	eorcc	r4, r0, #76, 10	@ 0x13000000
    9114:	30383030 	eorscc	r3, r8, r0, lsr r0
    9118:	5f5f0039 	svcpl	0x005f0039
    911c:	4c57454e 	cfldr64mi	mvdx4, [r7], {78}	@ 0x4e
    9120:	5f5f4249 	svcpl	0x005f4249
    9124:	5f003420 	svcpl	0x00003420
    9128:	7465725f 	strbtvc	r7, [r5], #-607	@ 0xfffffda1
    912c:	736e7275 	cmnvc	lr, #1342177287	@ 0x50000007
    9130:	6977745f 	ldmdbvs	r7!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}^
    9134:	5f206563 	svcpl	0x00206563
    9138:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    913c:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    9140:	5f5f6574 	svcpl	0x005f6574
    9144:	5f5f2828 	svcpl	0x005f2828
    9148:	75746572 	ldrbvc	r6, [r4, #-1394]!	@ 0xfffffa8e
    914c:	5f736e72 	svcpl	0x00736e72
    9150:	63697774 	cmnvs	r9, #116, 14	@ 0x1d00000
