NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    9154:	295f5f65 	ldmdbcs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    9158:	6f430029 	svcvs	0x00430029
    915c:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    9160:	5f677562 	svcpl	0x00677562
    9164:	53434844 	movtpl	r4, #14404	@ 0x3844
    9168:	5f535f52 	svcpl	0x00535f52
    916c:	544c4148 	strbpl	r4, [ip], #-328	@ 0xfffffeb8
    9170:	736f505f 	cmnvc	pc, #95	@ 0x5f
    9174:	55373120 	ldrpl	r3, [r7, #-288]!	@ 0xfffffee0
    9178:	4e5f5f00 	cdpmi	15, 5, cr5, cr15, cr0, {0}
    917c:	5f434956 	svcpl	0x00434956
    9180:	4f495250 	svcmi	0x00495250
    9184:	5449425f 	strbpl	r4, [r9], #-607	@ 0xfffffda1
    9188:	55332053 	ldrpl	r2, [r3, #-83]!	@ 0xffffffad
    918c:	42435300 	submi	r5, r3, #0, 6
    9190:	4348535f 	movtmi	r5, #33631	@ 0x835f
    9194:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ 9050 <_Min_Stack_Size+0x8c50>
    9198:	41464d45 	cmpmi	r6, r5, asr #26
    919c:	45544c55 	ldrbmi	r4, [r4, #-3157]	@ 0xfffff3ab
    91a0:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ 9070 <_Min_Stack_Size+0x8c70>
    91a4:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    91a8:	204c5531 	subcs	r5, ip, r1, lsr r5
    91ac:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    91b0:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    91b4:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    91b8:	4d454d5f 	stclmi	13, cr4, [r5, #-380]	@ 0xfffffe84
    91bc:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    91c0:	414e4554 	cmpmi	lr, r4, asr r5
    91c4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    91c8:	504d0029 	subpl	r0, sp, r9, lsr #32
    91cc:	59545f55 	ldmdbpl	r4, {r0, r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    91d0:	525f4550 	subspl	r4, pc, #80, 10	@ 0x14000000
    91d4:	41494c41 	cmpmi	r9, r1, asr #24
    91d8:	20534553 	subscs	r4, r3, r3, asr r5
    91dc:	5f005534 	svcpl	0x00005534
    91e0:	49534f50 	ldmdbmi	r3, {r4, r6, r8, r9, sl, fp, lr}^
    91e4:	5f435f58 	svcpl	0x00435f58
    91e8:	52554f53 	subspl	r4, r5, #332	@ 0x14c
    91ec:	5f004543 	svcpl	0x00004543
    91f0:	4c57454e 	cfldr64mi	mvdx4, [r7], {78}	@ 0x4e
    91f4:	565f4249 	ldrbpl	r4, [pc], -r9, asr #4
    91f8:	49535245 	ldmdbmi	r3, {r0, r2, r6, r9, ip, lr}^
    91fc:	22204e4f 	eorcs	r4, r0, #1264	@ 0x4f0
    9200:	2e332e34 	mrccs	14, 1, r2, cr3, cr4, {1}
    9204:	49002230 	stmdbmi	r0, {r4, r5, r9, sp}
    9208:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    920c:	495f3252 	ldmdbmi	pc, {r1, r4, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
    9210:	46554254 			@ <UNDEFINED> instruction: 0x46554254
    9214:	505f4e45 	subspl	r4, pc, r5, asr #28
    9218:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    921c:	29553031 	ldmdbcs	r5, {r0, r4, r5, ip, sp}^
    9220:	425f5f00 	subsmi	r5, pc, #0, 30
    9224:	2854504b 	ldmdacs	r4, {r0, r1, r3, r6, ip, lr}^
    9228:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    922c:	5f202965 	svcpl	0x00202965
    9230:	4d53415f 	ldfmie	f4, [r3, #-380]	@ 0xfffffe84
    9234:	6c6f7620 	stclvs	6, cr7, [pc], #-128	@ 91bc <_Min_Stack_Size+0x8dbc>
    9238:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
    923c:	22282065 	eorcs	r2, r8, #101	@ 0x65
    9240:	74706b62 	ldrbtvc	r6, [r0], #-2914	@ 0xfffff49e
    9244:	76232220 	strtvc	r2, [r3], -r0, lsr #4
    9248:	65756c61 	ldrbvs	r6, [r5, #-3169]!	@ 0xfffff39f
    924c:	525f0029 	subspl	r0, pc, #41	@ 0x29
    9250:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    9254:	4548435f 	strbmi	r4, [r8, #-863]	@ 0xfffffca1
    9258:	525f4b43 	subspl	r4, pc, #68608	@ 0x10c00
    925c:	34444e41 	strbcc	r4, [r4], #-3649	@ 0xfffff1bf
    9260:	61762838 	cmnvs	r6, r8, lsr r8
    9264:	5f202972 	svcpl	0x00202972
    9268:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    926c:	48435f54 	stmdami	r3, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    9270:	284b4345 	stmdacs	fp, {r0, r2, r6, r8, r9, lr}^
    9274:	2c726176 	ldfcse	f6, [r2], #-472	@ 0xfffffe28
    9278:	34725f20 	ldrbtcc	r5, [r2], #-3872	@ 0xfffff0e0
    927c:	73202c38 			@ <UNDEFINED> instruction: 0x73202c38
    9280:	63757274 	cmnvs	r5, #116, 4	@ 0x40000007
    9284:	725f2074 	subsvc	r2, pc, #116	@ 0x74
    9288:	34646e61 	strbtcc	r6, [r4], #-3681	@ 0xfffff19f
    928c:	2c2a2038 	stccs	0, cr2, [sl], #-224	@ 0xffffff20
    9290:	7a697320 	bvc	1a65f18 <_Min_Stack_Size+0x1a65b18>
    9294:	20666f65 	rsbcs	r6, r6, r5, ror #30
    9298:	7628282a 	strtvc	r2, [r8], -sl, lsr #16
    929c:	2d297261 	sfmcs	f7, 4, [r9, #-388]!	@ 0xfffffe7c
    92a0:	34725f3e 	ldrbtcc	r5, [r2], #-3902	@ 0xfffff0c2
    92a4:	202c2938 	eorcs	r2, ip, r8, lsr r9
    92a8:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    92ac:	495f544e 	ldmdbmi	pc, {r1, r2, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    92b0:	5f54494e 	svcpl	0x0054494e
    92b4:	444e4152 	strbmi	r4, [lr], #-338	@ 0xfffffeae
    92b8:	28283834 	stmdacs	r8!, {r2, r4, r5, fp, ip, sp}
    92bc:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    92c0:	45002929 	strmi	r2, [r0, #-2345]	@ 0xfffff6d7
    92c4:	31495458 	cmpcc	r9, r8, asr r4
    92c8:	52495f31 	subpl	r5, r9, #49, 30	@ 0xc4
    92cc:	30342051 	eorscc	r2, r4, r1, asr r0
    92d0:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    92d4:	5f454c49 	svcpl	0x00454c49
    92d8:	69666564 	stmdbvs	r6!, {r2, r5, r6, r8, sl, sp, lr}^
    92dc:	2064656e 	rsbcs	r6, r4, lr, ror #10
    92e0:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    92e4:	4346465f 	movtmi	r4, #26207	@ 0x665f
    92e8:	72545f52 	subsvc	r5, r4, #328	@ 0x148
    92ec:	6e496769 	cdpvs	7, 4, cr6, cr9, cr9, {3}
    92f0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    92f4:	00553820 	subseq	r3, r5, r0, lsr #16
    92f8:	444e455f 	strbmi	r4, [lr], #-1375	@ 0xfffffaa1
    92fc:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    9300:	0020435f 	eoreq	r4, r0, pc, asr r3
    9304:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    9308:	52545054 	subspl	r5, r4, #84	@ 0x54
    930c:	445f545f 	ldrbmi	r5, [pc], #-1119	@ 9314 <_Min_Stack_Size+0x8f14>
    9310:	414c4345 	cmpmi	ip, r5, asr #6
    9314:	20444552 	subcs	r4, r4, r2, asr r5
    9318:	735f5f00 	cmpvc	pc, #0, 30
    931c:	666f6566 	strbtvs	r6, [pc], -r6, ror #10
    9320:	20297028 	eorcs	r7, r9, r8, lsr #32
    9324:	6e692828 	cdpvs	8, 6, cr2, cr9, cr8, {1}
    9328:	28282974 	stmdacs	r8!, {r2, r4, r5, r6, r8, fp, sp}
    932c:	2d297028 	stccs	0, cr7, [r9, #-160]!	@ 0xffffff60
    9330:	6c665f3e 	stclvs	15, cr5, [r6], #-248	@ 0xffffff08
    9334:	20736761 	rsbscs	r6, r3, r1, ror #14
    9338:	5f5f2026 	svcpl	0x005f2026
    933c:	464f4553 			@ <UNDEFINED> instruction: 0x464f4553
    9340:	3d212029 	stccc	0, cr2, [r1, #-164]!	@ 0xffffff5c
    9344:	29293020 	stmdbcs	r9!, {r5, ip, sp}
    9348:	554e5f00 	strbpl	r5, [lr, #-3840]	@ 0xfffff100
    934c:	30204c4c 	eorcc	r4, r0, ip, asr #24
    9350:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    9354:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    9358:	5f333251 	svcpl	0x00333251
    935c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    9360:	5f395f35 	svcpl	0x00395f35
    9364:	61736944 	cmnvs	r3, r4, asr #18
    9368:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    936c:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    9370:	5f434956 	svcpl	0x00434956
    9374:	52454349 	subpl	r4, r5, #603979777	@ 0x24000001
    9378:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	@ 0xffffff40
    937c:	20312820 	eorscs	r2, r1, r0, lsr #16
    9380:	32203c3c 	eorcc	r3, r0, #60, 24	@ 0x3c00
    9384:	00292933 	eoreq	r2, r9, r3, lsr r9
    9388:	63775f5f 	cmnvs	r7, #380	@ 0x17c
    938c:	5f726168 	svcpl	0x00726168
    9390:	205f5f74 	subscs	r5, pc, r4, ror pc	@ <UNPREDICTABLE>
    9394:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    9398:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    939c:	20355f4e 	eorscs	r5, r5, lr, asr #30
    93a0:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    93a4:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    93a8:	3029745f 	eorcc	r7, r9, pc, asr r4
    93ac:	32303078 	eorscc	r3, r0, #120	@ 0x78
    93b0:	49002930 	stmdbmi	r0, {r4, r5, r8, fp, sp}
    93b4:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ 93bc <_Min_Stack_Size+0x8fbc>
    93b8:	545f5243 	ldrbpl	r5, [pc], #-579	@ 93c0 <_Min_Stack_Size+0x8fc0>
    93bc:	45525053 	ldrbmi	r5, [r2, #-83]	@ 0xffffffad
    93c0:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
    93c4:	6f505f45 	svcvs	0x00505f45
    93c8:	55382073 	ldrpl	r2, [r8, #-115]!	@ 0xffffff8d
    93cc:	705f5f00 	subsvc	r5, pc, r0, lsl #30
    93d0:	75675f74 	strbvc	r5, [r7, #-3956]!	@ 0xfffff08c
    93d4:	65647261 	strbvs	r7, [r4, #-609]!	@ 0xfffffd9f
    93d8:	79625f64 	stmdbvc	r2!, {r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    93dc:	20297828 	eorcs	r7, r9, r8, lsr #16
    93e0:	6f6c5f5f 	svcvs	0x006c5f5f
    93e4:	615f6b63 	cmpvs	pc, r3, ror #22
    93e8:	746f6e6e 	strbtvc	r6, [pc], #-3694	@ 93f0 <_Min_Stack_Size+0x8ff0>
    93ec:	28657461 	stmdacs	r5!, {r0, r5, r6, sl, ip, sp, lr}^
    93f0:	675f7470 			@ <UNDEFINED> instruction: 0x675f7470
    93f4:	64726175 	ldrbtvs	r6, [r2], #-373	@ 0xfffffe8b
    93f8:	625f6465 	subsvs	r6, pc, #1694498816	@ 0x65000000
    93fc:	29782879 	ldmdbcs	r8!, {r0, r3, r4, r5, r6, fp, sp}^
    9400:	525f0029 	subspl	r0, pc, #41	@ 0x29
    9404:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    9408:	4548435f 	strbmi	r4, [r8, #-863]	@ 0xfffffca1
    940c:	4d5f4b43 	vldrmi	d20, [pc, #-268]	@ 9308 <_Min_Stack_Size+0x8f08>
    9410:	61762850 	cmnvs	r6, r0, asr r8
    9414:	5f202972 	svcpl	0x00202972
    9418:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    941c:	48435f54 	stmdami	r3, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    9420:	284b4345 	stmdacs	fp, {r0, r2, r6, r8, r9, lr}^
    9424:	2c726176 	ldfcse	f6, [r2], #-472	@ 0xfffffe28
    9428:	706d5f20 	rsbvc	r5, sp, r0, lsr #30
    942c:	7473202c 	ldrbtvc	r2, [r3], #-44	@ 0xffffffd4
    9430:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    9434:	706d5f20 	rsbvc	r5, sp, r0, lsr #30
    9438:	20636572 	rsbcs	r6, r3, r2, ror r5
    943c:	73202c2a 			@ <UNDEFINED> instruction: 0x73202c2a
    9440:	6f657a69 	svcvs	0x00657a69
    9444:	282a2066 	stmdacs	sl!, {r1, r2, r5, r6, sp}
    9448:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
    944c:	5f3e2d29 	svcpl	0x003e2d29
    9450:	2c29706d 	stccs	0, cr7, [r9], #-436	@ 0xfffffe4c
    9454:	45525f20 	ldrbmi	r5, [r2, #-3872]	@ 0xfffff0e0
    9458:	5f544e45 	svcpl	0x00544e45
    945c:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    9460:	28504d5f 	ldmdacs	r0, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    9464:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    9468:	5f5f0029 	svcpl	0x005f0029
    946c:	6f6c6c61 	svcvs	0x006c6c61
    9470:	69735f63 	ldmdbvs	r3!, {r0, r1, r5, r6, r8, r9, sl, fp, ip, lr}^
    9474:	7828657a 	stmdavc	r8!, {r1, r3, r4, r5, r6, r8, sl, sp, lr}
    9478:	5f5f2029 	svcpl	0x005f2029
    947c:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    9480:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    9484:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    9488:	615f5f28 	cmpvs	pc, r8, lsr #30
    948c:	636f6c6c 	cmnvs	pc, #108, 24	@ 0x6c00
    9490:	7a69735f 	bvc	1a66214 <_Min_Stack_Size+0x1a65e14>
    9494:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    9498:	29292978 	stmdbcs	r9!, {r3, r4, r5, r6, r8, fp, sp}
    949c:	43324900 	teqmi	r2, #0, 18
    94a0:	52455f31 	subpl	r5, r5, #49, 30	@ 0xc4
    94a4:	5152495f 	cmppl	r2, pc, asr r9
    94a8:	00323320 	eorseq	r3, r2, r0, lsr #6
    94ac:	5f433249 	svcpl	0x00433249
    94b0:	5f325243 	svcpl	0x00325243
    94b4:	5453414c 	ldrbpl	r4, [r3], #-332	@ 0xfffffeb4
    94b8:	6b734d5f 	blvs	1cdca3c <_Min_Stack_Size+0x1cdc63c>
    94bc:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    94c0:	204c5531 	subcs	r5, ip, r1, lsr r5
    94c4:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    94c8:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    94cc:	4c5f3252 	lfmmi	f3, 2, [pc], {82}	@ 0x52
    94d0:	5f545341 	svcpl	0x00545341
    94d4:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    94d8:	43324900 	teqmi	r2, #0, 18
    94dc:	28282032 	stmdacs	r8!, {r1, r4, r5, sp}
    94e0:	5f433249 	svcpl	0x00433249
    94e4:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
    94e8:	2a666544 	bcs	19a2a00 <_Min_Stack_Size+0x19a2600>
    94ec:	43324929 	teqmi	r2, #671744	@ 0xa4000
    94f0:	41425f32 	cmpmi	r2, r2, lsr pc
    94f4:	00294553 	eoreq	r4, r9, r3, asr r5
    94f8:	5f424353 	svcpl	0x00424353
    94fc:	5f524343 	svcpl	0x00524343
    9500:	424e4f4e 	submi	r4, lr, #312	@ 0x138
    9504:	54455341 	strbpl	r5, [r5], #-833	@ 0xfffffcbf
    9508:	45445248 	strbmi	r5, [r4, #-584]	@ 0xfffffdb8
    950c:	505f414e 	subspl	r4, pc, lr, asr #2
    9510:	3020736f 	eorcc	r7, r0, pc, ror #6
    9514:	564e0055 			@ <UNDEFINED> instruction: 0x564e0055
    9518:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    951c:	31524543 	cmpcc	r2, r3, asr #10
    9520:	76282a20 	strtvc	r2, [r8], -r0, lsr #20
    9524:	74616c6f 	strbtvc	r6, [r1], #-3183	@ 0xfffff391
    9528:	20656c69 	rsbcs	r6, r5, r9, ror #24
    952c:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    9530:	745f3233 	ldrbvc	r3, [pc], #-563	@ 9538 <_Min_Stack_Size+0x9138>
    9534:	28292a20 	stmdacs	r9!, {r5, r9, fp, sp}
    9538:	4349564e 	movtmi	r5, #38478	@ 0x964e
    953c:	5341425f 	movtpl	r4, #4703	@ 0x125f
    9540:	2b205f45 	blcs	82125c <_Min_Stack_Size+0x820e5c>
    9544:	38783020 	ldmdacc	r8!, {r5, ip, sp}^
    9548:	41002934 	tstmi	r0, r4, lsr r9
    954c:	204f4946 	subcs	r4, pc, r6, asr #18
    9550:	46412828 	strbmi	r2, [r1], -r8, lsr #16
    9554:	545f4f49 	ldrbpl	r4, [pc], #-3913	@ 955c <_Min_Stack_Size+0x915c>
    9558:	44657079 	strbtmi	r7, [r5], #-121	@ 0xffffff87
    955c:	2a206665 	bcs	822ef8 <_Min_Stack_Size+0x822af8>
    9560:	49464129 	stmdbmi	r6, {r0, r3, r5, r8, lr}^
    9564:	41425f4f 	cmpmi	r2, pc, asr #30
    9568:	00294553 	eoreq	r4, r9, r3, asr r5
    956c:	31544e49 	cmpcc	r4, r9, asr #28
    9570:	414d5f36 	cmpmi	sp, r6, lsr pc
    9574:	5f282058 	svcpl	0x00282058
    9578:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    957c:	4d5f3631 	ldclmi	6, cr3, [pc, #-196]	@ 94c0 <_Min_Stack_Size+0x90c0>
    9580:	5f5f5841 	svcpl	0x005f5841
    9584:	504d0029 	subpl	r0, sp, r9, lsr #32
    9588:	41425f55 	cmpmi	r2, r5, asr pc
    958c:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    9590:	5f534353 	svcpl	0x00534353
    9594:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    9598:	30202b20 	eorcc	r2, r0, r0, lsr #22
    959c:	39443078 	stmdbcc	r4, {r3, r4, r5, r6, ip, sp}^
    95a0:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
    95a4:	42435300 	submi	r5, r3, #0, 6
    95a8:	4348535f 	movtmi	r5, #33631	@ 0x835f
    95ac:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    95b0:	41465355 	cmpmi	r6, r5, asr r3
    95b4:	50544c55 	subspl	r4, r4, r5, asr ip
    95b8:	45444e45 	strbmi	r4, [r4, #-3653]	@ 0xfffff1bb
    95bc:	6f505f44 	svcvs	0x00505f44
    95c0:	34312073 	ldrtcc	r2, [r1], #-115	@ 0xffffff8d
    95c4:	43530055 	cmpmi	r3, #85	@ 0x55
    95c8:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    95cc:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    95d0:	52505253 	subspl	r5, r0, #805306373	@ 0x30000005
    95d4:	504d4545 	subpl	r4, sp, r5, asr #10
    95d8:	6f505f54 	svcvs	0x00505f54
    95dc:	33322073 	teqcc	r2, #115	@ 0x73
    95e0:	32490055 	subcc	r0, r9, #85	@ 0x55
    95e4:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    95e8:	564f5f31 			@ <UNDEFINED> instruction: 0x564f5f31
    95ec:	734d5f52 	movtvc	r5, #57170	@ 0xdf52
    95f0:	3028206b 	eorcc	r2, r8, fp, rrx
    95f4:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    95f8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    95fc:	5f433249 	svcpl	0x00433249
    9600:	5f315253 	svcpl	0x00315253
    9604:	5f52564f 	svcpl	0x0052564f
    9608:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    960c:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    9610:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
    9614:	63655674 	cmnvs	r5, #116, 12	@ 0x7400000
    9618:	20726f74 	rsbscs	r6, r2, r4, ror pc
    961c:	564e5f5f 			@ <UNDEFINED> instruction: 0x564e5f5f
    9620:	475f4349 	ldrbmi	r4, [pc, -r9, asr #6]
    9624:	65567465 	ldrbvs	r7, [r6, #-1125]	@ 0xfffffb9b
    9628:	726f7463 	rsbvc	r7, pc, #1660944384	@ 0x63000000
    962c:	735f5f00 	cmpvc	pc, #0, 30
    9630:	63746567 	cmnvs	r4, #432013312	@ 0x19c00000
    9634:	7761725f 			@ <UNDEFINED> instruction: 0x7761725f
    9638:	5f28725f 	svcpl	0x0028725f
    963c:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    9640:	665f5f2c 	ldrbvs	r5, [pc], -ip, lsr #30
    9644:	2d282029 	stccs	0, cr2, [r8, #-164]!	@ 0xffffff5c
    9648:	5f5f282d 	svcpl	0x005f282d
    964c:	3e2d2966 	vnmulcc.f16	s4, s26, s13	@ <UNPREDICTABLE>
    9650:	3c20725f 	sfmcc	f7, 4, [r0], #-380	@ 0xfffffe84
    9654:	3f203020 	svccc	0x00203020
    9658:	735f5f20 	cmpvc	pc, #32, 30	@ 0x80
    965c:	74656772 	strbtvc	r6, [r5], #-1906	@ 0xfffff88e
    9660:	5f28725f 	svcpl	0x0028725f
    9664:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    9668:	5f5f202c 	svcpl	0x005f202c
    966c:	3a202966 	bcc	813c0c <_Min_Stack_Size+0x81380c>
    9670:	6e692820 	cdpvs	8, 6, cr2, cr9, cr0, {1}
    9674:	2a282974 	bcs	a13c4c <_Min_Stack_Size+0xa1384c>
    9678:	665f5f28 	ldrbvs	r5, [pc], -r8, lsr #30
    967c:	5f3e2d29 	svcpl	0x003e2d29
    9680:	292b2b70 	stmdbcs	fp!, {r4, r5, r6, r8, r9, fp, sp}
    9684:	504d0029 	subpl	r0, sp, r9, lsr #32
    9688:	41525f55 	cmpmi	r2, r5, asr pc
    968c:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    9690:	736f505f 	cmnvc	pc, #95	@ 0x5f
    9694:	55363120 	ldrpl	r3, [r6, #-288]!	@ 0xfffffee0
    9698:	465f5f00 	ldrbmi	r5, [pc], -r0, lsl #30
    969c:	33545341 	cmpcc	r4, #67108865	@ 0x4000001
    96a0:	5f002032 	svcpl	0x00002032
    96a4:	4345565f 	movtmi	r5, #22111	@ 0x565f
    96a8:	5f524f54 	svcpl	0x00524f54
    96ac:	4c424154 	stfmie	f4, [r2], {84}	@ 0x54
    96b0:	5f5f2045 	svcpl	0x005f2045
    96b4:	74636556 	strbtvc	r6, [r3], #-1366	@ 0xfffffaaa
    96b8:	0073726f 	rsbseq	r7, r3, pc, ror #4
    96bc:	31434441 	cmpcc	r3, r1, asr #8
    96c0:	41282820 			@ <UNDEFINED> instruction: 0x41282820
    96c4:	545f4344 	ldrbpl	r4, [pc], #-836	@ 96cc <_Min_Stack_Size+0x92cc>
    96c8:	44657079 	strbtmi	r7, [r5], #-121	@ 0xffffff87
    96cc:	292a6665 	stmdbcs	sl!, {r0, r2, r5, r6, r9, sl, sp, lr}
    96d0:	43444128 	movtmi	r4, #16680	@ 0x4128
    96d4:	41425f31 	cmpmi	r2, r1, lsr pc
    96d8:	00294553 	eoreq	r4, r9, r3, asr r5
    96dc:	5f424353 	svcpl	0x00424353
    96e0:	49555043 	ldmdbmi	r5, {r0, r1, r6, ip, lr}^
    96e4:	45525f44 	ldrbmi	r5, [r2, #-3908]	@ 0xfffff0bc
    96e8:	49534956 	ldmdbmi	r3, {r1, r2, r4, r6, r8, fp, lr}^
    96ec:	4d5f4e4f 	ldclmi	14, cr4, [pc, #-316]	@ 95b8 <_Min_Stack_Size+0x91b8>
    96f0:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    96f4:	55467830 	strbpl	r7, [r6, #-2096]	@ 0xfffff7d0
    96f8:	0029204c 	eoreq	r2, r9, ip, asr #32
    96fc:	5f433249 	svcpl	0x00433249
    9700:	5f315253 	svcpl	0x00315253
    9704:	31444441 	cmpcc	r4, r1, asr #8
    9708:	32492030 	subcc	r2, r9, #48	@ 0x30
    970c:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    9710:	44415f31 	strbmi	r5, [r1], #-3889	@ 0xfffff0cf
    9714:	5f303144 	svcpl	0x00303144
    9718:	006b734d 	rsbeq	r7, fp, sp, asr #6
    971c:	4e535f5f 	mrcmi	15, 2, r5, cr3, cr15, {2}
    9720:	30204b4c 	eorcc	r4, r0, ip, asr #22
    9724:	30303078 	eorscc	r3, r0, r8, ror r0
    9728:	50540031 	subspl	r0, r4, r1, lsr r0
    972c:	45445f49 	strbmi	r5, [r4, #-3913]	@ 0xfffff0b7
    9730:	5f444956 	svcpl	0x00444956
    9734:	565a524e 	ldrbpl	r5, [sl], -lr, asr #4
    9738:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    973c:	6b734d5f 	blvs	1cdccc0 <_Min_Stack_Size+0x1cdc8c0>
    9740:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    9744:	204c5531 	subcs	r5, ip, r1, lsr r5
    9748:	54203c3c 	strtpl	r3, [r0], #-3132	@ 0xfffff3c4
    974c:	445f4950 	ldrbmi	r4, [pc], #-2384	@ 9754 <_Min_Stack_Size+0x9354>
    9750:	44495645 	strbmi	r5, [r9], #-1605	@ 0xfffff9bb
    9754:	5a524e5f 	bpl	149d0d8 <_Min_Stack_Size+0x149ccd8>
    9758:	494c4156 	stmdbmi	ip, {r1, r2, r4, r6, r8, lr}^
    975c:	6f505f44 	svcvs	0x00505f44
    9760:	44002973 	strmi	r2, [r0], #-2419	@ 0xfffff68d
    9764:	465f5457 			@ <UNDEFINED> instruction: 0x465f5457
    9768:	54434e55 	strbpl	r4, [r3], #-3669	@ 0xfffff1ab
    976c:	5f4e4f49 	svcpl	0x004e4f49
    9770:	4354414d 	cmpmi	r4, #1073741843	@ 0x40000013
    9774:	5f444548 	svcpl	0x00444548
    9778:	20736f50 	rsbscs	r6, r3, r0, asr pc
    977c:	00553432 	subseq	r3, r5, r2, lsr r4
    9780:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    9784:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    9788:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    978c:	5f525343 	svcpl	0x00525343
    9790:	4e535f43 	cdpmi	15, 5, cr5, cr3, cr3, {2}
    9794:	54535041 	ldrbpl	r5, [r3], #-65	@ 0xffffffbf
    9798:	5f4c4c41 	svcpl	0x004c4c41
    979c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    97a0:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    97a4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    97a8:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    97ac:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    97b0:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    97b4:	5f525343 	svcpl	0x00525343
    97b8:	4e535f43 	cdpmi	15, 5, cr5, cr3, cr3, {2}
    97bc:	54535041 	ldrbpl	r5, [r3], #-65	@ 0xffffffbf
    97c0:	5f4c4c41 	svcpl	0x004c4c41
    97c4:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    97c8:	435f5f00 	cmpmi	pc, #0, 30
    97cc:	435f334d 	cmpmi	pc, #872415233	@ 0x34000001
    97d0:	5349534d 	movtpl	r5, #37709	@ 0x934d
    97d4:	5245565f 	subpl	r5, r5, #99614720	@ 0x5f00000
    97d8:	4e4f4953 			@ <UNDEFINED> instruction: 0x4e4f4953
    97dc:	5f282820 	svcpl	0x00282820
    97e0:	334d435f 	movtcc	r4, #54111	@ 0xd35f
    97e4:	534d435f 	movtpl	r4, #54111	@ 0xd35f
    97e8:	565f5349 	ldrbpl	r5, [pc], -r9, asr #6
    97ec:	49535245 	ldmdbmi	r3, {r0, r2, r6, r9, ip, lr}^
    97f0:	4d5f4e4f 	ldclmi	14, cr4, [pc, #-316]	@ 96bc <_Min_Stack_Size+0x92bc>
    97f4:	204e4941 	subcs	r4, lr, r1, asr #18
    97f8:	31203c3c 			@ <UNDEFINED> instruction: 0x31203c3c
    97fc:	20295536 	eorcs	r5, r9, r6, lsr r5
    9800:	5f5f207c 	svcpl	0x005f207c
    9804:	5f334d43 	svcpl	0x00334d43
    9808:	49534d43 	ldmdbmi	r3, {r0, r1, r6, r8, sl, fp, lr}^
    980c:	45565f53 	ldrbmi	r5, [r6, #-3923]	@ 0xfffff0ad
    9810:	4f495352 	svcmi	0x00495352
    9814:	55535f4e 	ldrbpl	r5, [r3, #-3918]	@ 0xfffff0b2
    9818:	00292042 	eoreq	r2, r9, r2, asr #32
    981c:	5f434352 	svcpl	0x00434352
    9820:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    9824:	65502820 	ldrbvs	r2, [r0, #-2080]	@ 0xfffff7e0
    9828:	68706972 	ldmdavs	r0!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    982c:	6c617265 	sfmvs	f7, 2, [r1], #-404	@ 0xfffffe6c
    9830:	41425f73 	hvcmi	9715	@ 0x25f3
    9834:	2b204553 	blcs	81ad88 <_Min_Stack_Size+0x81a988>
    9838:	30783020 	rsbscc	r3, r8, r0, lsr #32
    983c:	31323030 	teqcc	r2, r0, lsr r0
    9840:	55303030 	ldrpl	r3, [r0, #-48]!	@ 0xffffffd0
    9844:	4e00294c 	vmlsmi.f16	s4, s0, s24	@ <UNPREDICTABLE>
    9848:	5f434956 	svcpl	0x00434956
    984c:	61656c43 	cmnvs	r5, r3, asr #24
    9850:	6e655072 	mcrvs	0, 3, r5, cr5, cr2, {3}
    9854:	676e6964 	strbvs	r6, [lr, -r4, ror #18]!
    9858:	20515249 	subscs	r5, r1, r9, asr #4
    985c:	564e5f5f 			@ <UNDEFINED> instruction: 0x564e5f5f
    9860:	435f4349 	cmpmi	pc, #603979777	@ 0x24000001
    9864:	7261656c 	rsbvc	r6, r1, #108, 10	@ 0x1b000000
    9868:	646e6550 	strbtvs	r6, [lr], #-1360	@ 0xfffffab0
    986c:	49676e69 	stmdbmi	r7!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    9870:	43005152 	movwmi	r5, #338	@ 0x152
    9874:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    9878:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    987c:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    9880:	565f5243 	ldrbpl	r5, [pc], -r3, asr #4
    9884:	55425f43 	strbpl	r5, [r2, #-3907]	@ 0xfffff0bd
    9888:	52524553 	subspl	r4, r2, #348127232	@ 0x14c00000
    988c:	6b734d5f 	blvs	1cdce10 <_Min_Stack_Size+0x1cdca10>
