NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    9890:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    9894:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    9898:	726f4320 	rsbvc	r4, pc, #32, 6	@ 0x80000000
    989c:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    98a0:	445f6775 	ldrbmi	r6, [pc], #-1909	@ 98a8 <_Min_Stack_Size+0x94a8>
    98a4:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    98a8:	5f43565f 	svcpl	0x0043565f
    98ac:	45535542 	ldrbmi	r5, [r3, #-1346]	@ 0xfffffabe
    98b0:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    98b4:	0029736f 	eoreq	r7, r9, pc, ror #6
    98b8:	5f433249 	svcpl	0x00433249
    98bc:	5f325243 	svcpl	0x00325243
    98c0:	51455246 	cmppl	r5, r6, asr #4
    98c4:	6b734d5f 	blvs	1cdce48 <_Min_Stack_Size+0x1cdca48>
    98c8:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    98cc:	4c554633 	mrrcmi	6, 3, r4, r5, cr3
    98d0:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    98d4:	5f433249 	svcpl	0x00433249
    98d8:	5f325243 	svcpl	0x00325243
    98dc:	51455246 	cmppl	r5, r6, asr #4
    98e0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    98e4:	52410029 	subpl	r0, r1, #41	@ 0x29
    98e8:	504d5f4d 	subpl	r5, sp, sp, asr #30
    98ec:	42525f55 	subsmi	r5, r2, #340	@ 0x154
    98f0:	52285241 	eorpl	r5, r8, #268435460	@ 0x10000004
    98f4:	6f696765 	svcvs	0x00696765
    98f8:	61422c6e 	cmpvs	r2, lr, ror #24
    98fc:	64416573 	strbvs	r6, [r1], #-1395	@ 0xfffffa8d
    9900:	73657264 	cmnvc	r5, #100, 4	@ 0x40000006
    9904:	28202973 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, fp, sp}
    9908:	61422828 	cmpvs	r2, r8, lsr #16
    990c:	64416573 	strbvs	r6, [r1], #-1395	@ 0xfffffa8d
    9910:	73657264 	cmnvc	r5, #100, 4	@ 0x40000006
    9914:	26202973 			@ <UNDEFINED> instruction: 0x26202973
    9918:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    991c:	4142525f 	cmpmi	r2, pc, asr r2
    9920:	44415f52 	strbmi	r5, [r1], #-3922	@ 0xfffff0ae
    9924:	4d5f5244 	lfmmi	f5, 2, [pc, #-272]	@ 981c <_Min_Stack_Size+0x941c>
    9928:	20296b73 	eorcs	r6, r9, r3, ror fp
    992c:	2828207c 	stmdacs	r8!, {r2, r3, r4, r5, r6, sp}
    9930:	69676552 	stmdbvs	r7!, {r1, r4, r6, r8, sl, sp, lr}^
    9934:	20296e6f 	eorcs	r6, r9, pc, ror #28
    9938:	504d2026 	subpl	r2, sp, r6, lsr #32
    993c:	42525f55 	subsmi	r5, r2, #340	@ 0x154
    9940:	525f5241 	subspl	r5, pc, #268435460	@ 0x10000004
    9944:	4f494745 	svcmi	0x00494745
    9948:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    994c:	7c20296b 			@ <UNDEFINED> instruction: 0x7c20296b
    9950:	504d2820 	subpl	r2, sp, r0, lsr #16
    9954:	42525f55 	subsmi	r5, r2, #340	@ 0x154
    9958:	565f5241 	ldrbpl	r5, [pc], -r1, asr #4
    995c:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    9960:	6b734d5f 	blvs	1cdcee4 <_Min_Stack_Size+0x1cdcae4>
    9964:	43002929 	movwmi	r2, #2345	@ 0x929
    9968:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    996c:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    9970:	5243445f 	subpl	r4, r3, #1593835520	@ 0x5f000000
    9974:	525f5253 	subspl	r5, pc, #805306373	@ 0x30000005
    9978:	45534745 	ldrbmi	r4, [r3, #-1861]	@ 0xfffff8bb
    997c:	6f505f4c 	svcvs	0x00505f4c
    9980:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    9984:	555f5f00 	ldrbpl	r5, [pc, #-3840]	@ 8a8c <_Min_Stack_Size+0x868c>
    9988:	494c414e 	stmdbmi	ip, {r1, r2, r3, r6, r8, lr}^
    998c:	44454e47 	strbmi	r4, [r5], #-3655	@ 0xfffff1b9
    9990:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    9994:	5f323354 	svcpl	0x00323354
    9998:	54495257 	strbpl	r5, [r9], #-599	@ 0xfffffda9
    999c:	64612845 	strbtvs	r2, [r1], #-2117	@ 0xfffff7bb
    99a0:	762c7264 	strtvc	r7, [ip], -r4, ror #4
    99a4:	20296c61 	eorcs	r6, r9, r1, ror #24
    99a8:	696f7628 	stmdbvs	pc!, {r3, r5, r9, sl, ip, sp, lr}^	@ <UNPREDICTABLE>
    99ac:	28282964 	stmdacs	r8!, {r2, r5, r6, r8, fp, sp}
    99b0:	74732828 	ldrbtvc	r2, [r3], #-2088	@ 0xfffff7d8
    99b4:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    99b8:	555f5420 	ldrbpl	r5, [pc, #-1056]	@ 95a0 <_Min_Stack_Size+0x91a0>
    99bc:	33544e49 	cmpcc	r4, #1168	@ 0x490
    99c0:	52575f32 	subspl	r5, r7, #50, 30	@ 0xc8
    99c4:	20455449 	subcs	r5, r5, r9, asr #8
    99c8:	7628292a 	strtvc	r2, [r8], -sl, lsr #18
    99cc:	2064696f 	rsbcs	r6, r4, pc, ror #18
    99d0:	6128292a 			@ <UNDEFINED> instruction: 0x6128292a
    99d4:	29726464 	ldmdbcs	r2!, {r2, r5, r6, sl, sp, lr}^
    99d8:	763e2d29 	ldrtvc	r2, [lr], -r9, lsr #26
    99dc:	203d2029 	eorscs	r2, sp, r9, lsr #32
    99e0:	6c617628 	stclvs	6, cr7, [r1], #-160	@ 0xffffff60
    99e4:	41002929 	tstmi	r0, r9, lsr #18
    99e8:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ 98a8 <_Min_Stack_Size+0x94a8>
    99ec:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    99f0:	4f494745 	svcmi	0x00494745
    99f4:	49535f4e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    99f8:	315f455a 	cmpcc	pc, sl, asr r5	@ <UNPREDICTABLE>
    99fc:	20424b36 	subcs	r4, r2, r6, lsr fp
    9a00:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    9a04:	5f38746e 	svcpl	0x0038746e
    9a08:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    9a0c:	29554430 	ldmdbcs	r5, {r4, r5, sl, lr}^
    9a10:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    9a14:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    9a18:	20305f4e 	eorscs	r5, r0, lr, asr #30
    9a1c:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    9a20:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    9a24:	3029745f 	eorcc	r7, r9, pc, asr r4
    9a28:	30303078 	eorscc	r3, r0, r8, ror r0
    9a2c:	4e002931 			@ <UNDEFINED> instruction: 0x4e002931
    9a30:	5f434956 	svcpl	0x00434956
    9a34:	33515249 	cmpcc	r1, #-1879048188	@ 0x90000004
    9a38:	32495f32 	subcc	r5, r9, #50, 30	@ 0xc8
    9a3c:	455f3143 	ldrbmi	r3, [pc, #-323]	@ 9901 <_Min_Stack_Size+0x9501>
    9a40:	69445f56 	stmdbvs	r4, {r1, r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    9a44:	6c626173 	stfvse	f6, [r2], #-460	@ 0xfffffe34
    9a48:	20292865 	eorcs	r2, r9, r5, ror #16
    9a4c:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    9a50:	43495f43 	movtmi	r5, #40771	@ 0x9f43
    9a54:	20315245 	eorscs	r5, r1, r5, asr #4
    9a58:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    9a5c:	303c3c31 	eorscc	r3, ip, r1, lsr ip
    9a60:	49002929 	stmdbmi	r0, {r0, r3, r5, r8, fp, sp}
    9a64:	4d5f434e 	ldclmi	3, cr4, [pc, #-312]	@ 9934 <_Min_Stack_Size+0x9534>
    9a68:	4f545259 	svcmi	0x00545259
    9a6c:	49465f53 	stmdbmi	r6, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    9a70:	485f4f46 	ldmdami	pc, {r1, r2, r6, r8, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    9a74:	5f00205f 	svcpl	0x0000205f
    9a78:	5f455355 	svcpl	0x00455355
    9a7c:	4f544447 	svcmi	0x00544447
    9a80:	49002041 	stmdbmi	r0, {r0, r6, sp}
    9a84:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    9a88:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    9a8c:	32492042 	subcc	r2, r9, #66	@ 0x42
    9a90:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    9a94:	42535f31 	subsmi	r5, r3, #49, 30	@ 0xc4
    9a98:	6b734d5f 	blvs	1cdd01c <_Min_Stack_Size+0x1cdcc1c>
    9a9c:	4e495500 	cdpmi	5, 4, cr5, cr9, cr0, {0}
    9aa0:	5f343654 	svcpl	0x00343654
    9aa4:	2058414d 	subscs	r4, r8, sp, asr #2
    9aa8:	555f5f28 	ldrbpl	r5, [pc, #-3880]	@ 8b88 <_Min_Stack_Size+0x8788>
    9aac:	36544e49 	ldrbcc	r4, [r4], -r9, asr #28
    9ab0:	414d5f34 	cmpmi	sp, r4, lsr pc
    9ab4:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    9ab8:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    9abc:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
    9ac0:	69725074 	ldmdbvs	r2!, {r2, r4, r5, r6, ip, lr}^
    9ac4:	7469726f 	strbtvc	r7, [r9], #-623	@ 0xfffffd91
    9ac8:	5f5f2079 	svcpl	0x005f2079
    9acc:	4349564e 	movtmi	r5, #38478	@ 0x964e
    9ad0:	7465475f 	strbtvc	r4, [r5], #-1887	@ 0xfffff8a1
    9ad4:	6f697250 	svcvs	0x00697250
    9ad8:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    9adc:	42435300 	submi	r5, r3, #0, 6
    9ae0:	5346435f 	movtpl	r4, #25439	@ 0x635f
    9ae4:	4d4d5f52 	stclmi	15, cr5, [sp, #-328]	@ 0xfffffeb8
    9ae8:	41565241 	cmpmi	r6, r1, asr #4
    9aec:	5f44494c 	svcpl	0x0044494c
    9af0:	206b734d 	rsbcs	r7, fp, sp, asr #6
    9af4:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    9af8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    9afc:	5f424353 	svcpl	0x00424353
    9b00:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    9b04:	414d4d5f 	cmpmi	sp, pc, asr sp
    9b08:	4c415652 	mcrrmi	6, 5, r5, r1, cr2
    9b0c:	505f4449 	subspl	r4, pc, r9, asr #8
    9b10:	0029736f 	eoreq	r7, r9, pc, ror #6
    9b14:	74735f5f 	ldrbtvc	r5, [r3], #-3935	@ 0xfffff0a1
    9b18:	676e6f72 			@ <UNDEFINED> instruction: 0x676e6f72
    9b1c:	6665725f 			@ <UNDEFINED> instruction: 0x6665725f
    9b20:	6e657265 	cdpvs	2, 6, cr7, cr5, cr5, {3}
    9b24:	73286563 			@ <UNDEFINED> instruction: 0x73286563
    9b28:	612c6d79 			@ <UNDEFINED> instruction: 0x612c6d79
    9b2c:	7361696c 	cmnvc	r1, #108, 18	@ 0x1b0000
    9b30:	296d7973 	stmdbcs	sp!, {r0, r1, r4, r5, r6, r8, fp, ip, sp, lr}^
    9b34:	74786520 	ldrbtvc	r6, [r8], #-1312	@ 0xfffffae0
    9b38:	206e7265 	rsbcs	r7, lr, r5, ror #4
    9b3c:	79745f5f 	ldmdbvc	r4!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    9b40:	666f6570 			@ <UNDEFINED> instruction: 0x666f6570
    9b44:	79732820 	ldmdbvc	r3!, {r5, fp, sp}^
    9b48:	6120296d 			@ <UNDEFINED> instruction: 0x6120296d
    9b4c:	7361696c 	cmnvc	r1, #108, 18	@ 0x1b0000
    9b50:	206d7973 	rsbcs	r7, sp, r3, ror r9
    9b54:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    9b58:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    9b5c:	5f657475 	svcpl	0x00657475
    9b60:	2828205f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, sp}
    9b64:	6c615f5f 	stclvs	15, cr5, [r1], #-380	@ 0xfffffe84
    9b68:	5f736169 	svcpl	0x00736169
    9b6c:	2328205f 			@ <UNDEFINED> instruction: 0x2328205f
    9b70:	296d7973 	stmdbcs	sp!, {r0, r1, r4, r5, r6, r8, fp, ip, sp, lr}^
    9b74:	53002929 	movwpl	r2, #2345	@ 0x929
    9b78:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    9b7c:	5f525346 	svcpl	0x00525346
    9b80:	43455250 	movtmi	r5, #21072	@ 0x5250
    9b84:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    9b88:	6f505f52 	svcvs	0x00505f52
    9b8c:	53282073 			@ <UNDEFINED> instruction: 0x53282073
    9b90:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    9b94:	5f525346 	svcpl	0x00525346
    9b98:	46535542 	ldrbmi	r5, [r3], -r2, asr #10
    9b9c:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    9ba0:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    9ba4:	2b20736f 	blcs	826968 <_Min_Stack_Size+0x826568>
    9ba8:	29553120 	ldmdbcs	r5, {r5, r8, ip, sp}^
    9bac:	43324900 	teqmi	r2, #0, 18
    9bb0:	3152535f 	cmpcc	r2, pc, asr r3
    9bb4:	2046415f 	subcs	r4, r6, pc, asr r1
    9bb8:	5f433249 	svcpl	0x00433249
    9bbc:	5f315253 	svcpl	0x00315253
    9bc0:	4d5f4641 	ldclmi	6, cr4, [pc, #-260]	@ 9ac4 <_Min_Stack_Size+0x96c4>
    9bc4:	49006b73 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    9bc8:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    9bcc:	415f5253 	cmpmi	pc, r3, asr r2	@ <UNPREDICTABLE>
    9bd0:	53454343 	movtpl	r4, #21315	@ 0x5343
    9bd4:	6f505f53 	svcvs	0x00505f53
    9bd8:	55312073 	ldrpl	r2, [r1, #-115]!	@ 0xffffff8d
    9bdc:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    9be0:	5f544e45 	svcpl	0x00544e45
    9be4:	465f504d 	ldrbmi	r5, [pc], -sp, asr #32
    9be8:	4c454552 	cfstr64mi	mvdx4, [r5], {82}	@ 0x52
    9bec:	28545349 	ldmdacs	r4, {r0, r3, r6, r8, r9, ip, lr}^
    9bf0:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    9bf4:	70282820 	eorvc	r2, r8, r0, lsr #16
    9bf8:	2d297274 	sfmcs	f7, 4, [r9, #-464]!	@ 0xfffffe30
    9bfc:	706d5f3e 	rsbvc	r5, sp, lr, lsr pc
    9c00:	665f3e2d 	ldrbvs	r3, [pc], -sp, lsr #28
    9c04:	6c656572 	cfstr64vs	mvdx6, [r5], #-456	@ 0xfffffe38
    9c08:	29747369 	ldmdbcs	r4!, {r0, r3, r5, r6, r8, r9, ip, sp, lr}^
    9c0c:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    9c10:	4c43554e 	cfstr64mi	mvdx5, [r3], {78}	@ 0x4e
    9c14:	5f454b49 	svcpl	0x00454b49
    9c18:	4c495542 	cfstr64mi	mvdx5, [r9], {66}	@ 0x42
    9c1c:	5f4e4954 	svcpl	0x004e4954
    9c20:	41524156 	cmpmi	r2, r6, asr r1
    9c24:	20534752 	subscs	r4, r3, r2, asr r7
    9c28:	4b5f0031 	blmi	17c9cf4 <_Min_Stack_Size+0x17c98f4>
    9c2c:	2078616d 	rsbscs	r6, r8, sp, ror #2
    9c30:	7a697328 	bvc	1a668d8 <_Min_Stack_Size+0x1a664d8>
    9c34:	20666f65 	rsbcs	r6, r6, r5, ror #30
    9c38:	7a697328 	bvc	1a668e0 <_Min_Stack_Size+0x1a664e0>
    9c3c:	29745f65 	ldmdbcs	r4!, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    9c40:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    9c44:	4e002933 			@ <UNDEFINED> instruction: 0x4e002933
    9c48:	5f434956 	svcpl	0x00434956
    9c4c:	33515249 	cmpcc	r1, #-1879048188	@ 0x90000004
    9c50:	53555f37 	cmppl	r5, #55, 30	@ 0xdc
    9c54:	31545241 	cmpcc	r4, r1, asr #4
    9c58:	616e455f 	cmnvs	lr, pc, asr r5
    9c5c:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    9c60:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    9c64:	5f434956 	svcpl	0x00434956
    9c68:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    9c6c:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	@ 0xffffff3c
    9c70:	20312820 	eorscs	r2, r1, r0, lsr #16
    9c74:	35203c3c 	strcc	r3, [r0, #-3132]!	@ 0xfffff3c4
    9c78:	5f002929 	svcpl	0x00002929
    9c7c:	4d53415f 	ldfmie	f4, [r3, #-380]	@ 0xfffffe84
    9c80:	454d414e 	strbmi	r4, [sp, #-334]	@ 0xfffffeb2
    9c84:	616e6328 	cmnvs	lr, r8, lsr #6
    9c88:	2029656d 	eorcs	r6, r9, sp, ror #10
    9c8c:	53585f5f 	cmppl	r8, #380	@ 0x17c
    9c90:	4e495254 	mcrmi	2, 2, r5, cr9, cr4, {2}
    9c94:	5f282047 	svcpl	0x00282047
    9c98:	4553555f 	ldrbmi	r5, [r3, #-1375]	@ 0xfffffaa1
    9c9c:	414c5f52 	cmpmi	ip, r2, asr pc
    9ca0:	5f4c4542 	svcpl	0x004c4542
    9ca4:	46455250 			@ <UNDEFINED> instruction: 0x46455250
    9ca8:	5f5f5849 	svcpl	0x005f5849
    9cac:	6e632029 	cdpvs	0, 6, cr2, cr3, cr9, {1}
    9cb0:	00656d61 	rsbeq	r6, r5, r1, ror #26
    9cb4:	5f495054 	svcpl	0x00495054
    9cb8:	54415449 	strbpl	r5, [r1], #-1097	@ 0xfffffbb7
    9cbc:	52544342 	subspl	r4, r4, #134217729	@ 0x8000001
    9cc0:	54415f32 	strbpl	r5, [r1], #-3890	@ 0xfffff0ce
    9cc4:	44414552 	strbmi	r4, [r1], #-1362	@ 0xfffffaae
    9cc8:	4d5f3159 	ldfmie	f3, [pc, #-356]	@ 9b6c <_Min_Stack_Size+0x976c>
    9ccc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    9cd0:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    9cd4:	0029204c 	eoreq	r2, r9, ip, asr #32
    9cd8:	5f4d5241 	svcpl	0x004d5241
    9cdc:	5f55504d 	svcpl	0x0055504d
    9ce0:	505f5041 	subspl	r5, pc, r1, asr #32
    9ce4:	35204f52 	strcc	r4, [r0, #-3922]!	@ 0xfffff0ae
    9ce8:	57440055 	smlsldpl	r0, r4, r5, r0
    9cec:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    9cf0:	435f4c52 	cmpmi	pc, #20992	@ 0x5200
    9cf4:	56454950 			@ <UNDEFINED> instruction: 0x56454950
    9cf8:	414e4554 	cmpmi	lr, r4, asr r5
    9cfc:	6b734d5f 	blvs	1cdd280 <_Min_Stack_Size+0x1cdce80>
    9d00:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    9d04:	204c5531 	subcs	r5, ip, r1, lsr r5
    9d08:	44203c3c 	strtmi	r3, [r0], #-3132	@ 0xfffff3c4
    9d0c:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    9d10:	5f4c5254 	svcpl	0x004c5254
    9d14:	45495043 	strbmi	r5, [r9, #-67]	@ 0xffffffbd
    9d18:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    9d1c:	6f505f41 	svcvs	0x00505f41
    9d20:	5f002973 	svcpl	0x00002973
    9d24:	6e695f5f 	mcrvs	15, 3, r5, cr9, cr15, {2}
    9d28:	656c5f74 	strbvs	r5, [ip, #-3956]!	@ 0xfffff08c
    9d2c:	31747361 	cmncc	r4, r1, ror #6
    9d30:	5f745f36 	svcpl	0x00745f36
    9d34:	69666564 	stmdbvs	r6!, {r2, r5, r6, r8, sl, sp, lr}^
    9d38:	2064656e 	rsbcs	r6, r4, lr, ror #10
    9d3c:	45530031 	ldrbmi	r0, [r3, #-49]	@ 0xffffffcf
    9d40:	455f4b45 	ldrbmi	r4, [pc, #-2885]	@ 9203 <_Min_Stack_Size+0x8e03>
    9d44:	3220444e 	eorcc	r4, r0, #1308622848	@ 0x4e000000
    9d48:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    9d4c:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    9d50:	495f314f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
    9d54:	625f4d54 	subsvs	r4, pc, #84, 26	@ 0x1500
    9d58:	63657479 	cmnvs	r5, #2030043136	@ 0x79000000
    9d5c:	746e756f 	strbtvc	r7, [lr], #-1391	@ 0xfffffa91
    9d60:	6b734d5f 	blvs	1cdd2e4 <_Min_Stack_Size+0x1cdcee4>
    9d64:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    9d68:	204c5533 	subcs	r5, ip, r3, lsr r5
    9d6c:	54203c3c 	strtpl	r3, [r0], #-3132	@ 0xfffff3c4
    9d70:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    9d74:	314f4649 	cmpcc	pc, r9, asr #12
    9d78:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    9d7c:	7479625f 	ldrbtvc	r6, [r9], #-607	@ 0xfffffda1
    9d80:	756f6365 	strbvc	r6, [pc, #-869]!	@ 9a23 <_Min_Stack_Size+0x9623>
    9d84:	505f746e 	subspl	r7, pc, lr, ror #8
    9d88:	0029736f 	eoreq	r7, r9, pc, ror #6
    9d8c:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    9d90:	525f544e 	subspl	r5, pc, #1308622848	@ 0x4e000000
    9d94:	34444e41 	strbcc	r4, [r4], #-3649	@ 0xfffff1bf
    9d98:	45535f38 	ldrbmi	r5, [r3, #-3896]	@ 0xfffff0c8
    9d9c:	70284445 	eorvc	r4, r8, r5, asr #8
    9da0:	20297274 	eorcs	r7, r9, r4, ror r2
    9da4:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    9da8:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    9dac:	3834725f 	ldmdacc	r4!, {r0, r1, r2, r3, r4, r6, r9, ip, sp, lr}
    9db0:	735f3e2d 	cmpvc	pc, #720	@ 0x2d0
    9db4:	29646565 	stmdbcs	r4!, {r0, r2, r5, r6, r8, sl, sp, lr}^
    9db8:	59535f00 	ldmdbpl	r3, {r8, r9, sl, fp, ip, lr}^
    9dbc:	49535f53 	ldmdbmi	r3, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    9dc0:	545f455a 	ldrbpl	r4, [pc], #-1370	@ 9dc8 <_Min_Stack_Size+0x99c8>
    9dc4:	0020485f 	eoreq	r4, r0, pc, asr r8
    9dc8:	5f544e49 	svcpl	0x00544e49
    9dcc:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    9dd0:	4d5f3631 	ldclmi	6, cr3, [pc, #-196]	@ 9d14 <_Min_Stack_Size+0x9914>
    9dd4:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    9dd8:	495f5f2d 	ldmdbmi	pc, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    9ddc:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    9de0:	31545341 	cmpcc	r4, r1, asr #6
    9de4:	414d5f36 	cmpmi	sp, r6, lsr pc
    9de8:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    9dec:	2931202d 	ldmdbcs	r1!, {r0, r2, r3, r5, sp}
    9df0:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    9df4:	5059545f 	subspl	r5, r9, pc, asr r4
    9df8:	52495f45 	subpl	r5, r9, #276	@ 0x114
    9dfc:	4f494745 	svcmi	0x00494745
    9e00:	6f505f4e 	svcvs	0x00505f4e
    9e04:	36312073 			@ <UNDEFINED> instruction: 0x36312073
    9e08:	43530055 	cmpmi	r3, #85	@ 0x55
    9e0c:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    9e10:	5f525343 	svcpl	0x00525343
    9e14:	464d454d 	strbmi	r4, [sp], -sp, asr #10
    9e18:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    9e1c:	5f414e45 	svcpl	0x00414e45
    9e20:	20736f50 	rsbscs	r6, r3, r0, asr pc
    9e24:	00553631 	subseq	r3, r5, r1, lsr r6
    9e28:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    9e2c:	615f6369 	cmpvs	pc, r9, ror #6
    9e30:	72657373 	rsbvc	r7, r5, #-872415231	@ 0xcc000001
    9e34:	535f2074 	cmppl	pc, #116	@ 0x74
    9e38:	69746174 	ldmdbvs	r4!, {r2, r4, r5, r6, r8, sp, lr}^
    9e3c:	73615f63 	cmnvc	r1, #396	@ 0x18c
    9e40:	74726573 	ldrbtvc	r6, [r2], #-1395	@ 0xfffffa8d
    9e44:	43324900 	teqmi	r2, #0, 18
    9e48:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    9e4c:	4152545f 	cmpmi	r2, pc, asr r4
    9e50:	6b734d5f 	blvs	1cdd3d4 <_Min_Stack_Size+0x1cdcfd4>
    9e54:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    9e58:	204c5531 	subcs	r5, ip, r1, lsr r5
    9e5c:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    9e60:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    9e64:	545f3252 	ldrbpl	r3, [pc], #-594	@ 9e6c <_Min_Stack_Size+0x9a6c>
    9e68:	505f4152 	subspl	r4, pc, r2, asr r1	@ <UNPREDICTABLE>
    9e6c:	0029736f 	eoreq	r7, r9, pc, ror #6
    9e70:	6f6c5f5f 	svcvs	0x006c5f5f
    9e74:	5f736b63 	svcpl	0x00736b63
    9e78:	72616873 	rsbvc	r6, r1, #7536640	@ 0x730000
    9e7c:	2e286465 	cdpcs	4, 2, cr6, cr8, cr5, {3}
    9e80:	20292e2e 	eorcs	r2, r9, lr, lsr #28
    9e84:	6f6c5f5f 	svcvs	0x006c5f5f
    9e88:	615f6b63 	cmpvs	pc, r3, ror #22
    9e8c:	746f6e6e 	strbtvc	r6, [pc], #-3694	@ 9e94 <_Min_Stack_Size+0x9a94>
    9e90:	28657461 	stmdacs	r5!, {r0, r5, r6, sl, ip, sp, lr}^
    9e94:	72616873 	rsbvc	r6, r1, #7536640	@ 0x730000
    9e98:	6c5f6465 	cfldrdvs	mvd6, [pc], {101}	@ 0x65
    9e9c:	5f6b636f 	svcpl	0x006b636f
    9ea0:	636e7566 	cmnvs	lr, #427819008	@ 0x19800000
    9ea4:	6e6f6974 			@ <UNDEFINED> instruction: 0x6e6f6974
    9ea8:	565f5f28 	ldrbpl	r5, [pc], -r8, lsr #30
    9eac:	52415f41 	subpl	r5, r1, #260	@ 0x104
    9eb0:	5f5f5347 	svcpl	0x005f5347
    9eb4:	4e002929 	vmlami.f16	s4, s0, s19	@ <UNPREDICTABLE>
    9eb8:	5f434956 	svcpl	0x00434956
    9ebc:	31515249 	cmpcc	r1, r9, asr #4
    9ec0:	44415f38 	strbmi	r5, [r1], #-3896	@ 0xfffff0c8
    9ec4:	6e455f43 	cdpvs	15, 4, cr5, cr5, cr3, {2}
    9ec8:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    9ecc:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    9ed0:	4349564e 	movtmi	r5, #38478	@ 0x964e
    9ed4:	4553495f 	ldrbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    9ed8:	7c203052 	stcvc	0, cr3, [r0], #-328	@ 0xfffffeb8
    9edc:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    9ee0:	38313c3c 	ldmdacc	r1!, {r2, r3, r4, r5, sl, fp, ip, sp}
    9ee4:	54002929 	strpl	r2, [r0], #-2345	@ 0xfffff6d7
    9ee8:	5f6b7361 	svcpl	0x006b7361
    9eec:	00666572 	rsbeq	r6, r6, r2, ror r5
    9ef0:	5f424353 	svcpl	0x00424353
    9ef4:	5f524343 	svcpl	0x00524343
    9ef8:	424e4f4e 	submi	r4, lr, #312	@ 0x138
    9efc:	54455341 	strbpl	r5, [r5], #-833	@ 0xfffffcbf
    9f00:	45445248 	strbmi	r5, [r4, #-584]	@ 0xfffffdb8
    9f04:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ 9dd4 <_Min_Stack_Size+0x99d4>
    9f08:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    9f0c:	204c5531 	subcs	r5, ip, r1, lsr r5
    9f10:	54490029 	strbpl	r0, [r9], #-41	@ 0xffffffd7
    9f14:	534c5f4d 	movtpl	r5, #53069	@ 0xcf4d
    9f18:	63415f52 	movtvs	r5, #8018	@ 0x1f52
    9f1c:	73736563 	cmnvc	r3, #415236096	@ 0x18c00000
    9f20:	6b734d5f 	blvs	1cdd4a4 <_Min_Stack_Size+0x1cdd0a4>
    9f24:	54492820 	strbpl	r2, [r9], #-2080	@ 0xfffff7e0
    9f28:	534c5f4d 	movtpl	r5, #53069	@ 0xcf4d
    9f2c:	43415f52 	movtmi	r5, #8018	@ 0x1f52
    9f30:	53534543 	cmppl	r3, #281018368	@ 0x10c00000
    9f34:	6b734d5f 	blvs	1cdd4b8 <_Min_Stack_Size+0x1cdd0b8>
    9f38:	525f0029 	subspl	r0, pc, #41	@ 0x29
    9f3c:	34444e41 	strbcc	r4, [r4], #-3649	@ 0xfffff1bf
    9f40:	554d5f38 	strbpl	r5, [sp, #-3896]	@ 0xfffff0c8
    9f44:	305f544c 	subscc	r5, pc, ip, asr #8
    9f48:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    9f4c:	64363665 	ldrtvs	r3, [r6], #-1637	@ 0xfffff99b
    9f50:	6f430029 	svcvs	0x00430029
    9f54:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    9f58:	5f677562 	svcpl	0x00677562
    9f5c:	434d4544 	movtmi	r4, #54596	@ 0xd544
    9f60:	4f4d5f52 	svcmi	0x004d5f52
    9f64:	45525f4e 	ldrbmi	r5, [r2, #-3918]	@ 0xfffff0b2
    9f68:	734d5f51 	movtvc	r5, #57169	@ 0xdf51
    9f6c:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    9f70:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    9f74:	6f43203c 	svcvs	0x0043203c
    9f78:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    9f7c:	5f677562 	svcpl	0x00677562
    9f80:	434d4544 	movtmi	r4, #54596	@ 0xd544
    9f84:	4f4d5f52 	svcmi	0x004d5f52
    9f88:	45525f4e 	ldrbmi	r5, [r2, #-3918]	@ 0xfffff0b2
    9f8c:	6f505f51 	svcvs	0x00505f51
    9f90:	43002973 	movwmi	r2, #2419	@ 0x973
    9f94:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    9f98:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    9f9c:	43282820 			@ <UNDEFINED> instruction: 0x43282820
    9fa0:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    9fa4:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    9fa8:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    9fac:	292a2065 	stmdbcs	sl!, {r0, r2, r5, r6, sp}
    9fb0:	726f4320 	rsbvc	r4, pc, #32, 6	@ 0x80000000
    9fb4:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
