NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    9fb8:	425f6775 	subsmi	r6, pc, #30670848	@ 0x1d40000
    9fbc:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
    9fc0:	435f5f00 	cmpmi	pc, #0, 30
    9fc4:	5349534d 	movtpl	r5, #37709	@ 0x934d
    9fc8:	4343475f 	movtmi	r4, #14175	@ 0x375f
    9fcc:	54554f5f 	ldrbpl	r4, [r5], #-3935	@ 0xfffff0a1
    9fd0:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    9fd4:	20297228 	eorcs	r7, r9, r8, lsr #4
    9fd8:	22723d22 	rsbscs	r3, r2, #2176	@ 0x880
    9fdc:	29722820 	ldmdbcs	r2!, {r5, fp, sp}^
    9fe0:	43324900 	teqmi	r2, #0, 18
    9fe4:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    9fe8:	4554495f 	ldrbmi	r4, [r4, #-2399]	@ 0xfffff6a1
    9fec:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    9ff0:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    9ff4:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    9ff8:	4554495f 	ldrbmi	r4, [r4, #-2399]	@ 0xfffff6a1
    9ffc:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    a000:	6b734d5f 	blvs	1cdd584 <_Min_Stack_Size+0x1cdd184>
    a004:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    a008:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a00c:	32315f4e 	eorscc	r5, r1, #312	@ 0x138
    a010:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    a014:	31746e69 	cmncc	r4, r9, ror #28
    a018:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    a01c:	30317830 	eorscc	r7, r1, r0, lsr r8
    a020:	00293030 	eoreq	r3, r9, r0, lsr r0
    a024:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    a028:	5f20544e 	svcpl	0x0020544e
    a02c:	75706d69 	ldrbvc	r6, [r0, #-3433]!	@ 0xfffff297
    a030:	705f6572 	subsvc	r6, pc, r2, ror r5	@ <UNPREDICTABLE>
    a034:	49007274 	stmdbmi	r0, {r2, r4, r5, r6, r9, ip, sp, lr}
    a038:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ a040 <_Min_Stack_Size+0x9c40>
    a03c:	545f5243 	ldrbpl	r5, [pc], #-579	@ a044 <_Min_Stack_Size+0x9c44>
    a040:	414e4553 	cmpmi	lr, r3, asr r5
    a044:	736f505f 	cmnvc	pc, #95	@ 0x5f
    a048:	00553120 	subseq	r3, r5, r0, lsr #2
    a04c:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    a050:	435f3631 	cmpmi	pc, #51380224	@ 0x3100000
    a054:	20297828 	eorcs	r7, r9, r8, lsr #16
    a058:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    a05c:	3631544e 	ldrtcc	r5, [r1], -lr, asr #8
    a060:	7828435f 	stmdavc	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, lr}
    a064:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    a068:	534c5f54 	movtpl	r5, #53076	@ 0xcf54
    a06c:	544e4355 	strbpl	r4, [lr], #-853	@ 0xfffffcab
    a070:	55534c5f 	ldrbpl	r4, [r3, #-3167]	@ 0xfffff3a1
    a074:	5f544e43 	svcpl	0x00544e43
    a078:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a07c:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    a080:	204c5546 	subcs	r5, ip, r6, asr #10
    a084:	5f5f0029 	svcpl	0x005f0029
    a088:	6b636f6c 	blvs	18e5e40 <_Min_Stack_Size+0x18e5a40>
    a08c:	696e695f 	stmdbvs	lr!, {r0, r1, r2, r3, r4, r6, r8, fp, sp, lr}^
    a090:	6f6c2874 	svcvs	0x006c2874
    a094:	20296b63 	eorcs	r6, r9, r3, ror #22
    a098:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
    a09c:	67726174 			@ <UNDEFINED> instruction: 0x67726174
    a0a0:	6c5f7465 	cfldrdvs	mvd7, [pc], {101}	@ 0x65
    a0a4:	5f6b636f 	svcpl	0x006b636f
    a0a8:	74696e69 	strbtvc	r6, [r9], #-3689	@ 0xfffff197
    a0ac:	6f6c2628 	svcvs	0x006c2628
    a0b0:	00296b63 	eoreq	r6, r9, r3, ror #22
    a0b4:	656e5f5f 	strbvs	r5, [lr, #-3935]!	@ 0xfffff0a1
    a0b8:	4e5f6465 	cdpmi	4, 5, cr6, cr15, cr5, {3}
    a0bc:	004c4c55 	subeq	r4, ip, r5, asr ip
    a0c0:	7366666f 	cmnvc	r6, #116391936	@ 0x6f00000
    a0c4:	666f7465 	strbtvs	r7, [pc], -r5, ror #8
    a0c8:	50595428 	subspl	r5, r9, r8, lsr #8
    a0cc:	454d2c45 	strbmi	r2, [sp, #-3141]	@ 0xfffff3bb
    a0d0:	5245424d 	subpl	r4, r5, #-805306364	@ 0xd0000004
    a0d4:	5f5f2029 	svcpl	0x005f2029
    a0d8:	6c697562 	cfstr64vs	mvdx7, [r9], #-392	@ 0xfffffe78
    a0dc:	5f6e6974 	svcpl	0x006e6974
    a0e0:	7366666f 	cmnvc	r6, #116391936	@ 0x6f00000
    a0e4:	666f7465 	strbtvs	r7, [pc], -r5, ror #8
    a0e8:	59542820 	ldmdbpl	r4, {r5, fp, sp}^
    a0ec:	202c4550 	eorcs	r4, ip, r0, asr r5
    a0f0:	424d454d 	submi	r4, sp, #322961408	@ 0x13400000
    a0f4:	00295245 	eoreq	r5, r9, r5, asr #4
    a0f8:	5f495054 	svcpl	0x00495054
    a0fc:	54435449 	strbpl	r5, [r3], #-1097	@ 0xfffffbb7
    a100:	4d5f4c52 	ldclmi	12, cr4, [pc, #-328]	@ 9fc0 <_Min_Stack_Size+0x9bc0>
    a104:	5f65646f 	svcpl	0x0065646f
    a108:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a10c:	33783028 	cmncc	r8, #40	@ 0x28
    a110:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    a114:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
    a118:	5f333149 	svcpl	0x00333149
    a11c:	20515249 	subscs	r5, r1, r9, asr #4
    a120:	53003034 	movwpl	r3, #52	@ 0x34
    a124:	43536e43 	cmpmi	r3, #1072	@ 0x430
    a128:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    a12c:	495f5254 	ldmdbmi	pc, {r2, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    a130:	494c544e 	stmdbmi	ip, {r1, r2, r3, r6, sl, ip, lr}^
    a134:	4e53454e 	cdpmi	5, 5, cr4, cr3, cr14, {2}
    a138:	4d5f4d55 	ldclmi	13, cr4, [pc, #-340]	@ 9fec <_Min_Stack_Size+0x9bec>
    a13c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    a140:	55467830 	strbpl	r7, [r6, #-2096]	@ 0xfffff7d0
    a144:	0029204c 	eoreq	r2, r9, ip, asr #32
    a148:	5f433249 	svcpl	0x00433249
    a14c:	5f315243 	svcpl	0x00315243
    a150:	504f5453 	subpl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
    a154:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    a158:	3152435f 	cmpcc	r2, pc, asr r3
    a15c:	4f54535f 	svcmi	0x0054535f
    a160:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    a164:	5845006b 	stmdapl	r5, {r0, r1, r3, r5, r6}^
    a168:	5f324954 	svcpl	0x00324954
    a16c:	20515249 	subscs	r5, r1, r9, asr #4
    a170:	50540038 	subspl	r0, r4, r8, lsr r0
    a174:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    a178:	5f304f46 	svcpl	0x00304f46
    a17c:	5f4d5449 	svcpl	0x004d5449
    a180:	41565441 	cmpmi	r6, r1, asr #8
    a184:	5f44494c 	svcpl	0x0044494c
    a188:	20736f50 	rsbscs	r6, r3, r0, asr pc
    a18c:	00553932 	subseq	r3, r5, r2, lsr r9
    a190:	54535953 	ldrbpl	r5, [r3], #-2387	@ 0xfffff6ad
    a194:	415f4d45 	cmpmi	pc, r5, asr #26
    a198:	4d434d52 	stclmi	13, cr4, [r3, #-328]	@ 0xfffffeb8
    a19c:	20485f33 	subcs	r5, r8, r3, lsr pc
    a1a0:	49545f00 	ldmdbmi	r4, {r8, r9, sl, fp, ip, lr}^
    a1a4:	5f52454d 	svcpl	0x0052454d
    a1a8:	75205f54 	strvc	r5, [r0, #-3924]!	@ 0xfffff0ac
    a1ac:	6769736e 	strbvs	r7, [r9, -lr, ror #6]!
    a1b0:	2064656e 	rsbcs	r6, r4, lr, ror #10
    a1b4:	676e6f6c 	strbvs	r6, [lr, -ip, ror #30]!
    a1b8:	705f5f00 	subsvc	r5, pc, r0, lsl #30
    a1bc:	656b6361 	strbvs	r6, [fp, #-865]!	@ 0xfffffc9f
    a1c0:	5f5f2064 	svcpl	0x005f2064
    a1c4:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    a1c8:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    a1cc:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    a1d0:	705f5f28 	subsvc	r5, pc, r8, lsr #30
    a1d4:	656b6361 	strbvs	r6, [fp, #-865]!	@ 0xfffffc9f
    a1d8:	295f5f64 	ldmdbcs	pc, {r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    a1dc:	5f5f0029 	svcpl	0x005f0029
    a1e0:	4f564544 	svcmi	0x00564544
    a1e4:	4954414c 	ldmdbmi	r4, {r2, r3, r6, r8, lr}^
    a1e8:	7428454c 	strtvc	r4, [r8], #-1356	@ 0xfffffab4
    a1ec:	2c657079 	stclcs	0, cr7, [r5], #-484	@ 0xfffffe1c
    a1f0:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    a1f4:	74282820 	strtvc	r2, [r8], #-2080	@ 0xfffff7e0
    a1f8:	29657079 	stmdbcs	r5!, {r0, r3, r4, r5, r6, ip, sp, lr}^
    a1fc:	755f5f28 	ldrbvc	r5, [pc, #-3880]	@ 92dc <_Min_Stack_Size+0x8edc>
    a200:	70746e69 	rsbsvc	r6, r4, r9, ror #28
    a204:	745f7274 	ldrbvc	r7, [pc], #-628	@ a20c <_Min_Stack_Size+0x9e0c>
    a208:	6f762829 	svcvs	0x00762829
    a20c:	6974616c 	ldmdbvs	r4!, {r2, r3, r5, r6, r8, sp, lr}^
    a210:	7620656c 	strtvc	r6, [r0], -ip, ror #10
    a214:	2064696f 	rsbcs	r6, r4, pc, ror #18
    a218:	7628292a 	strtvc	r2, [r8], -sl, lsr #18
    a21c:	29297261 	stmdbcs	r9!, {r0, r5, r6, r9, ip, sp, lr}
    a220:	454e5f00 	strbmi	r5, [lr, #-3840]	@ 0xfffff100
    a224:	42494c57 	submi	r4, r9, #22272	@ 0x5700
    a228:	4c4c415f 	stfmie	f4, [ip], {95}	@ 0x5f
    a22c:	5f41434f 	svcpl	0x0041434f
    a230:	49002048 	stmdbmi	r0, {r3, r6, sp}
    a234:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    a238:	525f3152 	subspl	r3, pc, #-2147483628	@ 0x80000014
    a23c:	5f454e58 	svcpl	0x00454e58
    a240:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a244:	31783028 	cmncc	r8, r8, lsr #32
    a248:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    a24c:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    a250:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    a254:	58525f31 	ldmdapl	r2, {r0, r4, r5, r8, r9, sl, fp, ip, lr}^
    a258:	505f454e 	subspl	r4, pc, lr, asr #10
    a25c:	0029736f 	eoreq	r7, r9, pc, ror #6
    a260:	54535f5f 	ldrbpl	r5, [r3], #-3935	@ 0xfffff0a1
    a264:	544e4944 	strbpl	r4, [lr], #-2372	@ 0xfffff6bc
    a268:	5058455f 	subspl	r4, r8, pc, asr r5
    a26c:	20297828 	eorcs	r7, r9, r8, lsr #16
    a270:	23205f5f 			@ <UNDEFINED> instruction: 0x23205f5f
    a274:	23207823 			@ <UNDEFINED> instruction: 0x23207823
    a278:	005f5f23 	subseq	r5, pc, r3, lsr #30
    a27c:	5f495054 	svcpl	0x00495054
    a280:	52504341 	subspl	r4, r0, #67108865	@ 0x4000001
    a284:	4552505f 	ldrbmi	r5, [r2, #-95]	@ 0xffffffa1
    a288:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
    a28c:	4d5f5245 	lfmmi	f5, 2, [pc, #-276]	@ a180 <_Min_Stack_Size+0x9d80>
    a290:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    a294:	46317830 			@ <UNDEFINED> instruction: 0x46317830
    a298:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    a29c:	49002920 	stmdbmi	r0, {r5, r8, fp, sp}
    a2a0:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    a2a4:	415f3152 	cmpmi	pc, r2, asr r1	@ <UNPREDICTABLE>
    a2a8:	204f4c52 	subcs	r4, pc, r2, asr ip	@ <UNPREDICTABLE>
    a2ac:	5f433249 	svcpl	0x00433249
    a2b0:	5f315253 	svcpl	0x00315253
    a2b4:	4f4c5241 	svcmi	0x004c5241
    a2b8:	6b734d5f 	blvs	1cdd83c <_Min_Stack_Size+0x1cdd43c>
    a2bc:	6d5f5f00 	ldclvs	15, cr5, [pc, #-0]	@ a2c4 <_Min_Stack_Size+0x9ec4>
    a2c0:	735f6e69 	cmpvc	pc, #1680	@ 0x690
    a2c4:	28657a69 	stmdacs	r5!, {r0, r3, r5, r6, r9, fp, ip, sp, lr}^
    a2c8:	73202978 			@ <UNDEFINED> instruction: 0x73202978
    a2cc:	69746174 	ldmdbvs	r4!, {r2, r4, r5, r6, r8, sp, lr}^
    a2d0:	78282063 	stmdavc	r8!, {r0, r1, r5, r6, sp}
    a2d4:	535f0029 	cmppl	pc, #41	@ 0x29
    a2d8:	5f5f5359 	svcpl	0x005f5359
    a2dc:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
    a2e0:	20485f53 	subcs	r5, r8, r3, asr pc
    a2e4:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    a2e8:	4954494e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, fp, lr}^
    a2ec:	535f4c41 	cmppl	pc, #16640	@ 0x4100
    a2f0:	5f5f2050 	svcpl	0x005f2050
    a2f4:	63617453 	cmnvs	r1, #1392508928	@ 0x53000000
    a2f8:	706f546b 	rsbvc	r5, pc, fp, ror #8
    a2fc:	74735f00 	ldrbtvc	r5, [r3], #-3840	@ 0xfffff100
    a300:	5f6e6964 	svcpl	0x006e6964
    a304:	29782872 	ldmdbcs	r8!, {r1, r4, r5, r6, fp, sp}^
    a308:	45525f20 	ldrbmi	r5, [r2, #-3872]	@ 0xfffff0e0
    a30c:	5f544e45 	svcpl	0x00544e45
    a310:	49445453 	stmdbmi	r4, {r0, r1, r4, r6, sl, ip, lr}^
    a314:	2978284e 	ldmdbcs	r8!, {r1, r2, r3, r6, fp, sp}^
    a318:	41525f00 	cmpmi	r2, r0, lsl #30
    a31c:	3834444e 	ldmdacc	r4!, {r1, r2, r3, r6, sl, lr}
    a320:	4545535f 	strbmi	r5, [r5, #-863]	@ 0xfffffca1
    a324:	20325f44 	eorscs	r5, r2, r4, asr #30
    a328:	31783028 	cmncc	r8, r8, lsr #32
    a32c:	29343332 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, ip, sp}
    a330:	535f5f00 	cmppl	pc, #0, 30
    a334:	20525245 	subscs	r5, r2, r5, asr #4
    a338:	30307830 	eorscc	r7, r0, r0, lsr r8
    a33c:	44003034 	strmi	r3, [r0], #-52	@ 0xffffffcc
    a340:	465f5457 			@ <UNDEFINED> instruction: 0x465f5457
    a344:	54434e55 	strbpl	r4, [r3], #-3669	@ 0xfffff1ab
    a348:	5f4e4f49 	svcpl	0x004e4f49
    a34c:	41544144 	cmpmi	r4, r4, asr #2
    a350:	5a495356 	bpl	125f0b0 <_Min_Stack_Size+0x125ecb0>
    a354:	6f505f45 	svcvs	0x00505f45
    a358:	30312073 	eorscc	r2, r1, r3, ror r0
    a35c:	5f5f0055 	svcpl	0x005f0055
    a360:	49534352 	ldmdbmi	r3, {r1, r4, r6, r8, r9, lr}^
    a364:	29732844 	ldmdbcs	r3!, {r2, r6, fp, sp}^
    a368:	72747320 	rsbsvc	r7, r4, #32, 6	@ 0x80000000
    a36c:	20746375 	rsbscs	r6, r4, r5, ror r3
    a370:	61685f5f 	cmnvs	r8, pc, asr pc
    a374:	5f006b63 	svcpl	0x00006b63
    a378:	444e455f 	strbmi	r4, [lr], #-1375	@ 0xfffffaa1
    a37c:	4345445f 	movtmi	r4, #21599	@ 0x545f
    a380:	0020534c 	eoreq	r5, r0, ip, asr #6
    a384:	5f433249 	svcpl	0x00433249
    a388:	5f315243 	svcpl	0x00315243
    a38c:	43474e45 	movtmi	r4, #32325	@ 0x7e45
    a390:	736f505f 	cmnvc	pc, #95	@ 0x5f
    a394:	55362820 	ldrpl	r2, [r6, #-2080]!	@ 0xfffff7e0
    a398:	5f5f0029 	svcpl	0x005f0029
    a39c:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    a3a0:	61656c5f 	cmnvs	r5, pc, asr ip
    a3a4:	34367473 	ldrtcc	r7, [r6], #-1139	@ 0xfffffb8d
    a3a8:	645f745f 	ldrbvs	r7, [pc], #-1119	@ a3b0 <_Min_Stack_Size+0x9fb0>
    a3ac:	6e696665 	cdpvs	6, 6, cr6, cr9, cr5, {3}
    a3b0:	31206465 			@ <UNDEFINED> instruction: 0x31206465
    a3b4:	6f687300 	svcvs	0x00687300
    a3b8:	2b207472 	blcs	827588 <_Min_Stack_Size+0x827188>
    a3bc:	50470031 	subpl	r0, r7, r1, lsr r0
    a3c0:	505f4f49 	subspl	r4, pc, r9, asr #30
    a3c4:	335f4e49 	cmpcc	pc, #1168	@ 0x490
    a3c8:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    a3cc:	31746e69 	cmncc	r4, r9, ror #28
    a3d0:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    a3d4:	30307830 	eorscc	r7, r0, r0, lsr r8
    a3d8:	00293830 	eoreq	r3, r9, r0, lsr r8
    a3dc:	65686353 	strbvs	r6, [r8, #-851]!	@ 0xfffffcad
    a3e0:	616c7564 	cmnvs	ip, r4, ror #10
    a3e4:	5f002072 	svcpl	0x00002072
    a3e8:	334d435f 	movtcc	r4, #54111	@ 0xd35f
    a3ec:	534d435f 	movtpl	r4, #54111	@ 0xd35f
    a3f0:	565f5349 	ldrbpl	r5, [pc], -r9, asr #6
    a3f4:	49535245 	ldmdbmi	r3, {r0, r2, r6, r9, ip, lr}^
    a3f8:	4d5f4e4f 	ldclmi	14, cr4, [pc, #-316]	@ a2c4 <_Min_Stack_Size+0x9ec4>
    a3fc:	204e4941 	subcs	r4, lr, r1, asr #18
    a400:	435f5f28 	cmpmi	pc, #40, 30	@ 0xa0
    a404:	4d435f4d 	stclmi	15, cr5, [r3, #-308]	@ 0xfffffecc
    a408:	5f534953 	svcpl	0x00534953
    a40c:	53524556 	cmppl	r2, #360710144	@ 0x15800000
    a410:	5f4e4f49 	svcpl	0x004e4f49
    a414:	4e49414d 	dvfmiem	f4, f1, #5.0
    a418:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    a41c:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    a420:	4e5f4c52 	mrcmi	12, 2, r4, cr15, cr2, {2}
    a424:	4359434f 	cmpmi	r9, #1006632961	@ 0x3c000001
    a428:	5f544e43 	svcpl	0x00544e43
    a42c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a430:	31783028 	cmncc	r8, r8, lsr #32
    a434:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    a438:	5744203c 	smlaldxpl	r2, r4, ip, r0
    a43c:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    a440:	4e5f4c52 	mrcmi	12, 2, r4, cr15, cr2, {2}
    a444:	4359434f 	cmpmi	r9, #1006632961	@ 0x3c000001
    a448:	5f544e43 	svcpl	0x00544e43
    a44c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    a450:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    a454:	52495f31 	subpl	r5, r9, #49, 30	@ 0xc4
    a458:	35332051 	ldrcc	r2, [r3, #-81]!	@ 0xffffffaf
    a45c:	535f5f00 	cmppl	pc, #0, 30
    a460:	2046424c 	subcs	r4, r6, ip, asr #4
    a464:	30307830 	eorscc	r7, r0, r0, lsr r8
    a468:	62003130 	andvs	r3, r0, #48, 2
    a46c:	00666675 	rsbeq	r6, r6, r5, ror r6
    a470:	5f424353 	svcpl	0x00424353
    a474:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    a478:	4e45505f 	mcrmi	0, 2, r5, cr5, cr15, {2}
    a47c:	43545344 	cmpmi	r4, #68, 6	@ 0x10000001
    a480:	505f524c 	subspl	r5, pc, ip, asr #4
    a484:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    a488:	41005535 	tstmi	r0, r5, lsr r5
    a48c:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ a34c <_Min_Stack_Size+0x9f4c>
    a490:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    a494:	4f494745 	svcmi	0x00494745
    a498:	49535f4e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a49c:	365f455a 			@ <UNDEFINED> instruction: 0x365f455a
    a4a0:	20424d34 	subcs	r4, r2, r4, lsr sp
    a4a4:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    a4a8:	5f38746e 	svcpl	0x0038746e
    a4ac:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    a4b0:	29553931 	ldmdbcs	r5, {r0, r4, r5, r8, fp, ip, sp}^
    a4b4:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    a4b8:	5f454545 	svcpl	0x00454545
    a4bc:	5454494c 	ldrbpl	r4, [r4], #-2380	@ 0xfffff6b4
    a4c0:	455f454c 	ldrbmi	r4, [pc, #-1356]	@ 9f7c <_Min_Stack_Size+0x9b7c>
    a4c4:	4149444e 	cmpmi	r9, lr, asr #8
    a4c8:	4500204e 	strmi	r2, [r0, #-78]	@ 0xffffffb2
    a4cc:	31495458 	cmpcc	r9, r8, asr r4
    a4d0:	52495f34 	subpl	r5, r9, #52, 30	@ 0xd0
    a4d4:	30342051 	eorscc	r2, r4, r1, asr r0
    a4d8:	43324900 	teqmi	r2, #0, 18
    a4dc:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    a4e0:	4c534d5f 	mrrcmi	13, 5, r4, r3, cr15
    a4e4:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    a4e8:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    a4ec:	4c534d5f 	mrrcmi	13, 5, r4, r3, cr15
    a4f0:	6b734d5f 	blvs	1cdda74 <_Min_Stack_Size+0x1cdd674>
    a4f4:	504f4600 	subpl	r4, pc, r0, lsl #12
    a4f8:	4d5f4e45 	ldclmi	14, cr4, [pc, #-276]	@ a3ec <_Min_Stack_Size+0x9fec>
    a4fc:	32205841 	eorcc	r5, r0, #4259840	@ 0x410000
    a500:	43530030 	cmpmi	r3, #48	@ 0x30
    a504:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    a508:	555f5253 	ldrbpl	r5, [pc, #-595]	@ a2bd <_Min_Stack_Size+0x9ebd>
    a50c:	4645444e 	strbmi	r4, [r5], -lr, asr #8
    a510:	54534e49 	ldrbpl	r4, [r3], #-3657	@ 0xfffff1b7
    a514:	734d5f52 	movtvc	r5, #57170	@ 0xdf52
    a518:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    a51c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    a520:	4353203c 	cmpmi	r3, #60	@ 0x3c
    a524:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    a528:	555f5253 	ldrbpl	r5, [pc, #-595]	@ a2dd <_Min_Stack_Size+0x9edd>
    a52c:	4645444e 	strbmi	r4, [r5], -lr, asr #8
    a530:	54534e49 	ldrbpl	r4, [r3], #-3657	@ 0xfffff1b7
    a534:	6f505f52 	svcvs	0x00505f52
    a538:	5f002973 	svcpl	0x00002973
    a53c:	49445453 	stmdbmi	r4, {r0, r1, r4, r6, sl, ip, lr}^
    a540:	5f485f4f 	svcpl	0x00485f4f
    a544:	50780020 	rsbspl	r0, r8, r0, lsr #32
    a548:	4e5f5253 	mrcmi	2, 2, r5, cr15, cr3, {2}
    a54c:	6b734d5f 	blvs	1cddad0 <_Min_Stack_Size+0x1cdd6d0>
    a550:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    a554:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    a558:	53507820 	cmppl	r0, #32, 16	@ 0x200000
    a55c:	5f4e5f52 	svcpl	0x004e5f52
    a560:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    a564:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    a568:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    a56c:	46485f4c 	strbmi	r5, [r8], -ip, asr #30
    a570:	45494d4e 	strbmi	r4, [r9, #-3406]	@ 0xfffff2b2
    a574:	505f414e 	subspl	r4, pc, lr, asr #2
    a578:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    a57c:	61660055 	qdsubvs	r0, r5, r6
    a580:	705f7473 	subsvc	r7, pc, r3, ror r4	@ <UNPREDICTABLE>
    a584:	28637475 	stmdacs	r3!, {r0, r2, r4, r5, r6, sl, ip, sp, lr}^
    a588:	29702c78 	ldmdbcs	r0!, {r3, r4, r5, r6, sl, fp, sp}^
    a58c:	2d2d2820 	stccs	8, cr2, [sp, #-128]!	@ 0xffffff80
    a590:	2d297028 	stccs	0, cr7, [r9, #-160]!	@ 0xffffff60
    a594:	20775f3e 	rsbscs	r5, r7, lr, lsr pc
    a598:	2030203c 	eorscs	r2, r0, ip, lsr r0
    a59c:	5f5f203f 	svcpl	0x005f203f
    a5a0:	75627773 	strbvc	r7, [r2, #-1907]!	@ 0xfffff88d
    a5a4:	28725f66 	ldmdacs	r2!, {r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    a5a8:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    a5ac:	202c544e 	eorcs	r5, ip, lr, asr #8
    a5b0:	746e6928 	strbtvc	r6, [lr], #-2344	@ 0xfffff6d8
    a5b4:	29782829 	ldmdbcs	r8!, {r0, r3, r5, fp, sp}^
    a5b8:	2970202c 	ldmdbcs	r0!, {r2, r3, r5, sp}^
    a5bc:	203d3d20 	eorscs	r3, sp, r0, lsr #26
    a5c0:	20464f45 	subcs	r4, r6, r5, asr #30
    a5c4:	2a28203a 	bcs	a126b4 <_Min_Stack_Size+0xa122b4>
    a5c8:	2d297028 	stccs	0, cr7, [r9, #-160]!	@ 0xffffff60
    a5cc:	20705f3e 	rsbscs	r5, r0, lr, lsr pc
    a5d0:	7828203d 	stmdavc	r8!, {r0, r2, r3, r4, r5, sp}
    a5d4:	28202c29 	stmdacs	r0!, {r0, r3, r5, sl, fp, sp}
    a5d8:	3e2d2970 			@ <UNDEFINED> instruction: 0x3e2d2970
    a5dc:	2b2b705f 	blcs	ae6760 <_Min_Stack_Size+0xae6360>
    a5e0:	2930202c 	ldmdbcs	r0!, {r2, r3, r5, sp}
    a5e4:	50540029 	subspl	r0, r4, r9, lsr #32
    a5e8:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    a5ec:	5f304f46 	svcpl	0x00304f46
    a5f0:	5f4d5445 	svcpl	0x004d5445
    a5f4:	41565441 	cmpmi	r6, r1, asr #8
    a5f8:	5f44494c 	svcpl	0x0044494c
    a5fc:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a600:	31783028 	cmncc	r8, r8, lsr #32
    a604:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    a608:	5054203c 	subspl	r2, r4, ip, lsr r0
    a60c:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    a610:	5f304f46 	svcpl	0x00304f46
    a614:	5f4d5445 	svcpl	0x004d5445
    a618:	41565441 	cmpmi	r6, r1, asr #8
    a61c:	5f44494c 	svcpl	0x0044494c
    a620:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    a624:	42435300 	submi	r5, r3, #0, 6
    a628:	4348535f 	movtmi	r5, #33631	@ 0x835f
    a62c:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    a630:	53444e45 	movtpl	r4, #20037	@ 0x4e45
    a634:	54434156 	strbpl	r4, [r3], #-342	@ 0xfffffeaa
    a638:	736f505f 	cmnvc	pc, #95	@ 0x5f
    a63c:	55303120 	ldrpl	r3, [r0, #-288]!	@ 0xfffffee0
    a640:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    a644:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    a648:	22203631 	eorcs	r3, r0, #51380224	@ 0x3100000
    a64c:	53002268 	movwpl	r2, #616	@ 0x268
    a650:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    a654:	435f6b63 	cmpmi	pc, #101376	@ 0x18c00
    a658:	42494c41 	submi	r4, r9, #16640	@ 0x4100
    a65c:	4e45545f 	mcrmi	4, 2, r5, cr5, cr15, {2}
    a660:	4d5f534d 	ldclmi	3, cr5, [pc, #-308]	@ a534 <_Min_Stack_Size+0xa134>
    a664:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    a668:	46467830 			@ <UNDEFINED> instruction: 0x46467830
    a66c:	46464646 	strbmi	r4, [r6], -r6, asr #12
    a670:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    a674:	735f5f00 	cmpvc	pc, #0, 30
    a678:	5f657a69 	svcpl	0x00657a69
    a67c:	205f5f74 	subscs	r5, pc, r4, ror pc	@ <UNPREDICTABLE>
    a680:	726f4300 	rsbvc	r4, pc, #0, 6
    a684:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    a688:	445f6775 	ldrbmi	r6, [pc], #-1909	@ a690 <_Min_Stack_Size+0xa290>
    a68c:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    a690:	4742445f 	smlsldmi	r4, r2, pc, r4	@ <UNPREDICTABLE>
    a694:	5f59454b 	svcpl	0x0059454b
    a698:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a69c:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    a6a0:	55464646 	strbpl	r4, [r6, #-1606]	@ 0xfffff9ba
    a6a4:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    a6a8:	726f4320 	rsbvc	r4, pc, #32, 6	@ 0x80000000
    a6ac:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    a6b0:	445f6775 	ldrbmi	r6, [pc], #-1909	@ a6b8 <_Min_Stack_Size+0xa2b8>
    a6b4:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    a6b8:	4742445f 	smlsldmi	r4, r2, pc, r4	@ <UNPREDICTABLE>
    a6bc:	5f59454b 	svcpl	0x0059454b
    a6c0:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    a6c4:	535f5f00 	cmppl	pc, #0, 30
    a6c8:	435f5359 	cmpmi	pc, #1677721601	@ 0x64000001
    a6cc:	49464e4f 	stmdbmi	r6, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
    a6d0:	5f485f47 	svcpl	0x00485f47
    a6d4:	4900205f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, sp}
    a6d8:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    a6dc:	445f3252 	ldrbmi	r3, [pc], #-594	@ a6e4 <_Min_Stack_Size+0xa2e4>
    a6e0:	4e45414d 	dvfmism	f4, f5, #5.0
    a6e4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    a6e8:	31312820 	teqcc	r1, r0, lsr #16
