NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    a6ec:	49002955 	stmdbmi	r0, {r0, r2, r4, r6, r8, fp, sp}
    a6f0:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ a6f8 <_Min_Stack_Size+0xa2f8>
    a6f4:	445f5243 	ldrbmi	r5, [pc], #-579	@ a6fc <_Min_Stack_Size+0xa2fc>
    a6f8:	4e455457 	mcrmi	4, 2, r5, cr5, cr7, {2}
    a6fc:	6f505f41 	svcvs	0x00505f41
    a700:	55332073 	ldrpl	r2, [r3, #-115]!	@ 0xffffff8d
    a704:	705f5f00 	subsvc	r5, pc, r0, lsl #30
    a708:	69646572 	stmdbvs	r4!, {r1, r4, r5, r6, r8, sl, sp, lr}^
    a70c:	665f7463 	ldrbvs	r7, [pc], -r3, ror #8
    a710:	65736c61 	ldrbvs	r6, [r3, #-3169]!	@ 0xfffff39f
    a714:	70786528 	rsbsvc	r6, r8, r8, lsr #10
    a718:	5f5f2029 	svcpl	0x005f2029
    a71c:	6c697562 	cfstr64vs	mvdx7, [r9], #-392	@ 0xfffffe78
    a720:	5f6e6974 	svcpl	0x006e6974
    a724:	65707865 	ldrbvs	r7, [r0, #-2149]!	@ 0xfffff79b
    a728:	28287463 	stmdacs	r8!, {r0, r1, r5, r6, sl, ip, sp, lr}
    a72c:	29707865 	ldmdbcs	r0!, {r0, r2, r5, r6, fp, ip, sp, lr}^
    a730:	2930202c 	ldmdbcs	r0!, {r2, r3, r5, sp}
    a734:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    a738:	5341525f 	movtpl	r5, #4703	@ 0x125f
    a73c:	50415f52 	subpl	r5, r1, r2, asr pc
    a740:	736f505f 	cmnvc	pc, #95	@ 0x5f
    a744:	55343220 	ldrpl	r3, [r4, #-544]!	@ 0xfffffde0
    a748:	726f4300 	rsbvc	r4, pc, #0, 6
    a74c:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    a750:	445f6775 	ldrbmi	r6, [pc], #-1909	@ a758 <_Min_Stack_Size+0xa358>
    a754:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    a758:	5f43565f 	svcpl	0x0043565f
    a75c:	44524148 	ldrbmi	r4, [r2], #-328	@ 0xfffffeb8
    a760:	5f525245 	svcpl	0x00525245
    a764:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a768:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    a76c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    a770:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    a774:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    a778:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
    a77c:	5f52434d 	svcpl	0x0052434d
    a780:	485f4356 	ldmdami	pc, {r1, r2, r4, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    a784:	45445241 	strbmi	r5, [r4, #-577]	@ 0xfffffdbf
    a788:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    a78c:	0029736f 	eoreq	r7, r9, pc, ror #6
    a790:	5f424353 	svcpl	0x00424353
    a794:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    a798:	5355425f 	cmppl	r5, #-268435451	@ 0xf0000005
    a79c:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    a7a0:	5f525354 	svcpl	0x00525354
    a7a4:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a7a8:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    a7ac:	204c5546 	subcs	r5, ip, r6, asr #10
    a7b0:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    a7b4:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    a7b8:	5f525346 	svcpl	0x00525346
    a7bc:	46535542 	ldrbmi	r5, [r3], -r2, asr #10
    a7c0:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    a7c4:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    a7c8:	0029736f 	eoreq	r7, r9, pc, ror #6
    a7cc:	20464f45 	subcs	r4, r6, r5, asr #30
    a7d0:	29312d28 	ldmdbcs	r1!, {r3, r5, r8, sl, fp, sp}
    a7d4:	4f505f00 	svcmi	0x00505f00
    a7d8:	45544e49 	ldrbmi	r4, [r4, #-3657]	@ 0xfffff1b7
    a7dc:	4e495f52 	mcrmi	15, 2, r5, cr9, cr2, {2}
    a7e0:	6f6c2054 	svcvs	0x006c2054
    a7e4:	5f00676e 	svcpl	0x0000676e
    a7e8:	58455441 	stmdapl	r5, {r0, r6, sl, ip, lr}^
    a7ec:	495f5449 	ldmdbmi	pc, {r0, r3, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
    a7f0:	2054494e 	subscs	r4, r4, lr, asr #18
    a7f4:	554e5f7b 	strbpl	r5, [lr, #-3963]	@ 0xfffff085
    a7f8:	202c4c4c 	eorcs	r4, ip, ip, asr #24
    a7fc:	7b202c30 	blvc	8158c4 <_Min_Stack_Size+0x8154c4>
    a800:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    a804:	202c7d4c 	eorcs	r7, ip, ip, asr #26
    a808:	4c554e5f 	mrrcmi	14, 5, r4, r5, cr15
    a80c:	41007d4c 	tstmi	r0, ip, asr #26
    a810:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ a6d0 <_Min_Stack_Size+0xa2d0>
    a814:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    a818:	4f494745 	svcmi	0x00494745
    a81c:	49535f4e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    a820:	315f455a 	cmpcc	pc, sl, asr r5	@ <UNPREDICTABLE>
    a824:	20424d36 	subcs	r4, r2, r6, lsr sp
    a828:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    a82c:	5f38746e 	svcpl	0x0038746e
    a830:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    a834:	29553731 	ldmdbcs	r5, {r0, r4, r5, r8, r9, sl, ip, sp}^
    a838:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    a83c:	5f544e45 	svcpl	0x00544e45
    a840:	444e4152 	strbmi	r4, [lr], #-338	@ 0xfffffeae
    a844:	415f3834 	cmpmi	pc, r4, lsr r8	@ <UNPREDICTABLE>
    a848:	70284444 	eorvc	r4, r8, r4, asr #8
    a84c:	20297274 	eorcs	r7, r9, r4, ror r2
    a850:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    a854:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    a858:	3834725f 	ldmdacc	r4!, {r0, r1, r2, r3, r4, r6, r9, ip, sp, lr}
    a85c:	615f3e2d 	cmpvs	pc, sp, lsr #28
    a860:	00296464 	eoreq	r6, r9, r4, ror #8
    a864:	5f433249 	svcpl	0x00433249
    a868:	5f315243 	svcpl	0x00315243
    a86c:	52415453 	subpl	r5, r1, #1392508928	@ 0x53000000
    a870:	32492054 	subcc	r2, r9, #84	@ 0x54
    a874:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    a878:	54535f31 	ldrbpl	r5, [r3], #-3889	@ 0xfffff0cf
    a87c:	5f545241 	svcpl	0x00545241
    a880:	006b734d 	rsbeq	r7, fp, sp, asr #6
    a884:	5f433249 	svcpl	0x00433249
    a888:	5f315253 	svcpl	0x00315253
    a88c:	52444441 	subpl	r4, r4, #1090519040	@ 0x41000000
    a890:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    a894:	3152535f 	cmpcc	r2, pc, asr r3
    a898:	4444415f 	strbmi	r4, [r4], #-351	@ 0xfffffea1
    a89c:	734d5f52 	movtvc	r5, #57170	@ 0xdf52
    a8a0:	5054006b 	subspl	r0, r4, fp, rrx
    a8a4:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    a8a8:	5f314f46 	svcpl	0x00314f46
    a8ac:	5f4d5449 	svcpl	0x004d5449
    a8b0:	65747962 	ldrbvs	r7, [r4, #-2402]!	@ 0xfffff69e
    a8b4:	6e756f63 	cdpvs	15, 7, cr6, cr5, cr3, {3}
    a8b8:	6f505f74 	svcvs	0x00505f74
    a8bc:	37322073 			@ <UNDEFINED> instruction: 0x37322073
    a8c0:	50470055 	subpl	r0, r7, r5, asr r0
    a8c4:	505f4f49 	subspl	r4, pc, r9, asr #30
    a8c8:	375f4e49 	ldrbcc	r4, [pc, -r9, asr #28]
    a8cc:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    a8d0:	31746e69 	cmncc	r4, r9, ror #28
    a8d4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    a8d8:	30307830 	eorscc	r7, r0, r0, lsr r8
    a8dc:	00293038 	eoreq	r3, r9, r8, lsr r0
    a8e0:	5f424353 	svcpl	0x00424353
    a8e4:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    a8e8:	4b54535f 	blmi	151f66c <_Min_Stack_Size+0x151f26c>
    a8ec:	5f525245 	svcpl	0x00525245
    a8f0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    a8f4:	42435328 	submi	r5, r3, #40, 6	@ 0xa0000000
    a8f8:	5346435f 	movtpl	r4, #25439	@ 0x635f
    a8fc:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    a900:	55414653 	strbpl	r4, [r1, #-1619]	@ 0xfffff9ad
    a904:	5253544c 	subspl	r5, r3, #76, 8	@ 0x4c000000
    a908:	736f505f 	cmnvc	pc, #95	@ 0x5f
    a90c:	34202b20 	strtcc	r2, [r0], #-2848	@ 0xfffff4e0
    a910:	5f002955 	svcpl	0x00002955
    a914:	41544552 	cmpmi	r4, r2, asr r5
    a918:	54454752 	strbpl	r4, [r5], #-1874	@ 0xfffff8ae
    a91c:	454c4241 	strbmi	r4, [ip, #-577]	@ 0xfffffdbf
    a920:	434f4c5f 	movtmi	r4, #64607	@ 0xfc5f
    a924:	474e494b 	strbmi	r4, [lr, -fp, asr #18]
    a928:	4d003120 	stfmis	f3, [r0, #-128]	@ 0xffffff80
    a92c:	545f5550 	ldrbpl	r5, [pc], #-1360	@ a934 <_Min_Stack_Size+0xa534>
    a930:	5f455059 	svcpl	0x00455059
    a934:	47455249 	strbmi	r5, [r5, -r9, asr #4]
    a938:	5f4e4f49 	svcpl	0x004e4f49
    a93c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    a940:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    a944:	204c5546 	subcs	r5, ip, r6, asr #10
    a948:	4d203c3c 	stcmi	12, cr3, [r0, #-240]!	@ 0xffffff10
    a94c:	545f5550 	ldrbpl	r5, [pc], #-1360	@ a954 <_Min_Stack_Size+0xa554>
    a950:	5f455059 	svcpl	0x00455059
    a954:	47455249 	strbmi	r5, [r5, -r9, asr #4]
    a958:	5f4e4f49 	svcpl	0x004e4f49
    a95c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    a960:	53425f00 	movtpl	r5, #12032	@ 0x2f00
    a964:	49535f44 	ldmdbmi	r3, {r2, r6, r8, r9, sl, fp, ip, lr}^
    a968:	545f455a 	ldrbpl	r4, [pc], #-1370	@ a970 <_Min_Stack_Size+0xa570>
    a96c:	5500205f 	strpl	r2, [r0, #-95]	@ 0xffffffa1
    a970:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    a974:	52495f33 	subpl	r5, r9, #51, 30	@ 0xcc
    a978:	39332051 	ldmdbcc	r3!, {r0, r4, r6, sp}
    a97c:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
    a980:	5f353149 	svcpl	0x00353149
    a984:	20515249 	subscs	r5, r1, r9, asr #4
    a988:	53003034 	movwpl	r3, #52	@ 0x34
    a98c:	415f4243 	cmpmi	pc, r3, asr #4
    a990:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    a994:	5359535f 	cmppl	r9, #2080374785	@ 0x7c000001
    a998:	45534552 	ldrbmi	r4, [r3, #-1362]	@ 0xfffffaae
    a99c:	51455254 	cmppl	r5, r4, asr r2
    a9a0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    a9a4:	00553220 	subseq	r3, r5, r0, lsr #4
    a9a8:	434f4c5f 	movtmi	r4, #64607	@ 0xfc5f
    a9ac:	45525f4b 	ldrbmi	r5, [r2, #-3915]	@ 0xfffff0b5
    a9b0:	53525543 	cmppl	r2, #281018368	@ 0x10c00000
    a9b4:	5f455649 	svcpl	0x00455649
    a9b8:	4c5f2054 	mrrcmi	0, 5, r2, pc, cr4	@ <UNPREDICTABLE>
    a9bc:	5f4b434f 	svcpl	0x004b434f
    a9c0:	535f0054 	cmppl	pc, #84	@ 0x54
    a9c4:	4e495254 	mcrmi	2, 2, r5, cr9, cr4, {2}
    a9c8:	5f485f47 	svcpl	0x00485f47
    a9cc:	32490020 	subcc	r0, r9, #32
    a9d0:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    a9d4:	54535f31 	ldrbpl	r5, [r3], #-3889	@ 0xfffff0cf
    a9d8:	505f504f 	subspl	r5, pc, pc, asr #32
    a9dc:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    a9e0:	00295539 	eoreq	r5, r9, r9, lsr r5
    a9e4:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    a9e8:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    a9ec:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
    a9f0:	5f52434d 	svcpl	0x0052434d
    a9f4:	435f4356 	cmpmi	pc, #1476395009	@ 0x58000001
    a9f8:	52454b48 	subpl	r4, r5, #72, 22	@ 0x12000
    a9fc:	6f505f52 	svcvs	0x00505f52
    aa00:	55362073 	ldrpl	r2, [r6, #-115]!	@ 0xffffff8d
    aa04:	6f4e5f00 	svcvs	0x004e5f00
    aa08:	6c756e6e 	ldclvs	14, cr6, [r5], #-440	@ 0xfffffe48
    aa0c:	5400206c 	strpl	r2, [r0], #-108	@ 0xffffff94
    aa10:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    aa14:	314f4649 	cmpcc	pc, r9, asr #12
    aa18:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    aa1c:	6f505f31 	svcvs	0x00505f31
    aa20:	55382073 	ldrpl	r2, [r8, #-115]!	@ 0xffffff8d
    aa24:	43324900 	teqmi	r2, #0, 18
    aa28:	3152535f 	cmpcc	r2, pc, asr r3
    aa2c:	4f54535f 	svcmi	0x0054535f
    aa30:	4d5f4650 	ldclmi	6, cr4, [pc, #-320]	@ a8f8 <_Min_Stack_Size+0xa4f8>
    aa34:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    aa38:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    aa3c:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    aa40:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    aa44:	3152535f 	cmpcc	r2, pc, asr r3
    aa48:	4f54535f 	svcmi	0x0054535f
    aa4c:	505f4650 	subspl	r4, pc, r0, asr r6	@ <UNPREDICTABLE>
    aa50:	0029736f 	eoreq	r7, r9, pc, ror #6
    aa54:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
    aa58:	52495f39 	subpl	r5, r9, #57, 30	@ 0xe4
    aa5c:	33322051 	teqcc	r2, #81	@ 0x51
    aa60:	535f5f00 	cmppl	pc, #0, 30
    aa64:	2046464f 	subcs	r4, r6, pc, asr #12
    aa68:	30317830 	eorscc	r7, r1, r0, lsr r8
    aa6c:	54003030 	strpl	r3, [r0], #-48	@ 0xffffffd0
    aa70:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    aa74:	5f524346 	svcpl	0x00524346
    aa78:	67697254 			@ <UNDEFINED> instruction: 0x67697254
    aa7c:	4d5f6e49 	ldclmi	14, cr6, [pc, #-292]	@ a960 <_Min_Stack_Size+0xa560>
    aa80:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    aa84:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    aa88:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    aa8c:	49505420 	ldmdbmi	r0, {r5, sl, ip, lr}^
    aa90:	4346465f 	movtmi	r4, #26207	@ 0x665f
    aa94:	72545f52 	subsvc	r5, r4, #328	@ 0x148
    aa98:	6e496769 	cdpvs	7, 4, cr6, cr9, cr9, {3}
    aa9c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    aaa0:	43530029 	cmpmi	r3, #41	@ 0x29
    aaa4:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    aaa8:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    aaac:	52505253 	subspl	r5, r0, #805306373	@ 0x30000005
    aab0:	504d4545 	subpl	r4, sp, r5, asr #10
    aab4:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
    aab8:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    aabc:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    aac0:	4353203c 	cmpmi	r3, #60	@ 0x3c
    aac4:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    aac8:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    aacc:	52505253 	subspl	r5, r0, #805306373	@ 0x30000005
    aad0:	504d4545 	subpl	r4, sp, r5, asr #10
    aad4:	6f505f54 	svcvs	0x00505f54
    aad8:	5f002973 	svcpl	0x00002973
    aadc:	554e475f 	strbpl	r4, [lr, #-1887]	@ 0xfffff8a1
    aae0:	5349565f 	movtpl	r5, #38495	@ 0x965f
    aae4:	454c4249 	strbmi	r4, [ip, #-585]	@ 0xfffffdb7
    aae8:	63003020 	movwvs	r3, #32
    aaec:	746e756f 	strbtvc	r7, [lr], #-1391	@ 0xfffffa91
    aaf0:	5f007265 	svcpl	0x00007265
    aaf4:	5058455f 	subspl	r4, r8, pc, asr r5
    aaf8:	43324900 	teqmi	r2, #0, 18
    aafc:	3152435f 	cmpcc	r2, pc, asr r3
    ab00:	4345505f 	movtmi	r5, #20575	@ 0x505f
    ab04:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    ab08:	3152435f 	cmpcc	r2, pc, asr r3
    ab0c:	4345505f 	movtmi	r5, #20575	@ 0x505f
    ab10:	6b734d5f 	blvs	1cde094 <_Min_Stack_Size+0x1cddc94>
    ab14:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    ab18:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    ab1c:	5f343351 	svcpl	0x00343351
    ab20:	32433249 	subcc	r3, r3, #-1879048188	@ 0x90000004
    ab24:	5f56455f 	svcpl	0x0056455f
    ab28:	61736944 	cmnvs	r3, r4, asr #18
    ab2c:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    ab30:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    ab34:	5f434956 	svcpl	0x00434956
    ab38:	52454349 	subpl	r4, r5, #603979777	@ 0x24000001
    ab3c:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	@ 0xffffff3c
    ab40:	3c312820 	ldccc	8, cr2, [r1], #-128	@ 0xffffff80
    ab44:	2929323c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, ip, sp}
    ab48:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    ab4c:	4f4d5f4f 	svcmi	0x004d5f4f
    ab50:	495f4544 	ldmdbmi	pc, {r2, r6, r8, sl, lr}^	@ <UNPREDICTABLE>
    ab54:	5455504e 	ldrbpl	r5, [r5], #-78	@ 0xffffffb2
    ab58:	4f4c465f 	svcmi	0x004c465f
    ab5c:	30783020 	rsbscc	r3, r8, r0, lsr #32
    ab60:	30303030 	eorscc	r3, r0, r0, lsr r0
    ab64:	75313030 	ldrvc	r3, [r1, #-48]!	@ 0xffffffd0
    ab68:	695f5f00 	ldmdbvs	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    ab6c:	3032746e 	eorscc	r7, r2, lr, ror #8
    ab70:	2b205f5f 	blcs	8228f4 <_Min_Stack_Size+0x8224f4>
    ab74:	43530032 	cmpmi	r3, #50	@ 0x32
    ab78:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    ab7c:	555f5253 	ldrbpl	r5, [pc, #-595]	@ a931 <_Min_Stack_Size+0xa531>
    ab80:	4b54534e 	blmi	151f8c0 <_Min_Stack_Size+0x151f4c0>
    ab84:	5f525245 	svcpl	0x00525245
    ab88:	20736f50 	rsbscs	r6, r3, r0, asr pc
    ab8c:	42435328 	submi	r5, r3, #40, 6	@ 0xa0000000
    ab90:	5346435f 	movtpl	r4, #25439	@ 0x635f
    ab94:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    ab98:	55414653 	strbpl	r4, [r1, #-1619]	@ 0xfffff9ad
    ab9c:	5253544c 	subspl	r5, r3, #76, 8	@ 0x4c000000
    aba0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    aba4:	33202b20 			@ <UNDEFINED> instruction: 0x33202b20
    aba8:	55002955 	strpl	r2, [r0, #-2389]	@ 0xfffff6ab
    abac:	5f544e49 	svcpl	0x00544e49
    abb0:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    abb4:	4d5f3631 	ldclmi	6, cr3, [pc, #-196]	@ aaf8 <_Min_Stack_Size+0xa6f8>
    abb8:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    abbc:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    abc0:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    abc4:	31545341 	cmpcc	r4, r1, asr #6
    abc8:	414d5f36 	cmpmi	sp, r6, lsr pc
    abcc:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    abd0:	41535500 	cmpmi	r3, r0, lsl #10
    abd4:	20335452 	eorscs	r5, r3, r2, asr r4
    abd8:	53552828 	cmppl	r5, #40, 16	@ 0x280000
    abdc:	5f545241 	svcpl	0x00545241
    abe0:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
    abe4:	20666544 	rsbcs	r6, r6, r4, asr #10
    abe8:	5355292a 	cmppl	r5, #688128	@ 0xa8000
    abec:	33545241 	cmpcc	r4, #268435460	@ 0x10000004
    abf0:	5341425f 	movtpl	r4, #4703	@ 0x125f
    abf4:	5f002945 	svcpl	0x00002945
    abf8:	49534e41 	ldmdbmi	r3, {r0, r6, r9, sl, fp, lr}^
    abfc:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    ac00:	5f464544 	svcpl	0x00464544
    ac04:	49002048 	stmdbmi	r0, {r3, r6, sp}
    ac08:	4f5f4332 	svcmi	0x005f4332
    ac0c:	5f325241 	svcpl	0x00325241
    ac10:	55444e45 	strbpl	r4, [r4, #-3653]	@ 0xfffff1bb
    ac14:	505f4c41 	subspl	r4, pc, r1, asr #24
    ac18:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    ac1c:	00295530 	eoreq	r5, r9, r0, lsr r5
    ac20:	544e4957 	strbpl	r4, [lr], #-2391	@ 0xfffff6a9
    ac24:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    ac28:	5f5f2820 	svcpl	0x005f2820
    ac2c:	544e4957 	strbpl	r4, [lr], #-2391	@ 0xfffff6a9
    ac30:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    ac34:	00295f5f 	eoreq	r5, r9, pc, asr pc
    ac38:	5f4d5449 	svcpl	0x004d5449
    ac3c:	5f524354 	svcpl	0x00524354
    ac40:	72505354 	subsvc	r5, r0, #84, 6	@ 0x50000001
    ac44:	61637365 	cmnvs	r3, r5, ror #6
    ac48:	4d5f656c 	cfldr64mi	mvdx6, [pc, #-432]	@ aaa0 <_Min_Stack_Size+0xa6a0>
    ac4c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    ac50:	5f4d5449 	svcpl	0x004d5449
    ac54:	5f524354 	svcpl	0x00524354
    ac58:	52505354 	subspl	r5, r0, #84, 6	@ 0x50000001
    ac5c:	41435345 	cmpmi	r3, r5, asr #6
    ac60:	4d5f454c 	cfldr64mi	mvdx4, [pc, #-304]	@ ab38 <_Min_Stack_Size+0xa738>
    ac64:	00296b73 	eoreq	r6, r9, r3, ror fp
    ac68:	4f495047 	svcmi	0x00495047
    ac6c:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
    ac70:	4f495047 	svcmi	0x00495047
    ac74:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    ac78:	66654465 	strbtvs	r4, [r5], -r5, ror #8
    ac7c:	47292a20 	strmi	r2, [r9, -r0, lsr #20]!
    ac80:	454f4950 	strbmi	r4, [pc, #-2384]	@ a338 <_Min_Stack_Size+0x9f38>
    ac84:	5341425f 	movtpl	r4, #4703	@ 0x125f
    ac88:	49002945 	stmdbmi	r0, {r0, r2, r6, r8, fp, sp}
    ac8c:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    ac90:	415f3152 	cmpmi	pc, r2, asr r1	@ <UNPREDICTABLE>
    ac94:	505f4b43 	subspl	r4, pc, r3, asr #22
    ac98:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    ac9c:	29553031 	ldmdbcs	r5, {r0, r4, r5, ip, sp}^
    aca0:	4d524100 	ldfmie	f4, [r2, #-0]
    aca4:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    aca8:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    acac:	5f4e4f49 	svcpl	0x004e4f49
    acb0:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    acb4:	3832315f 	ldmdacc	r2!, {r0, r1, r2, r3, r4, r6, r8, ip, sp}
    acb8:	2820424d 	stmdacs	r0!, {r0, r2, r3, r6, r9, lr}
    acbc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    acc0:	745f3874 	ldrbvc	r3, [pc], #-2164	@ acc8 <_Min_Stack_Size+0xa8c8>
    acc4:	31783029 	cmncc	r8, r9, lsr #32
    acc8:	00295541 	eoreq	r5, r9, r1, asr #10
    accc:	5f4d5449 	svcpl	0x004d5449
    acd0:	5f52534c 	svcpl	0x0052534c
    acd4:	45545942 	ldrbmi	r5, [r4, #-2370]	@ 0xfffff6be
    acd8:	5f434341 	svcpl	0x00434341
    acdc:	206b734d 	rsbcs	r7, fp, sp, asr #6
    ace0:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    ace4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ace8:	5f4d5449 	svcpl	0x004d5449
    acec:	5f52534c 	svcpl	0x0052534c
    acf0:	45545942 	ldrbmi	r5, [r4, #-2370]	@ 0xfffff6be
    acf4:	5f434341 	svcpl	0x00434341
    acf8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    acfc:	41525f00 	cmpmi	r2, r0, lsl #30
    ad00:	3834444e 	ldmdacc	r4!, {r1, r2, r3, r6, sl, lr}
    ad04:	4c554d5f 	mrrcmi	13, 5, r4, r5, cr15
    ad08:	20325f54 	eorscs	r5, r2, r4, asr pc
    ad0c:	30783028 	rsbscc	r3, r8, r8, lsr #32
    ad10:	29353030 	ldmdbcs	r5!, {r4, r5, ip, sp}
    ad14:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    ad18:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    ad1c:	33315f4e 	teqcc	r1, #312	@ 0x138
    ad20:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    ad24:	31746e69 	cmncc	r4, r9, ror #28
    ad28:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    ad2c:	30327830 	eorscc	r7, r2, r0, lsr r8
    ad30:	00293030 	eoreq	r3, r9, r0, lsr r0
    ad34:	4f4c435f 	svcmi	0x004c435f
    ad38:	44494b43 	strbmi	r4, [r9], #-2883	@ 0xfffff4bd
    ad3c:	205f545f 	subscs	r5, pc, pc, asr r4	@ <UNPREDICTABLE>
    ad40:	69736e75 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, sl, fp, sp, lr}^
    ad44:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    ad48:	6e6f6c20 	cdpvs	12, 6, cr6, cr15, cr0, {1}
    ad4c:	5f5f0067 	svcpl	0x005f0067
    ad50:	535f4343 	cmppl	pc, #201326593	@ 0xc000001
    ad54:	4f505055 	svcmi	0x00505055
    ad58:	5f535452 	svcpl	0x00535452
    ad5c:	41524156 	cmpmi	r2, r6, asr r1
    ad60:	5f434944 	svcpl	0x00434944
    ad64:	20585858 	subscs	r5, r8, r8, asr r8
    ad68:	43530031 	cmpmi	r3, #49	@ 0x31
    ad6c:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    ad70:	5f525343 	svcpl	0x00525343
    ad74:	46475355 			@ <UNDEFINED> instruction: 0x46475355
    ad78:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    ad7c:	444e4550 	strbmi	r4, [lr], #-1360	@ 0xfffffab0
    ad80:	505f4445 	subspl	r4, pc, r5, asr #8
    ad84:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    ad88:	47005532 	smladxmi	r0, r2, r5, r5
    ad8c:	434f4950 	movtmi	r4, #63824	@ 0xf950
    ad90:	5341425f 	movtpl	r4, #4703	@ 0x125f
    ad94:	50282045 	eorpl	r2, r8, r5, asr #32
    ad98:	70697265 	rsbvc	r7, r9, r5, ror #4
    ad9c:	61726568 	cmnvs	r2, r8, ror #10
    ada0:	425f736c 	subsmi	r7, pc, #108, 6	@ 0xb0000001
    ada4:	20455341 	subcs	r5, r5, r1, asr #6
    ada8:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    adac:	31303030 	teqcc	r0, r0, lsr r0
    adb0:	30303031 	eorscc	r3, r0, r1, lsr r0
    adb4:	00294c55 	eoreq	r4, r9, r5, asr ip
    adb8:	4349564e 	movtmi	r5, #38478	@ 0x964e
    adbc:	5152495f 	cmppl	r2, pc, asr r9
    adc0:	455f3031 	ldrbmi	r3, [pc, #-49]	@ ad97 <_Min_Stack_Size+0xa997>
    adc4:	34495458 	strbcc	r5, [r9], #-1112	@ 0xfffffba8
    adc8:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
    adcc:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    add0:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    add4:	4349564e 	movtmi	r5, #38478	@ 0x964e
    add8:	4543495f 	strbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    addc:	7c203052 	stcvc	0, cr3, [r0], #-328	@ 0xfffffeb8
    ade0:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    ade4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ade8:	29293031 	stmdbcs	r9!, {r0, r4, r5, ip, sp}
    adec:	73795300 	cmnvc	r9, #0, 6
    adf0:	6b636954 	blvs	18e5348 <_Min_Stack_Size+0x18e4f48>
    adf4:	4c41435f 	mcrrmi	3, 5, r4, r1, cr15
    adf8:	535f4249 	cmppl	pc, #-1879048188	@ 0x90000004
    adfc:	5f57454b 	svcpl	0x0057454b
    ae00:	206b734d 	rsbcs	r7, fp, sp, asr #6
    ae04:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    ae08:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ae0c:	54737953 	ldrbtpl	r7, [r3], #-2387	@ 0xfffff6ad
    ae10:	5f6b6369 	svcpl	0x006b6369
    ae14:	494c4143 	stmdbmi	ip, {r0, r1, r6, r8, lr}^
    ae18:	4b535f42 	blmi	14e2b28 <_Min_Stack_Size+0x14e2728>
    ae1c:	505f5745 	subspl	r5, pc, r5, asr #14
    ae20:	0029736f 	eoreq	r7, r9, pc, ror #6
    ae24:	6f6c5f5f 	svcvs	0x006c5f5f
    ae28:	62616b63 	rsbvs	r6, r1, #101376	@ 0x18c00
    ae2c:	5f20656c 	svcpl	0x0020656c
    ae30:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    ae34:	6e615f6b 	cdpvs	15, 6, cr5, cr1, cr11, {3}
    ae38:	61746f6e 	cmnvs	r4, lr, ror #30
    ae3c:	6c286574 	cfstr32vs	mvfx6, [r8], #-464	@ 0xfffffe30
    ae40:	616b636f 	cmnvs	fp, pc, ror #6
