NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    ae44:	29656c62 	stmdbcs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    ae48:	685f5f00 	ldmdavs	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    ae4c:	655f7361 	ldrbvs	r7, [pc, #-865]	@ aaf3 <_Min_Stack_Size+0xa6f3>
    ae50:	6e657478 	mcrvs	4, 3, r7, cr5, cr8, {3}
    ae54:	6e6f6973 			@ <UNDEFINED> instruction: 0x6e6f6973
    ae58:	685f5f20 	ldmdavs	pc, {r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    ae5c:	665f7361 	ldrbvs	r7, [pc], -r1, ror #6
    ae60:	75746165 	ldrbvc	r6, [r4, #-357]!	@ 0xfffffe9b
    ae64:	53006572 	movwpl	r6, #1394	@ 0x572
    ae68:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    ae6c:	565f6b63 	ldrbpl	r6, [pc], -r3, ror #22
    ae70:	435f4c41 	cmpmi	pc, #16640	@ 0x4100
    ae74:	45525255 	ldrbmi	r5, [r2, #-597]	@ 0xfffffdab
    ae78:	505f544e 	subspl	r5, pc, lr, asr #8
    ae7c:	3020736f 	eorcc	r7, r0, pc, ror #6
    ae80:	43530055 	cmpmi	r3, #85	@ 0x55
    ae84:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    ae88:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    ae8c:	4552504d 	ldrbmi	r5, [r2, #-77]	@ 0xffffffb3
    ae90:	45534943 	ldrbmi	r4, [r3, #-2371]	@ 0xfffff6bd
    ae94:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    ae98:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    ae9c:	5f424353 	svcpl	0x00424353
    aea0:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    aea4:	5355425f 	cmppl	r5, #-268435451	@ 0xf0000005
    aea8:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    aeac:	5f525354 	svcpl	0x00525354
    aeb0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    aeb4:	5532202b 	ldrpl	r2, [r2, #-43]!	@ 0xffffffd5
    aeb8:	5f5f0029 	svcpl	0x005f0029
    aebc:	6f6c6e75 	svcvs	0x006c6e75
    aec0:	28736b63 	ldmdacs	r3!, {r0, r1, r5, r6, r8, r9, fp, sp, lr}^
    aec4:	292e2e2e 	stmdbcs	lr!, {r1, r2, r3, r5, r9, sl, fp, sp}
    aec8:	6c5f5f20 	mrrcvs	15, 2, r5, pc, cr0	@ <UNPREDICTABLE>
    aecc:	5f6b636f 	svcpl	0x006b636f
    aed0:	6f6e6e61 	svcvs	0x006e6e61
    aed4:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
    aed8:	6c6e7528 	cfstr64vs	mvdx7, [lr], #-160	@ 0xffffff60
    aedc:	5f6b636f 	svcpl	0x006b636f
    aee0:	636e7566 	cmnvs	lr, #427819008	@ 0x19800000
    aee4:	6e6f6974 			@ <UNDEFINED> instruction: 0x6e6f6974
    aee8:	565f5f28 	ldrbpl	r5, [pc], -r8, lsr #30
    aeec:	52415f41 	subpl	r5, r1, #260	@ 0x104
    aef0:	5f5f5347 	svcpl	0x005f5347
    aef4:	5f002929 	svcpl	0x00002929
    aef8:	444e4152 	strbmi	r4, [lr], #-338	@ 0xfffffeae
    aefc:	4d5f3834 	ldclmi	8, cr3, [pc, #-208]	@ ae34 <_Min_Stack_Size+0xaa34>
    af00:	5f544c55 	svcpl	0x00544c55
    af04:	30282031 	eorcc	r2, r8, r1, lsr r0
    af08:	65656478 	strbvs	r6, [r5, #-1144]!	@ 0xfffffb88
    af0c:	53002963 	movwpl	r2, #2403	@ 0x963
    af10:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    af14:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    af18:	4e45505f 	mcrmi	0, 2, r5, cr5, cr15, {2}
    af1c:	41565344 	cmpmi	r6, r4, asr #6
    af20:	4d5f5443 	cfldrdmi	mvd5, [pc, #-268]	@ ae1c <_Min_Stack_Size+0xaa1c>
    af24:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    af28:	204c5531 	subcs	r5, ip, r1, lsr r5
    af2c:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    af30:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    af34:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    af38:	4e45505f 	mcrmi	0, 2, r5, cr5, cr15, {2}
    af3c:	41565344 	cmpmi	r6, r4, asr #6
    af40:	505f5443 	subspl	r5, pc, r3, asr #8
    af44:	0029736f 	eoreq	r7, r9, pc, ror #6
    af48:	5f424353 	svcpl	0x00424353
    af4c:	49555043 	ldmdbmi	r5, {r0, r1, r6, ip, lr}^
    af50:	41505f44 	cmpmi	r0, r4, asr #30
    af54:	4f4e5452 	svcmi	0x004e5452
    af58:	736f505f 	cmnvc	pc, #95	@ 0x5f
    af5c:	00553420 	subseq	r3, r5, r0, lsr #8
    af60:	4c465f5f 	mcrrmi	15, 5, r5, r6, cr15
    af64:	5f54414f 	svcpl	0x0054414f
    af68:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
    af6c:	6f6c6620 	svcvs	0x006c6620
    af70:	5f007461 	svcpl	0x00007461
    af74:	5f535953 	svcpl	0x00535953
    af78:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    af7c:	5f544e49 	svcpl	0x00544e49
    af80:	54002048 	strpl	r2, [r0], #-72	@ 0xffffffb8
    af84:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    af88:	314f4649 	cmpcc	pc, r9, asr #12
    af8c:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    af90:	734d5f31 	movtvc	r5, #57137	@ 0xdf31
    af94:	3028206b 	eorcc	r2, r8, fp, rrx
    af98:	55464678 	strbpl	r4, [r6, #-1656]	@ 0xfffff988
    af9c:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    afa0:	49505420 	ldmdbmi	r0, {r5, sl, ip, lr}^
    afa4:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    afa8:	495f314f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
    afac:	5f314d54 	svcpl	0x00314d54
    afb0:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    afb4:	53504100 	cmppl	r0, #0, 2
    afb8:	5f4e5f52 	svcpl	0x004e5f52
    afbc:	20736f50 	rsbscs	r6, r3, r0, asr pc
    afc0:	00553133 	subseq	r3, r5, r3, lsr r1
    afc4:	5f545744 	svcpl	0x00545744
    afc8:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    afcc:	4c4f465f 	mcrrmi	6, 5, r4, pc, cr15
    afd0:	54564544 	ldrbpl	r4, [r6], #-1348	@ 0xfffffabc
    afd4:	5f414e45 	svcpl	0x00414e45
    afd8:	20736f50 	rsbscs	r6, r3, r0, asr pc
    afdc:	00553132 	subseq	r3, r5, r2, lsr r1
    afe0:	5f433249 	svcpl	0x00433249
    afe4:	5f315253 	svcpl	0x00315253
    afe8:	4f4c5241 	svcmi	0x004c5241
    afec:	736f505f 	cmnvc	pc, #95	@ 0x5f
    aff0:	55392820 	ldrpl	r2, [r9, #-2080]!	@ 0xfffff7e0
    aff4:	45530029 	ldrbmi	r0, [r3, #-41]	@ 0xffffffd7
    aff8:	435f4b45 	cmpmi	pc, #70656	@ 0x11400
    affc:	31205255 			@ <UNDEFINED> instruction: 0x31205255
    b000:	53507800 	cmppl	r0, #0, 16
    b004:	5f545f52 	svcpl	0x00545f52
    b008:	206b734d 	rsbcs	r7, fp, sp, asr #6
    b00c:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    b010:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    b014:	52535078 	subspl	r5, r3, #120	@ 0x78
    b018:	505f545f 	subspl	r5, pc, pc, asr r4	@ <UNPREDICTABLE>
    b01c:	0029736f 	eoreq	r7, r9, pc, ror #6
    b020:	5f545744 	svcpl	0x00545744
    b024:	434e5546 	movtmi	r5, #58694	@ 0xe546
    b028:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    b02c:	494d455f 	stmdbmi	sp, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    b030:	4e415254 	mcrmi	2, 2, r5, cr1, cr4, {2}
    b034:	4d5f4547 	cfldr64mi	mvdx4, [pc, #-284]	@ af20 <_Min_Stack_Size+0xab20>
    b038:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    b03c:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    b040:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    b044:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
    b048:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    b04c:	4f495443 	svcmi	0x00495443
    b050:	4d455f4e 	stclmi	15, cr5, [r5, #-312]	@ 0xfffffec8
    b054:	41525449 	cmpmi	r2, r9, asr #8
    b058:	5f45474e 	svcpl	0x0045474e
    b05c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    b060:	775f5f00 	ldrbvc	r5, [pc, -r0, lsl #30]
    b064:	5f6e7261 	svcpl	0x006e7261
    b068:	65666572 	strbvs	r6, [r6, #-1394]!	@ 0xfffffa8e
    b06c:	636e6572 	cmnvs	lr, #478150656	@ 0x1c800000
    b070:	73287365 			@ <UNDEFINED> instruction: 0x73287365
    b074:	6d2c6d79 	stcvs	13, cr6, [ip, #-484]!	@ 0xfffffe1c
    b078:	20296773 	eorcs	r6, r9, r3, ror r7
    b07c:	73615f5f 	cmnvc	r1, #380	@ 0x17c
    b080:	285f5f6d 	ldmdacs	pc, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    b084:	65732e22 	ldrbvs	r2, [r3, #-3618]!	@ 0xfffff1de
    b088:	6f697463 	svcvs	0x00697463
    b08c:	672e206e 	strvs	r2, [lr, -lr, rrx]!
    b090:	772e756e 	strvc	r7, [lr, -lr, ror #10]!
    b094:	696e7261 	stmdbvs	lr!, {r0, r5, r6, r9, ip, sp, lr}^
    b098:	222e676e 	eorcs	r6, lr, #28835840	@ 0x1b80000
    b09c:	79732320 	ldmdbvc	r3!, {r5, r8, r9, sp}^
    b0a0:	203b296d 	eorscs	r2, fp, sp, ror #18
    b0a4:	73615f5f 	cmnvc	r1, #380	@ 0x17c
    b0a8:	285f5f6d 	ldmdacs	pc, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    b0ac:	73612e22 	cmnvc	r1, #544	@ 0x220
    b0b0:	207a6963 	rsbscs	r6, sl, r3, ror #18
    b0b4:	2022225c 	eorcs	r2, r2, ip, asr r2
    b0b8:	2067736d 	rsbcs	r7, r7, sp, ror #6
    b0bc:	22225c22 	eorcs	r5, r2, #8704	@ 0x2200
    b0c0:	5f203b29 	svcpl	0x00203b29
    b0c4:	6d73615f 	ldfvse	f6, [r3, #-380]!	@ 0xfffffe84
    b0c8:	22285f5f 	eorcs	r5, r8, #380	@ 0x17c
    b0cc:	6572702e 	ldrbvs	r7, [r2, #-46]!	@ 0xffffffd2
    b0d0:	756f6976 	strbvc	r6, [pc, #-2422]!	@ a762 <_Min_Stack_Size+0xa362>
    b0d4:	00292273 	eoreq	r2, r9, r3, ror r2
    b0d8:	5f433249 	svcpl	0x00433249
    b0dc:	5f325243 	svcpl	0x00325243
    b0e0:	45414d44 	strbmi	r4, [r1, #-3396]	@ 0xfffff2bc
    b0e4:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    b0e8:	3028206b 	eorcc	r2, r8, fp, rrx
    b0ec:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    b0f0:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    b0f4:	5f433249 	svcpl	0x00433249
    b0f8:	5f325243 	svcpl	0x00325243
    b0fc:	45414d44 	strbmi	r4, [r1, #-3396]	@ 0xfffff2bc
    b100:	6f505f4e 	svcvs	0x00505f4e
    b104:	41002973 	tstmi	r0, r3, ror r9
    b108:	5f525350 	svcpl	0x00525350
    b10c:	6f505f43 	svcvs	0x00505f43
    b110:	39322073 	ldmdbcc	r2!, {r0, r1, r4, r5, r6, sp}
    b114:	564e0055 			@ <UNDEFINED> instruction: 0x564e0055
    b118:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    b11c:	32335152 	eorscc	r5, r3, #-2147483628	@ 0x80000014
    b120:	4332495f 	teqmi	r2, #1556480	@ 0x17c000
    b124:	56455f31 			@ <UNDEFINED> instruction: 0x56455f31
    b128:	616e455f 	cmnvs	lr, pc, asr r5
    b12c:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    b130:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    b134:	5f434956 	svcpl	0x00434956
    b138:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    b13c:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	@ 0xffffff3c
    b140:	3c312820 	ldccc	8, cr2, [r1], #-128	@ 0xffffff80
    b144:	2929303c 	stmdbcs	r9!, {r2, r3, r4, r5, ip, sp}
    b148:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
    b14c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    b150:	20345f4e 	eorscs	r5, r4, lr, asr #30
    b154:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    b158:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
    b15c:	3029745f 	eorcc	r7, r9, pc, asr r4
    b160:	31303078 	teqcc	r0, r8, ror r0
    b164:	41002930 	tstmi	r0, r0, lsr r9
    b168:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ b028 <_Min_Stack_Size+0xac28>
    b16c:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    b170:	4f494745 	svcmi	0x00494745
    b174:	49535f4e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    b178:	325f455a 	subscc	r4, pc, #377487360	@ 0x16800000
    b17c:	20423635 	subcs	r3, r2, r5, lsr r6
    b180:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    b184:	5f38746e 	svcpl	0x0038746e
    b188:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    b18c:	29553730 	ldmdbcs	r5, {r4, r5, r8, r9, sl, ip, sp}^
    b190:	4d524100 	ldfmie	f4, [r2, #-0]
    b194:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    b198:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    b19c:	5f4e4f49 	svcpl	0x004e4f49
    b1a0:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    b1a4:	4b32335f 	blmi	c97f28 <_Min_Stack_Size+0xc97b28>
    b1a8:	28282042 	stmdacs	r8!, {r1, r6, sp}
    b1ac:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    b1b0:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    b1b4:	45307830 	ldrmi	r7, [r0, #-2096]!	@ 0xfffff7d0
    b1b8:	55002955 	strpl	r2, [r0, #-2389]	@ 0xfffff6ab
    b1bc:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    b1c0:	435f5841 	cmpmi	pc, #4259840	@ 0x410000
    b1c4:	20297828 	eorcs	r7, r9, r8, lsr #16
    b1c8:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    b1cc:	414d544e 	cmpmi	sp, lr, asr #8
    b1d0:	28435f58 	stmdacs	r3, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    b1d4:	4e002978 			@ <UNDEFINED> instruction: 0x4e002978
    b1d8:	5f434956 	svcpl	0x00434956
    b1dc:	32515249 	subscc	r5, r1, #-1879048188	@ 0x90000004
    b1e0:	58455f33 	stmdapl	r5, {r0, r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    b1e4:	5f354954 	svcpl	0x00354954
    b1e8:	6e455f39 	mcrvs	15, 2, r5, cr5, cr9, {1}
    b1ec:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    b1f0:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    b1f4:	4349564e 	movtmi	r5, #38478	@ 0x964e
    b1f8:	4553495f 	ldrbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    b1fc:	7c203052 	stcvc	0, cr3, [r0], #-328	@ 0xfffffeb8
    b200:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    b204:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    b208:	29293332 	stmdbcs	r9!, {r1, r4, r5, r8, r9, ip, sp}
    b20c:	726f4300 	rsbvc	r4, pc, #0, 6
    b210:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    b214:	445f6775 	ldrbmi	r6, [pc], #-1909	@ b21c <_Min_Stack_Size+0xae1c>
    b218:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    b21c:	445f435f 	ldrbmi	r4, [pc], #-863	@ b224 <_Min_Stack_Size+0xae24>
    b220:	47554245 	ldrbmi	r4, [r5, -r5, asr #4]
    b224:	4d5f4e45 	ldclmi	14, cr4, [pc, #-276]	@ b118 <_Min_Stack_Size+0xad18>
    b228:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    b22c:	204c5531 	subcs	r5, ip, r1, lsr r5
    b230:	58450029 	stmdapl	r5, {r0, r3, r5}^
    b234:	5f384954 	svcpl	0x00384954
    b238:	20515249 	subscs	r5, r1, r9, asr #4
    b23c:	41003332 	tstmi	r0, r2, lsr r3
    b240:	5f525350 	svcpl	0x00525350
    b244:	6f505f51 	svcvs	0x00505f51
    b248:	37322073 			@ <UNDEFINED> instruction: 0x37322073
    b24c:	5f5f0055 	svcpl	0x005f0055
    b250:	5f727470 	svcpl	0x00727470
    b254:	6f762074 	svcvs	0x00762074
    b258:	2a206469 	bcs	824404 <_Min_Stack_Size+0x824004>
    b25c:	736e7500 	cmnvc	lr, #0, 10
    b260:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    b264:	50470064 	subpl	r0, r7, r4, rrx
    b268:	505f4f49 	subspl	r4, pc, r9, asr #30
    b26c:	315f4e49 	cmpcc	pc, r9, asr #28
    b270:	28282030 	stmdacs	r8!, {r4, r5, sp}
    b274:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    b278:	745f3631 	ldrbvc	r3, [pc], #-1585	@ b280 <_Min_Stack_Size+0xae80>
    b27c:	30783029 	rsbscc	r3, r8, r9, lsr #32
    b280:	29303034 	ldmdbcs	r0!, {r2, r4, r5, ip, sp}
    b284:	43324900 	teqmi	r2, #0, 18
    b288:	52414f5f 	subpl	r4, r1, #380	@ 0x17c
    b28c:	4e455f32 	mcrmi	15, 2, r5, cr5, cr2, {1}
    b290:	4c415544 	cfstr64mi	mvdx5, [r1], {68}	@ 0x44
    b294:	6b734d5f 	blvs	1cde818 <_Min_Stack_Size+0x1cde418>
    b298:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    b29c:	204c5531 	subcs	r5, ip, r1, lsr r5
    b2a0:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    b2a4:	4f5f4332 	svcmi	0x005f4332
    b2a8:	5f325241 	svcpl	0x00325241
    b2ac:	55444e45 	strbpl	r4, [r4, #-3653]	@ 0xfffff1bb
    b2b0:	505f4c41 	subspl	r4, pc, r1, asr #24
    b2b4:	0029736f 	eoreq	r7, r9, pc, ror #6
    b2b8:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    b2bc:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    b2c0:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    b2c4:	5f525343 	svcpl	0x00525343
    b2c8:	41485f43 	cmpmi	r8, r3, asr #30
    b2cc:	4d5f544c 	cfldrdmi	mvd5, [pc, #-304]	@ b1a4 <_Min_Stack_Size+0xada4>
    b2d0:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    b2d4:	204c5531 	subcs	r5, ip, r1, lsr r5
    b2d8:	43203c3c 			@ <UNDEFINED> instruction: 0x43203c3c
    b2dc:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    b2e0:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    b2e4:	4348445f 	movtmi	r4, #33887	@ 0x845f
    b2e8:	435f5253 	cmpmi	pc, #805306373	@ 0x30000005
    b2ec:	4c41485f 	mcrrmi	8, 5, r4, r1, cr15
    b2f0:	6f505f54 	svcvs	0x00505f54
    b2f4:	5f002973 	svcpl	0x00002973
    b2f8:	65656e5f 	strbvs	r6, [r5, #-3679]!	@ 0xfffff1a1
    b2fc:	74705f64 	ldrbtvc	r5, [r0], #-3940	@ 0xfffff09c
    b300:	66696472 			@ <UNDEFINED> instruction: 0x66696472
    b304:	00745f66 	rsbseq	r5, r4, r6, ror #30
    b308:	52535041 	subspl	r5, r3, #65	@ 0x41
    b30c:	505f5a5f 	subspl	r5, pc, pc, asr sl	@ <UNPREDICTABLE>
    b310:	3320736f 			@ <UNDEFINED> instruction: 0x3320736f
    b314:	43005530 	movwmi	r5, #1328	@ 0x530
    b318:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    b31c:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    b320:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    b324:	4d5f5243 	lfmmi	f5, 2, [pc, #-268]	@ b220 <_Min_Stack_Size+0xae20>
    b328:	505f4e4f 	subspl	r4, pc, pc, asr #28
    b32c:	5f444e45 	svcpl	0x00444e45
    b330:	206b734d 	rsbcs	r7, fp, sp, asr #6
    b334:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    b338:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    b33c:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    b340:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    b344:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
    b348:	5f52434d 	svcpl	0x0052434d
    b34c:	5f4e4f4d 	svcpl	0x004e4f4d
    b350:	444e4550 	strbmi	r4, [lr], #-1360	@ 0xfffffab0
    b354:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b358:	49460029 	stmdbmi	r6, {r0, r3, r5}^
    b35c:	695f4f46 	ldmdbvs	pc, {r1, r2, r6, r8, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    b360:	0074696e 	rsbseq	r6, r4, lr, ror #18
    b364:	5f424353 	svcpl	0x00424353
    b368:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    b36c:	5649445f 			@ <UNDEFINED> instruction: 0x5649445f
    b370:	455a5942 	ldrbmi	r5, [sl, #-2370]	@ 0xfffff6be
    b374:	4d5f4f52 	ldclmi	15, cr4, [pc, #-328]	@ b234 <_Min_Stack_Size+0xae34>
    b378:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    b37c:	204c5531 	subcs	r5, ip, r1, lsr r5
    b380:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    b384:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    b388:	5f525346 	svcpl	0x00525346
    b38c:	42564944 	subsmi	r4, r6, #68, 18	@ 0x110000
    b390:	52455a59 	subpl	r5, r5, #364544	@ 0x59000
    b394:	6f505f4f 	svcvs	0x00505f4f
    b398:	55002973 	strpl	r2, [r0, #-2419]	@ 0xfffff68d
    b39c:	38544e49 	ldmdacc	r4, {r0, r3, r6, r9, sl, fp, lr}^
    b3a0:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    b3a4:	5f5f2820 	svcpl	0x005f2820
    b3a8:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    b3ac:	414d5f38 	cmpmi	sp, r8, lsr pc
    b3b0:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    b3b4:	42435300 	submi	r5, r3, #0, 6
    b3b8:	5346435f 	movtpl	r4, #25439	@ 0x635f
    b3bc:	554d5f52 	strbpl	r5, [sp, #-3922]	@ 0xfffff0ae
    b3c0:	4b54534e 	blmi	1520100 <_Min_Stack_Size+0x151fd00>
    b3c4:	5f525245 	svcpl	0x00525245
    b3c8:	206b734d 	rsbcs	r7, fp, sp, asr #6
    b3cc:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    b3d0:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    b3d4:	5f424353 	svcpl	0x00424353
    b3d8:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    b3dc:	4e554d5f 	mrcmi	13, 2, r4, cr5, cr15, {2}
    b3e0:	454b5453 	strbmi	r5, [fp, #-1107]	@ 0xfffffbad
    b3e4:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    b3e8:	0029736f 	eoreq	r7, r9, pc, ror #6
    b3ec:	5f545744 	svcpl	0x00545744
    b3f0:	4b53414d 	blmi	14db92c <_Min_Stack_Size+0x14db52c>
    b3f4:	53414d5f 	movtpl	r4, #7519	@ 0x1d5f
    b3f8:	734d5f4b 	movtvc	r5, #57163	@ 0xdf4b
    b3fc:	3028206b 	eorcc	r2, r8, fp, rrx
    b400:	55463178 	strbpl	r3, [r6, #-376]	@ 0xfffffe88
    b404:	0029204c 	eoreq	r2, r9, ip, asr #32
    b408:	54415f5f 	strbpl	r5, [r1], #-3935	@ 0xfffff0a1
    b40c:	454c4946 	strbmi	r4, [ip, #-2374]	@ 0xfffff6ba
    b410:	5349565f 	movtpl	r5, #38495	@ 0x965f
    b414:	454c4249 	strbmi	r4, [ip, #-585]	@ 0xfffffdb7
    b418:	49003120 	stmdbmi	r0, {r5, r8, ip, sp}
    b41c:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    b420:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    b424:	4c41424d 	sfmmi	f4, 2, [r1], {77}	@ 0x4d
    b428:	20545245 	subscs	r5, r4, r5, asr #4
    b42c:	5f433249 	svcpl	0x00433249
    b430:	5f315253 	svcpl	0x00315253
    b434:	41424d53 	cmpmi	r2, r3, asr sp
    b438:	5452454c 	ldrbpl	r4, [r2], #-1356	@ 0xfffffab4
    b43c:	6b734d5f 	blvs	1cde9c0 <_Min_Stack_Size+0x1cde5c0>
    b440:	43575f00 	cmpmi	r7, #0, 30
    b444:	5f524148 	svcpl	0x00524148
    b448:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    b44c:	454e4946 	strbmi	r4, [lr, #-2374]	@ 0xfffff6ba
    b450:	53002044 	movwpl	r2, #68	@ 0x44
    b454:	415f4243 	cmpmi	pc, r3, asr #4
    b458:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    b45c:	4345565f 	movtmi	r5, #22111	@ 0x565f
    b460:	53455254 	movtpl	r5, #21076	@ 0x5254
    b464:	505f5445 	subspl	r5, pc, r5, asr #8
    b468:	3020736f 	eorcc	r7, r0, pc, ror #6
    b46c:	4e490055 	mcrmi	0, 2, r0, cr9, cr5, {2}
    b470:	58414d54 	stmdapl	r1, {r2, r4, r6, r8, sl, fp, lr}^
    b474:	7828435f 	stmdavc	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, lr}
    b478:	5f5f2029 	svcpl	0x005f2029
    b47c:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    b480:	435f5841 	cmpmi	pc, #4259840	@ 0x410000
    b484:	00297828 	eoreq	r7, r9, r8, lsr #16
    b488:	63747570 	cmnvs	r4, #112, 10	@ 0x1c000000
    b48c:	5f726168 	svcpl	0x00726168
    b490:	6f6c6e75 	svcvs	0x006c6e75
    b494:	64656b63 	strbtvs	r6, [r5], #-2915	@ 0xfffff49d
    b498:	29635f28 	stmdbcs	r3!, {r3, r5, r8, r9, sl, fp, ip, lr}^
    b49c:	75705f20 	ldrbvc	r5, [r0, #-3872]!	@ 0xfffff0e0
    b4a0:	61686374 	smcvs	34356	@ 0x8634
    b4a4:	6e755f72 	mrcvs	15, 3, r5, cr5, cr2, {3}
    b4a8:	6b636f6c 	blvs	18e7260 <_Min_Stack_Size+0x18e6e60>
    b4ac:	5f286465 	svcpl	0x00286465
    b4b0:	49002963 	stmdbmi	r0, {r0, r1, r5, r6, r8, fp, sp}
    b4b4:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    b4b8:	425f3152 	subsmi	r3, pc, #-2147483628	@ 0x80000014
    b4bc:	49204654 	stmdbmi	r0!, {r2, r4, r6, r9, sl, lr}
    b4c0:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    b4c4:	425f3152 	subsmi	r3, pc, #-2147483628	@ 0x80000014
    b4c8:	4d5f4654 	ldclmi	6, cr4, [pc, #-336]	@ b380 <_Min_Stack_Size+0xaf80>
    b4cc:	49006b73 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    b4d0:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    b4d4:	425f3152 	subsmi	r3, pc, #-2147483628	@ 0x80000014
    b4d8:	4d5f4654 	ldclmi	6, cr4, [pc, #-336]	@ b390 <_Min_Stack_Size+0xaf90>
    b4dc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    b4e0:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    b4e4:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    b4e8:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    b4ec:	3152535f 	cmpcc	r2, pc, asr r3
    b4f0:	4654425f 			@ <UNDEFINED> instruction: 0x4654425f
    b4f4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b4f8:	32490029 	subcc	r0, r9, #41	@ 0x29
    b4fc:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    b500:	45505f31 	ldrbmi	r5, [r0, #-3889]	@ 0xfffff0cf
    b504:	52524543 	subspl	r4, r2, #281018368	@ 0x10c00000
    b508:	6b734d5f 	blvs	1cdea8c <_Min_Stack_Size+0x1cde68c>
    b50c:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    b510:	204c5531 	subcs	r5, ip, r1, lsr r5
    b514:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    b518:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    b51c:	505f3152 	subspl	r3, pc, r2, asr r1	@ <UNPREDICTABLE>
    b520:	52454345 	subpl	r4, r5, #335544321	@ 0x14000001
    b524:	6f505f52 	svcvs	0x00505f52
    b528:	54002973 	strpl	r2, [r0], #-2419	@ 0xfffff68d
    b52c:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    b530:	304f4649 	subcc	r4, pc, r9, asr #12
    b534:	4d54455f 	cfldr64mi	mvdx4, [r4, #-380]	@ 0xfffffe84
    b538:	6f505f31 	svcvs	0x00505f31
    b53c:	55382073 	ldrpl	r2, [r8, #-115]!	@ 0xffffff8d
    b540:	42435300 	submi	r5, r3, #0, 6
    b544:	4f54565f 	svcmi	0x0054565f
    b548:	42545f52 	subsmi	r5, r4, #328	@ 0x148
    b54c:	46464f4c 	strbmi	r4, [r6], -ip, asr #30
    b550:	6b734d5f 	blvs	1cdead4 <_Min_Stack_Size+0x1cde6d4>
    b554:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    b558:	46464631 			@ <UNDEFINED> instruction: 0x46464631
    b55c:	55464646 	strbpl	r4, [r6, #-1606]	@ 0xfffff9ba
    b560:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    b564:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    b568:	4f54565f 	svcmi	0x0054565f
    b56c:	42545f52 	subsmi	r5, r4, #328	@ 0x148
    b570:	46464f4c 	strbmi	r4, [r6], -ip, asr #30
