NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    b574:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b578:	475f0029 	ldrbmi	r0, [pc, -r9, lsr #32]
    b57c:	41424f4c 	cmpmi	r2, ip, asr #30
    b580:	45525f4c 	ldrbmi	r5, [r2, #-3916]	@ 0xfffff0b4
    b584:	20544e45 	subscs	r4, r4, r5, asr #28
    b588:	695f2628 	ldmdbvs	pc, {r3, r5, r9, sl, sp}^	@ <UNPREDICTABLE>
    b58c:	7275706d 	rsbsvc	r7, r5, #109	@ 0x6d
    b590:	61645f65 	cmnvs	r4, r5, ror #30
    b594:	00296174 	eoreq	r6, r9, r4, ror r1
    b598:	5f4d5241 	svcpl	0x004d5241
    b59c:	5f55504d 	svcpl	0x0055504d
    b5a0:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    b5a4:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    b5a8:	5f455a49 	svcpl	0x00455a49
    b5ac:	20424d31 	subcs	r4, r2, r1, lsr sp
    b5b0:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    b5b4:	5f38746e 	svcpl	0x0038746e
    b5b8:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    b5bc:	29553331 	ldmdbcs	r5, {r0, r4, r5, r8, r9, ip, sp}^
    b5c0:	455f5f00 	ldrbmi	r5, [pc, #-3840]	@ a6c8 <_Min_Stack_Size+0xa2c8>
    b5c4:	524f5058 	subpl	r5, pc, #88	@ 0x58
    b5c8:	5f002054 	svcpl	0x00002054
    b5cc:	544d505f 	strbpl	r5, [sp], #-95	@ 0xffffffa1
    b5d0:	67726128 	ldrbvs	r6, [r2, -r8, lsr #2]!
    b5d4:	61202973 			@ <UNDEFINED> instruction: 0x61202973
    b5d8:	00736772 	rsbseq	r6, r3, r2, ror r7
    b5dc:	5f424353 	svcpl	0x00424353
    b5e0:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    b5e4:	434f4e5f 	movtmi	r4, #65119	@ 0xfe5f
    b5e8:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    b5ec:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    b5f0:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    b5f4:	4353203c 	cmpmi	r3, #60	@ 0x3c
    b5f8:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    b5fc:	4e5f5253 	mrcmi	2, 2, r5, cr15, cr3, {2}
    b600:	5f50434f 	svcpl	0x0050434f
    b604:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    b608:	53504100 	cmppl	r0, #0, 2
    b60c:	5f565f52 	svcpl	0x00565f52
    b610:	206b734d 	rsbcs	r7, fp, sp, asr #6
    b614:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    b618:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    b61c:	52535041 	subspl	r5, r3, #65	@ 0x41
    b620:	505f565f 	subspl	r5, pc, pc, asr r6	@ <UNPREDICTABLE>
    b624:	0029736f 	eoreq	r7, r9, pc, ror #6
    b628:	5f433249 	svcpl	0x00433249
    b62c:	5f325243 	svcpl	0x00325243
    b630:	55425449 	strbpl	r5, [r2, #-1097]	@ 0xfffffbb7
    b634:	204e4546 	subcs	r4, lr, r6, asr #10
    b638:	5f433249 	svcpl	0x00433249
    b63c:	5f325243 	svcpl	0x00325243
    b640:	55425449 	strbpl	r5, [r2, #-1097]	@ 0xfffffbb7
    b644:	5f4e4546 	svcpl	0x004e4546
    b648:	006b734d 	rsbeq	r7, fp, sp, asr #6
    b64c:	5f433249 	svcpl	0x00433249
    b650:	5f315243 	svcpl	0x00315243
    b654:	55424d53 	strbpl	r4, [r2, #-3411]	@ 0xfffff2ad
    b658:	734d5f53 	movtvc	r5, #57171	@ 0xdf53
    b65c:	3028206b 	eorcc	r2, r8, fp, rrx
    b660:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    b664:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    b668:	5f433249 	svcpl	0x00433249
    b66c:	5f315243 	svcpl	0x00315243
    b670:	55424d53 	strbpl	r4, [r2, #-3411]	@ 0xfffff2ad
    b674:	6f505f53 	svcvs	0x00505f53
    b678:	46002973 			@ <UNDEFINED> instruction: 0x46002973
    b67c:	5f4f4649 	svcpl	0x004f4649
    b680:	6e697270 	mcrvs	2, 3, r7, cr9, cr0, {3}
    b684:	79530074 	ldmdbvc	r3, {r2, r4, r5, r6}^
    b688:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    b68c:	54435f6b 	strbpl	r5, [r3], #-3947	@ 0xfffff095
    b690:	435f4c52 	cmpmi	pc, #20992	@ 0x5200
    b694:	544e554f 	strbpl	r5, [lr], #-1359	@ 0xfffffab1
    b698:	47414c46 	strbmi	r4, [r1, -r6, asr #24]
    b69c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b6a0:	55363120 	ldrpl	r3, [r6, #-288]!	@ 0xfffffee0
    b6a4:	735f5f00 	cmpvc	pc, #0, 30
    b6a8:	74667274 	strbtvc	r7, [r6], #-628	@ 0xfffffd8c
    b6ac:	6c656d69 	stclvs	13, cr6, [r5], #-420	@ 0xfffffe5c
    b6b0:	28656b69 	stmdacs	r5!, {r0, r3, r5, r6, r8, r9, fp, sp, lr}^
    b6b4:	61746d66 	cmnvs	r4, r6, ror #26
    b6b8:	662c6772 			@ <UNDEFINED> instruction: 0x662c6772
    b6bc:	74737269 	ldrbtvc	r7, [r3], #-617	@ 0xfffffd97
    b6c0:	61726176 	cmnvs	r2, r6, ror r1
    b6c4:	20296772 	eorcs	r6, r9, r2, ror r7
    b6c8:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    b6cc:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    b6d0:	5f657475 	svcpl	0x00657475
    b6d4:	5f28285f 	svcpl	0x0028285f
    b6d8:	726f665f 	rsbvc	r6, pc, #99614720	@ 0x5f00000
    b6dc:	5f74616d 	svcpl	0x0074616d
    b6e0:	5f28205f 	svcpl	0x0028205f
    b6e4:	7274735f 	rsbsvc	r7, r4, #2080374785	@ 0x7c000001
    b6e8:	6d697466 	cfstrdvs	mvd7, [r9, #-408]!	@ 0xfffffe68
    b6ec:	2c5f5f65 	mrrccs	15, 6, r5, pc, cr5	@ <UNPREDICTABLE>
    b6f0:	746d6620 	strbtvc	r6, [sp], #-1568	@ 0xfffff9e0
    b6f4:	2c677261 	sfmcs	f7, 2, [r7], #-388	@ 0xfffffe7c
    b6f8:	72696620 	rsbvc	r6, r9, #32, 12	@ 0x2000000
    b6fc:	61767473 	cmnvs	r6, r3, ror r4
    b700:	67726172 			@ <UNDEFINED> instruction: 0x67726172
    b704:	00292929 	eoreq	r2, r9, r9, lsr #18
    b708:	54505f5f 	ldrbpl	r5, [r0], #-3935	@ 0xfffff0a1
    b70c:	46494452 			@ <UNDEFINED> instruction: 0x46494452
    b710:	20545f46 	subscs	r5, r4, r6, asr #30
    b714:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    b718:	4952545f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
    b71c:	52454747 	subpl	r4, r5, #18612224	@ 0x11c0000
    b720:	4952545f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
    b724:	52454747 	subpl	r4, r5, #18612224	@ 0x11c0000
    b728:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b72c:	00553020 	subseq	r3, r5, r0, lsr #32
    b730:	4349564e 	movtmi	r5, #38478	@ 0x964e
    b734:	5152495f 	cmppl	r2, pc, asr r9
    b738:	58455f38 	stmdapl	r5, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    b73c:	5f324954 	svcpl	0x00324954
    b740:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
    b744:	2928656c 	stmdbcs	r8!, {r2, r3, r5, r6, r8, sl, sp, lr}
    b748:	564e2820 	strbpl	r2, [lr], -r0, lsr #16
    b74c:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    b750:	30524553 	subscc	r4, r2, r3, asr r5
    b754:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    b758:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    b75c:	2938203c 	ldmdbcs	r8!, {r2, r3, r4, r5, sp}
    b760:	58450029 	stmdapl	r5, {r0, r3, r5}^
    b764:	535f5449 	cmppl	pc, #1224736768	@ 0x49000000
    b768:	45434355 	strbmi	r4, [r3, #-853]	@ 0xfffffcab
    b76c:	30205353 	eorcc	r5, r0, r3, asr r3
    b770:	42435300 	submi	r5, r3, #0, 6
    b774:	5346445f 	movtpl	r4, #25695	@ 0x645f
    b778:	58455f52 	stmdapl	r5, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    b77c:	4e524554 	mrcmi	5, 2, r4, cr2, cr4, {2}
    b780:	505f4c41 	subspl	r4, pc, r1, asr #24
    b784:	3420736f 	strtcc	r7, [r0], #-879	@ 0xfffffc91
    b788:	50410055 	subpl	r0, r1, r5, asr r0
    b78c:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    b790:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b794:	55383220 	ldrpl	r3, [r8, #-544]!	@ 0xfffffde0
    b798:	4d524100 	ldfmie	f4, [r2, #-0]
    b79c:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    b7a0:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    b7a4:	5f4e4f49 	svcpl	0x004e4f49
    b7a8:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    b7ac:	424b345f 	submi	r3, fp, #1593835520	@ 0x5f000000
    b7b0:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    b7b4:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    b7b8:	3029745f 	eorcc	r7, r9, pc, asr r4
    b7bc:	55423078 	strbpl	r3, [r2, #-120]	@ 0xffffff88
    b7c0:	50470029 	subpl	r0, r7, r9, lsr #32
    b7c4:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ b6a8 <_Min_Stack_Size+0xb2a8>
    b7c8:	5f45444f 	svcpl	0x0045444f
    b7cc:	5054554f 	subspl	r5, r4, pc, asr #10
    b7d0:	415f5455 	cmpmi	pc, r5, asr r4	@ <UNPREDICTABLE>
    b7d4:	444f5f46 	strbmi	r5, [pc], #-3910	@ b7dc <_Min_Stack_Size+0xb3dc>
    b7d8:	30783020 	rsbscc	r3, r8, r0, lsr #32
    b7dc:	30303030 	eorscc	r3, r0, r0, lsr r0
    b7e0:	75373030 	ldrvc	r3, [r7, #-48]!	@ 0xffffffd0
    b7e4:	43324900 	teqmi	r2, #0, 18
    b7e8:	3152535f 	cmpcc	r2, pc, asr r3
    b7ec:	5f46415f 	svcpl	0x0046415f
    b7f0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    b7f4:	55303128 	ldrpl	r3, [r0, #-296]!	@ 0xfffffed8
    b7f8:	79530029 	ldmdbvc	r3, {r0, r3, r5}^
    b7fc:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    b800:	41435f6b 	cmpmi	r3, fp, ror #30
    b804:	5f42494c 	svcpl	0x0042494c
    b808:	45524f4e 	ldrbmi	r4, [r2, #-3918]	@ 0xfffff0b2
    b80c:	734d5f46 	movtvc	r5, #57158	@ 0xdf46
    b810:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    b814:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    b818:	7953203c 	ldmdbvc	r3, {r2, r3, r4, r5, sp}^
    b81c:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    b820:	41435f6b 	cmpmi	r3, fp, ror #30
    b824:	5f42494c 	svcpl	0x0042494c
    b828:	45524f4e 	ldrbmi	r4, [r2, #-3918]	@ 0xfffff0b2
    b82c:	6f505f46 	svcvs	0x00505f46
    b830:	5f002973 	svcpl	0x00002973
    b834:	41454c5f 	cmpmi	r5, pc, asr ip
    b838:	20385453 	eorscs	r5, r8, r3, asr r4
    b83c:	22686822 	rsbcs	r6, r8, #2228224	@ 0x220000
    b840:	4d544900 	vldrmi.16	s9, [r4, #-0]	@ <UNPREDICTABLE>
    b844:	5243545f 	subpl	r5, r3, #1593835520	@ 0x5f000000
    b848:	5354475f 	cmppl	r4, #24903680	@ 0x17c0000
    b84c:	51455246 	cmppl	r5, r6, asr #4
    b850:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b854:	55303120 	ldrpl	r3, [r0, #-288]!	@ 0xfffffee0
    b858:	735f5f00 	cmpvc	pc, #0, 30
    b85c:	6d667274 	sfmvs	f7, 2, [r6, #-464]!	@ 0xfffffe30
    b860:	696c6e6f 	stmdbvs	ip!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    b864:	6628656b 	strtvs	r6, [r8], -fp, ror #10
    b868:	7261746d 	rsbvc	r7, r1, #1828716544	@ 0x6d000000
    b86c:	69662c67 	stmdbvs	r6!, {r0, r1, r2, r5, r6, sl, fp, sp}^
    b870:	76747372 			@ <UNDEFINED> instruction: 0x76747372
    b874:	72617261 	rsbvc	r7, r1, #268435462	@ 0x10000006
    b878:	5f202967 	svcpl	0x00202967
    b87c:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    b880:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    b884:	5f5f6574 	svcpl	0x005f6574
    b888:	5f5f2828 	svcpl	0x005f2828
    b88c:	6d726f66 	ldclvs	15, cr6, [r2, #-408]!	@ 0xfffffe68
    b890:	5f5f7461 	svcpl	0x005f7461
    b894:	5f5f2820 	svcpl	0x005f2820
    b898:	66727473 			@ <UNDEFINED> instruction: 0x66727473
    b89c:	5f6e6f6d 	svcpl	0x006e6f6d
    b8a0:	66202c5f 			@ <UNDEFINED> instruction: 0x66202c5f
    b8a4:	7261746d 	rsbvc	r7, r1, #1828716544	@ 0x6d000000
    b8a8:	66202c67 	strtvs	r2, [r0], -r7, ror #24
    b8ac:	74737269 	ldrbtvc	r7, [r3], #-617	@ 0xfffffd97
    b8b0:	61726176 	cmnvs	r2, r6, ror r1
    b8b4:	29296772 	stmdbcs	r9!, {r1, r4, r5, r6, r8, r9, sl, sp, lr}
    b8b8:	52410029 	subpl	r0, r1, #41	@ 0x29
    b8bc:	504d5f4d 	subpl	r5, sp, sp, asr #30
    b8c0:	45525f55 	ldrbmi	r5, [r2, #-3925]	@ 0xfffff0ab
    b8c4:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    b8c8:	5a49535f 	bpl	126064c <_Min_Stack_Size+0x126024c>
    b8cc:	4b315f45 	blmi	c635e8 <_Min_Stack_Size+0xc631e8>
    b8d0:	28282042 	stmdacs	r8!, {r1, r6, sp}
    b8d4:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    b8d8:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    b8dc:	39307830 	ldmdbcc	r0!, {r4, r5, fp, ip, sp, lr}
    b8e0:	4d002955 	vstrmi.16	s4, [r0, #-170]	@ 0xffffff56	@ <UNPREDICTABLE>
    b8e4:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    b8e8:	5f524142 	svcpl	0x00524142
    b8ec:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    b8f0:	505f4e4f 	subspl	r4, pc, pc, asr #28
    b8f4:	3020736f 	eorcc	r7, r0, pc, ror #6
    b8f8:	79530055 	ldmdbvc	r3, {r0, r2, r4, r6}^
    b8fc:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    b900:	41435f6b 	cmpmi	r3, fp, ror #30
    b904:	5f42494c 	svcpl	0x0042494c
    b908:	57454b53 	smlsldpl	r4, r5, r3, fp
    b90c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    b910:	55303320 	ldrpl	r3, [r0, #-800]!	@ 0xfffffce0
    b914:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    b918:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    b91c:	5f393351 	svcpl	0x00393351
    b920:	52415355 	subpl	r5, r1, #1409286145	@ 0x54000001
    b924:	455f3354 	ldrbmi	r3, [pc, #-852]	@ b5d8 <_Min_Stack_Size+0xb1d8>
    b928:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
    b92c:	20292865 	eorcs	r2, r9, r5, ror #16
    b930:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    b934:	53495f43 	movtpl	r5, #40771	@ 0x9f43
    b938:	20315245 	eorscs	r5, r1, r5, asr #4
    b93c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    b940:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    b944:	29293720 	stmdbcs	r9!, {r5, r8, r9, sl, ip, sp}
    b948:	615f5f00 	cmpvs	pc, r0, lsl #30
    b94c:	7961776c 	stmdbvc	r1!, {r2, r3, r5, r6, r8, r9, sl, ip, sp, lr}^
    b950:	6e695f73 	mcrvs	15, 3, r5, cr9, cr3, {3}
    b954:	656e696c 	strbvs	r6, [lr, #-2412]!	@ 0xfffff694
    b958:	695f5f20 	ldmdbvs	pc, {r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    b95c:	6e696c6e 	cdpvs	12, 6, cr6, cr9, cr14, {3}
    b960:	205f5f65 	subscs	r5, pc, r5, ror #30
    b964:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    b968:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    b96c:	5f657475 	svcpl	0x00657475
    b970:	5f28285f 	svcpl	0x0028285f
    b974:	776c615f 			@ <UNDEFINED> instruction: 0x776c615f
    b978:	5f737961 	svcpl	0x00737961
    b97c:	696c6e69 	stmdbvs	ip!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    b980:	5f5f656e 	svcpl	0x005f656e
    b984:	5f002929 	svcpl	0x00002929
    b988:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    b98c:	6c635f6b 	stclvs	15, cr5, [r3], #-428	@ 0xfffffe54
    b990:	2865736f 	stmdacs	r5!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}^
    b994:	6b636f6c 	blvs	18e774c <_Min_Stack_Size+0x18e734c>
    b998:	5f5f2029 	svcpl	0x005f2029
    b99c:	61746572 	cmnvs	r4, r2, ror r5
    b9a0:	74656772 	strbtvc	r6, [r5], #-1906	@ 0xfffff88e
    b9a4:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    b9a8:	6c635f6b 	stclvs	15, cr5, [r3], #-428	@ 0xfffffe54
    b9ac:	2865736f 	stmdacs	r5!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}^
    b9b0:	6b636f6c 	blvs	18e7768 <_Min_Stack_Size+0x18e7368>
    b9b4:	61540029 	cmpvs	r4, r9, lsr #32
    b9b8:	535f6b73 	cmppl	pc, #117760	@ 0x1cc00
    b9bc:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
    b9c0:	5300745f 	movwpl	r7, #1119	@ 0x45f
    b9c4:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    b9c8:	435f6b63 	cmpmi	pc, #101376	@ 0x18c00
    b9cc:	5f4c5254 	svcpl	0x004c5254
    b9d0:	534b4c43 	movtpl	r4, #48195	@ 0xbc43
    b9d4:	4352554f 	cmpmi	r2, #331350016	@ 0x13c00000
    b9d8:	734d5f45 	movtvc	r5, #57157	@ 0xdf45
    b9dc:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    b9e0:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    b9e4:	7953203c 	ldmdbvc	r3, {r2, r3, r4, r5, sp}^
    b9e8:	63695473 	cmnvs	r9, #1929379840	@ 0x73000000
    b9ec:	54435f6b 	strbpl	r5, [r3], #-3947	@ 0xfffff095
    b9f0:	435f4c52 	cmpmi	pc, #20992	@ 0x5200
    b9f4:	4f534b4c 	svcmi	0x00534b4c
    b9f8:	45435255 	strbmi	r5, [r3, #-597]	@ 0xfffffdab
    b9fc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    ba00:	6f430029 	svcvs	0x00430029
    ba04:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    ba08:	5f677562 	svcpl	0x00677562
    ba0c:	53434844 	movtpl	r4, #14404	@ 0x3844
    ba10:	5f535f52 	svcpl	0x00535f52
    ba14:	45534552 	ldrbmi	r4, [r3, #-1362]	@ 0xfffffaae
    ba18:	54535f54 	ldrbpl	r5, [r3], #-3924	@ 0xfffff0ac
    ba1c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    ba20:	55353220 	ldrpl	r3, [r5, #-544]!	@ 0xfffffde0
    ba24:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    ba28:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    ba2c:	455f3651 	ldrbmi	r3, [pc, #-1617]	@ b3e3 <_Min_Stack_Size+0xafe3>
    ba30:	30495458 	subcc	r5, r9, r8, asr r4
    ba34:	616e455f 	cmnvs	lr, pc, asr r5
    ba38:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    ba3c:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    ba40:	5f434956 	svcpl	0x00434956
    ba44:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    ba48:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	@ 0xffffff40
    ba4c:	20312820 	eorscs	r2, r1, r0, lsr #16
    ba50:	36203c3c 			@ <UNDEFINED> instruction: 0x36203c3c
    ba54:	4d002929 	vstrmi.16	s4, [r0, #-82]	@ 0xffffffae	@ <UNPREDICTABLE>
    ba58:	545f5550 	ldrbpl	r5, [pc], #-1360	@ ba60 <_Min_Stack_Size+0xb660>
    ba5c:	5f455059 	svcpl	0x00455059
    ba60:	41504553 	cmpmi	r0, r3, asr r5
    ba64:	45544152 	ldrbmi	r4, [r4, #-338]	@ 0xfffffeae
    ba68:	6b734d5f 	blvs	1cdefec <_Min_Stack_Size+0x1cdebec>
    ba6c:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    ba70:	0029204c 	eoreq	r2, r9, ip, asr #32
    ba74:	49535f5f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    ba78:	545f455a 	ldrbpl	r4, [pc], #-1370	@ ba80 <_Min_Stack_Size+0xb680>
    ba7c:	57440020 	strbpl	r0, [r4, -r0, lsr #32]
    ba80:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    ba84:	435f4c52 	cmpmi	pc, #20992	@ 0x5200
    ba88:	41544359 	cmpmi	r4, r9, asr r3
    ba8c:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    ba90:	3028206b 	eorcc	r2, r8, fp, rrx
    ba94:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    ba98:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ba9c:	5f545744 	svcpl	0x00545744
    baa0:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    baa4:	4359435f 	cmpmi	r9, #2080374785	@ 0x7c000001
    baa8:	5f504154 	svcpl	0x00504154
    baac:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    bab0:	43324900 	teqmi	r2, #0, 18
    bab4:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    bab8:	4554495f 	ldrbmi	r4, [r4, #-2399]	@ 0xfffff6a1
    babc:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    bac0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    bac4:	55392820 	ldrpl	r2, [r9, #-2080]!	@ 0xfffff7e0
    bac8:	49460029 	stmdbmi	r6, {r0, r3, r5}^
    bacc:	655f4f46 	ldrbvs	r4, [pc, #-3910]	@ ab8e <_Min_Stack_Size+0xa78e>
    bad0:	6575716e 	ldrbvs	r7, [r5, #-366]!	@ 0xfffffe92
    bad4:	5f006575 	svcpl	0x00006575
    bad8:	6e6f4c5f 	mcrvs	12, 3, r4, cr15, cr15, {2}
    badc:	6f6c2067 	svcvs	0x006c2067
    bae0:	5f00676e 	svcpl	0x0000676e
    bae4:	7275705f 	rsbsvc	r7, r5, #95	@ 0x5f
    bae8:	5f203265 	svcpl	0x00203265
    baec:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    baf0:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    baf4:	5f5f6574 	svcpl	0x005f6574
    baf8:	5f5f2828 	svcpl	0x005f2828
    bafc:	736e6f63 	cmnvc	lr, #396	@ 0x18c
    bb00:	295f5f74 	ldmdbcs	pc, {r2, r4, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    bb04:	50470029 	subpl	r0, r7, r9, lsr #32
    bb08:	5f454f49 	svcpl	0x00454f49
    bb0c:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    bb10:	65502820 	ldrbvs	r2, [r0, #-2080]	@ 0xfffff7e0
    bb14:	68706972 	ldmdavs	r0!, {r1, r4, r5, r6, r8, fp, sp, lr}^
    bb18:	6c617265 	sfmvs	f7, 2, [r1], #-404	@ 0xfffffe6c
    bb1c:	41425f73 	hvcmi	9715	@ 0x25f3
    bb20:	2b204553 	blcs	81d074 <_Min_Stack_Size+0x81cc74>
    bb24:	30783020 	rsbscc	r3, r8, r0, lsr #32
    bb28:	31313030 	teqcc	r1, r0, lsr r0
    bb2c:	55303038 	ldrpl	r3, [r0, #-56]!	@ 0xffffffc8
    bb30:	5f00294c 	svcpl	0x0000294c
    bb34:	544f445f 	strbpl	r4, [pc], #-1119	@ bb3c <_Min_Stack_Size+0xb73c>
    bb38:	202c2053 	eorcs	r2, ip, r3, asr r0
    bb3c:	002e2e2e 	eoreq	r2, lr, lr, lsr #28
    bb40:	38544e49 	ldmdacc	r4, {r0, r3, r6, r9, sl, fp, lr}^
    bb44:	7828435f 	stmdavc	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, lr}
    bb48:	5f5f2029 	svcpl	0x005f2029
    bb4c:	38544e49 	ldmdacc	r4, {r0, r3, r6, r9, sl, fp, lr}^
    bb50:	7828435f 	stmdavc	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, lr}
    bb54:	564e0029 	strbpl	r0, [lr], -r9, lsr #32
    bb58:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    bb5c:	31335152 	teqcc	r3, r2, asr r1
    bb60:	4332495f 	teqmi	r2, #1556480	@ 0x17c000
    bb64:	56455f31 			@ <UNDEFINED> instruction: 0x56455f31
    bb68:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
    bb6c:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    bb70:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    bb74:	4349564e 	movtmi	r5, #38478	@ 0x964e
    bb78:	4543495f 	strbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    bb7c:	7c203052 	stcvc	0, cr3, [r0], #-328	@ 0xfffffeb8
    bb80:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    bb84:	31333c3c 	teqcc	r3, ip, lsr ip
    bb88:	5f002929 	svcpl	0x00002929
    bb8c:	6e695f5f 	mcrvs	15, 3, r5, cr9, cr15, {2}
    bb90:	656c5f74 	strbvs	r5, [ip, #-3956]!	@ 0xfffff08c
    bb94:	33747361 	cmncc	r4, #-2080374783	@ 0x84000001
    bb98:	5f745f32 	svcpl	0x00745f32
    bb9c:	69666564 	stmdbvs	r6!, {r2, r5, r6, r8, sl, sp, lr}^
    bba0:	2064656e 	rsbcs	r6, r4, lr, ror #10
    bba4:	5f5f0031 	svcpl	0x005f0031
    bba8:	65727570 	ldrbvs	r7, [r2, #-1392]!	@ 0xfffffa90
    bbac:	615f5f20 	cmpvs	pc, r0, lsr #30
    bbb0:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    bbb4:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    bbb8:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    bbbc:	75705f5f 	ldrbvc	r5, [r0, #-3935]!	@ 0xfffff0a1
    bbc0:	5f5f6572 	svcpl	0x005f6572
    bbc4:	78002929 	stmdavc	r0, {r0, r3, r5, r8, fp, sp}
    bbc8:	5f525350 	svcpl	0x00525350
    bbcc:	734d5f5a 	movtvc	r5, #57178	@ 0xdf5a
    bbd0:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    bbd4:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    bbd8:	5078203c 	rsbspl	r2, r8, ip, lsr r0
    bbdc:	5a5f5253 	bpl	17e0530 <_Min_Stack_Size+0x17e0130>
    bbe0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    bbe4:	50540029 	subspl	r0, r4, r9, lsr #32
    bbe8:	45445f49 	strbmi	r5, [r4, #-3913]	@ 0xfffff0b7
    bbec:	5f444956 	svcpl	0x00444956
    bbf0:	4e495450 	mcrmi	4, 2, r5, cr9, cr0, {2}
    bbf4:	494c4156 	stmdbmi	ip, {r1, r2, r4, r6, r8, lr}^
    bbf8:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    bbfc:	3028206b 	eorcc	r2, r8, fp, rrx
    bc00:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    bc04:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    bc08:	5f495054 	svcpl	0x00495054
    bc0c:	49564544 	ldmdbmi	r6, {r2, r6, r8, sl, lr}^
    bc10:	54505f44 	ldrbpl	r5, [r0], #-3908	@ 0xfffff0bc
    bc14:	41564e49 	cmpmi	r6, r9, asr #28
    bc18:	5f44494c 	svcpl	0x0044494c
    bc1c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    bc20:	42435300 	submi	r5, r3, #0, 6
    bc24:	5550435f 	ldrbpl	r4, [r0, #-863]	@ 0xfffffca1
    bc28:	565f4449 	ldrbpl	r4, [pc], -r9, asr #8
    bc2c:	41495241 	cmpmi	r9, r1, asr #4
    bc30:	505f544e 	subspl	r5, pc, lr, asr #8
    bc34:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    bc38:	5f005530 	svcpl	0x00005530
    bc3c:	49535f54 	ldmdbmi	r3, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    bc40:	0020455a 	eoreq	r4, r0, sl, asr r5
    bc44:	5f424353 	svcpl	0x00424353
    bc48:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    bc4c:	564e495f 			@ <UNDEFINED> instruction: 0x564e495f
    bc50:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
    bc54:	734d5f45 	movtvc	r5, #57157	@ 0xdf45
    bc58:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    bc5c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    bc60:	4353203c 	cmpmi	r3, #60	@ 0x3c
    bc64:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    bc68:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    bc6c:	5453564e 	ldrbpl	r5, [r3], #-1614	@ 0xfffff9b2
    bc70:	5f455441 	svcpl	0x00455441
    bc74:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    bc78:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    bc7c:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    bc80:	59535f4c 	ldmdbpl	r3, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    bc84:	4154434e 	cmpmi	r4, lr, asr #6
    bc88:	6f505f50 	svcvs	0x00505f50
    bc8c:	30312073 	eorscc	r2, r1, r3, ror r0
    bc90:	32490055 	subcc	r0, r9, #85	@ 0x55
    bc94:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    bc98:	54535f31 	ldrbpl	r5, [r3], #-3889	@ 0xfffff0cf
    bc9c:	5f545241 	svcpl	0x00545241
    bca0:	206b734d 	rsbcs	r7, fp, sp, asr #6
    bca4:	31783028 	cmncc	r8, r8, lsr #32
    bca8:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    bcac:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    bcb0:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    bcb4:	54535f31 	ldrbpl	r5, [r3], #-3889	@ 0xfffff0cf
    bcb8:	5f545241 	svcpl	0x00545241
    bcbc:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
