NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    bcc0:	695f5f00 	ldmdbvs	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    bcc4:	3032746e 	eorscc	r7, r2, lr, ror #8
    bcc8:	6e435300 	cdpvs	3, 4, cr5, cr3, cr0, {0}
    bccc:	5f424353 	svcpl	0x00424353
    bcd0:	4c544341 	mrrcmi	3, 4, r4, r4, cr1	@ <UNPREDICTABLE>
    bcd4:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    bcd8:	4c4f4653 	mcrrmi	6, 5, r4, pc, cr3
    bcdc:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    bce0:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    bce4:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    bce8:	4353203c 	cmpmi	r3, #60	@ 0x3c
    bcec:	4243536e 	submi	r5, r3, #-1207959551	@ 0xb8000001
    bcf0:	5443415f 	strbpl	r4, [r3], #-351	@ 0xfffffea1
    bcf4:	445f524c 	ldrbmi	r5, [pc], #-588	@ bcfc <_Min_Stack_Size+0xb8fc>
    bcf8:	4f465349 	svcmi	0x00465349
    bcfc:	505f444c 	subspl	r4, pc, ip, asr #8
    bd00:	0029736f 	eoreq	r7, r9, pc, ror #6
    bd04:	72745f5f 	rsbsvc	r5, r4, #380	@ 0x17c
    bd08:	636f6c79 	cmnvs	pc, #30976	@ 0x7900
    bd0c:	735f736b 	cmpvc	pc, #-1409286143	@ 0xac000001
    bd10:	65726168 	ldrbvs	r6, [r2, #-360]!	@ 0xfffffe98
    bd14:	2e2e2864 	cdpcs	8, 2, cr2, cr14, cr4, {3}
    bd18:	5f20292e 	svcpl	0x0020292e
    bd1c:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    bd20:	6e615f6b 	cdpvs	15, 6, cr5, cr1, cr11, {3}
    bd24:	61746f6e 	cmnvs	r4, lr, ror #30
    bd28:	73286574 			@ <UNDEFINED> instruction: 0x73286574
    bd2c:	65726168 	ldrbvs	r6, [r2, #-360]!	@ 0xfffffe98
    bd30:	72745f64 	rsbsvc	r5, r4, #100, 30	@ 0x190
    bd34:	636f6c79 	cmnvs	pc, #30976	@ 0x7900
    bd38:	75665f6b 	strbvc	r5, [r6, #-3947]!	@ 0xfffff095
    bd3c:	6974636e 	ldmdbvs	r4!, {r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    bd40:	5f286e6f 	svcpl	0x00286e6f
    bd44:	5f41565f 	svcpl	0x0041565f
    bd48:	53475241 	movtpl	r5, #29249	@ 0x7241
    bd4c:	29295f5f 	stmdbcs	r9!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    bd50:	435f5f00 	cmpmi	pc, #0, 30
    bd54:	41434e4f 	cmpmi	r3, pc, asr #28
    bd58:	78283154 	stmdavc	r8!, {r2, r4, r6, r8, ip, sp}
    bd5c:	2029792c 	eorcs	r7, r9, ip, lsr #18
    bd60:	23232078 			@ <UNDEFINED> instruction: 0x23232078
    bd64:	5f007920 	svcpl	0x00007920
    bd68:	736f6e5f 	cmnvc	pc, #1520	@ 0x5f0
    bd6c:	74696e61 	strbtvc	r6, [r9], #-3681	@ 0xfffff19f
    bd70:	6d657a69 	vstmdbvs	r5!, {s15-s119}
    bd74:	726f6d65 	rsbvc	r6, pc, #6464	@ 0x1940
    bd78:	49002079 	stmdbmi	r0, {r0, r3, r4, r5, r6, sp}
    bd7c:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    bd80:	495f3252 	ldmdbmi	pc, {r1, r4, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
    bd84:	54564554 	ldrbpl	r4, [r6], #-1364	@ 0xfffffaac
    bd88:	4d5f4e45 	ldclmi	14, cr4, [pc, #-276]	@ bc7c <_Min_Stack_Size+0xb87c>
    bd8c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    bd90:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    bd94:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    bd98:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    bd9c:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    bda0:	4554495f 	ldrbmi	r4, [r4, #-2399]	@ 0xfffff6a1
    bda4:	4e455456 	mcrmi	4, 2, r5, cr5, cr6, {2}
    bda8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    bdac:	5f5f0029 	svcpl	0x005f0029
    bdb0:	61736f6e 	cmnvs	r3, lr, ror #30
    bdb4:	6974696e 	ldmdbvs	r4!, {r1, r2, r3, r5, r6, r8, fp, sp, lr}^
    bdb8:	6874657a 	ldmdavs	r4!, {r1, r3, r4, r5, r6, r8, sl, sp, lr}^
    bdbc:	64616572 	strbtvs	r6, [r1], #-1394	@ 0xfffffa8e
    bdc0:	5f5f0020 	svcpl	0x005f0020
    bdc4:	75736572 	ldrbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    bdc8:	755f746c 	ldrbvc	r7, [pc, #-1132]	@ b964 <_Min_Stack_Size+0xb564>
    bdcc:	635f6573 	cmpvs	pc, #482344960	@ 0x1cc00000
    bdd0:	6b636568 	blvs	18e5378 <_Min_Stack_Size+0x18e4f78>
    bdd4:	615f5f20 	cmpvs	pc, r0, lsr #30
    bdd8:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    bddc:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    bde0:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    bde4:	61775f5f 	cmnvs	r7, pc, asr pc
    bde8:	755f6e72 	ldrbvc	r6, [pc, #-3698]	@ af7e <_Min_Stack_Size+0xab7e>
    bdec:	6573756e 	ldrbvs	r7, [r3, #-1390]!	@ 0xfffffa92
    bdf0:	65725f64 	ldrbvs	r5, [r2, #-3940]!	@ 0xfffff09c
    bdf4:	746c7573 	strbtvc	r7, [ip], #-1395	@ 0xfffffa8d
    bdf8:	29295f5f 	stmdbcs	r9!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    bdfc:	42435300 	submi	r5, r3, #0, 6
    be00:	5343495f 	movtpl	r4, #14687	@ 0x395f
    be04:	45505f52 	ldrbmi	r5, [r0, #-3922]	@ 0xfffff0ae
    be08:	5653444e 	ldrbpl	r4, [r3], -lr, asr #8
    be0c:	5f524c43 	svcpl	0x00524c43
    be10:	206b734d 	rsbcs	r7, fp, sp, asr #6
    be14:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    be18:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    be1c:	5f424353 	svcpl	0x00424353
    be20:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    be24:	4e45505f 	mcrmi	0, 2, r5, cr5, cr15, {2}
    be28:	43565344 	cmpmi	r6, #68, 6	@ 0x10000001
    be2c:	505f524c 	subspl	r5, pc, ip, asr #4
    be30:	0029736f 	eoreq	r7, r9, pc, ror #6
    be34:	6f6c5f5f 	svcvs	0x006c5f5f
    be38:	725f6b63 	subsvc	r6, pc, #101376	@ 0x18c00
    be3c:	61656c65 	cmnvs	r5, r5, ror #24
    be40:	6c286573 	cfstr32vs	mvfx6, [r8], #-460	@ 0xfffffe34
    be44:	296b636f 	stmdbcs	fp!, {r0, r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    be48:	725f5f20 	subsvc	r5, pc, #32, 30	@ 0x80
    be4c:	72617465 	rsbvc	r7, r1, #1694498816	@ 0x65000000
    be50:	5f746567 	svcpl	0x00746567
    be54:	6b636f6c 	blvs	18e7c0c <_Min_Stack_Size+0x18e780c>
    be58:	6c65725f 	sfmvs	f7, 2, [r5], #-380	@ 0xfffffe84
    be5c:	65736165 	ldrbvs	r6, [r3, #-357]!	@ 0xfffffe9b
    be60:	636f6c28 	cmnvs	pc, #40, 24	@ 0x2800
    be64:	5f00296b 	svcpl	0x0000296b
    be68:	554e475f 	strbpl	r4, [lr, #-1887]	@ 0xfffff8a1
    be6c:	52505f43 	subspl	r5, r0, #268	@ 0x10c
    be70:	51455245 	cmppl	r5, r5, asr #4
    be74:	6a616d28 	bvs	186731c <_Min_Stack_Size+0x1866f1c>
    be78:	6e696d2c 	cdpvs	13, 6, cr6, cr9, cr12, {1}
    be7c:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    be80:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    be84:	5f5f4355 	svcpl	0x005f4355
    be88:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    be8c:	20293631 	eorcs	r3, r9, r1, lsr r6
    be90:	5f5f202b 	svcpl	0x005f202b
    be94:	43554e47 	cmpmi	r5, #1136	@ 0x470
    be98:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    be9c:	5f5f524f 	svcpl	0x005f524f
    bea0:	203d3e20 	eorscs	r3, sp, r0, lsr #28
    bea4:	616d2828 	cmnvs	sp, r8, lsr #16
    bea8:	3c20296a 			@ <UNDEFINED> instruction: 0x3c20296a
    beac:	3631203c 			@ <UNDEFINED> instruction: 0x3631203c
    beb0:	202b2029 	eorcs	r2, fp, r9, lsr #32
    beb4:	6e696d28 	cdpvs	13, 6, cr6, cr9, cr8, {1}
    beb8:	49002929 	stmdbmi	r0, {r0, r3, r5, r8, fp, sp}
    bebc:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ bec4 <_Min_Stack_Size+0xbac4>
    bec0:	545f5243 	ldrbpl	r5, [pc], #-579	@ bec8 <_Min_Stack_Size+0xbac8>
    bec4:	65636172 	strbvs	r6, [r3, #-370]!	@ 0xfffffe8e
    bec8:	49737542 	ldmdbmi	r3!, {r1, r6, r8, sl, ip, sp, lr}^
    becc:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    bed0:	4928206b 	stmdbmi	r8!, {r0, r1, r3, r5, r6, sp}
    bed4:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ bedc <_Min_Stack_Size+0xbadc>
    bed8:	545f5243 	ldrbpl	r5, [pc], #-579	@ bee0 <_Min_Stack_Size+0xbae0>
    bedc:	45434152 	strbmi	r4, [r3, #-338]	@ 0xfffffeae
    bee0:	49535542 	ldmdbmi	r3, {r1, r6, r8, sl, ip, lr}^
    bee4:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    bee8:	5f00296b 	svcpl	0x0000296b
    beec:	76204f5f 	qsaxvc	r4, r0, pc	@ <UNPREDICTABLE>
    bef0:	74616c6f 	strbtvc	r6, [r1], #-3183	@ 0xfffff391
    bef4:	00656c69 	rsbeq	r6, r5, r9, ror #24
    bef8:	5f424353 	svcpl	0x00424353
    befc:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    bf00:	4341445f 	movtmi	r4, #5215	@ 0x145f
    bf04:	4f495643 	svcmi	0x00495643
    bf08:	6f505f4c 	svcvs	0x00505f4c
    bf0c:	53282073 			@ <UNDEFINED> instruction: 0x53282073
    bf10:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    bf14:	5f525346 	svcpl	0x00525346
    bf18:	464d454d 	strbmi	r4, [sp], -sp, asr #10
    bf1c:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    bf20:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    bf24:	2b20736f 	blcs	828ce8 <_Min_Stack_Size+0x8288e8>
    bf28:	29553120 	ldmdbcs	r5, {r5, r8, ip, sp}^
    bf2c:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    bf30:	5645445f 			@ <UNDEFINED> instruction: 0x5645445f
    bf34:	4d5f4449 	cfldrdmi	mvd4, [pc, #-292]	@ be18 <_Min_Stack_Size+0xba18>
    bf38:	56434e41 	strbpl	r4, [r3], -r1, asr #28
    bf3c:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    bf40:	6b734d5f 	blvs	1cdf4c4 <_Min_Stack_Size+0x1cdf0c4>
    bf44:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    bf48:	204c5531 	subcs	r5, ip, r1, lsr r5
    bf4c:	54203c3c 	strtpl	r3, [r0], #-3132	@ 0xfffff3c4
    bf50:	445f4950 	ldrbmi	r4, [pc], #-2384	@ bf58 <_Min_Stack_Size+0xbb58>
    bf54:	44495645 	strbmi	r5, [r9], #-1605	@ 0xfffff9bb
    bf58:	4e414d5f 	mcrmi	13, 2, r4, cr1, cr15, {2}
    bf5c:	4c415643 	mcrrmi	6, 4, r5, r1, cr3
    bf60:	505f4449 	subspl	r4, pc, r9, asr #8
    bf64:	0029736f 	eoreq	r7, r9, pc, ror #6
    bf68:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    bf6c:	435f544e 	cmpmi	pc, #1308622848	@ 0x4e000000
    bf70:	454c5456 	strbmi	r5, [ip, #-1110]	@ 0xfffffbaa
    bf74:	705f284e 	subsvc	r2, pc, lr, asr #16
    bf78:	20297274 	eorcs	r7, r9, r4, ror r2
    bf7c:	705f2828 	subsvc	r2, pc, r8, lsr #16
    bf80:	2d297274 	sfmcs	f7, 4, [r9, #-464]!	@ 0xfffffe30
    bf84:	76635f3e 	uqasxvc	r5, r3, lr
    bf88:	6e656c74 	mcrvs	12, 3, r6, cr5, cr4, {3}
    bf8c:	4e490029 	cdpmi	0, 4, cr0, cr9, cr9, {1}
    bf90:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ be48 <_Min_Stack_Size+0xba48>
    bf94:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    bf98:	495f5f2d 	ldmdbmi	pc, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    bf9c:	5f38544e 	svcpl	0x0038544e
    bfa0:	5f58414d 	svcpl	0x0058414d
    bfa4:	202d205f 	eorcs	r2, sp, pc, asr r0
    bfa8:	43002931 	movwmi	r2, #2353	@ 0x931
    bfac:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    bfb0:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    bfb4:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    bfb8:	4d5f5243 	lfmmi	f5, 2, [pc, #-268]	@ beb4 <_Min_Stack_Size+0xbab4>
    bfbc:	505f4e4f 	subspl	r4, pc, pc, asr #28
    bfc0:	5f444e45 	svcpl	0x00444e45
    bfc4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    bfc8:	00553731 	subseq	r3, r5, r1, lsr r7
    bfcc:	575f545f 			@ <UNDEFINED> instruction: 0x575f545f
    bfd0:	52414843 	subpl	r4, r1, #4390912	@ 0x430000
    bfd4:	4d00205f 	stcmi	0, cr2, [r0, #-380]	@ 0xfffffe84
    bfd8:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    bfdc:	5f524142 	svcpl	0x00524142
    bfe0:	52444441 	subpl	r4, r4, #1090519040	@ 0x41000000
    bfe4:	6b734d5f 	blvs	1cdf568 <_Min_Stack_Size+0x1cdf168>
    bfe8:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    bfec:	46464637 			@ <UNDEFINED> instruction: 0x46464637
    bff0:	55464646 	strbpl	r4, [r6, #-1606]	@ 0xfffff9ba
    bff4:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    bff8:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    bffc:	4142525f 	cmpmi	r2, pc, asr r2
    c000:	44415f52 	strbmi	r5, [r1], #-3922	@ 0xfffff0ae
    c004:	505f5244 	subspl	r5, pc, r4, asr #4
    c008:	0029736f 	eoreq	r7, r9, pc, ror #6
    c00c:	5641485f 			@ <UNDEFINED> instruction: 0x5641485f
    c010:	43435f45 	movtmi	r5, #16197	@ 0x3f45
    c014:	484e495f 	stmdami	lr, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    c018:	54494249 	strbpl	r4, [r9], #-585	@ 0xfffffdb7
    c01c:	4f4f4c5f 	svcmi	0x004f4c5f
    c020:	4f545f50 	svcmi	0x00545f50
    c024:	42494c5f 	submi	r4, r9, #24320	@ 0x5f00
    c028:	4c4c4143 	stfmie	f4, [ip], {67}	@ 0x43
    c02c:	53003120 	movwpl	r3, #288	@ 0x120
    c030:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    c034:	535f5243 	cmppl	pc, #805306372	@ 0x30000004
    c038:	5045454c 	subpl	r4, r5, ip, asr #10
    c03c:	58454e4f 	stmdapl	r5, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
    c040:	4d5f5449 	cfldrdmi	mvd5, [pc, #-292]	@ bf24 <_Min_Stack_Size+0xbb24>
    c044:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    c048:	204c5531 	subcs	r5, ip, r1, lsr r5
    c04c:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    c050:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    c054:	535f5243 	cmppl	pc, #805306372	@ 0x30000004
    c058:	5045454c 	subpl	r4, r5, ip, asr #10
    c05c:	58454e4f 	stmdapl	r5, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
    c060:	505f5449 	subspl	r5, pc, r9, asr #8
    c064:	0029736f 	eoreq	r7, r9, pc, ror #6
    c068:	4f494641 	svcmi	0x00494641
    c06c:	5341425f 	movtpl	r4, #4703	@ 0x125f
    c070:	50282045 	eorpl	r2, r8, r5, asr #32
    c074:	70697265 	rsbvc	r7, r9, r5, ror #4
    c078:	61726568 	cmnvs	r2, r8, ror #10
    c07c:	425f736c 	subsmi	r7, pc, #108, 6	@ 0xb0000001
    c080:	20455341 	subcs	r5, r5, r1, asr #6
    c084:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    c088:	31303030 	teqcc	r0, r0, lsr r0
    c08c:	30303030 	eorscc	r3, r0, r0, lsr r0
    c090:	00294c55 	eoreq	r4, r9, r5, asr ip
    c094:	54737953 	ldrbtpl	r7, [r3], #-2387	@ 0xfffff6ad
    c098:	5f6b6369 	svcpl	0x006b6369
    c09c:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    c0a0:	43532820 	cmpmi	r3, #32, 16	@ 0x200000
    c0a4:	41425f53 	cmpmi	r2, r3, asr pc
    c0a8:	2b204553 	blcs	81d5fc <_Min_Stack_Size+0x81d1fc>
    c0ac:	30783020 	rsbscc	r3, r8, r0, lsr #32
    c0b0:	55303130 	ldrpl	r3, [r0, #-304]!	@ 0xfffffed0
    c0b4:	5f00294c 	svcpl	0x0000294c
    c0b8:	5343525f 	movtpl	r5, #12895	@ 0x325f
    c0bc:	535f4449 	cmppl	pc, #1224736768	@ 0x49000000
    c0c0:	4352554f 	cmpmi	r2, #331350016	@ 0x13c00000
    c0c4:	29732845 	ldmdbcs	r3!, {r0, r2, r6, fp, sp}^
    c0c8:	72747320 	rsbsvc	r7, r4, #32, 6	@ 0x80000000
    c0cc:	20746375 	rsbscs	r6, r4, r5, ror r3
    c0d0:	61685f5f 	cmnvs	r8, pc, asr pc
    c0d4:	49006b63 	stmdbmi	r0, {r0, r1, r5, r6, r8, r9, fp, sp, lr}
    c0d8:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    c0dc:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    c0e0:	54535257 	ldrbpl	r5, [r3], #-599	@ 0xfffffda9
    c0e4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    c0e8:	35312820 	ldrcc	r2, [r1, #-2080]!	@ 0xfffff7e0
    c0ec:	52002955 	andpl	r2, r0, #1392640	@ 0x154000
    c0f0:	555f4343 	ldrbpl	r4, [pc, #-835]	@ bdb5 <_Min_Stack_Size+0xb9b5>
    c0f4:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    c0f8:	65525f31 	ldrbvs	r5, [r2, #-3889]	@ 0xfffff0cf
    c0fc:	28746573 	ldmdacs	r4!, {r0, r1, r4, r5, r6, r8, sl, sp, lr}^
    c100:	52282029 	eorpl	r2, r8, #41	@ 0x29
    c104:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    c108:	32425041 	subcc	r5, r2, #65	@ 0x41
    c10c:	52545352 	subspl	r5, r4, #1207959553	@ 0x48000001
    c110:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    c114:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    c118:	3431203c 	ldrtcc	r2, [r1], #-60	@ 0xffffffc4
    c11c:	5f002929 	svcpl	0x00002929
    c120:	4645445f 			@ <UNDEFINED> instruction: 0x4645445f
    c124:	44454e49 	strbmi	r4, [r5], #-3657	@ 0xfffff1b7
    c128:	6863775f 	stmdavs	r3!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, sp, lr}^
    c12c:	745f7261 	ldrbvc	r7, [pc], #-609	@ c134 <_Min_Stack_Size+0xbd34>
    c130:	43530020 	cmpmi	r3, #32
    c134:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    c138:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    c13c:	56434341 	strbpl	r4, [r3], -r1, asr #6
    c140:	5f4c4f49 	svcpl	0x004c4f49
    c144:	206b734d 	rsbcs	r7, fp, sp, asr #6
    c148:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    c14c:	4e002920 	vmlami.f16	s4, s0, s1	@ <UNPREDICTABLE>
    c150:	20434956 	subcs	r4, r3, r6, asr r9
    c154:	564e2828 	strbpl	r2, [lr], -r8, lsr #16
    c158:	545f4349 	ldrbpl	r4, [pc], #-841	@ c160 <_Min_Stack_Size+0xbd60>
    c15c:	20657079 	rsbcs	r7, r5, r9, ror r0
    c160:	4e20292a 	vmulmi.f16	s4, s0, s21	@ <UNPREDICTABLE>
    c164:	5f434956 	svcpl	0x00434956
    c168:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    c16c:	53002920 	movwpl	r2, #2336	@ 0x920
    c170:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    c174:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    c178:	5355425f 	cmppl	r5, #-268435451	@ 0xf0000005
    c17c:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    c180:	4e455054 	mcrmi	0, 2, r5, cr5, cr4, {2}
    c184:	5f444544 	svcpl	0x00444544
    c188:	206b734d 	rsbcs	r7, fp, sp, asr #6
    c18c:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    c190:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    c194:	5f424353 	svcpl	0x00424353
    c198:	53434853 	movtpl	r4, #14419	@ 0x3853
    c19c:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    c1a0:	55414653 	strbpl	r4, [r1, #-1619]	@ 0xfffff9ad
    c1a4:	4550544c 	ldrbmi	r5, [r0, #-1100]	@ 0xfffffbb4
    c1a8:	4445444e 	strbmi	r4, [r5], #-1102	@ 0xfffffbb2
    c1ac:	736f505f 	cmnvc	pc, #95	@ 0x5f
    c1b0:	54530029 	ldrbpl	r0, [r3], #-41	@ 0xffffffd7
    c1b4:	4632334d 	ldrtmi	r3, [r2], -sp, asr #6
    c1b8:	43333031 	teqmi	r3, #49	@ 0x31
    c1bc:	50475f36 	subpl	r5, r7, r6, lsr pc
    c1c0:	485f4f49 	ldmdami	pc, {r0, r3, r6, r8, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
    c1c4:	4d00205f 	stcmi	0, cr2, [r0, #-380]	@ 0xfffffe84
    c1c8:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    c1cc:	525f524e 	subspl	r5, pc, #-536870908	@ 0xe0000004
    c1d0:	4f494745 	svcmi	0x00494745
    c1d4:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    c1d8:	3028206b 	eorcc	r2, r8, fp, rrx
    c1dc:	55464678 	strbpl	r4, [r6, #-1656]	@ 0xfffff988
    c1e0:	0029204c 	eoreq	r2, r9, ip, asr #32
    c1e4:	6b636954 	blvs	18e673c <_Min_Stack_Size+0x18e633c>
    c1e8:	6f435f73 	svcvs	0x00435f73
    c1ec:	00746e75 	rsbseq	r6, r4, r5, ror lr
    c1f0:	4349564e 	movtmi	r5, #38478	@ 0x964e
    c1f4:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
    c1f8:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    c1fc:	20515249 	subscs	r5, r1, r9, asr #4
    c200:	564e5f5f 			@ <UNDEFINED> instruction: 0x564e5f5f
    c204:	445f4349 	ldrbmi	r4, [pc], #-841	@ c20c <_Min_Stack_Size+0xbe0c>
    c208:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
    c20c:	5249656c 	subpl	r6, r9, #108, 10	@ 0x1b000000
    c210:	6f430051 	svcvs	0x00430051
    c214:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    c218:	5f677562 	svcpl	0x00677562
    c21c:	434d4544 	movtmi	r4, #54596	@ 0xd544
    c220:	43565f52 	cmpmi	r6, #328	@ 0x148
    c224:	434f4e5f 	movtmi	r4, #65119	@ 0xfe5f
    c228:	52524550 	subspl	r4, r2, #80, 10	@ 0x14000000
    c22c:	6b734d5f 	blvs	1cdf7b0 <_Min_Stack_Size+0x1cdf3b0>
    c230:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    c234:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    c238:	726f4320 	rsbvc	r4, pc, #32, 6	@ 0x80000000
    c23c:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    c240:	445f6775 	ldrbmi	r6, [pc], #-1909	@ c248 <_Min_Stack_Size+0xbe48>
    c244:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    c248:	5f43565f 	svcpl	0x0043565f
    c24c:	50434f4e 	subpl	r4, r3, lr, asr #30
    c250:	5f525245 	svcpl	0x00525245
    c254:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    c258:	43324900 	teqmi	r2, #0, 18
    c25c:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    c260:	4345505f 	movtmi	r5, #20575	@ 0x505f
    c264:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    c268:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    c26c:	4345505f 	movtmi	r5, #20575	@ 0x505f
    c270:	6b734d5f 	blvs	1cdf7f4 <_Min_Stack_Size+0x1cdf3f4>
    c274:	73795300 	cmnvc	r9, #0, 6
    c278:	6b636954 	blvs	18e67d0 <_Min_Stack_Size+0x18e63d0>
    c27c:	53282820 			@ <UNDEFINED> instruction: 0x53282820
    c280:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    c284:	545f6b63 	ldrbpl	r6, [pc], #-2915	@ c28c <_Min_Stack_Size+0xbe8c>
    c288:	20657079 	rsbcs	r7, r5, r9, ror r0
    c28c:	5320292a 			@ <UNDEFINED> instruction: 0x5320292a
    c290:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    c294:	425f6b63 	subsmi	r6, pc, #101376	@ 0x18c00
    c298:	20455341 	subcs	r5, r5, r1, asr #6
    c29c:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    c2a0:	55465f54 	strbpl	r5, [r6, #-3924]	@ 0xfffff0ac
    c2a4:	4954434e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, r9, lr}^
    c2a8:	445f4e4f 	ldrbmi	r4, [pc], #-3663	@ c2b0 <_Min_Stack_Size+0xbeb0>
    c2ac:	56415441 	strbpl	r5, [r1], -r1, asr #8
    c2b0:	52444441 	subpl	r4, r4, #1090519040	@ 0x41000000
    c2b4:	734d5f30 	movtvc	r5, #57136	@ 0xdf30
    c2b8:	3028206b 	eorcc	r2, r8, fp, rrx
    c2bc:	4c554678 	mrrcmi	6, 7, r4, r5, cr8
    c2c0:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    c2c4:	5f545744 	svcpl	0x00545744
    c2c8:	434e5546 	movtmi	r5, #58694	@ 0xe546
    c2cc:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    c2d0:	5441445f 	strbpl	r4, [r1], #-1119	@ 0xfffffba1
    c2d4:	44415641 	strbmi	r5, [r1], #-1601	@ 0xfffff9bf
    c2d8:	5f305244 	svcpl	0x00305244
    c2dc:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    c2e0:	73795300 	cmnvc	r9, #0, 6
    c2e4:	6b636954 	blvs	18e683c <_Min_Stack_Size+0x18e643c>
    c2e8:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    c2ec:	49545f4c 	ldmdbmi	r4, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    c2f0:	4e494b43 	vmlsmi.f64	d20, d9, d3
    c2f4:	6f505f54 	svcvs	0x00505f54
    c2f8:	55312073 	ldrpl	r2, [r1, #-115]!	@ 0xffffff8d
    c2fc:	46494600 	strbmi	r4, [r9], -r0, lsl #12
    c300:	75425f4f 	strbvc	r5, [r2, #-3919]	@ 0xfffff0b1
    c304:	00745f66 	rsbseq	r5, r4, r6, ror #30
    c308:	5f424353 	svcpl	0x00424353
    c30c:	49555043 	ldmdbmi	r5, {r0, r1, r6, ip, lr}^
    c310:	41565f44 	cmpmi	r6, r4, asr #30
    c314:	4e414952 			@ <UNDEFINED> instruction: 0x4e414952
    c318:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
    c31c:	3028206b 	eorcc	r2, r8, fp, rrx
    c320:	4c554678 	mrrcmi	6, 7, r4, r5, cr8
    c324:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    c328:	5f424353 	svcpl	0x00424353
    c32c:	49555043 	ldmdbmi	r5, {r0, r1, r6, ip, lr}^
    c330:	41565f44 	cmpmi	r6, r4, asr #30
    c334:	4e414952 			@ <UNDEFINED> instruction: 0x4e414952
    c338:	6f505f54 	svcvs	0x00505f54
    c33c:	5f002973 	svcpl	0x00002973
    c340:	4953585f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, fp, ip, lr}^
    c344:	5349565f 	movtpl	r5, #38495	@ 0x965f
    c348:	454c4249 	strbmi	r4, [ip, #-585]	@ 0xfffffdb7
    c34c:	5f003020 	svcpl	0x00003020
    c350:	5f4d435f 	svcpl	0x004d435f
    c354:	49534d43 	ldmdbmi	r3, {r0, r1, r6, r8, sl, fp, lr}^
    c358:	45565f53 	ldrbmi	r5, [r6, #-3923]	@ 0xfffff0ad
    c35c:	4f495352 	svcmi	0x00495352
    c360:	55535f4e 	ldrbpl	r5, [r3, #-3918]	@ 0xfffff0b2
    c364:	20282042 	eorcs	r2, r8, r2, asr #32
    c368:	00295536 	eoreq	r5, r9, r6, lsr r5
    c36c:	454e5f5f 	strbmi	r5, [lr, #-3935]	@ 0xfffff0a1
    c370:	42494c57 	submi	r4, r9, #22272	@ 0x5700
    c374:	5f5f485f 	svcpl	0x005f485f
    c378:	49003120 	stmdbmi	r0, {r5, r8, ip, sp}
    c37c:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    c380:	545f3252 	ldrbpl	r3, [pc], #-594	@ c388 <_Min_Stack_Size+0xbf88>
    c384:	505f4152 	subspl	r4, pc, r2, asr r1	@ <UNPREDICTABLE>
    c388:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    c38c:	00295532 	eoreq	r5, r9, r2, lsr r5
    c390:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    c394:	5341465f 	movtpl	r4, #5727	@ 0x165f
    c398:	5f323354 	svcpl	0x00323354
    c39c:	2058414d 	subscs	r4, r8, sp, asr #2
    c3a0:	555f5f28 	ldrbpl	r5, [pc, #-3880]	@ b480 <_Min_Stack_Size+0xb080>
    c3a4:	5f544e49 	svcpl	0x00544e49
    c3a8:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    c3ac:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ c2e8 <_Min_Stack_Size+0xbee8>
    c3b0:	5f5f5841 	svcpl	0x005f5841
    c3b4:	53550029 	cmppl	r5, #41	@ 0x29
    c3b8:	32545241 	subscc	r5, r4, #268435460	@ 0x10000004
    c3bc:	5341425f 	movtpl	r4, #4703	@ 0x125f
    c3c0:	50282045 	eorpl	r2, r8, r5, asr #32
    c3c4:	70697265 	rsbvc	r7, r9, r5, ror #4
    c3c8:	61726568 	cmnvs	r2, r8, ror #10
    c3cc:	425f736c 	subsmi	r7, pc, #108, 6	@ 0xb0000001
    c3d0:	20455341 	subcs	r5, r5, r1, asr #6
    c3d4:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    c3d8:	31303030 	teqcc	r0, r0, lsr r0
    c3dc:	30303434 	eorscc	r3, r0, r4, lsr r4
    c3e0:	00294c55 	eoreq	r4, r9, r5, asr ip
