NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    c3e4:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    c3e8:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    c3ec:	43445f67 	movtmi	r5, #20327	@ 0x4f67
    c3f0:	5f525352 	svcpl	0x00525352
    c3f4:	57474552 	smlsldpl	r4, r7, r2, r5
    c3f8:	505f526e 	subspl	r5, pc, lr, ror #4
    c3fc:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    c400:	44005536 	strmi	r5, [r0], #-1334	@ 0xfffffaca
    c404:	465f5457 			@ <UNDEFINED> instruction: 0x465f5457
    c408:	54434e55 	strbpl	r4, [r3], #-3669	@ 0xfffff1ab
    c40c:	5f4e4f49 	svcpl	0x004e4f49
    c410:	41544144 	cmpmi	r4, r4, asr #2
    c414:	54414d56 	strbpl	r4, [r1], #-3414	@ 0xfffff2aa
    c418:	505f4843 	subspl	r4, pc, r3, asr #16
    c41c:	3820736f 	stmdacc	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    c420:	41520055 	cmpmi	r2, r5, asr r0
    c424:	4d5f444e 	cfldrdmi	mvd4, [pc, #-312]	@ c2f4 <_Min_Stack_Size+0xbef4>
    c428:	5f205841 	svcpl	0x00205841
    c42c:	4e41525f 	mcrmi	2, 2, r5, cr1, cr15, {2}
    c430:	414d5f44 	cmpmi	sp, r4, asr #30
    c434:	57440058 	smlsldpl	r0, r4, r8, r0
    c438:	55465f54 	strbpl	r5, [r6, #-3924]	@ 0xfffff0ac
    c43c:	4954434e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, r9, lr}^
    c440:	4c5f4e4f 	mrrcmi	14, 4, r4, pc, cr15	@ <UNPREDICTABLE>
    c444:	45314b4e 	ldrmi	r4, [r1, #-2894]!	@ 0xfffff4b2
    c448:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ c318 <_Min_Stack_Size+0xbf18>
    c44c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    c450:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    c454:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    c458:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
    c45c:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    c460:	4f495443 	svcmi	0x00495443
    c464:	4e4c5f4e 	cdpmi	15, 4, cr5, cr12, cr14, {2}
    c468:	4e45314b 	dvfmism	f3, f5, #3.0
    c46c:	6f505f41 	svcvs	0x00505f41
    c470:	41002973 	tstmi	r0, r3, ror r9
    c474:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ c334 <_Min_Stack_Size+0xbf34>
    c478:	435f5550 	cmpmi	pc, #80, 10	@ 0x14000000
    c47c:	45484341 	strbmi	r4, [r8, #-833]	@ 0xfffffcbf
    c480:	54575f50 	ldrbpl	r5, [r7], #-3920	@ 0xfffff0b0
    c484:	41574e5f 	cmpmi	r7, pc, asr lr
    c488:	00553220 	subseq	r3, r5, r0, lsr #4
    c48c:	4f535f5f 	svcmi	0x00535f5f
    c490:	30205450 	eorcc	r5, r0, r0, asr r4
    c494:	30343078 	eorscc	r3, r4, r8, ror r0
    c498:	5f5f0030 	svcpl	0x005f0030
    c49c:	44455355 	strbmi	r5, [r5], #-853	@ 0xfffffcab
    c4a0:	615f5f20 	cmpvs	pc, r0, lsr #30
    c4a4:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    c4a8:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    c4ac:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    c4b0:	64657375 	strbtvs	r7, [r5], #-885	@ 0xfffffc8b
    c4b4:	53002929 	movwpl	r2, #2345	@ 0x929
    c4b8:	415f4243 	cmpmi	pc, r3, asr #4
    c4bc:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
    c4c0:	4345565f 	movtmi	r5, #22111	@ 0x565f
    c4c4:	53455254 	movtpl	r5, #21076	@ 0x5254
    c4c8:	4d5f5445 	cfldrdmi	mvd5, [pc, #-276]	@ c3bc <_Min_Stack_Size+0xbfbc>
    c4cc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    c4d0:	204c5531 	subcs	r5, ip, r1, lsr r5
    c4d4:	5f5f0029 	svcpl	0x005f0029
    c4d8:	676e6172 			@ <UNDEFINED> instruction: 0x676e6172
    c4dc:	28666f65 	stmdacs	r6!, {r0, r2, r5, r6, r8, r9, sl, fp, sp, lr}^
    c4e0:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    c4e4:	6174732c 	cmnvs	r4, ip, lsr #6
    c4e8:	652c7472 	strvs	r7, [ip, #-1138]!	@ 0xfffffb8e
    c4ec:	2029646e 	eorcs	r6, r9, lr, ror #8
    c4f0:	6f5f5f28 	svcvs	0x005f5f28
    c4f4:	65736666 	ldrbvs	r6, [r3, #-1638]!	@ 0xfffff99a
    c4f8:	28666f74 	stmdacs	r6!, {r2, r4, r5, r6, r8, r9, sl, fp, sp, lr}^
    c4fc:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    c500:	6e65202c 	cdpvs	0, 6, cr2, cr5, cr12, {1}
    c504:	2d202964 			@ <UNDEFINED> instruction: 0x2d202964
    c508:	6f5f5f20 	svcvs	0x005f5f20
    c50c:	65736666 	ldrbvs	r6, [r3, #-1638]!	@ 0xfffff99a
    c510:	28666f74 	stmdacs	r6!, {r2, r4, r5, r6, r8, r9, sl, fp, sp, lr}^
    c514:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
    c518:	7473202c 	ldrbtvc	r2, [r3], #-44	@ 0xffffffd4
    c51c:	29747261 	ldmdbcs	r4!, {r0, r5, r6, r9, ip, sp, lr}^
    c520:	43520029 	cmpmi	r2, #41	@ 0x29
    c524:	53555f43 	cmppl	r5, #268	@ 0x10c
    c528:	31545241 	cmpcc	r4, r1, asr #4
    c52c:	4b4c435f 	blmi	131d2b0 <_Min_Stack_Size+0x131ceb0>
    c530:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    c534:	52282029 	eorpl	r2, r8, #41	@ 0x29
    c538:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    c53c:	32425041 	subcc	r5, r2, #65	@ 0x41
    c540:	20524e45 	subscs	r4, r2, r5, asr #28
    c544:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    c548:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    c54c:	29343120 	ldmdbcs	r4!, {r5, r8, ip, sp}
    c550:	535f0029 	cmppl	pc, #41	@ 0x29
    c554:	435f5359 	cmpmi	pc, #1677721601	@ 0x64000001
    c558:	53464544 	movtpl	r4, #25924	@ 0x6544
    c55c:	205f485f 	subscs	r4, pc, pc, asr r8	@ <UNPREDICTABLE>
    c560:	4f505f00 	svcmi	0x00505f00
    c564:	5f584953 	svcpl	0x00584953
    c568:	4f535f43 	svcmi	0x00535f43
    c56c:	45435255 	strbmi	r5, [r3, #-597]	@ 0xfffffdab
    c570:	30303220 	eorscc	r3, r0, r0, lsr #4
    c574:	4c393038 	ldcmi	0, cr3, [r9], #-224	@ 0xffffff20
    c578:	4d524100 	ldfmie	f4, [r2, #-0]
    c57c:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    c580:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    c584:	5f4e4f49 	svcpl	0x004e4f49
    c588:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    c58c:	4234365f 	eorsmi	r3, r4, #99614720	@ 0x5f00000
    c590:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    c594:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    c598:	3029745f 	eorcc	r7, r9, pc, asr r4
    c59c:	55353078 	ldrpl	r3, [r5, #-120]!	@ 0xffffff88
    c5a0:	4e490029 	cdpmi	0, 4, cr0, cr9, cr9, {1}
    c5a4:	52545054 	subspl	r5, r4, #84	@ 0x54
    c5a8:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    c5ac:	5f5f2820 	svcpl	0x005f2820
    c5b0:	50544e49 	subspl	r4, r4, r9, asr #28
    c5b4:	4d5f5254 	lfmmi	f5, 2, [pc, #-336]	@ c46c <_Min_Stack_Size+0xc06c>
    c5b8:	5f5f5841 	svcpl	0x005f5841
    c5bc:	525f0029 	subspl	r0, pc, #41	@ 0x29
    c5c0:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    c5c4:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    c5c8:	2854554f 	ldmdacs	r4, {r0, r1, r2, r3, r6, r8, sl, ip, lr}^
    c5cc:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    c5d0:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    c5d4:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    c5d8:	5f3e2d29 	svcpl	0x003e2d29
    c5dc:	6f647473 	svcvs	0x00647473
    c5e0:	00297475 	eoreq	r7, r9, r5, ror r4
    c5e4:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    c5e8:	4d5f5841 	ldclmi	8, cr5, [pc, #-260]	@ c4ec <_Min_Stack_Size+0xc0ec>
    c5ec:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    c5f0:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    c5f4:	58414d54 	stmdapl	r1, {r2, r4, r6, r8, sl, fp, lr}^
    c5f8:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    c5fc:	00295f5f 	eoreq	r5, r9, pc, asr pc
    c600:	5f545744 	svcpl	0x00545744
    c604:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    c608:	454c535f 	strbmi	r5, [ip, #-863]	@ 0xfffffca1
    c60c:	56455045 	strbpl	r5, [r5], -r5, asr #32
    c610:	414e4554 	cmpmi	lr, r4, asr r5
    c614:	6b734d5f 	blvs	1cdfb98 <_Min_Stack_Size+0x1cdf798>
    c618:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    c61c:	204c5531 	subcs	r5, ip, r1, lsr r5
    c620:	44203c3c 	strtmi	r3, [r0], #-3132	@ 0xfffff3c4
    c624:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    c628:	5f4c5254 	svcpl	0x004c5254
    c62c:	45454c53 	strbmi	r4, [r5, #-3155]	@ 0xfffff3ad
    c630:	54564550 	ldrbpl	r4, [r6], #-1360	@ 0xfffffab0
    c634:	5f414e45 	svcpl	0x00414e45
    c638:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    c63c:	42435300 	submi	r5, r3, #0, 6
    c640:	4348535f 	movtmi	r5, #33631	@ 0x835f
    c644:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ c500 <_Min_Stack_Size+0xc100>
    c648:	54494e4f 	strbpl	r4, [r9], #-3663	@ 0xfffff1b1
    c64c:	4341524f 	movtmi	r5, #4687	@ 0x124f
    c650:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
    c654:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    c658:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    c65c:	4353203c 	cmpmi	r3, #60	@ 0x3c
    c660:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    c664:	5f525343 	svcpl	0x00525343
    c668:	494e4f4d 	stmdbmi	lr, {r0, r2, r3, r6, r8, r9, sl, fp, lr}^
    c66c:	41524f54 	cmpmi	r2, r4, asr pc
    c670:	505f5443 	subspl	r5, pc, r3, asr #8
    c674:	0029736f 	eoreq	r7, r9, pc, ror #6
    c678:	65757274 	ldrbvs	r7, [r5, #-628]!	@ 0xfffffd8c
    c67c:	4e003120 	adfmisp	f3, f0, f0
    c680:	5f434956 	svcpl	0x00434956
    c684:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    c688:	7830205f 	ldmdavc	r0!, {r0, r1, r2, r3, r4, r6, sp}
    c68c:	30303045 	eorscc	r3, r0, r5, asr #32
    c690:	30303145 	eorscc	r3, r0, r5, asr #2
    c694:	5f004c55 	svcpl	0x00004c55
    c698:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    c69c:	54535f54 	ldrbpl	r5, [r3], #-3924	@ 0xfffff0ac
    c6a0:	284e4944 	stmdacs	lr, {r2, r6, r8, fp, lr}^
    c6a4:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    c6a8:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    c6ac:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    c6b0:	5f3e2d29 	svcpl	0x003e2d29
    c6b4:	69647473 	stmdbvs	r4!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
    c6b8:	5300296e 	movwpl	r2, #2414	@ 0x96e
    c6bc:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    c6c0:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    c6c4:	4d454d5f 	stclmi	13, cr4, [r5, #-380]	@ 0xfffffe84
    c6c8:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    c6cc:	4e455054 	mcrmi	0, 2, r5, cr5, cr4, {2}
    c6d0:	5f444544 	svcpl	0x00444544
    c6d4:	206b734d 	rsbcs	r7, fp, sp, asr #6
    c6d8:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    c6dc:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    c6e0:	5f424353 	svcpl	0x00424353
    c6e4:	53434853 	movtpl	r4, #14419	@ 0x3853
    c6e8:	454d5f52 	strbmi	r5, [sp, #-3922]	@ 0xfffff0ae
    c6ec:	5541464d 	strbpl	r4, [r1, #-1613]	@ 0xfffff9b3
    c6f0:	4550544c 	ldrbmi	r5, [r0, #-1100]	@ 0xfffffbb4
    c6f4:	4445444e 	strbmi	r4, [r5], #-1102	@ 0xfffffbb2
    c6f8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    c6fc:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    c700:	41425f54 	cmpmi	r2, r4, asr pc
    c704:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    c708:	30457830 	subcc	r7, r5, r0, lsr r8
    c70c:	30313030 	eorscc	r3, r1, r0, lsr r0
    c710:	4c553030 	mrrcmi	0, 3, r3, r5, cr0
    c714:	43530029 	cmpmi	r3, #41	@ 0x29
    c718:	46445f42 	strbmi	r5, [r4], -r2, asr #30
    c71c:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    c720:	43544143 	cmpmi	r4, #-1073741808	@ 0xc0000010
    c724:	6f505f48 	svcvs	0x00505f48
    c728:	55332073 	ldrpl	r2, [r3, #-115]!	@ 0xffffff8d
    c72c:	4e495500 	cdpmi	5, 4, cr5, cr9, cr0, {0}
    c730:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    c734:	31545341 	cmpcc	r4, r1, asr #6
    c738:	414d5f36 	cmpmi	sp, r6, lsr pc
    c73c:	5f282058 	svcpl	0x00282058
    c740:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    c744:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    c748:	31545341 	cmpcc	r4, r1, asr #6
    c74c:	414d5f36 	cmpmi	sp, r6, lsr pc
    c750:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    c754:	49535f00 	ldmdbmi	r3, {r8, r9, sl, fp, ip, lr}^
    c758:	545f455a 	ldrbpl	r4, [pc], #-1370	@ c760 <_Min_Stack_Size+0xc360>
    c75c:	4645445f 			@ <UNDEFINED> instruction: 0x4645445f
    c760:	44454e49 	strbmi	r4, [r5], #-3657	@ 0xfffff1b7
    c764:	4e490020 	cdpmi	0, 4, cr0, cr9, cr0, {1}
    c768:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ c620 <_Min_Stack_Size+0xc220>
    c76c:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    c770:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    c774:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ c62c <_Min_Stack_Size+0xc22c>
    c778:	5f5f5841 	svcpl	0x005f5841
    c77c:	32490029 	subcc	r0, r9, #41	@ 0x29
    c780:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    c784:	4e455f31 	mcrmi	15, 2, r5, cr5, cr1, {1}
    c788:	49204347 	stmdbmi	r0!, {r0, r1, r2, r6, r8, r9, lr}
    c78c:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    c790:	455f3152 	ldrbmi	r3, [pc, #-338]	@ c646 <_Min_Stack_Size+0xc246>
    c794:	5f43474e 	svcpl	0x0043474e
    c798:	006b734d 	rsbeq	r7, fp, sp, asr #6
    c79c:	5f545744 	svcpl	0x00545744
    c7a0:	434e5546 	movtmi	r5, #58694	@ 0xe546
    c7a4:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    c7a8:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    c7ac:	4f495443 	svcmi	0x00495443
    c7b0:	6f505f4e 	svcvs	0x00505f4e
    c7b4:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    c7b8:	43475f00 	movtmi	r5, #32512	@ 0x7f00
    c7bc:	49535f43 	ldmdbmi	r3, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
    c7c0:	545f455a 	ldrbpl	r4, [pc], #-1370	@ c7c8 <_Min_Stack_Size+0xc3c8>
    c7c4:	5f5f0020 	svcpl	0x005f0020
    c7c8:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    c7cc:	5f745f38 	svcpl	0x00745f38
    c7d0:	69666564 	stmdbvs	r6!, {r2, r5, r6, r8, sl, sp, lr}^
    c7d4:	2064656e 	rsbcs	r6, r4, lr, ror #10
    c7d8:	5f5f0031 	svcpl	0x005f0031
    c7dc:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    c7e0:	22203436 	eorcs	r3, r0, #905969664	@ 0x36000000
    c7e4:	00226c6c 	eoreq	r6, r2, ip, ror #24
    c7e8:	5f424353 	svcpl	0x00424353
    c7ec:	53434853 	movtpl	r4, #14419	@ 0x3853
    c7f0:	53555f52 	cmppl	r5, #328	@ 0x148
    c7f4:	55414647 	strbpl	r4, [r1, #-1607]	@ 0xfffff9b9
    c7f8:	4341544c 	movtmi	r5, #5196	@ 0x144c
    c7fc:	6f505f54 	svcvs	0x00505f54
    c800:	55332073 	ldrpl	r2, [r3, #-115]!	@ 0xffffff8d
    c804:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    c808:	5f544e45 	svcpl	0x00544e45
    c80c:	54525453 	ldrbpl	r5, [r2], #-1107	@ 0xfffffbad
    c810:	4c5f4b4f 	mrrcmi	11, 4, r4, pc, cr15	@ <UNPREDICTABLE>
    c814:	28545341 	ldmdacs	r4, {r0, r6, r8, r9, ip, lr}^
    c818:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    c81c:	70282820 	eorvc	r2, r8, r0, lsr #16
    c820:	2d297274 	sfmcs	f7, 4, [r9, #-464]!	@ 0xfffffe30
    c824:	696d5f3e 	stmdbvs	sp!, {r1, r2, r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    c828:	3e2d6373 	mcrcc	3, 1, r6, cr13, cr3, {3}
    c82c:	7274735f 	rsbsvc	r7, r4, #2080374785	@ 0x7c000001
    c830:	5f6b6f74 	svcpl	0x006b6f74
    c834:	7473616c 	ldrbtvc	r6, [r3], #-364	@ 0xfffffe94
    c838:	525f0029 	subspl	r0, pc, #41	@ 0x29
    c83c:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    c840:	4749535f 	smlsldmi	r5, r9, pc, r3	@ <UNPREDICTABLE>
    c844:	4d41474e 	stclmi	7, cr4, [r1, #-312]	@ 0xfffffec8
    c848:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    c84c:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    c850:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    c854:	675f3e2d 	ldrbvs	r3, [pc, -sp, lsr #28]
    c858:	616d6d61 	cmnvs	sp, r1, ror #26
    c85c:	6769735f 			@ <UNDEFINED> instruction: 0x6769735f
    c860:	6d61676e 	stclvs	7, cr6, [r1, #-440]!	@ 0xfffffe48
    c864:	49550029 	ldmdbmi	r5, {r0, r3, r5}^
    c868:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    c86c:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    c870:	414d5f38 	cmpmi	sp, r8, lsr pc
    c874:	5f282058 	svcpl	0x00282058
    c878:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    c87c:	454c5f54 	strbmi	r5, [ip, #-3924]	@ 0xfffff0ac
    c880:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
    c884:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    c888:	00295f5f 	eoreq	r5, r9, pc, asr pc
    c88c:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    c890:	525f544e 	subspl	r5, pc, #1308622848	@ 0x4e000000
    c894:	34444e41 	strbcc	r4, [r4], #-3649	@ 0xfffff1bf
    c898:	554d5f38 	strbpl	r5, [sp, #-3896]	@ 0xfffff0c8
    c89c:	7028544c 	eorvc	r5, r8, ip, asr #8
    c8a0:	20297274 	eorcs	r7, r9, r4, ror r2
    c8a4:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    c8a8:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    c8ac:	3834725f 	ldmdacc	r4!, {r0, r1, r2, r3, r4, r6, r9, ip, sp, lr}
    c8b0:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ c804 <_Min_Stack_Size+0xc404>
    c8b4:	29746c75 	ldmdbcs	r4!, {r0, r2, r4, r5, r6, sl, fp, sp, lr}^
    c8b8:	425f5f00 	subsmi	r5, pc, #0, 30
    c8bc:	565f4453 			@ <UNDEFINED> instruction: 0x565f4453
    c8c0:	42495349 	submi	r5, r9, #603979777	@ 0x24000001
    c8c4:	3120454c 			@ <UNDEFINED> instruction: 0x3120454c
    c8c8:	6e5f5f00 	cdpvs	15, 5, cr5, cr15, cr0, {0}
    c8cc:	5f646565 	svcpl	0x00646565
    c8d0:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    c8d4:	43530020 	cmpmi	r3, #32
    c8d8:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    c8dc:	5f525343 	svcpl	0x00525343
    c8e0:	464d454d 	strbmi	r4, [sp], -sp, asr #10
    c8e4:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    c8e8:	5f544341 	svcpl	0x00544341
    c8ec:	20736f50 	rsbscs	r6, r3, r0, asr pc
    c8f0:	49005530 	stmdbmi	r0, {r4, r5, r8, sl, ip, lr}
    c8f4:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    c8f8:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    c8fc:	65736572 	ldrbvs	r6, [r3, #-1394]!	@ 0xfffffa8e
    c900:	4d5f746e 	cfldrdmi	mvd7, [pc, #-440]	@ c750 <_Min_Stack_Size+0xc350>
    c904:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    c908:	5f4d5449 	svcpl	0x004d5449
    c90c:	5f52534c 	svcpl	0x0052534c
    c910:	53455250 	movtpl	r5, #21072	@ 0x5250
    c914:	5f544e45 	svcpl	0x00544e45
    c918:	296b734d 	stmdbcs	fp!, {r0, r2, r3, r6, r8, r9, ip, sp, lr}^
    c91c:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    c920:	41454c5f 	cmpmi	r5, pc, asr ip
    c924:	5f385453 	svcpl	0x00385453
    c928:	204e494d 	subcs	r4, lr, sp, asr #18
    c92c:	5f5f2d28 	svcpl	0x005f2d28
    c930:	5f544e49 	svcpl	0x00544e49
    c934:	5341454c 	movtpl	r4, #5452	@ 0x154c
    c938:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ c7f0 <_Min_Stack_Size+0xc3f0>
    c93c:	5f5f5841 	svcpl	0x005f5841
    c940:	31202d20 			@ <UNDEFINED> instruction: 0x31202d20
    c944:	495f0029 	ldmdbmi	pc, {r0, r3, r5}^	@ <UNPREDICTABLE>
    c948:	5450544e 	ldrbpl	r5, [r0], #-1102	@ 0xfffffbb2
    c94c:	5f545f52 	svcpl	0x00545f52
    c950:	4c434544 	cfstr64mi	mvdx4, [r3], {68}	@ 0x44
    c954:	44455241 	strbmi	r5, [r5], #-577	@ 0xfffffdbf
    c958:	43530020 	cmpmi	r3, #32
    c95c:	49415f42 	stmdbmi	r1, {r1, r6, r8, r9, sl, fp, ip, lr}^
    c960:	5f524352 	svcpl	0x00524352
    c964:	54434556 	strbpl	r4, [r3], #-1366	@ 0xfffffaaa
    c968:	41524c43 	cmpmi	r2, r3, asr #24
    c96c:	56495443 	strbpl	r5, [r9], -r3, asr #8
    c970:	734d5f45 	movtvc	r5, #57157	@ 0xdf45
    c974:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    c978:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    c97c:	4353203c 	cmpmi	r3, #60	@ 0x3c
    c980:	49415f42 	stmdbmi	r1, {r1, r6, r8, r9, sl, fp, ip, lr}^
    c984:	5f524352 	svcpl	0x00524352
    c988:	54434556 	strbpl	r4, [r3], #-1366	@ 0xfffffaaa
    c98c:	41524c43 	cmpmi	r2, r3, asr #24
    c990:	56495443 	strbpl	r5, [r9], -r3, asr #8
    c994:	6f505f45 	svcvs	0x00505f45
    c998:	43002973 	movwmi	r2, #2419	@ 0x973
    c99c:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    c9a0:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    c9a4:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    c9a8:	565f5243 	ldrbpl	r5, [pc], -r3, asr #4
    c9ac:	4e495f43 	cdpmi	15, 4, cr5, cr9, cr3, {2}
    c9b0:	52524554 	subspl	r4, r2, #84, 10	@ 0x15000000
    c9b4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    c9b8:	00553920 	subseq	r3, r5, r0, lsr #18
    c9bc:	5f4d5241 	svcpl	0x004d5241
    c9c0:	5f55504d 	svcpl	0x0055504d
    c9c4:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    c9c8:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    c9cc:	5f455a49 	svcpl	0x00455a49
    c9d0:	20423233 	subcs	r3, r2, r3, lsr r2
    c9d4:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    c9d8:	5f38746e 	svcpl	0x0038746e
    c9dc:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    c9e0:	29553430 	ldmdbcs	r5, {r4, r5, sl, ip, sp}^
    c9e4:	4e495f00 	cdpmi	15, 4, cr5, cr9, cr0, {0}
    c9e8:	5f323354 	svcpl	0x00323354
    c9ec:	4c5f5145 	ldfmie	f5, [pc], {69}	@ 0x45
    c9f0:	20474e4f 	subcs	r4, r7, pc, asr #28
    c9f4:	4c554e00 	mrrcmi	14, 0, r4, r5, cr0
    c9f8:	2828204c 	stmdacs	r8!, {r2, r3, r6, sp}
    c9fc:	64696f76 	strbtvs	r6, [r9], #-3958	@ 0xfffff08a
    ca00:	30292a20 	eorcc	r2, r9, r0, lsr #20
    ca04:	43520029 	cmpmi	r2, #41	@ 0x29
    ca08:	46415f43 	strbmi	r5, [r1], -r3, asr #30
    ca0c:	435f4f49 	cmpmi	pc, #292	@ 0x124
    ca10:	455f4b4c 	ldrbmi	r4, [pc, #-2892]	@ becc <_Min_Stack_Size+0xbacc>
    ca14:	2029284e 	eorcs	r2, r9, lr, asr #16
    ca18:	43435228 	movtmi	r5, #12840	@ 0x3228
    ca1c:	50413e2d 	subpl	r3, r1, sp, lsr #28
    ca20:	4e453242 	cdpmi	2, 4, cr3, cr5, cr2, {2}
    ca24:	3d7c2052 	ldclcc	0, cr2, [ip, #-328]!	@ 0xfffffeb8
    ca28:	20312820 	eorscs	r2, r1, r0, lsr #16
    ca2c:	30203c3c 	eorcc	r3, r0, ip, lsr ip
    ca30:	52002929 	andpl	r2, r0, #671744	@ 0xa4000
    ca34:	475f4343 	ldrbmi	r4, [pc, -r3, asr #6]
    ca38:	454f4950 	strbmi	r4, [pc, #-2384]	@ c0f0 <_Min_Stack_Size+0xbcf0>
    ca3c:	4b4c435f 	blmi	131d7c0 <_Min_Stack_Size+0x131d3c0>
    ca40:	284e455f 	stmdacs	lr, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    ca44:	52282029 	eorpl	r2, r8, #41	@ 0x29
    ca48:	3e2d4343 	cdpcc	3, 2, cr4, cr13, cr3, {2}
    ca4c:	32425041 	subcc	r5, r2, #65	@ 0x41
    ca50:	20524e45 	subscs	r4, r2, r5, asr #28
    ca54:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    ca58:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    ca5c:	29293620 	stmdbcs	r9!, {r5, r9, sl, ip, sp}
    ca60:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    ca64:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    ca68:	5f363351 	svcpl	0x00363351
    ca6c:	32495053 	subcc	r5, r9, #83	@ 0x53
    ca70:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
    ca74:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    ca78:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    ca7c:	4349564e 	movtmi	r5, #38478	@ 0x964e
    ca80:	4543495f 	strbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    ca84:	7c203152 	stfvcs	f3, [r0], #-328	@ 0xfffffeb8
    ca88:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    ca8c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ca90:	00292934 	eoreq	r2, r9, r4, lsr r9
    ca94:	5f545744 	svcpl	0x00545744
    ca98:	434e5546 	movtmi	r5, #58694	@ 0xe546
    ca9c:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
    caa0:	54414d5f 	strbpl	r4, [r1], #-3423	@ 0xfffff2a1
    caa4:	44454843 	strbmi	r4, [r5], #-2115	@ 0xfffff7bd
    caa8:	6b734d5f 	blvs	1ce002c <_Min_Stack_Size+0x1cdfc2c>
    caac:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    cab0:	204c5531 	subcs	r5, ip, r1, lsr r5
    cab4:	44203c3c 	strtmi	r3, [r0], #-3132	@ 0xfffff3c4
    cab8:	465f5457 			@ <UNDEFINED> instruction: 0x465f5457
    cabc:	54434e55 	strbpl	r4, [r3], #-3669	@ 0xfffff1ab
    cac0:	5f4e4f49 	svcpl	0x004e4f49
    cac4:	4354414d 	cmpmi	r4, #1073741843	@ 0x40000013
    cac8:	5f444548 	svcpl	0x00444548
    cacc:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    cad0:	42435300 	submi	r5, r3, #0, 6
    cad4:	5346445f 	movtpl	r4, #25695	@ 0x645f
    cad8:	4b425f52 	blmi	10a4828 <_Min_Stack_Size+0x10a4428>
    cadc:	505f5450 	subspl	r5, pc, r0, asr r4	@ <UNPREDICTABLE>
    cae0:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    cae4:	49550055 	ldmdbmi	r5, {r0, r2, r4, r6}^
    cae8:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    caec:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    caf0:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ ca20 <_Min_Stack_Size+0xc620>
    caf4:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    caf8:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    cafc:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    cb00:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    cb04:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ ca34 <_Min_Stack_Size+0xc634>
    cb08:	5f5f5841 	svcpl	0x005f5841
