NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    cb0c:	4d5f0029 	ldclmi	0, cr0, [pc, #-164]	@ ca70 <_Min_Stack_Size+0xc670>
    cb10:	49484341 	stmdbmi	r8, {r0, r6, r8, r9, lr}^
    cb14:	5f5f454e 	svcpl	0x005f454e
    cb18:	41464544 	cmpmi	r6, r4, asr #10
    cb1c:	5f544c55 	svcpl	0x00544c55
    cb20:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
    cb24:	20485f53 	subcs	r5, r8, r3, asr pc
    cb28:	43324900 	teqmi	r2, #0, 18
    cb2c:	52455f32 	subpl	r5, r5, #50, 30	@ 0xc8
    cb30:	5152495f 	cmppl	r2, pc, asr r9
    cb34:	00343320 	eorseq	r3, r4, r0, lsr #6
    cb38:	4e555f5f 	mrcmi	15, 2, r5, cr5, cr15, {2}
    cb3c:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    cb40:	5f44454e 	svcpl	0x0044454e
    cb44:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    cb48:	525f3233 	subspl	r3, pc, #805306371	@ 0x30000003
    cb4c:	28444145 	stmdacs	r4, {r0, r2, r6, r8, lr}^
    cb50:	72646461 	rsbvc	r6, r4, #1627389952	@ 0x61000000
    cb54:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    cb58:	6e6f6328 	cdpvs	3, 6, cr6, cr15, cr8, {1}
    cb5c:	73207473 			@ <UNDEFINED> instruction: 0x73207473
    cb60:	63757274 	cmnvs	r5, #116, 4	@ 0x40000007
    cb64:	5f542074 	svcpl	0x00542074
    cb68:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    cb6c:	525f3233 	subspl	r3, pc, #805306371	@ 0x30000003
    cb70:	20444145 	subcs	r4, r4, r5, asr #2
    cb74:	6328292a 			@ <UNDEFINED> instruction: 0x6328292a
    cb78:	74736e6f 	ldrbtvc	r6, [r3], #-3695	@ 0xfffff191
    cb7c:	696f7620 	stmdbvs	pc!, {r5, r9, sl, ip, sp, lr}^	@ <UNPREDICTABLE>
    cb80:	292a2064 	stmdbcs	sl!, {r2, r5, r6, sp}
    cb84:	64646128 	strbtvs	r6, [r4], #-296	@ 0xfffffed8
    cb88:	2d292972 			@ <UNDEFINED> instruction: 0x2d292972
    cb8c:	0029763e 	eoreq	r7, r9, lr, lsr r6
    cb90:	5f4d5241 	svcpl	0x004d5241
    cb94:	5f55504d 	svcpl	0x0055504d
    cb98:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    cb9c:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    cba0:	5f455a49 	svcpl	0x00455a49
    cba4:	4b323135 	blmi	c99080 <_Min_Stack_Size+0xc98c80>
    cba8:	28282042 	stmdacs	r8!, {r1, r6, sp}
    cbac:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    cbb0:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    cbb4:	32317830 	eorscc	r7, r1, #48, 16	@ 0x300000
    cbb8:	41002955 	tstmi	r0, r5, asr r9
    cbbc:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ ca7c <_Min_Stack_Size+0xc67c>
    cbc0:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    cbc4:	4f494745 	svcmi	0x00494745
    cbc8:	49535f4e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    cbcc:	325f455a 	subscc	r4, pc, #377487360	@ 0x16800000
    cbd0:	424d3635 	submi	r3, sp, #55574528	@ 0x3500000
    cbd4:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    cbd8:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    cbdc:	3029745f 	eorcc	r7, r9, pc, asr r4
    cbe0:	55423178 	strbpl	r3, [r2, #-376]	@ 0xfffffe88
    cbe4:	525f0029 	subspl	r0, pc, #41	@ 0x29
    cbe8:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    cbec:	5456435f 	ldrbpl	r4, [r6], #-863	@ 0xfffffca1
    cbf0:	28465542 	stmdacs	r6, {r1, r6, r8, sl, ip, lr}^
    cbf4:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    cbf8:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    cbfc:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    cc00:	5f3e2d29 	svcpl	0x003e2d29
    cc04:	62747663 	rsbsvs	r7, r4, #103809024	@ 0x6300000
    cc08:	00296675 	eoreq	r6, r9, r5, ror r6
    cc0c:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    cc10:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ cb4c <_Min_Stack_Size+0xc74c>
    cc14:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    cc18:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    cc1c:	3233544e 	eorscc	r5, r3, #1308622848	@ 0x4e000000
    cc20:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    cc24:	00295f5f 	eoreq	r5, r9, pc, asr pc
    cc28:	50465f5f 	subpl	r5, r6, pc, asr pc
    cc2c:	53555f55 	cmppl	r5, #340	@ 0x154
    cc30:	30204445 	eorcc	r4, r0, r5, asr #8
    cc34:	564e0055 			@ <UNDEFINED> instruction: 0x564e0055
    cc38:	495f4349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    cc3c:	30524543 	subscc	r4, r2, r3, asr #10
    cc40:	76282a20 	strtvc	r2, [r8], -r0, lsr #20
    cc44:	74616c6f 	strbtvc	r6, [r1], #-3183	@ 0xfffff391
    cc48:	20656c69 	rsbcs	r6, r5, r9, ror #24
    cc4c:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    cc50:	745f3233 	ldrbvc	r3, [pc], #-563	@ cc58 <_Min_Stack_Size+0xc858>
    cc54:	28292a20 	stmdacs	r9!, {r5, r9, fp, sp}
    cc58:	4349564e 	movtmi	r5, #38478	@ 0x964e
    cc5c:	5341425f 	movtpl	r4, #4703	@ 0x125f
    cc60:	2b205f45 	blcs	82497c <_Min_Stack_Size+0x82457c>
    cc64:	38783020 	ldmdacc	r8!, {r5, ip, sp}^
    cc68:	4d002930 	vstrmi.16	s4, [r0, #-96]	@ 0xffffffa0	@ <UNPREDICTABLE>
    cc6c:	435f5550 	cmpmi	pc, #80, 10	@ 0x14000000
    cc70:	5f4c5254 	svcpl	0x004c5254
    cc74:	56495250 			@ <UNDEFINED> instruction: 0x56495250
    cc78:	45464544 	strbmi	r4, [r6, #-1348]	@ 0xfffffabc
    cc7c:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ cb4c <_Min_Stack_Size+0xc74c>
    cc80:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    cc84:	204c5531 	subcs	r5, ip, r1, lsr r5
    cc88:	4d203c3c 	stcmi	12, cr3, [r0, #-240]!	@ 0xffffff10
    cc8c:	435f5550 	cmpmi	pc, #80, 10	@ 0x14000000
    cc90:	5f4c5254 	svcpl	0x004c5254
    cc94:	56495250 			@ <UNDEFINED> instruction: 0x56495250
    cc98:	45464544 	strbmi	r4, [r6, #-1348]	@ 0xfffffabc
    cc9c:	505f414e 	subspl	r4, pc, lr, asr #2
    cca0:	0029736f 	eoreq	r7, r9, pc, ror #6
    cca4:	5f424353 	svcpl	0x00424353
    cca8:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    ccac:	564e495f 			@ <UNDEFINED> instruction: 0x564e495f
    ccb0:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
    ccb4:	6f505f45 	svcvs	0x00505f45
    ccb8:	53282073 			@ <UNDEFINED> instruction: 0x53282073
    ccbc:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    ccc0:	5f525346 	svcpl	0x00525346
    ccc4:	46475355 			@ <UNDEFINED> instruction: 0x46475355
    ccc8:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    cccc:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    ccd0:	2b20736f 	blcs	829a94 <_Min_Stack_Size+0x829694>
    ccd4:	29553120 	ldmdbcs	r5, {r5, r8, ip, sp}^
    ccd8:	6e435300 	cdpvs	3, 4, cr5, cr3, cr0, {0}
    ccdc:	5f424353 	svcpl	0x00424353
    cce0:	4c544341 	mrrcmi	3, 4, r4, r4, cr1	@ <UNPREDICTABLE>
    cce4:	49445f52 	stmdbmi	r4, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    cce8:	46454453 			@ <UNDEFINED> instruction: 0x46454453
    ccec:	46554257 			@ <UNDEFINED> instruction: 0x46554257
    ccf0:	736f505f 	cmnvc	pc, #95	@ 0x5f
    ccf4:	00553120 	subseq	r3, r5, r0, lsr #2
    ccf8:	4d435f5f 	stclmi	15, cr5, [r3, #-380]	@ 0xfffffe84
    ccfc:	45525f33 	ldrbmi	r5, [r2, #-3891]	@ 0xfffff0cd
    cd00:	78302056 	ldmdavc	r0!, {r1, r2, r4, r6, sp}
    cd04:	31303230 	teqcc	r0, r0, lsr r2
    cd08:	5f5f0055 	svcpl	0x005f0055
    cd0c:	4b414557 	blmi	105e270 <_Min_Stack_Size+0x105de70>
    cd10:	615f5f20 	cmpvs	pc, r0, lsr #30
    cd14:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    cd18:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    cd1c:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    cd20:	6b616577 	blvs	1866304 <_Min_Stack_Size+0x1865f04>
    cd24:	5f002929 	svcpl	0x00002929
    cd28:	65656e5f 	strbvs	r6, [r5, #-3679]!	@ 0xfffff1a1
    cd2c:	63775f64 	cmnvs	r7, #100, 30	@ 0x190
    cd30:	5f726168 	svcpl	0x00726168
    cd34:	43530074 	cmpmi	r3, #116	@ 0x74
    cd38:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    cd3c:	5f525343 	svcpl	0x00525343
    cd40:	41435653 	cmpmi	r3, r3, asr r6
    cd44:	43414c4c 	movtmi	r4, #7244	@ 0x1c4c
    cd48:	6f505f54 	svcvs	0x00505f54
    cd4c:	55372073 	ldrpl	r2, [r7, #-115]!	@ 0xffffff8d
    cd50:	43324900 	teqmi	r2, #0, 18
    cd54:	3152535f 	cmpcc	r2, pc, asr r3
    cd58:	4d49545f 	cfstrdmi	mvd5, [r9, #-380]	@ 0xfffffe84
    cd5c:	54554f45 	ldrbpl	r4, [r5], #-3909	@ 0xfffff0bb
    cd60:	736f505f 	cmnvc	pc, #95	@ 0x5f
    cd64:	34312820 	ldrtcc	r2, [r1], #-2080	@ 0xfffff7e0
    cd68:	5f002955 	svcpl	0x00002955
    cd6c:	54505f54 	ldrbpl	r5, [r0], #-3924	@ 0xfffff0ac
    cd70:	46494452 			@ <UNDEFINED> instruction: 0x46494452
    cd74:	5f002046 	svcpl	0x00002046
    cd78:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    cd7c:	4d535f54 	ldclmi	15, cr5, [r3, #-336]	@ 0xfffffeb0
    cd80:	204c4c41 	subcs	r4, ip, r1, asr #24
    cd84:	72655000 	rsbvc	r5, r5, #0
    cd88:	65687069 	strbvs	r7, [r8, #-105]!	@ 0xffffff97
    cd8c:	736c6172 	cmnvc	ip, #-2147483620	@ 0x8000001c
    cd90:	5341425f 	movtpl	r4, #4703	@ 0x125f
    cd94:	78302045 	ldmdavc	r0!, {r0, r2, r6, sp}
    cd98:	30303034 	eorscc	r3, r0, r4, lsr r0
    cd9c:	30303030 	eorscc	r3, r0, r0, lsr r0
    cda0:	43004c55 	movwmi	r4, #3157	@ 0xc55
    cda4:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    cda8:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    cdac:	4348445f 	movtmi	r4, #33887	@ 0x845f
    cdb0:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    cdb4:	5445525f 	strbpl	r5, [r5], #-607	@ 0xfffffda1
    cdb8:	5f455249 	svcpl	0x00455249
    cdbc:	4d5f5453 	cfldrdmi	mvd5, [pc, #-332]	@ cc78 <_Min_Stack_Size+0xc878>
    cdc0:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    cdc4:	204c5531 	subcs	r5, ip, r1, lsr r5
    cdc8:	43203c3c 			@ <UNDEFINED> instruction: 0x43203c3c
    cdcc:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    cdd0:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    cdd4:	4348445f 	movtmi	r4, #33887	@ 0x845f
    cdd8:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    cddc:	5445525f 	strbpl	r5, [r5], #-607	@ 0xfffffda1
    cde0:	5f455249 	svcpl	0x00455249
    cde4:	505f5453 	subspl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
    cde8:	0029736f 	eoreq	r7, r9, pc, ror #6
    cdec:	4f495047 	svcmi	0x00495047
    cdf0:	28282041 	stmdacs	r8!, {r0, r6, sp}
    cdf4:	4f495047 	svcmi	0x00495047
    cdf8:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    cdfc:	66654465 	strbtvs	r4, [r5], -r5, ror #8
    ce00:	47292a20 	strmi	r2, [r9, -r0, lsr #20]!
    ce04:	414f4950 	cmpmi	pc, r0, asr r9	@ <UNPREDICTABLE>
    ce08:	5341425f 	movtpl	r4, #4703	@ 0x125f
    ce0c:	49002945 	stmdbmi	r0, {r0, r2, r6, r8, fp, sp}
    ce10:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    ce14:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    ce18:	65736572 	ldrbvs	r6, [r3, #-1394]!	@ 0xfffffa8e
    ce1c:	505f746e 	subspl	r7, pc, lr, ror #8
    ce20:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    ce24:	5f4d5449 	svcpl	0x004d5449
    ce28:	5f52534c 	svcpl	0x0052534c
    ce2c:	53455250 	movtpl	r5, #21072	@ 0x5250
    ce30:	5f544e45 	svcpl	0x00544e45
    ce34:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    ce38:	565f5f00 	ldrbpl	r5, [pc], -r0, lsl #30
    ce3c:	4f544345 	svcmi	0x00544345
    ce40:	41545f52 	cmpmi	r4, r2, asr pc
    ce44:	5f454c42 	svcpl	0x00454c42
    ce48:	52545441 	subspl	r5, r4, #1090519040	@ 0x41000000
    ce4c:	54554249 	ldrbpl	r4, [r5], #-585	@ 0xfffffdb7
    ce50:	5f5f2045 	svcpl	0x005f2045
    ce54:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    ce58:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    ce5c:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    ce60:	65737528 	ldrbvs	r7, [r3, #-1320]!	@ 0xfffffad8
    ce64:	73202c64 			@ <UNDEFINED> instruction: 0x73202c64
    ce68:	69746365 	ldmdbvs	r4!, {r0, r2, r5, r6, r8, r9, sp, lr}^
    ce6c:	22286e6f 	eorcs	r6, r8, #1776	@ 0x6f0
    ce70:	6365762e 	cmnvs	r5, #48234496	@ 0x2e00000
    ce74:	73726f74 	cmnvc	r2, #116, 30	@ 0x1d0
    ce78:	29292922 	stmdbcs	r9!, {r1, r5, r8, fp, sp}
    ce7c:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    ce80:	575f4441 	ldrbpl	r4, [pc, -r1, asr #8]
    ce84:	45544952 	ldrbmi	r4, [r4, #-2386]	@ 0xfffff6ae
    ce88:	5445525f 	strbpl	r5, [r5], #-607	@ 0xfffffda1
    ce8c:	5f4e5255 	svcpl	0x004e5255
    ce90:	45505954 	ldrbmi	r5, [r0, #-2388]	@ 0xfffff6ac
    ce94:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    ce98:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
    ce9c:	5f323149 	svcpl	0x00323149
    cea0:	20515249 	subscs	r5, r1, r9, asr #4
    cea4:	52003034 	andpl	r3, r0, #52	@ 0x34
    cea8:	495f4343 	ldmdbmi	pc, {r0, r1, r6, r8, r9, lr}^	@ <UNPREDICTABLE>
    ceac:	5f314332 	svcpl	0x00314332
    ceb0:	65736552 	ldrbvs	r6, [r3, #-1362]!	@ 0xfffffaae
    ceb4:	20292874 	eorcs	r2, r9, r4, ror r8
    ceb8:	43435228 	movtmi	r5, #12840	@ 0x3228
    cebc:	50413e2d 	subpl	r3, r1, sp, lsr #28
    cec0:	53523242 	cmppl	r2, #536870916	@ 0x20000004
    cec4:	7c205254 	sfmvc	f5, 4, [r0], #-336	@ 0xfffffeb0
    cec8:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    cecc:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ced0:	29293132 	stmdbcs	r9!, {r1, r4, r5, r8, ip, sp}
    ced4:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    ced8:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    cedc:	495f314f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
    cee0:	415f4d54 	cmpmi	pc, r4, asr sp	@ <UNPREDICTABLE>
    cee4:	4c415654 	mcrrmi	6, 5, r5, r1, cr4
    cee8:	505f4449 	subspl	r4, pc, r9, asr #8
    ceec:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    cef0:	49005539 	stmdbmi	r0, {r0, r3, r4, r5, r8, sl, ip, lr}
    cef4:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    cef8:	495f3252 	ldmdbmi	pc, {r1, r4, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
    cefc:	46554254 			@ <UNDEFINED> instruction: 0x46554254
    cf00:	4d5f4e45 	ldclmi	14, cr4, [pc, #-276]	@ cdf4 <_Min_Stack_Size+0xc9f4>
    cf04:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    cf08:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    cf0c:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    cf10:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    cf14:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    cf18:	4254495f 	subsmi	r4, r4, #1556480	@ 0x17c000
    cf1c:	4e454655 	mcrmi	6, 2, r4, cr5, cr5, {2}
    cf20:	736f505f 	cmnvc	pc, #95	@ 0x5f
    cf24:	43530029 	cmpmi	r3, #41	@ 0x29
    cf28:	46445f42 	strbmi	r5, [r4], -r2, asr #30
    cf2c:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    cf30:	43544143 	cmpmi	r4, #-1073741808	@ 0xc0000010
    cf34:	734d5f48 	movtvc	r5, #57160	@ 0xdf48
    cf38:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    cf3c:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    cf40:	4353203c 	cmpmi	r3, #60	@ 0x3c
    cf44:	46445f42 	strbmi	r5, [r4], -r2, asr #30
    cf48:	565f5253 			@ <UNDEFINED> instruction: 0x565f5253
    cf4c:	43544143 	cmpmi	r4, #-1073741808	@ 0xc0000010
    cf50:	6f505f48 	svcvs	0x00505f48
    cf54:	53002973 	movwpl	r2, #2419	@ 0x973
    cf58:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    cf5c:	555f5243 	ldrbpl	r5, [pc, #-579]	@ cd21 <_Min_Stack_Size+0xc921>
    cf60:	494c414e 	stmdbmi	ip, {r1, r2, r3, r6, r8, lr}^
    cf64:	545f4e47 	ldrbpl	r4, [pc], #-3655	@ cf6c <_Min_Stack_Size+0xcb6c>
    cf68:	4d5f5052 	ldclmi	0, cr5, [pc, #-328]	@ ce28 <_Min_Stack_Size+0xca28>
    cf6c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    cf70:	204c5531 	subcs	r5, ip, r1, lsr r5
    cf74:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    cf78:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    cf7c:	555f5243 	ldrbpl	r5, [pc, #-579]	@ cd41 <_Min_Stack_Size+0xc941>
    cf80:	494c414e 	stmdbmi	ip, {r1, r2, r3, r6, r8, lr}^
    cf84:	545f4e47 	ldrbpl	r4, [pc], #-3655	@ cf8c <_Min_Stack_Size+0xcb8c>
    cf88:	505f5052 	subspl	r5, pc, r2, asr r0	@ <UNPREDICTABLE>
    cf8c:	0029736f 	eoreq	r7, r9, pc, ror #6
    cf90:	5f55504d 	svcpl	0x0055504d
    cf94:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    cf98:	5454415f 	ldrbpl	r4, [r4], #-351	@ 0xfffffea1
    cf9c:	4d5f5352 	ldclmi	3, cr5, [pc, #-328]	@ ce5c <_Min_Stack_Size+0xca5c>
    cfa0:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    cfa4:	46467830 			@ <UNDEFINED> instruction: 0x46467830
    cfa8:	4c554646 	mrrcmi	6, 4, r4, r5, cr6
    cfac:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    cfb0:	5f55504d 	svcpl	0x0055504d
    cfb4:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    cfb8:	5454415f 	ldrbpl	r4, [r4], #-351	@ 0xfffffea1
    cfbc:	505f5352 	subspl	r5, pc, r2, asr r3	@ <UNPREDICTABLE>
    cfc0:	0029736f 	eoreq	r7, r9, pc, ror #6
    cfc4:	5f495054 	svcpl	0x00495054
    cfc8:	52534646 	subspl	r4, r3, #73400320	@ 0x4600000
    cfcc:	496c465f 	stmdbmi	ip!, {r0, r1, r2, r3, r4, r6, r9, sl, lr}^
    cfd0:	6f72506e 	svcvs	0x0072506e
    cfd4:	734d5f67 	movtvc	r5, #57191	@ 0xdf67
    cfd8:	3028206b 	eorcc	r2, r8, fp, rrx
    cfdc:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    cfe0:	49002920 	stmdbmi	r0, {r5, r8, fp, sp}
    cfe4:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    cfe8:	445f3252 	ldrbmi	r3, [pc], #-594	@ cff0 <_Min_Stack_Size+0xcbf0>
    cfec:	464c4155 			@ <UNDEFINED> instruction: 0x464c4155
    cff0:	6b734d5f 	blvs	1ce0574 <_Min_Stack_Size+0x1ce0174>
    cff4:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    cff8:	204c5531 	subcs	r5, ip, r1, lsr r5
    cffc:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    d000:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    d004:	445f3252 	ldrbmi	r3, [pc], #-594	@ d00c <_Min_Stack_Size+0xcc0c>
    d008:	464c4155 			@ <UNDEFINED> instruction: 0x464c4155
    d00c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    d010:	43530029 	cmpmi	r3, #41	@ 0x29
    d014:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    d018:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    d01c:	45535542 	ldrbmi	r5, [r3, #-1346]	@ 0xfffffabe
    d020:	4d5f5252 	lfmmi	f5, 2, [pc, #-328]	@ cee0 <_Min_Stack_Size+0xcae0>
    d024:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    d028:	204c5531 	subcs	r5, ip, r1, lsr r5
    d02c:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    d030:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    d034:	5f525346 	svcpl	0x00525346
    d038:	53554249 	cmppl	r5, #-1879048188	@ 0x90000004
    d03c:	5f525245 	svcpl	0x00525245
    d040:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    d044:	42435300 	submi	r5, r3, #0, 6
    d048:	5243535f 	subpl	r5, r3, #2080374785	@ 0x7c000001
    d04c:	454c535f 	strbmi	r5, [ip, #-863]	@ 0xfffffca1
    d050:	45445045 	strbmi	r5, [r4, #-69]	@ 0xffffffbb
    d054:	505f5045 	subspl	r5, pc, r5, asr #32
    d058:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    d05c:	5f5f0055 	svcpl	0x005f0055
    d060:	52545353 	subspl	r5, r4, #1275068417	@ 0x4c000001
    d064:	30783020 	rsbscc	r3, r8, r0, lsr #32
    d068:	00303032 	eorseq	r3, r0, r2, lsr r0
    d06c:	66667542 	strbtvs	r7, [r6], -r2, asr #10
    d070:	735f7265 	cmpvc	pc, #1342177286	@ 0x50000006
    d074:	75746174 	ldrbvc	r6, [r4, #-372]!	@ 0xfffffe8c
    d078:	43520073 	cmpmi	r2, #115	@ 0x73
    d07c:	53555f43 	cmppl	r5, #268	@ 0x10c
    d080:	32545241 	subscc	r5, r4, #268435460	@ 0x10000004
    d084:	7365525f 	cmnvc	r5, #-268435451	@ 0xf0000005
    d088:	29287465 	stmdbcs	r8!, {r0, r2, r5, r6, sl, ip, sp, lr}
    d08c:	43522820 	cmpmi	r2, #32, 16	@ 0x200000
    d090:	413e2d43 	teqmi	lr, r3, asr #26
    d094:	52314250 	eorspl	r4, r1, #80, 4
    d098:	20525453 	subscs	r5, r2, r3, asr r4
    d09c:	28203d7c 	stmdacs	r0!, {r2, r3, r4, r5, r6, r8, sl, fp, ip, sp}
    d0a0:	3c3c2031 	ldccc	0, cr2, [ip], #-196	@ 0xffffff3c
    d0a4:	29373120 	ldmdbcs	r7!, {r5, r8, ip, sp}
    d0a8:	5f5f0029 	svcpl	0x005f0029
    d0ac:	72617567 	rsbvc	r7, r1, #432013312	@ 0x19c00000
    d0b0:	5f646564 	svcpl	0x00646564
    d0b4:	78287962 	stmdavc	r8!, {r1, r5, r6, r8, fp, ip, sp, lr}
    d0b8:	5f5f2029 	svcpl	0x005f2029
    d0bc:	6b636f6c 	blvs	18e8e74 <_Min_Stack_Size+0x18e8a74>
    d0c0:	6e6e615f 	mcrvs	1, 3, r6, cr14, cr15, {2}
    d0c4:	7461746f 	strbtvc	r7, [r1], #-1135	@ 0xfffffb91
    d0c8:	75672865 	strbvc	r2, [r7, #-2149]!	@ 0xfffff79b
    d0cc:	65647261 	strbvs	r7, [r4, #-609]!	@ 0xfffffd9f
    d0d0:	79625f64 	stmdbvc	r2!, {r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    d0d4:	29297828 	stmdbcs	r9!, {r3, r5, fp, ip, sp, lr}
    d0d8:	42435300 	submi	r5, r3, #0, 6
    d0dc:	5346445f 	movtpl	r4, #25695	@ 0x645f
    d0e0:	41485f52 	cmpmi	r8, r2, asr pc
    d0e4:	4445544c 	strbmi	r5, [r5], #-1100	@ 0xfffffbb4
    d0e8:	6b734d5f 	blvs	1ce066c <_Min_Stack_Size+0x1ce026c>
    d0ec:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    d0f0:	0029204c 	eoreq	r2, r9, ip, asr #32
    d0f4:	5f433249 	svcpl	0x00433249
    d0f8:	5f315243 	svcpl	0x00315243
    d0fc:	52414e45 	subpl	r4, r1, #1104	@ 0x450
    d100:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    d104:	3028206b 	eorcc	r2, r8, fp, rrx
    d108:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    d10c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    d110:	5f433249 	svcpl	0x00433249
    d114:	5f315243 	svcpl	0x00315243
    d118:	52414e45 	subpl	r4, r1, #1104	@ 0x450
    d11c:	6f505f50 	svcvs	0x00505f50
    d120:	50002973 	andpl	r2, r0, r3, ror r9
    d124:	49445254 	stmdbmi	r4, {r2, r4, r6, r9, ip, lr}^
    d128:	4d5f4646 	ldclmi	6, cr4, [pc, #-280]	@ d018 <_Min_Stack_Size+0xcc18>
    d12c:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    d130:	54505f5f 	ldrbpl	r5, [r0], #-3935	@ 0xfffff0a1
    d134:	46494452 			@ <UNDEFINED> instruction: 0x46494452
    d138:	414d5f46 	cmpmi	sp, r6, asr #30
    d13c:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    d140:	43324900 	teqmi	r2, #0, 18
    d144:	3152535f 	cmpcc	r2, pc, asr r3
    d148:	5245425f 	subpl	r4, r5, #-268435451	@ 0xf0000005
    d14c:	32492052 	subcc	r2, r9, #82	@ 0x52
    d150:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    d154:	45425f31 	strbmi	r5, [r2, #-3889]	@ 0xfffff0cf
    d158:	4d5f5252 	lfmmi	f5, 2, [pc, #-328]	@ d018 <_Min_Stack_Size+0xcc18>
    d15c:	57006b73 	smlsdxpl	r0, r3, fp, r6
    d160:	69746961 	ldmdbvs	r4!, {r0, r5, r6, r8, fp, sp, lr}^
    d164:	5f00676e 	svcpl	0x0000676e
    d168:	726e755f 	rsbvc	r7, lr, #398458880	@ 0x17c00000
    d16c:	68636165 	stmdavs	r3!, {r0, r2, r5, r6, r8, sp, lr}^
    d170:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    d174:	5f202928 	svcpl	0x00202928
    d178:	6975625f 	ldmdbvs	r5!, {r0, r1, r2, r3, r4, r6, r9, sp, lr}^
    d17c:	6e69746c 	cdpvs	4, 6, cr7, cr9, cr12, {3}
    d180:	726e755f 	rsbvc	r7, lr, #398458880	@ 0x17c00000
    d184:	68636165 	stmdavs	r3!, {r0, r2, r5, r6, r8, sp, lr}^
    d188:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    d18c:	49002928 	stmdbmi	r0, {r3, r5, r8, fp, sp}
    d190:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    d194:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    d198:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ d0d4 <_Min_Stack_Size+0xccd4>
    d19c:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    d1a0:	495f5f2d 	ldmdbmi	pc, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    d1a4:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    d1a8:	54534145 	ldrbpl	r4, [r3], #-325	@ 0xfffffebb
    d1ac:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ d0e8 <_Min_Stack_Size+0xcce8>
    d1b0:	5f5f5841 	svcpl	0x005f5841
    d1b4:	31202d20 			@ <UNDEFINED> instruction: 0x31202d20
    d1b8:	43520029 	cmpmi	r2, #41	@ 0x29
    d1bc:	28282043 	stmdacs	r8!, {r0, r1, r6, sp}
    d1c0:	5f434352 	svcpl	0x00434352
    d1c4:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
    d1c8:	20666544 	rsbcs	r6, r6, r4, asr #10
    d1cc:	4352292a 	cmpmi	r2, #688128	@ 0xa8000
    d1d0:	41425f43 	cmpmi	r2, r3, asr #30
    d1d4:	00294553 	eoreq	r4, r9, r3, asr r5
    d1d8:	5f424353 	svcpl	0x00424353
    d1dc:	5f524353 	svcpl	0x00524353
    d1e0:	4f564553 	svcmi	0x00564553
    d1e4:	4e45504e 	cdpmi	0, 4, cr5, cr5, cr14, {2}
    d1e8:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    d1ec:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    d1f0:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    d1f4:	4353203c 	cmpmi	r3, #60	@ 0x3c
    d1f8:	43535f42 	cmpmi	r3, #264	@ 0x108
    d1fc:	45535f52 	ldrbmi	r5, [r3, #-3922]	@ 0xfffff0ae
    d200:	504e4f56 	subpl	r4, lr, r6, asr pc
    d204:	5f444e45 	svcpl	0x00444e45
    d208:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    d20c:	43324900 	teqmi	r2, #0, 18
    d210:	3152435f 	cmpcc	r2, pc, asr r3
    d214:	5f45505f 	svcpl	0x0045505f
