NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    d218:	20736f50 	rsbscs	r6, r3, r0, asr pc
    d21c:	29553028 	ldmdbcs	r5, {r3, r5, ip, sp}^
    d220:	6c5f5f00 	mrrcvs	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    d224:	5f6b636f 	svcpl	0x006b636f
    d228:	656c6572 	strbvs	r6, [ip, #-1394]!	@ 0xfffffa8e
    d22c:	5f657361 	svcpl	0x00657361
    d230:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    d234:	76697372 			@ <UNDEFINED> instruction: 0x76697372
    d238:	6f6c2865 	svcvs	0x006c2865
    d23c:	20296b63 	eorcs	r6, r9, r3, ror #22
    d240:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
    d244:	67726174 			@ <UNDEFINED> instruction: 0x67726174
    d248:	6c5f7465 	cfldrdvs	mvd7, [pc], {101}	@ 0x65
    d24c:	5f6b636f 	svcpl	0x006b636f
    d250:	656c6572 	strbvs	r6, [ip, #-1394]!	@ 0xfffffa8e
    d254:	5f657361 	svcpl	0x00657361
    d258:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    d25c:	76697372 			@ <UNDEFINED> instruction: 0x76697372
    d260:	6f6c2865 	svcvs	0x006c2865
    d264:	00296b63 	eoreq	r6, r9, r3, ror #22
    d268:	5f424353 	svcpl	0x00424353
    d26c:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    d270:	414e555f 	cmpmi	lr, pc, asr r5
    d274:	4e47494c 	vmlsmi.f16	s9, s14, s24	@ <UNPREDICTABLE>
    d278:	505f4445 	subspl	r4, pc, r5, asr #8
    d27c:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    d280:	5f424353 	svcpl	0x00424353
    d284:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    d288:	4753555f 			@ <UNDEFINED> instruction: 0x4753555f
    d28c:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    d290:	5f525354 	svcpl	0x00525354
    d294:	20736f50 	rsbscs	r6, r3, r0, asr pc
    d298:	5538202b 	ldrpl	r2, [r8, #-43]!	@ 0xffffffd5
    d29c:	50490029 	subpl	r0, r9, r9, lsr #32
    d2a0:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    d2a4:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ d160 <_Min_Stack_Size+0xcd60>
    d2a8:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    d2ac:	46317830 			@ <UNDEFINED> instruction: 0x46317830
    d2b0:	204c5546 	subcs	r5, ip, r6, asr #10
    d2b4:	5f5f0029 	svcpl	0x005f0029
    d2b8:	6b616577 	blvs	186689c <_Min_Stack_Size+0x186649c>
    d2bc:	6665725f 			@ <UNDEFINED> instruction: 0x6665725f
    d2c0:	6e657265 	cdpvs	2, 6, cr7, cr5, cr5, {3}
    d2c4:	73286563 			@ <UNDEFINED> instruction: 0x73286563
    d2c8:	612c6d79 			@ <UNDEFINED> instruction: 0x612c6d79
    d2cc:	7361696c 	cmnvc	r1, #108, 18	@ 0x1b0000
    d2d0:	5f5f2029 	svcpl	0x005f2029
    d2d4:	5f6d7361 	svcpl	0x006d7361
    d2d8:	2e22285f 	mcrcs	8, 1, r2, cr2, cr15, {2}
    d2dc:	6b616577 	blvs	18668c0 <_Min_Stack_Size+0x18664c0>
    d2e0:	23202220 			@ <UNDEFINED> instruction: 0x23202220
    d2e4:	61696c61 	cmnvs	r9, r1, ror #24
    d2e8:	203b2973 	eorscs	r2, fp, r3, ror r9
    d2ec:	73615f5f 	cmnvc	r1, #380	@ 0x17c
    d2f0:	285f5f6d 	ldmdacs	pc, {r0, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    d2f4:	71652e22 	cmnvc	r5, r2, lsr #28
    d2f8:	20222075 	eorcs	r2, r2, r5, ror r0
    d2fc:	696c6123 	stmdbvs	ip!, {r0, r1, r5, r8, sp, lr}^
    d300:	22207361 	eorcs	r7, r0, #-2080374783	@ 0x84000001
    d304:	2022202c 	eorcs	r2, r2, ip, lsr #32
    d308:	6d797323 	ldclvs	3, cr7, [r9, #-140]!	@ 0xffffff74
    d30c:	5f5f0029 	svcpl	0x005f0029
    d310:	31544e49 	cmpcc	r4, r9, asr #28
    d314:	68222036 	stmdavs	r2!, {r1, r2, r4, r5, sp}
    d318:	6f430022 	svcvs	0x00430022
    d31c:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    d320:	5f677562 	svcpl	0x00677562
    d324:	434d4544 	movtmi	r4, #54596	@ 0xd544
    d328:	52545f52 	subspl	r5, r4, #328	@ 0x148
    d32c:	414e4543 	cmpmi	lr, r3, asr #10
    d330:	6b734d5f 	blvs	1ce08b4 <_Min_Stack_Size+0x1ce04b4>
    d334:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    d338:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    d33c:	726f4320 	rsbvc	r4, pc, #32, 6	@ 0x80000000
    d340:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    d344:	445f6775 	ldrbmi	r6, [pc], #-1909	@ d34c <_Min_Stack_Size+0xcf4c>
    d348:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    d34c:	4352545f 	cmpmi	r2, #1593835520	@ 0x5f000000
    d350:	5f414e45 	svcpl	0x00414e45
    d354:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    d358:	43324900 	teqmi	r2, #0, 18
    d35c:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    d360:	424d535f 	submi	r5, sp, #2080374785	@ 0x7c000001
    d364:	41464544 	cmpmi	r6, r4, asr #10
    d368:	5f544c55 	svcpl	0x00544c55
    d36c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    d370:	29553528 	ldmdbcs	r5, {r3, r5, r8, sl, ip, sp}^
    d374:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    d378:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
    d37c:	6e655074 	mcrvs	0, 3, r5, cr5, cr4, {3}
    d380:	676e6964 	strbvs	r6, [lr, -r4, ror #18]!
    d384:	20515249 	subscs	r5, r1, r9, asr #4
    d388:	564e5f5f 			@ <UNDEFINED> instruction: 0x564e5f5f
    d38c:	475f4349 	ldrbmi	r4, [pc, -r9, asr #6]
    d390:	65507465 	ldrbvs	r7, [r0, #-1125]	@ 0xfffffb9b
    d394:	6e69646e 	cdpvs	4, 6, cr6, cr9, cr14, {3}
    d398:	51524967 	cmppl	r2, r7, ror #18
    d39c:	726f4300 	rsbvc	r4, pc, #0, 6
    d3a0:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    d3a4:	425f6775 	subsmi	r6, pc, #30670848	@ 0x1d40000
    d3a8:	20455341 	subcs	r5, r5, r1, asr #6
    d3ac:	45783028 	ldrbmi	r3, [r8, #-40]!	@ 0xffffffd8
    d3b0:	45303030 	ldrmi	r3, [r0, #-48]!	@ 0xffffffd0
    d3b4:	55304644 	ldrpl	r4, [r0, #-1604]!	@ 0xfffff9bc
    d3b8:	4900294c 	stmdbmi	r0, {r2, r3, r6, r8, fp, sp}
    d3bc:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ d3c4 <_Min_Stack_Size+0xcfc4>
    d3c0:	535f5243 	cmppl	pc, #805306372	@ 0x30000004
    d3c4:	45434e59 	strbmi	r4, [r3, #-3673]	@ 0xfffff1a7
    d3c8:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ d298 <_Min_Stack_Size+0xce98>
    d3cc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    d3d0:	204c5531 	subcs	r5, ip, r1, lsr r5
    d3d4:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    d3d8:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ d3e0 <_Min_Stack_Size+0xcfe0>
    d3dc:	535f5243 	cmppl	pc, #805306372	@ 0x30000004
    d3e0:	45434e59 	strbmi	r4, [r3, #-3673]	@ 0xfffff1a7
    d3e4:	505f414e 	subspl	r4, pc, lr, asr #2
    d3e8:	0029736f 	eoreq	r7, r9, pc, ror #6
    d3ec:	5f495054 	svcpl	0x00495054
    d3f0:	49564544 	ldmdbmi	r6, {r2, r6, r8, sl, lr}^
    d3f4:	54505f44 	ldrbpl	r5, [r0], #-3908	@ 0xfffff0bc
    d3f8:	41564e49 	cmpmi	r6, r9, asr #28
    d3fc:	5f44494c 	svcpl	0x0044494c
    d400:	20736f50 	rsbscs	r6, r3, r0, asr pc
    d404:	49005539 	stmdbmi	r0, {r0, r3, r4, r5, r8, sl, ip, lr}
    d408:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    d40c:	535f3152 	cmppl	pc, #-2147483628	@ 0x80000014
    d410:	5355424d 	cmppl	r5, #-805306364	@ 0xd0000004
    d414:	736f505f 	cmnvc	pc, #95	@ 0x5f
    d418:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    d41c:	5f5f0029 	svcpl	0x005f0029
    d420:	52545358 	subspl	r5, r4, #88, 6	@ 0x60000001
    d424:	28474e49 	stmdacs	r7, {r0, r3, r6, r9, sl, fp, lr}^
    d428:	5f202978 	svcpl	0x00202978
    d42c:	5254535f 	subspl	r5, r4, #2080374785	@ 0x7c000001
    d430:	28474e49 	stmdacs	r7, {r0, r3, r6, r9, sl, fp, lr}^
    d434:	53002978 	movwpl	r2, #2424	@ 0x978
    d438:	43536e43 	cmpmi	r3, #1072	@ 0x430
    d43c:	43415f42 	movtmi	r5, #8002	@ 0x1f42
    d440:	5f524c54 	svcpl	0x00524c54
    d444:	4d534944 	vldrmi.16	s9, [r3, #-136]	@ 0xffffff78	@ <UNPREDICTABLE>
    d448:	49435943 	stmdbmi	r3, {r0, r1, r6, r8, fp, ip, lr}^
    d44c:	505f544e 	subspl	r5, pc, lr, asr #8
    d450:	3020736f 	eorcc	r7, r0, pc, ror #6
    d454:	5f5f0055 	svcpl	0x005f0055
    d458:	53434353 	movtpl	r4, #13139	@ 0x3353
    d45c:	73284449 			@ <UNDEFINED> instruction: 0x73284449
    d460:	74732029 	ldrbtvc	r2, [r3], #-41	@ 0xffffffd7
    d464:	74637572 	strbtvc	r7, [r3], #-1394	@ 0xfffffa8e
    d468:	685f5f20 	ldmdavs	pc, {r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    d46c:	006b6361 	rsbeq	r6, fp, r1, ror #6
    d470:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    d474:	435f544e 	cmpmi	pc, #1308622848	@ 0x4e000000
    d478:	4b434548 	blmi	10de9a0 <_Min_Stack_Size+0x10de5a0>
    d47c:	4353415f 	cmpmi	r3, #-1073741801	@ 0xc0000017
    d480:	454d4954 	strbmi	r4, [sp, #-2388]	@ 0xfffff6ac
    d484:	4655425f 			@ <UNDEFINED> instruction: 0x4655425f
    d488:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
    d48c:	525f2029 	subspl	r2, pc, #41	@ 0x29
    d490:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    d494:	4548435f 	strbmi	r4, [r8, #-863]	@ 0xfffffca1
    d498:	76284b43 	strtvc	r4, [r8], -r3, asr #22
    d49c:	202c7261 	eorcs	r7, ip, r1, ror #4
    d4a0:	6373615f 	cmnvs	r3, #-1073741801	@ 0xc0000017
    d4a4:	656d6974 	strbvs	r6, [sp, #-2420]!	@ 0xfffff68c
    d4a8:	6675625f 			@ <UNDEFINED> instruction: 0x6675625f
    d4ac:	6863202c 	stmdavs	r3!, {r2, r3, r5, sp}^
    d4b0:	2a207261 	bcs	829e3c <_Min_Stack_Size+0x829a3c>
    d4b4:	525f202c 	subspl	r2, pc, #44	@ 0x2c
    d4b8:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    d4bc:	4353415f 	cmpmi	r3, #-1073741801	@ 0xc0000017
    d4c0:	454d4954 	strbmi	r4, [sp, #-2388]	@ 0xfffff6ac
    d4c4:	5a49535f 	bpl	1262248 <_Min_Stack_Size+0x1261e48>
    d4c8:	6d202c45 	stcvs	12, cr2, [r0, #-276]!	@ 0xfffffeec
    d4cc:	65736d65 	ldrbvs	r6, [r3, #-3429]!	@ 0xfffff29b
    d4d0:	76282874 			@ <UNDEFINED> instruction: 0x76282874
    d4d4:	2d297261 	sfmcs	f7, 4, [r9, #-388]!	@ 0xfffffe7c
    d4d8:	73615f3e 	cmnvc	r1, #62, 30	@ 0xf8
    d4dc:	6d697463 	cfstrdvs	mvd7, [r9, #-396]!	@ 0xfffffe74
    d4e0:	75625f65 	strbvc	r5, [r2, #-3941]!	@ 0xfffff09b
    d4e4:	30202c66 	eorcc	r2, r0, r6, ror #24
    d4e8:	525f202c 	subspl	r2, pc, #44	@ 0x2c
    d4ec:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    d4f0:	4353415f 	cmpmi	r3, #-1073741801	@ 0xc0000017
    d4f4:	454d4954 	strbmi	r4, [sp, #-2388]	@ 0xfffff6ac
    d4f8:	5a49535f 	bpl	126227c <_Min_Stack_Size+0x1261e7c>
    d4fc:	00292945 	eoreq	r2, r9, r5, asr #18
    d500:	5f433249 	svcpl	0x00433249
    d504:	5f325253 	svcpl	0x00325253
    d508:	4c415544 	cfstr64mi	mvdx5, [r1], {68}	@ 0x44
    d50c:	6f505f46 	svcvs	0x00505f46
    d510:	37282073 			@ <UNDEFINED> instruction: 0x37282073
    d514:	49002955 	stmdbmi	r0, {r0, r2, r4, r6, r8, fp, sp}
    d518:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    d51c:	525f3152 	subspl	r3, pc, #-2147483628	@ 0x80000014
    d520:	20454e58 	subcs	r4, r5, r8, asr lr
    d524:	5f433249 	svcpl	0x00433249
    d528:	5f315253 	svcpl	0x00315253
    d52c:	454e5852 	strbmi	r5, [lr, #-2130]	@ 0xfffff7ae
    d530:	6b734d5f 	blvs	1ce0ab4 <_Min_Stack_Size+0x1ce06b4>
    d534:	42435300 	submi	r5, r3, #0, 6
    d538:	4348535f 	movtmi	r5, #33631	@ 0x835f
    d53c:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    d540:	41465355 	cmpmi	r6, r5, asr r3
    d544:	45544c55 	ldrbmi	r4, [r4, #-3157]	@ 0xfffff3ab
    d548:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ d418 <_Min_Stack_Size+0xd018>
    d54c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    d550:	204c5531 	subcs	r5, ip, r1, lsr r5
    d554:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    d558:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    d55c:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    d560:	5355425f 	cmppl	r5, #-268435451	@ 0xf0000005
    d564:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    d568:	414e4554 	cmpmi	lr, r4, asr r5
    d56c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    d570:	54490029 	strbpl	r0, [r9], #-41	@ 0xffffffd7
    d574:	534c5f4d 	movtpl	r5, #53069	@ 0xcf4d
    d578:	59425f52 	stmdbpl	r2, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    d57c:	43414554 	movtmi	r4, #5460	@ 0x1554
    d580:	6f505f43 	svcvs	0x00505f43
    d584:	55322073 	ldrpl	r2, [r2, #-115]!	@ 0xffffff8d
    d588:	4e495f00 	cdpmi	15, 4, cr5, cr9, cr0, {0}
    d58c:	5f363154 	svcpl	0x00363154
    d590:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    d594:	52414c43 	subpl	r4, r1, #17152	@ 0x4300
    d598:	00204445 	eoreq	r4, r0, r5, asr #8
    d59c:	5f4d5241 	svcpl	0x004d5241
    d5a0:	5f55504d 	svcpl	0x0055504d
    d5a4:	49474552 	stmdbmi	r7, {r1, r4, r6, r8, sl, lr}^
    d5a8:	535f4e4f 	cmppl	pc, #1264	@ 0x4f0
    d5ac:	5f455a49 	svcpl	0x00455a49
    d5b0:	20424732 	subcs	r4, r2, r2, lsr r7
    d5b4:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    d5b8:	5f38746e 	svcpl	0x0038746e
    d5bc:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    d5c0:	29554531 	ldmdbcs	r5, {r0, r4, r5, r8, sl, lr}^
    d5c4:	42435300 	submi	r5, r3, #0, 6
    d5c8:	5346445f 	movtpl	r4, #25695	@ 0x645f
    d5cc:	41485f52 	cmpmi	r8, r2, asr pc
    d5d0:	4445544c 	strbmi	r5, [r5], #-1100	@ 0xfffffbb4
    d5d4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    d5d8:	00553020 	subseq	r3, r5, r0, lsr #32
    d5dc:	54415f5f 	strbpl	r5, [r1], #-3935	@ 0xfffff0a1
    d5e0:	42495254 	submi	r5, r9, #84, 4	@ 0x40000005
    d5e4:	5f455455 	svcpl	0x00455455
    d5e8:	55504d49 	ldrbpl	r4, [r0, #-3401]	@ 0xfffff2b7
    d5ec:	505f4552 	subspl	r4, pc, r2, asr r5	@ <UNPREDICTABLE>
    d5f0:	5f5f5254 	svcpl	0x005f5254
    d5f4:	555f0020 	ldrbpl	r0, [pc, #-32]	@ d5dc <_Min_Stack_Size+0xd1dc>
    d5f8:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    d5fc:	545f5841 	ldrbpl	r5, [pc], #-2113	@ d604 <_Min_Stack_Size+0xd204>
    d600:	4345445f 	movtmi	r4, #21599	@ 0x545f
    d604:	4552414c 	ldrbmi	r4, [r2, #-332]	@ 0xfffffeb4
    d608:	53002044 	movwpl	r2, #68	@ 0x44
    d60c:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    d610:	5f525346 	svcpl	0x00525346
    d614:	42564944 	subsmi	r4, r6, #68, 18	@ 0x110000
    d618:	52455a59 	subpl	r5, r5, #364544	@ 0x59000
    d61c:	6f505f4f 	svcvs	0x00505f4f
    d620:	53282073 			@ <UNDEFINED> instruction: 0x53282073
    d624:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    d628:	5f525346 	svcpl	0x00525346
    d62c:	46475355 			@ <UNDEFINED> instruction: 0x46475355
    d630:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    d634:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    d638:	2b20736f 	blcs	82a3fc <_Min_Stack_Size+0x829ffc>
    d63c:	29553920 	ldmdbcs	r5, {r5, r8, fp, ip, sp}^
    d640:	6e6f6c00 	cdpvs	12, 6, cr6, cr15, cr0, {0}
    d644:	342b2067 	strtcc	r2, [fp], #-103	@ 0xffffff99
    d648:	69617400 	stmdbvs	r1!, {sl, ip, sp, lr}^
    d64c:	5744006c 	strbpl	r0, [r4, -ip, rrx]
    d650:	4f465f54 	svcmi	0x00465f54
    d654:	4e43444c 	cdpmi	4, 4, cr4, cr3, cr12, {2}
    d658:	4f465f54 	svcmi	0x00465f54
    d65c:	4e43444c 	cdpmi	4, 4, cr4, cr3, cr12, {2}
    d660:	6f505f54 	svcvs	0x00505f54
    d664:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    d668:	726f4300 	rsbvc	r4, pc, #0, 6
    d66c:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    d670:	445f6775 	ldrbmi	r6, [pc], #-1909	@ d678 <_Min_Stack_Size+0xd278>
    d674:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    d678:	535f435f 	cmppl	pc, #2080374785	@ 0x7c000001
    d67c:	5f504554 	svcpl	0x00504554
    d680:	206b734d 	rsbcs	r7, fp, sp, asr #6
    d684:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    d688:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    d68c:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    d690:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    d694:	48445f67 	stmdami	r4, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
    d698:	5f525343 	svcpl	0x00525343
    d69c:	54535f43 	ldrbpl	r5, [r3], #-3907	@ 0xfffff0bd
    d6a0:	505f5045 	subspl	r5, pc, r5, asr #32
    d6a4:	0029736f 	eoreq	r7, r9, pc, ror #6
    d6a8:	4f495047 	svcmi	0x00495047
    d6ac:	28282043 	stmdacs	r8!, {r0, r1, r6, sp}
    d6b0:	4f495047 	svcmi	0x00495047
    d6b4:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    d6b8:	66654465 	strbtvs	r4, [r5], -r5, ror #8
    d6bc:	47292a20 	strmi	r2, [r9, -r0, lsr #20]!
    d6c0:	434f4950 	movtmi	r4, #63824	@ 0xf950
    d6c4:	5341425f 	movtpl	r4, #4703	@ 0x125f
    d6c8:	53002945 	movwpl	r2, #2373	@ 0x945
    d6cc:	5f455a49 	svcpl	0x00455a49
    d6d0:	2058414d 	subscs	r4, r8, sp, asr #2
    d6d4:	535f5f28 	cmppl	pc, #40, 30	@ 0xa0
    d6d8:	5f455a49 	svcpl	0x00455a49
    d6dc:	5f58414d 	svcpl	0x0058414d
    d6e0:	4d00295f 	vstrmi.16	s4, [r0, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    d6e4:	435f5550 	cmpmi	pc, #80, 10	@ 0x14000000
    d6e8:	5f4c5254 	svcpl	0x004c5254
    d6ec:	4d4e4648 	stclmi	6, cr4, [lr, #-288]	@ 0xfffffee0
    d6f0:	414e4549 	cmpmi	lr, r9, asr #10
    d6f4:	6b734d5f 	blvs	1ce0c78 <_Min_Stack_Size+0x1ce0878>
    d6f8:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    d6fc:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    d700:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    d704:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    d708:	46485f4c 	strbmi	r5, [r8], -ip, asr #30
    d70c:	45494d4e 	strbmi	r4, [r9, #-3406]	@ 0xfffff2b2
    d710:	505f414e 	subspl	r4, pc, lr, asr #2
    d714:	0029736f 	eoreq	r7, r9, pc, ror #6
    d718:	5f433249 	svcpl	0x00433249
    d71c:	5f325253 	svcpl	0x00325253
    d720:	20415254 	subcs	r5, r1, r4, asr r2
    d724:	5f433249 	svcpl	0x00433249
    d728:	5f325253 	svcpl	0x00325253
    d72c:	5f415254 	svcpl	0x00415254
    d730:	006b734d 	rsbeq	r7, fp, sp, asr #6
    d734:	4349564e 	movtmi	r5, #38478	@ 0x964e
    d738:	5152495f 	cmppl	r2, pc, asr r9
    d73c:	455f3034 	ldrbmi	r3, [pc, #-52]	@ d710 <_Min_Stack_Size+0xd310>
    d740:	31495458 	cmpcc	r9, r8, asr r4
    d744:	35315f30 	ldrcc	r5, [r1, #-3888]!	@ 0xfffff0d0
    d748:	616e455f 	cmnvs	lr, pc, asr r5
    d74c:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    d750:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    d754:	5f434956 	svcpl	0x00434956
    d758:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    d75c:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	@ 0xffffff3c
    d760:	20312820 	eorscs	r2, r1, r0, lsr #16
    d764:	38203c3c 	stmdacc	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    d768:	53002929 	movwpl	r2, #2345	@ 0x929
    d76c:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    d770:	555f5243 	ldrbpl	r5, [pc, #-579]	@ d535 <_Min_Stack_Size+0xd135>
    d774:	494c414e 	stmdbmi	ip, {r1, r2, r3, r6, r8, lr}^
    d778:	545f4e47 	ldrbpl	r4, [pc], #-3655	@ d780 <_Min_Stack_Size+0xd380>
    d77c:	505f5052 	subspl	r5, pc, r2, asr r0	@ <UNPREDICTABLE>
    d780:	3320736f 			@ <UNDEFINED> instruction: 0x3320736f
    d784:	525f0055 	subspl	r0, pc, #85	@ 0x55
    d788:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    d78c:	494e495f 	stmdbmi	lr, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
    d790:	45525f54 	ldrbmi	r5, [r2, #-3924]	@ 0xfffff0ac
    d794:	56524553 			@ <UNDEFINED> instruction: 0x56524553
    d798:	365f4445 	ldrbcc	r4, [pc], -r5, asr #8
    d79c:	0020375f 	eoreq	r3, r0, pc, asr r7
    d7a0:	63735f5f 	cmnvs	r3, #380	@ 0x17c
    d7a4:	6c666e61 	stclvs	14, cr6, [r6], #-388	@ 0xfffffe7c
    d7a8:	28656b69 	stmdacs	r5!, {r0, r3, r5, r6, r8, r9, fp, sp, lr}^
    d7ac:	61746d66 	cmnvs	r4, r6, ror #26
    d7b0:	662c6772 			@ <UNDEFINED> instruction: 0x662c6772
    d7b4:	74737269 	ldrbtvc	r7, [r3], #-617	@ 0xfffffd97
    d7b8:	61726176 	cmnvs	r2, r6, ror r1
    d7bc:	20296772 	eorcs	r6, r9, r2, ror r7
    d7c0:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    d7c4:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    d7c8:	5f657475 	svcpl	0x00657475
    d7cc:	5f28285f 	svcpl	0x0028285f
    d7d0:	726f665f 	rsbvc	r6, pc, #99614720	@ 0x5f00000
    d7d4:	5f74616d 	svcpl	0x0074616d
    d7d8:	5f28205f 	svcpl	0x0028205f
    d7dc:	6163735f 	cmnvs	r3, pc, asr r3
    d7e0:	5f5f666e 	svcpl	0x005f666e
    d7e4:	6d66202c 	stclvs	0, cr2, [r6, #-176]!	@ 0xffffff50
    d7e8:	67726174 			@ <UNDEFINED> instruction: 0x67726174
    d7ec:	6966202c 	stmdbvs	r6!, {r2, r3, r5, sp}^
    d7f0:	76747372 			@ <UNDEFINED> instruction: 0x76747372
    d7f4:	72617261 	rsbvc	r7, r1, #268435462	@ 0x10000006
    d7f8:	29292967 	stmdbcs	r9!, {r0, r1, r2, r5, r6, r8, fp, sp}
    d7fc:	4e495500 	cdpmi	5, 4, cr5, cr9, cr0, {0}
    d800:	5f323354 	svcpl	0x00323354
    d804:	29782843 	ldmdbcs	r8!, {r0, r1, r6, fp, sp}^
    d808:	555f5f20 	ldrbpl	r5, [pc, #-3872]	@ c8f0 <_Min_Stack_Size+0xc4f0>
    d80c:	33544e49 	cmpcc	r4, #1168	@ 0x490
    d810:	28435f32 	stmdacs	r3, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
    d814:	46002978 			@ <UNDEFINED> instruction: 0x46002978
    d818:	5f4f4649 	svcpl	0x004f4649
    d81c:	455f4f4e 	ldrbmi	r4, [pc, #-3918]	@ c8d6 <_Min_Stack_Size+0xc4d6>
    d820:	524f5252 	subpl	r5, pc, #536870917	@ 0x20000005
    d824:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    d828:	5f544e45 	svcpl	0x00544e45
    d82c:	4e5f5349 	cdpmi	3, 5, cr5, cr15, cr9, {2}
    d830:	284c4c55 	stmdacs	ip, {r0, r2, r4, r6, sl, fp, lr}^
    d834:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    d838:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    d83c:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
    d840:	3d3d2029 	ldccc	0, cr2, [sp, #-164]!	@ 0xffffff5c
    d844:	4c554e20 	mrrcmi	14, 2, r4, r5, cr0
    d848:	5300294c 	movwpl	r2, #2380	@ 0x94c
    d84c:	5f324950 	svcpl	0x00324950
    d850:	20515249 	subscs	r5, r1, r9, asr #4
    d854:	4d003633 	stcmi	6, cr3, [r0, #-204]	@ 0xffffff34
    d858:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    d85c:	5f525341 	svcpl	0x00525341
    d860:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    d864:	6b734d5f 	blvs	1ce0de8 <_Min_Stack_Size+0x1ce09e8>
    d868:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    d86c:	4c554631 	mrrcmi	6, 3, r4, r5, cr1
    d870:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    d874:	5f55504d 	svcpl	0x0055504d
    d878:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    d87c:	5a49535f 	bpl	1262600 <_Min_Stack_Size+0x1262200>
    d880:	6f505f45 	svcvs	0x00505f45
    d884:	5f002973 	svcpl	0x00002973
    d888:	6e695f5f 	mcrvs	15, 3, r5, cr9, cr15, {2}
    d88c:	74705f74 	ldrbtvc	r5, [r0], #-3956	@ 0xfffff08c
    d890:	66696472 			@ <UNDEFINED> instruction: 0x66696472
    d894:	5f745f66 	svcpl	0x00745f66
    d898:	5f002068 	svcpl	0x00002068
    d89c:	434f4c5f 	movtmi	r4, #64607	@ 0xfc5f
    d8a0:	4e495f4b 	cdpmi	15, 4, cr5, cr9, cr11, {2}
    d8a4:	525f5449 	subspl	r5, pc, #1224736768	@ 0x49000000
    d8a8:	52554345 	subspl	r4, r5, #335544321	@ 0x14000001
    d8ac:	45564953 	ldrbmi	r4, [r6, #-2387]	@ 0xfffff6ad
    d8b0:	616c6328 	cmnvs	ip, r8, lsr #6
    d8b4:	6c2c7373 	stcvs	3, cr7, [ip], #-460	@ 0xfffffe34
    d8b8:	296b636f 	stmdbcs	fp!, {r0, r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    d8bc:	4c5f5f20 	mrrcmi	15, 2, r5, pc, cr0	@ <UNPREDICTABLE>
    d8c0:	5f4b434f 	svcpl	0x004b434f
    d8c4:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    d8c8:	616c6328 	cmnvs	ip, r8, lsr #6
    d8cc:	6c2c7373 	stcvs	3, cr7, [ip], #-460	@ 0xfffffe34
    d8d0:	296b636f 	stmdbcs	fp!, {r0, r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    d8d4:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
    d8d8:	495f3049 	ldmdbmi	pc, {r0, r3, r6, ip, sp}^	@ <UNPREDICTABLE>
    d8dc:	36205152 			@ <UNDEFINED> instruction: 0x36205152
    d8e0:	4d544900 	vldrmi.16	s9, [r4, #-0]	@ <UNPREDICTABLE>
    d8e4:	52534c5f 	subspl	r4, r3, #24320	@ 0x5f00
    d8e8:	4552505f 	ldrbmi	r5, [r2, #-95]	@ 0xffffffa1
    d8ec:	544e4553 	strbpl	r4, [lr], #-1363	@ 0xfffffaad
    d8f0:	6b734d5f 	blvs	1ce0e74 <_Min_Stack_Size+0x1ce0a74>
    d8f4:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    d8f8:	0029204c 	eoreq	r2, r9, ip, asr #32
    d8fc:	4453425f 	ldrbmi	r4, [r3], #-607	@ 0xfffffda1
    d900:	4843575f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
    d904:	545f5241 	ldrbpl	r5, [pc], #-577	@ d90c <_Min_Stack_Size+0xd50c>
    d908:	5f00205f 	svcpl	0x0000205f
    d90c:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    d910:	6c635f6b 	stclvs	15, cr5, [r3], #-428	@ 0xfffffe54
    d914:	5f65736f 	svcpl	0x0065736f
    d918:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
    d91c:	76697372 			@ <UNDEFINED> instruction: 0x76697372
    d920:	6f6c2865 	svcvs	0x006c2865
    d924:	20296b63 	eorcs	r6, r9, r3, ror #22
    d928:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
    d92c:	67726174 			@ <UNDEFINED> instruction: 0x67726174
    d930:	6c5f7465 	cfldrdvs	mvd7, [pc], {101}	@ 0x65
    d934:	5f6b636f 	svcpl	0x006b636f
    d938:	736f6c63 	cmnvc	pc, #25344	@ 0x6300
    d93c:	65725f65 	ldrbvs	r5, [r2, #-3941]!	@ 0xfffff09b
    d940:	73727563 	cmnvc	r2, #415236096	@ 0x18c00000
    d944:	28657669 	stmdacs	r5!, {r0, r3, r5, r6, r9, sl, ip, sp, lr}^
