NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    d948:	6b636f6c 	blvs	18e9700 <_Min_Stack_Size+0x18e9300>
    d94c:	52410029 	subpl	r0, r1, #41	@ 0x29
    d950:	504d5f4d 	subpl	r5, sp, sp, asr #30
    d954:	45525f55 	ldrbmi	r5, [r2, #-3925]	@ 0xfffff0ab
    d958:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    d95c:	5a49535f 	bpl	12626e0 <_Min_Stack_Size+0x12622e0>
    d960:	32335f45 	eorscc	r5, r3, #276	@ 0x114
    d964:	2820424d 	stmdacs	r0!, {r0, r2, r3, r6, r9, lr}
    d968:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    d96c:	745f3874 	ldrbvc	r3, [pc], #-2164	@ d974 <_Min_Stack_Size+0xd574>
    d970:	31783029 	cmncc	r8, r9, lsr #32
    d974:	00295538 	eoreq	r5, r9, r8, lsr r5
    d978:	4e41525f 	mcrmi	2, 2, r5, cr1, cr15, {2}
    d97c:	5f383444 	svcpl	0x00383444
    d980:	20444441 	subcs	r4, r4, r1, asr #8
    d984:	30783028 	rsbscc	r3, r8, r8, lsr #32
    d988:	29623030 	stmdbcs	r2!, {r4, r5, ip, sp}^
    d98c:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    d990:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    d994:	50435f4c 	subpl	r5, r3, ip, asr #30
    d998:	54564549 	ldrbpl	r4, [r6], #-1353	@ 0xfffffab7
    d99c:	5f414e45 	svcpl	0x00414e45
    d9a0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    d9a4:	00553731 	subseq	r3, r5, r1, lsr r7
    d9a8:	4953535f 	ldmdbmi	r3, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
    d9ac:	545f455a 	ldrbpl	r4, [pc], #-1370	@ d9b4 <_Min_Stack_Size+0xd5b4>
    d9b0:	4345445f 	movtmi	r4, #21599	@ 0x545f
    d9b4:	4552414c 	ldrbmi	r4, [r2, #-332]	@ 0xfffffeb4
    d9b8:	5f002044 	svcpl	0x00002044
    d9bc:	444e4152 	strbmi	r4, [lr], #-338	@ 0xfffffeae
    d9c0:	535f3834 	cmppl	pc, #52, 16	@ 0x340000
    d9c4:	5f444545 	svcpl	0x00444545
    d9c8:	30282030 	eorcc	r2, r8, r0, lsr r0
    d9cc:	30333378 	eorscc	r3, r3, r8, ror r3
    d9d0:	5f002965 	svcpl	0x00002965
    d9d4:	5041535f 	subpl	r5, r1, pc, asr r3
    d9d8:	78302050 	ldmdavc	r0!, {r4, r6, sp}
    d9dc:	30303130 	eorscc	r3, r0, r0, lsr r1
    d9e0:	54415f00 	strbpl	r5, [r1], #-3840	@ 0xfffff100
    d9e4:	42495254 	submi	r5, r9, #84, 4	@ 0x40000005
    d9e8:	28455455 	stmdacs	r5, {r0, r2, r4, r6, sl, ip, lr}^
    d9ec:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    d9f0:	5f202973 	svcpl	0x00202973
    d9f4:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    d9f8:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    d9fc:	5f5f6574 	svcpl	0x005f6574
    da00:	74612820 	strbtvc	r2, [r1], #-2080	@ 0xfffff7e0
    da04:	29737274 	ldmdbcs	r3!, {r2, r4, r5, r6, r9, ip, sp, lr}^
    da08:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    da0c:	4154495f 	cmpmi	r4, pc, asr r9
    da10:	54434254 	strbpl	r4, [r3], #-596	@ 0xfffffdac
    da14:	415f3252 	cmpmi	pc, r2, asr r2	@ <UNPREDICTABLE>
    da18:	41455254 	cmpmi	r5, r4, asr r2
    da1c:	5f325944 	svcpl	0x00325944
    da20:	206b734d 	rsbcs	r7, fp, sp, asr #6
    da24:	31783028 	cmncc	r8, r8, lsr #32
    da28:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    da2c:	42435300 	submi	r5, r3, #0, 6
    da30:	5249415f 	subpl	r4, r9, #-1073741801	@ 0xc0000017
    da34:	455f5243 	ldrbmi	r5, [pc, #-579]	@ d7f9 <_Min_Stack_Size+0xd3f9>
    da38:	4149444e 	cmpmi	r9, lr, asr #8
    da3c:	5353454e 	cmppl	r3, #327155712	@ 0x13800000
    da40:	736f505f 	cmnvc	pc, #95	@ 0x5f
    da44:	55353120 	ldrpl	r3, [r5, #-288]!	@ 0xfffffee0
    da48:	42435300 	submi	r5, r3, #0, 6
    da4c:	5343495f 	movtpl	r4, #14687	@ 0x395f
    da50:	4d4e5f52 	stclmi	15, cr5, [lr, #-328]	@ 0xfffffeb8
    da54:	4e455049 	cdpmi	0, 4, cr5, cr5, cr9, {2}
    da58:	54455344 	strbpl	r5, [r5], #-836	@ 0xfffffcbc
    da5c:	6b734d5f 	blvs	1ce0fe0 <_Min_Stack_Size+0x1ce0be0>
    da60:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    da64:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    da68:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    da6c:	5343495f 	movtpl	r4, #14687	@ 0x395f
    da70:	4d4e5f52 	stclmi	15, cr5, [lr, #-328]	@ 0xfffffeb8
    da74:	4e455049 	cdpmi	0, 4, cr5, cr5, cr9, {2}
    da78:	54455344 	strbpl	r5, [r5], #-836	@ 0xfffffcbc
    da7c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    da80:	5f5f0029 	svcpl	0x005f0029
    da84:	75716572 	ldrbvc	r6, [r1, #-1394]!	@ 0xfffffa8e
    da88:	73657269 	cmnvc	r5, #-1879048186	@ 0x90000006
    da8c:	6168735f 	cmnvs	r8, pc, asr r3
    da90:	28646572 	stmdacs	r4!, {r1, r4, r5, r6, r8, sl, sp, lr}^
    da94:	292e2e2e 	stmdbcs	lr!, {r1, r2, r3, r5, r9, sl, fp, sp}
    da98:	6c5f5f20 	mrrcvs	15, 2, r5, pc, cr0	@ <UNPREDICTABLE>
    da9c:	5f6b636f 	svcpl	0x006b636f
    daa0:	6f6e6e61 	svcvs	0x006e6e61
    daa4:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
    daa8:	61687328 	cmnvs	r8, r8, lsr #6
    daac:	5f646572 	svcpl	0x00646572
    dab0:	6b636f6c 	blvs	18e9868 <_Min_Stack_Size+0x18e9468>
    dab4:	65725f73 	ldrbvs	r5, [r2, #-3955]!	@ 0xfffff08d
    dab8:	72697571 	rsbvc	r7, r9, #473956352	@ 0x1c400000
    dabc:	5f286465 	svcpl	0x00286465
    dac0:	5f41565f 	svcpl	0x0041565f
    dac4:	53475241 	movtpl	r5, #29249	@ 0x7241
    dac8:	29295f5f 	stmdbcs	r9!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    dacc:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    dad0:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    dad4:	495f314f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
    dad8:	415f4d54 	cmpmi	pc, r4, asr sp	@ <UNPREDICTABLE>
    dadc:	4c415654 	mcrrmi	6, 5, r5, r1, cr4
    dae0:	4d5f4449 	cfldrdmi	mvd4, [pc, #-292]	@ d9c4 <_Min_Stack_Size+0xd5c4>
    dae4:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    dae8:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    daec:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    daf0:	49505420 	ldmdbmi	r0, {r5, sl, ip, lr}^
    daf4:	4649465f 			@ <UNDEFINED> instruction: 0x4649465f
    daf8:	495f314f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
    dafc:	415f4d54 	cmpmi	pc, r4, asr sp	@ <UNPREDICTABLE>
    db00:	4c415654 	mcrrmi	6, 5, r5, r1, cr4
    db04:	505f4449 	subspl	r4, pc, r9, asr #8
    db08:	0029736f 	eoreq	r7, r9, pc, ror #6
    db0c:	4e555f5f 	mrcmi	15, 2, r5, cr5, cr15, {2}
    db10:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    db14:	5f44454e 	svcpl	0x0044454e
    db18:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    db1c:	575f3631 	smmlarpl	pc, r1, r6, r3	@ <UNPREDICTABLE>
    db20:	45544952 	ldrbmi	r4, [r4, #-2386]	@ 0xfffff6ae
    db24:	64646128 	strbtvs	r6, [r4], #-296	@ 0xfffffed8
    db28:	61762c72 	cmnvs	r6, r2, ror ip
    db2c:	2820296c 	stmdacs	r0!, {r2, r3, r5, r6, r8, fp, sp}
    db30:	64696f76 	strbtvs	r6, [r9], #-3958	@ 0xfffff08a
    db34:	28282829 	stmdacs	r8!, {r0, r3, r5, fp, sp}
    db38:	72747328 	rsbsvc	r7, r4, #40, 6	@ 0xa0000000
    db3c:	20746375 	rsbscs	r6, r4, r5, ror r3
    db40:	49555f54 	ldmdbmi	r5, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    db44:	3631544e 	ldrtcc	r5, [r1], -lr, asr #8
    db48:	4952575f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
    db4c:	2a204554 	bcs	81f0a4 <_Min_Stack_Size+0x81eca4>
    db50:	6f762829 	svcvs	0x00762829
    db54:	2a206469 	bcs	826d00 <_Min_Stack_Size+0x826900>
    db58:	64612829 	strbtvs	r2, [r1], #-2089	@ 0xfffff7d7
    db5c:	29297264 	stmdbcs	r9!, {r2, r5, r6, r9, ip, sp, lr}
    db60:	29763e2d 	ldmdbcs	r6!, {r0, r2, r3, r5, r9, sl, fp, ip, sp}^
    db64:	28203d20 	stmdacs	r0!, {r5, r8, sl, fp, ip, sp}
    db68:	296c6176 	stmdbcs	ip!, {r1, r2, r4, r5, r6, r8, sp, lr}^
    db6c:	50540029 	subspl	r0, r4, r9, lsr #32
    db70:	54495f49 	strbpl	r5, [r9], #-3913	@ 0xfffff0b7
    db74:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    db78:	646f4d5f 	strbtvs	r4, [pc], #-3423	@ db80 <_Min_Stack_Size+0xd780>
    db7c:	6f505f65 	svcvs	0x00505f65
    db80:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    db84:	735f5f00 	cmpvc	pc, #0, 30
    db88:	656e6769 	strbvs	r6, [lr, #-1897]!	@ 0xfffff897
    db8c:	69732064 	ldmdbvs	r3!, {r2, r5, r6, sp}^
    db90:	64656e67 	strbtvs	r6, [r5], #-3687	@ 0xfffff199
    db94:	726f4300 	rsbvc	r4, pc, #0, 6
    db98:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    db9c:	445f6775 	ldrbmi	r6, [pc], #-1909	@ dba4 <_Min_Stack_Size+0xd7a4>
    dba0:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    dba4:	4c5f535f 	mrrcmi	3, 5, r5, pc, cr15	@ <UNPREDICTABLE>
    dba8:	554b434f 	strbpl	r4, [fp, #-847]	@ 0xfffffcb1
    dbac:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    dbb0:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    dbb4:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    dbb8:	6f43203c 	svcvs	0x0043203c
    dbbc:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    dbc0:	5f677562 	svcpl	0x00677562
    dbc4:	53434844 	movtpl	r4, #14404	@ 0x3844
    dbc8:	5f535f52 	svcpl	0x00535f52
    dbcc:	4b434f4c 	blmi	10e1904 <_Min_Stack_Size+0x10e1504>
    dbd0:	505f5055 	subspl	r5, pc, r5, asr r0	@ <UNPREDICTABLE>
    dbd4:	0029736f 	eoreq	r7, r9, pc, ror #6
    dbd8:	53535f5f 	cmppl	r3, #380	@ 0x17c
    dbdc:	4f465f50 	svcmi	0x00465f50
    dbe0:	46495452 			@ <UNDEFINED> instruction: 0x46495452
    dbe4:	454c5f59 	strbmi	r5, [ip, #-3929]	@ 0xfffff0a7
    dbe8:	204c4556 	subcs	r4, ip, r6, asr r5
    dbec:	535f0030 	cmppl	pc, #48	@ 0x30
    dbf0:	465f5359 			@ <UNDEFINED> instruction: 0x465f5359
    dbf4:	55544145 	ldrbpl	r4, [r4, #-325]	@ 0xfffffebb
    dbf8:	5f534552 	svcpl	0x00534552
    dbfc:	49002048 	stmdbmi	r0, {r3, r6, sp}
    dc00:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    dc04:	475f3252 			@ <UNDEFINED> instruction: 0x475f3252
    dc08:	41434e45 	cmpmi	r3, r5, asr #28
    dc0c:	49204c4c 	stmdbmi	r0!, {r2, r3, r6, sl, fp, lr}
    dc10:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    dc14:	475f3252 			@ <UNDEFINED> instruction: 0x475f3252
    dc18:	41434e45 	cmpmi	r3, r5, asr #28
    dc1c:	4d5f4c4c 	ldclmi	12, cr4, [pc, #-304]	@ daf4 <_Min_Stack_Size+0xd6f4>
    dc20:	45006b73 	strmi	r6, [r0, #-2931]	@ 0xfffff48d
    dc24:	37495458 	smlsldcc	r5, r9, r8, r4
    dc28:	5152495f 	cmppl	r2, pc, asr r9
    dc2c:	00333220 	eorseq	r3, r3, r0, lsr #4
    dc30:	5f4d5241 	svcpl	0x004d5241
    dc34:	5f55504d 	svcpl	0x0055504d
    dc38:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    dc3c:	2858455f 	ldmdacs	r8, {r0, r1, r2, r3, r4, r6, r8, sl, lr}^
    dc40:	61736944 	cmnvs	r3, r4, asr #18
    dc44:	45656c62 	strbmi	r6, [r5, #-3170]!	@ 0xfffff39e
    dc48:	2c636578 	cfstr64cs	mvdx6, [r3], #-480	@ 0xfffffe20
    dc4c:	65636341 	strbvs	r6, [r3, #-833]!	@ 0xfffffcbf
    dc50:	65507373 	ldrbvs	r7, [r0, #-883]	@ 0xfffffc8d
    dc54:	73696d72 	cmnvc	r9, #7296	@ 0x1c80
    dc58:	6e6f6973 			@ <UNDEFINED> instruction: 0x6e6f6973
    dc5c:	6363412c 	cmnvs	r3, #44, 2
    dc60:	41737365 	cmnmi	r3, r5, ror #6
    dc64:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    dc68:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    dc6c:	75532c73 	ldrbvc	r2, [r3, #-3187]	@ 0xfffff38d
    dc70:	67655262 	strbvs	r5, [r5, -r2, ror #4]!
    dc74:	446e6f69 	strbtmi	r6, [lr], #-3945	@ 0xfffff097
    dc78:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
    dc7c:	532c656c 			@ <UNDEFINED> instruction: 0x532c656c
    dc80:	29657a69 	stmdbcs	r5!, {r0, r3, r5, r6, r9, fp, ip, sp, lr}^
    dc84:	28282820 	stmdacs	r8!, {r5, fp, sp}
    dc88:	73694428 	cmnvc	r9, #40, 8	@ 0x28000000
    dc8c:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    dc90:	63657845 	cmnvs	r5, #4521984	@ 0x450000
    dc94:	3c3c2029 	ldccc	0, cr2, [ip], #-164	@ 0xffffff5c
    dc98:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    dc9c:	5341525f 	movtpl	r5, #4703	@ 0x125f
    dca0:	4e585f52 	mrcmi	15, 2, r5, cr8, cr2, {2}
    dca4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    dca8:	20262029 	eorcs	r2, r6, r9, lsr #32
    dcac:	5f55504d 	svcpl	0x0055504d
    dcb0:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    dcb4:	5f4e585f 	svcpl	0x004e585f
    dcb8:	296b734d 	stmdbcs	fp!, {r0, r2, r3, r6, r8, r9, ip, sp, lr}^
    dcbc:	28207c20 	stmdacs	r0!, {r5, sl, fp, ip, sp, lr}
    dcc0:	63412828 	movtvs	r2, #6184	@ 0x1828
    dcc4:	73736563 	cmnvc	r3, #415236096	@ 0x18c00000
    dcc8:	6d726550 	cfldr64vs	mvdx6, [r2, #-320]!	@ 0xfffffec0
    dccc:	69737369 	ldmdbvs	r3!, {r0, r3, r5, r6, r8, r9, ip, sp, lr}^
    dcd0:	20296e6f 	eorcs	r6, r9, pc, ror #28
    dcd4:	4d203c3c 	stcmi	12, cr3, [r0, #-240]!	@ 0xffffff10
    dcd8:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    dcdc:	5f525341 	svcpl	0x00525341
    dce0:	505f5041 	subspl	r5, pc, r1, asr #32
    dce4:	2029736f 	eorcs	r7, r9, pc, ror #6
    dce8:	504d2026 	subpl	r2, sp, r6, lsr #32
    dcec:	41525f55 	cmpmi	r2, r5, asr pc
    dcf0:	415f5253 	cmpmi	pc, r3, asr r2	@ <UNPREDICTABLE>
    dcf4:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    dcf8:	7c20296b 			@ <UNDEFINED> instruction: 0x7c20296b
    dcfc:	28282820 	stmdacs	r8!, {r5, fp, sp}
    dd00:	65636341 	strbvs	r6, [r3, #-833]!	@ 0xfffffcbf
    dd04:	74417373 	strbvc	r7, [r1], #-883	@ 0xfffffc8d
    dd08:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    dd0c:	73657475 	cmnvc	r5, #1962934272	@ 0x75000000
    dd10:	20262029 	eorcs	r2, r6, r9, lsr #32
    dd14:	55504d28 	ldrbpl	r4, [r0, #-3368]	@ 0xfffff2d8
    dd18:	5341525f 	movtpl	r5, #4703	@ 0x125f
    dd1c:	45545f52 	ldrbmi	r5, [r4, #-3922]	@ 0xfffff0ae
    dd20:	734d5f58 	movtvc	r5, #57176	@ 0xdf58
    dd24:	207c206b 	rsbscs	r2, ip, fp, rrx
    dd28:	5f55504d 	svcpl	0x0055504d
    dd2c:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    dd30:	4d5f535f 	ldclmi	3, cr5, [pc, #-380]	@ dbbc <_Min_Stack_Size+0xd7bc>
    dd34:	7c206b73 			@ <UNDEFINED> instruction: 0x7c206b73
    dd38:	55504d20 	ldrbpl	r4, [r0, #-3360]	@ 0xfffff2e0
    dd3c:	5341525f 	movtpl	r5, #4703	@ 0x125f
    dd40:	5f435f52 	svcpl	0x00435f52
    dd44:	206b734d 	rsbcs	r7, fp, sp, asr #6
    dd48:	504d207c 	subpl	r2, sp, ip, ror r0
    dd4c:	41525f55 	cmpmi	r2, r5, asr pc
    dd50:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    dd54:	6b734d5f 	blvs	1ce12d8 <_Min_Stack_Size+0x1ce0ed8>
    dd58:	20292929 	eorcs	r2, r9, r9, lsr #18
    dd5c:	2828207c 	stmdacs	r8!, {r2, r3, r4, r5, r6, sp}
    dd60:	62755328 	rsbsvs	r5, r5, #40, 6	@ 0xa0000000
    dd64:	69676552 	stmdbvs	r7!, {r1, r4, r6, r8, sl, sp, lr}^
    dd68:	69446e6f 	stmdbvs	r4, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
    dd6c:	6c626173 	stfvse	f6, [r2], #-460	@ 0xfffffe34
    dd70:	3c202965 			@ <UNDEFINED> instruction: 0x3c202965
    dd74:	504d203c 	subpl	r2, sp, ip, lsr r0
    dd78:	41525f55 	cmpmi	r2, r5, asr pc
    dd7c:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    dd80:	505f4452 	subspl	r4, pc, r2, asr r4	@ <UNPREDICTABLE>
    dd84:	2029736f 	eorcs	r7, r9, pc, ror #6
    dd88:	504d2026 	subpl	r2, sp, r6, lsr #32
    dd8c:	41525f55 	cmpmi	r2, r5, asr pc
    dd90:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    dd94:	4d5f4452 	cfldrdmi	mvd4, [pc, #-328]	@ dc54 <_Min_Stack_Size+0xd854>
    dd98:	20296b73 	eorcs	r6, r9, r3, ror fp
    dd9c:	2828207c 	stmdacs	r8!, {r2, r3, r4, r5, r6, sp}
    dda0:	7a695328 	bvc	1a62a48 <_Min_Stack_Size+0x1a62648>
    dda4:	3c202965 			@ <UNDEFINED> instruction: 0x3c202965
    dda8:	504d203c 	subpl	r2, sp, ip, lsr r0
    ddac:	41525f55 	cmpmi	r2, r5, asr pc
    ddb0:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    ddb4:	5f455a49 	svcpl	0x00455a49
    ddb8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    ddbc:	4d202620 	stcmi	6, cr2, [r0, #-128]!	@ 0xffffff80
    ddc0:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    ddc4:	5f525341 	svcpl	0x00525341
    ddc8:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    ddcc:	6b734d5f 	blvs	1ce1350 <_Min_Stack_Size+0x1ce0f50>
    ddd0:	207c2029 	rsbscs	r2, ip, r9, lsr #32
    ddd4:	4d282828 	stcmi	8, cr2, [r8, #-160]!	@ 0xffffff60
    ddd8:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    dddc:	5f525341 	svcpl	0x00525341
    dde0:	42414e45 	submi	r4, r1, #1104	@ 0x450
    dde4:	4d5f454c 	cfldr64mi	mvdx4, [pc, #-304]	@ dcbc <_Min_Stack_Size+0xd8bc>
    dde8:	29296b73 	stmdbcs	r9!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    ddec:	68002929 	stmdavs	r0, {r0, r3, r5, r8, fp, sp}
    ddf0:	00646165 	rsbeq	r6, r4, r5, ror #2
    ddf4:	5f495054 	svcpl	0x00495054
    ddf8:	4f464946 	svcmi	0x00464946
    ddfc:	54455f31 	strbpl	r5, [r5], #-3889	@ 0xfffff0cf
    de00:	54415f4d 	strbpl	r5, [r1], #-3917	@ 0xfffff0b3
    de04:	494c4156 	stmdbmi	ip, {r1, r2, r4, r6, r8, lr}^
    de08:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    de0c:	3028206b 	eorcc	r2, r8, fp, rrx
    de10:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    de14:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    de18:	5f495054 	svcpl	0x00495054
    de1c:	4f464946 	svcmi	0x00464946
    de20:	54455f31 	strbpl	r5, [r5], #-3889	@ 0xfffff0cf
    de24:	54415f4d 	strbpl	r5, [r1], #-3917	@ 0xfffff0b3
    de28:	494c4156 	stmdbmi	ip, {r1, r2, r4, r6, r8, lr}^
    de2c:	6f505f44 	svcvs	0x00505f44
    de30:	5f002973 	svcpl	0x00002973
    de34:	7365725f 	cmnvc	r5, #-268435451	@ 0xf0000005
    de38:	63697274 	cmnvs	r9, #116, 4	@ 0x40000007
    de3c:	65722074 	ldrbvs	r2, [r2, #-116]!	@ 0xffffff8c
    de40:	69727473 	ldmdbvs	r2!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
    de44:	41007463 	tstmi	r0, r3, ror #8
    de48:	32314344 	eorscc	r4, r1, #68, 6	@ 0x10000001
    de4c:	5152495f 	cmppl	r2, pc, asr r9
    de50:	00383120 	eorseq	r3, r8, r0, lsr #2
    de54:	5f4d5449 	svcpl	0x004d5449
    de58:	5f524354 	svcpl	0x00524354
    de5c:	454d5449 	strbmi	r5, [sp, #-1097]	@ 0xfffffbb7
    de60:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ dd30 <_Min_Stack_Size+0xd930>
    de64:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    de68:	204c5531 	subcs	r5, ip, r1, lsr r5
    de6c:	5f5f0029 	svcpl	0x005f0029
    de70:	6465656e 	strbtvs	r6, [r5], #-1390	@ 0xfffffa92
    de74:	6863775f 	stmdavs	r3!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, sp, lr}^
    de78:	745f7261 	ldrbvc	r7, [pc], #-609	@ de80 <_Min_Stack_Size+0xda80>
    de7c:	5f5f0020 	svcpl	0x005f0020
    de80:	657a6973 	ldrbvs	r6, [sl, #-2419]!	@ 0xfffff68d
    de84:	5500745f 	strpl	r7, [r0, #-1119]	@ 0xfffffba1
    de88:	5f544e49 	svcpl	0x00544e49
    de8c:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    de90:	4d5f3436 	cfldrdmi	mvd3, [pc, #-216]	@ ddc0 <_Min_Stack_Size+0xd9c0>
    de94:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    de98:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    de9c:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    dea0:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    dea4:	414d5f34 	cmpmi	sp, r4, lsr pc
    dea8:	295f5f58 	ldmdbcs	pc, {r3, r4, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    deac:	41565f00 	cmpmi	r6, r0, lsl #30
    deb0:	4c46324c 	sfmmi	f3, 2, [r6], {76}	@ 0x4c
    deb4:	69662844 	stmdbvs	r6!, {r2, r6, fp, sp}^
    deb8:	2c646c65 	stclcs	12, cr6, [r4], #-404	@ 0xfffffe6c
    debc:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    dec0:	28202965 	stmdacs	r0!, {r0, r2, r5, r6, r8, fp, sp}
    dec4:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    dec8:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
    decc:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
    ded0:	756c6176 	strbvc	r6, [ip, #-374]!	@ 0xfffffe8a
    ded4:	3c202965 			@ <UNDEFINED> instruction: 0x3c202965
    ded8:	6966203c 	stmdbvs	r6!, {r2, r3, r4, r5, sp}^
    dedc:	20646c65 	rsbcs	r6, r4, r5, ror #24
    dee0:	5f202323 	svcpl	0x00202323
    dee4:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    dee8:	66202620 	strtvs	r2, [r0], -r0, lsr #12
    deec:	646c6569 	strbtvs	r6, [ip], #-1385	@ 0xfffffa97
    def0:	20232320 	eorcs	r2, r3, r0, lsr #6
    def4:	6b734d5f 	blvs	1ce1478 <_Min_Stack_Size+0x1ce1078>
    def8:	6f430029 	svcvs	0x00430029
    defc:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    df00:	5f677562 	svcpl	0x00677562
    df04:	434d4544 	movtmi	r4, #54596	@ 0xd544
    df08:	4f4d5f52 	svcmi	0x004d5f52
    df0c:	45525f4e 	ldrbmi	r5, [r2, #-3918]	@ 0xfffff0b2
    df10:	6f505f51 	svcvs	0x00505f51
    df14:	39312073 	ldmdbcc	r1!, {r0, r1, r4, r5, r6, sp}
    df18:	52410055 	subpl	r0, r1, #85	@ 0x55
    df1c:	504d5f4d 	subpl	r5, sp, sp, asr #30
    df20:	50415f55 	subpl	r5, r1, r5, asr pc
    df24:	204f525f 	subcs	r5, pc, pc, asr r2	@ <UNPREDICTABLE>
    df28:	5f005536 	svcpl	0x00005536
    df2c:	696c615f 	stmdbvs	ip!, {r0, r1, r2, r3, r4, r6, r8, sp, lr}^
    df30:	755f6e67 	ldrbvc	r6, [pc, #-3687]	@ d0d1 <_Min_Stack_Size+0xccd1>
    df34:	2c782870 	ldclcs	8, cr2, [r8], #-448	@ 0xfffffe40
    df38:	5f202979 	svcpl	0x00202979
    df3c:	6975625f 	ldmdbvs	r5!, {r0, r1, r2, r3, r4, r6, r9, sp, lr}^
    df40:	6e69746c 	cdpvs	4, 6, cr7, cr9, cr12, {3}
    df44:	696c615f 	stmdbvs	ip!, {r0, r1, r2, r3, r4, r6, r8, sp, lr}^
    df48:	755f6e67 	ldrbvc	r6, [pc, #-3687]	@ d0e9 <_Min_Stack_Size+0xcce9>
    df4c:	2c782870 	ldclcs	8, cr2, [r8], #-448	@ 0xfffffe40
    df50:	00297920 	eoreq	r7, r9, r0, lsr #18
    df54:	6f6e5f5f 	svcvs	0x006e5f5f
    df58:	6c756e6e 	ldclvs	14, cr6, [r5], #-440	@ 0xfffffe48
    df5c:	6c615f6c 	stclvs	15, cr5, [r1], #-432	@ 0xfffffe50
    df60:	5f5f206c 	svcpl	0x005f206c
    df64:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    df68:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    df6c:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    df70:	6e5f5f28 	cdpvs	15, 5, cr5, cr15, cr8, {1}
    df74:	756e6e6f 	strbvc	r6, [lr, #-3695]!	@ 0xfffff191
    df78:	5f5f6c6c 	svcpl	0x005f6c6c
    df7c:	5f002929 	svcpl	0x00002929
    df80:	44494c45 	strbmi	r4, [r9], #-3141	@ 0xfffff3bb
    df84:	454c4241 	strbmi	r4, [ip, #-577]	@ 0xfffffdbf
    df88:	4c4e495f 	mcrrmi	9, 5, r4, lr, cr15	@ <UNPREDICTABLE>
    df8c:	20454e49 	subcs	r4, r5, r9, asr #28
    df90:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    df94:	5f206369 	svcpl	0x00206369
    df98:	6c6e695f 			@ <UNDEFINED> instruction: 0x6c6e695f
    df9c:	5f656e69 	svcpl	0x00656e69
    dfa0:	5f5f005f 	svcpl	0x005f005f
    dfa4:	6f6c6c61 	svcvs	0x006c6c61
    dfa8:	6c615f63 	stclvs	15, cr5, [r1], #-396	@ 0xfffffe74
    dfac:	286e6769 	stmdacs	lr!, {r0, r3, r5, r6, r8, r9, sl, sp, lr}^
    dfb0:	5f202978 	svcpl	0x00202978
    dfb4:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    dfb8:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    dfbc:	5f5f6574 	svcpl	0x005f6574
    dfc0:	5f5f2828 	svcpl	0x005f2828
    dfc4:	6f6c6c61 	svcvs	0x006c6c61
    dfc8:	6c615f63 	stclvs	15, cr5, [r1], #-396	@ 0xfffffe74
    dfcc:	5f6e6769 	svcpl	0x006e6769
    dfd0:	2978285f 	ldmdbcs	r8!, {r0, r1, r2, r3, r4, r6, fp, sp}^
    dfd4:	5f002929 	svcpl	0x00002929
    dfd8:	43575f54 	cmpmi	r7, #84, 30	@ 0x150
    dfdc:	20524148 	subscs	r4, r2, r8, asr #2
    dfe0:	49535f00 	ldmdbmi	r3, {r8, r9, sl, fp, ip, lr}^
    dfe4:	5f54455a 	svcpl	0x0054455a
    dfe8:	43530020 	cmpmi	r3, #32
    dfec:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    dff0:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    dff4:	53444e45 	movtpl	r4, #20037	@ 0x4e45
    dff8:	54455354 	strbpl	r5, [r5], #-852	@ 0xfffffcac
    dffc:	6b734d5f 	blvs	1ce1580 <_Min_Stack_Size+0x1ce1180>
    e000:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    e004:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    e008:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    e00c:	5343495f 	movtpl	r4, #14687	@ 0x395f
    e010:	45505f52 	ldrbmi	r5, [r0, #-3922]	@ 0xfffff0ae
    e014:	5453444e 	ldrbpl	r4, [r3], #-1102	@ 0xfffffbb2
    e018:	5f544553 	svcpl	0x00544553
    e01c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    e020:	726f4300 	rsbvc	r4, pc, #0, 6
    e024:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    e028:	445f6775 	ldrbmi	r6, [pc], #-1909	@ e030 <_Min_Stack_Size+0xdc30>
    e02c:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    e030:	535f535f 	cmppl	pc, #2080374785	@ 0x7c000001
    e034:	5045454c 	subpl	r4, r5, ip, asr #10
    e038:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e03c:	55383120 	ldrpl	r3, [r8, #-288]!	@ 0xfffffee0
    e040:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    e044:	44282820 	strtmi	r2, [r8], #-2080	@ 0xfffff7e0
    e048:	545f5457 	ldrbpl	r5, [pc], #-1111	@ e050 <_Min_Stack_Size+0xdc50>
    e04c:	20657079 	rsbcs	r7, r5, r9, ror r0
    e050:	4420292a 	strtmi	r2, [r0], #-2346	@ 0xfffff6d6
    e054:	425f5457 	subsmi	r5, pc, #1459617792	@ 0x57000000
    e058:	20455341 	subcs	r5, r5, r1, asr #6
