NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    e05c:	50780029 	rsbspl	r0, r8, r9, lsr #32
    e060:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    e064:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ df20 <_Min_Stack_Size+0xdb20>
    e068:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    e06c:	46317830 			@ <UNDEFINED> instruction: 0x46317830
    e070:	204c5546 	subcs	r5, ip, r6, asr #10
    e074:	5f5f0029 	svcpl	0x005f0029
    e078:	64646968 	strbtvs	r6, [r4], #-2408	@ 0xfffff698
    e07c:	5f206e65 	svcpl	0x00206e65
    e080:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    e084:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    e088:	5f5f6574 	svcpl	0x005f6574
    e08c:	5f5f2828 	svcpl	0x005f2828
    e090:	69736976 	ldmdbvs	r3!, {r1, r2, r4, r5, r6, r8, fp, sp, lr}^
    e094:	696c6962 	stmdbvs	ip!, {r1, r5, r6, r8, fp, sp, lr}^
    e098:	5f5f7974 	svcpl	0x005f7974
    e09c:	69682228 	stmdbvs	r8!, {r3, r5, r9, sp}^
    e0a0:	6e656464 	cdpvs	4, 6, cr6, cr5, cr4, {3}
    e0a4:	29292922 	stmdbcs	r9!, {r1, r5, r8, fp, sp}
    e0a8:	42435300 	submi	r5, r3, #0, 6
    e0ac:	4348535f 	movtmi	r5, #33631	@ 0x835f
    e0b0:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    e0b4:	4c414356 	mcrrmi	3, 5, r4, r1, cr6
    e0b8:	4e45504c 	cdpmi	0, 4, cr5, cr5, cr12, {2}
    e0bc:	5f444544 	svcpl	0x00444544
    e0c0:	206b734d 	rsbcs	r7, fp, sp, asr #6
    e0c4:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    e0c8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    e0cc:	5f424353 	svcpl	0x00424353
    e0d0:	53434853 	movtpl	r4, #14419	@ 0x3853
    e0d4:	56535f52 	usaxpl	r5, r3, r2
    e0d8:	4c4c4143 	stfmie	f4, [ip], {67}	@ 0x43
    e0dc:	444e4550 	strbmi	r4, [lr], #-1360	@ 0xfffffab0
    e0e0:	505f4445 	subspl	r4, pc, r5, asr #8
    e0e4:	0029736f 	eoreq	r7, r9, pc, ror #6
    e0e8:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    e0ec:	5f464544 	svcpl	0x00464544
    e0f0:	00205f48 	eoreq	r5, r0, r8, asr #30
    e0f4:	4654415f 			@ <UNDEFINED> instruction: 0x4654415f
    e0f8:	5f454c49 	svcpl	0x00454c49
    e0fc:	52554f53 	subspl	r4, r5, #332	@ 0x14c
    e100:	31204543 			@ <UNDEFINED> instruction: 0x31204543
    e104:	73616200 	cmnvc	r1, #0, 4
    e108:	5f5f0065 	svcpl	0x005f0065
    e10c:	706d6f63 	rsbvc	r6, sp, r3, ror #30
    e110:	665f7261 	ldrbvs	r7, [pc], -r1, ror #4
    e114:	5f745f6e 	svcpl	0x00745f6e
    e118:	69666564 	stmdbvs	r6!, {r2, r5, r6, r8, sl, sp, lr}^
    e11c:	2064656e 	rsbcs	r6, r4, lr, ror #10
    e120:	475f5f00 	ldrbmi	r5, [pc, -r0, lsl #30]
    e124:	5f43554e 	svcpl	0x0043554e
    e128:	52455250 	subpl	r5, r5, #80, 4
    e12c:	5f5f5145 	svcpl	0x005f5145
    e130:	2c616d28 	stclcs	13, cr6, [r1], #-160	@ 0xffffff60
    e134:	2029696d 	eorcs	r6, r9, sp, ror #18
    e138:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    e13c:	505f4355 	subspl	r4, pc, r5, asr r3	@ <UNPREDICTABLE>
    e140:	45524552 	ldrbmi	r4, [r2, #-1362]	@ 0xfffffaae
    e144:	616d2851 	cmnvs	sp, r1, asr r8
    e148:	696d202c 	stmdbvs	sp!, {r2, r3, r5, sp}^
    e14c:	495f0029 	ldmdbmi	pc, {r0, r3, r5}^	@ <UNPREDICTABLE>
    e150:	46424c4f 	strbmi	r4, [r2], -pc, asr #24
    e154:	49003120 	stmdbmi	r0, {r5, r8, ip, sp}
    e158:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    e15c:	505f3152 	subspl	r3, pc, r2, asr r1	@ <UNPREDICTABLE>
    e160:	4d5f4345 	ldclmi	3, cr4, [pc, #-276]	@ e054 <_Min_Stack_Size+0xdc54>
    e164:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    e168:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
    e16c:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    e170:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    e174:	3152435f 	cmpcc	r2, pc, asr r3
    e178:	4345505f 	movtmi	r5, #20575	@ 0x505f
    e17c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e180:	525f0029 	subspl	r0, pc, #41	@ 0x29
    e184:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    e188:	4e41525f 	mcrmi	2, 2, r5, cr1, cr15, {2}
    e18c:	454e5f44 	strbmi	r5, [lr, #-3908]	@ 0xfffff0bc
    e190:	70285458 	eorvc	r5, r8, r8, asr r4
    e194:	20297274 	eorcs	r7, r9, r4, ror r2
    e198:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    e19c:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    e1a0:	3834725f 	ldmdacc	r4!, {r0, r1, r2, r3, r4, r6, r9, ip, sp, lr}
    e1a4:	725f3e2d 	subsvc	r3, pc, #720	@ 0x2d0
    e1a8:	5f646e61 	svcpl	0x00646e61
    e1ac:	7478656e 	ldrbtvc	r6, [r8], #-1390	@ 0xfffffa92
    e1b0:	50780029 	rsbspl	r0, r8, r9, lsr #32
    e1b4:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    e1b8:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    e1bc:	3020736f 	eorcc	r7, r0, pc, ror #6
    e1c0:	4e490055 	mcrmi	0, 2, r0, cr9, cr5, {2}
    e1c4:	52545054 	subspl	r5, r4, #84	@ 0x54
    e1c8:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    e1cc:	5f2d2820 	svcpl	0x002d2820
    e1d0:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    e1d4:	5f525450 	svcpl	0x00525450
    e1d8:	5f58414d 	svcpl	0x0058414d
    e1dc:	202d205f 	eorcs	r2, sp, pc, asr r0
    e1e0:	53002931 	movwpl	r2, #2353	@ 0x931
    e1e4:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
    e1e8:	435f6b63 	cmpmi	pc, #101376	@ 0x18c00
    e1ec:	5f4c5254 	svcpl	0x004c5254
    e1f0:	4b434954 	blmi	10e0748 <_Min_Stack_Size+0x10e0348>
    e1f4:	5f544e49 	svcpl	0x00544e49
    e1f8:	206b734d 	rsbcs	r7, fp, sp, asr #6
    e1fc:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    e200:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    e204:	54737953 	ldrbtpl	r7, [r3], #-2387	@ 0xfffff6ad
    e208:	5f6b6369 	svcpl	0x006b6369
    e20c:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    e210:	4349545f 	movtmi	r5, #37983	@ 0x945f
    e214:	544e494b 	strbpl	r4, [lr], #-2379	@ 0xfffff6b5
    e218:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e21c:	6f430029 	svcvs	0x00430029
    e220:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    e224:	5f677562 	svcpl	0x00677562
    e228:	53434844 	movtpl	r4, #14404	@ 0x3844
    e22c:	5f535f52 	svcpl	0x00535f52
    e230:	4b434f4c 	blmi	10e1f68 <_Min_Stack_Size+0x10e1b68>
    e234:	505f5055 	subspl	r5, pc, r5, asr r0	@ <UNPREDICTABLE>
    e238:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    e23c:	5f005539 	svcpl	0x00005539
    e240:	6c6c754e 	cfstr64vs	mvdx7, [ip], #-312	@ 0xfffffec8
    e244:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    e248:	54490020 	strbpl	r0, [r9], #-32	@ 0xffffffe0
    e24c:	534c5f4d 	movtpl	r5, #53069	@ 0xcf4d
    e250:	79425f52 	stmdbvc	r2, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    e254:	63416574 	movtvs	r6, #5492	@ 0x1574
    e258:	734d5f63 	movtvc	r5, #57187	@ 0xdf63
    e25c:	4928206b 	stmdbmi	r8!, {r0, r1, r3, r5, r6, sp}
    e260:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    e264:	425f5253 	subsmi	r5, pc, #805306373	@ 0x30000005
    e268:	41455459 	cmpmi	r5, r9, asr r4
    e26c:	4d5f4343 	ldclmi	3, cr4, [pc, #-268]	@ e168 <_Min_Stack_Size+0xdd68>
    e270:	00296b73 	eoreq	r6, r9, r3, ror fp
    e274:	544f4e5f 	strbpl	r4, [pc], #-3679	@ e27c <_Min_Stack_Size+0xde7c>
    e278:	574f5248 	strbpl	r5, [pc, -r8, asr #4]
    e27c:	5f5f0020 	svcpl	0x005f0020
    e280:	535f4343 	cmppl	pc, #201326593	@ 0xc000001
    e284:	4f505055 	svcmi	0x00505055
    e288:	5f535452 	svcpl	0x00535452
    e28c:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    e290:	454e494c 	strbmi	r4, [lr, #-2380]	@ 0xfffff6b4
    e294:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    e298:	43324900 	teqmi	r2, #0, 18
    e29c:	3252435f 	subscc	r4, r2, #2080374785	@ 0x7c000001
    e2a0:	4552465f 	ldrbmi	r4, [r2, #-1631]	@ 0xfffff9a1
    e2a4:	32492051 	subcc	r2, r9, #81	@ 0x51
    e2a8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    e2ac:	52465f32 	subpl	r5, r6, #50, 30	@ 0xc8
    e2b0:	4d5f5145 	ldfmie	f5, [pc, #-276]	@ e1a4 <_Min_Stack_Size+0xdda4>
    e2b4:	49006b73 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    e2b8:	535f434e 	cmppl	pc, #939524097	@ 0x38000001
    e2bc:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
    e2c0:	33303146 	teqcc	r0, #-2147483631	@ 0x80000011
    e2c4:	485f3658 	ldmdami	pc, {r3, r4, r6, r9, sl, ip, sp}^	@ <UNPREDICTABLE>
    e2c8:	5f00205f 	svcpl	0x0000205f
    e2cc:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    e2d0:	7361665f 	cmnvc	r1, #99614720	@ 0x5f00000
    e2d4:	5f343674 	svcpl	0x00343674
    e2d8:	65645f74 	strbvs	r5, [r4, #-3956]!	@ 0xfffff08c
    e2dc:	656e6966 	strbvs	r6, [lr, #-2406]!	@ 0xfffff69a
    e2e0:	00312064 	eorseq	r2, r1, r4, rrx
    e2e4:	5f55504d 	svcpl	0x0055504d
    e2e8:	52414252 	subpl	r4, r1, #536870917	@ 0x20000005
    e2ec:	4c41565f 	mcrrmi	6, 5, r5, r1, cr15
    e2f0:	4d5f4449 	cfldrdmi	mvd4, [pc, #-292]	@ e1d4 <_Min_Stack_Size+0xddd4>
    e2f4:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    e2f8:	204c5531 	subcs	r5, ip, r1, lsr r5
    e2fc:	4d203c3c 	stcmi	12, cr3, [r0, #-240]!	@ 0xffffff10
    e300:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    e304:	5f524142 	svcpl	0x00524142
    e308:	494c4156 	stmdbmi	ip, {r1, r2, r4, r6, r8, lr}^
    e30c:	6f505f44 	svcvs	0x00505f44
    e310:	53002973 	movwpl	r2, #2419	@ 0x973
    e314:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    e318:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    e31c:	4753555f 			@ <UNDEFINED> instruction: 0x4753555f
    e320:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    e324:	4e455054 	mcrmi	0, 2, r5, cr5, cr4, {2}
    e328:	5f444544 	svcpl	0x00444544
    e32c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    e330:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    e334:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    e338:	5f424353 	svcpl	0x00424353
    e33c:	53434853 	movtpl	r4, #14419	@ 0x3853
    e340:	53555f52 	cmppl	r5, #328	@ 0x148
    e344:	55414647 	strbpl	r4, [r1, #-1607]	@ 0xfffff9b9
    e348:	4550544c 	ldrbmi	r5, [r0, #-1100]	@ 0xfffffbb4
    e34c:	4445444e 	strbmi	r4, [r5], #-1102	@ 0xfffffbb2
    e350:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e354:	74690029 	strbtvc	r0, [r9], #-41	@ 0xffffffd7
    e358:	49006d65 	stmdbmi	r0, {r0, r2, r5, r6, r8, sl, fp, sp, lr}
    e35c:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    e360:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    e364:	45534552 	ldrbmi	r4, [r3, #-1362]	@ 0xfffffaae
    e368:	505f544e 	subspl	r5, pc, lr, asr #8
    e36c:	3020736f 	eorcc	r7, r0, pc, ror #6
    e370:	32490055 	subcc	r0, r9, #85	@ 0x55
    e374:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    e378:	44415f31 	strbmi	r5, [r1], #-3889	@ 0xfffff0cf
    e37c:	5f303144 	svcpl	0x00303144
    e380:	206b734d 	rsbcs	r7, fp, sp, asr #6
    e384:	31783028 	cmncc	r8, r8, lsr #32
    e388:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    e38c:	3249203c 	subcc	r2, r9, #60	@ 0x3c
    e390:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    e394:	44415f31 	strbmi	r5, [r1], #-3889	@ 0xfffff0cf
    e398:	5f303144 	svcpl	0x00303144
    e39c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    e3a0:	726f4300 	rsbvc	r4, pc, #0, 6
    e3a4:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    e3a8:	445f6775 	ldrbmi	r6, [pc], #-1909	@ e3b0 <_Min_Stack_Size+0xdfb0>
    e3ac:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    e3b0:	4e4f4d5f 	mcrmi	13, 2, r4, cr15, cr15, {2}
    e3b4:	4554535f 	ldrbmi	r5, [r4, #-863]	@ 0xfffffca1
    e3b8:	734d5f50 	movtvc	r5, #57168	@ 0xdf50
    e3bc:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    e3c0:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    e3c4:	6f43203c 	svcvs	0x0043203c
    e3c8:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    e3cc:	5f677562 	svcpl	0x00677562
    e3d0:	434d4544 	movtmi	r4, #54596	@ 0xd544
    e3d4:	4f4d5f52 	svcmi	0x004d5f52
    e3d8:	54535f4e 	ldrbpl	r5, [r3], #-3918	@ 0xfffff0b2
    e3dc:	505f5045 	subspl	r5, pc, r5, asr #32
    e3e0:	0029736f 	eoreq	r7, r9, pc, ror #6
    e3e4:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    e3e8:	535f544e 	cmppl	pc, #1308622848	@ 0x4e000000
    e3ec:	414e4749 	cmpmi	lr, r9, asr #14
    e3f0:	49535f4c 	ldmdbmi	r3, {r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    e3f4:	3220455a 	eorcc	r4, r0, #377487360	@ 0x16800000
    e3f8:	535f0034 	cmppl	pc, #52	@ 0x34
    e3fc:	525f5359 	subspl	r5, pc, #1677721601	@ 0x64000001
    e400:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    e404:	205f485f 	subscs	r4, pc, pc, asr r8	@ <UNPREDICTABLE>
    e408:	435f5f00 	cmpmi	pc, #0, 30
    e40c:	5349534d 	movtpl	r5, #37709	@ 0x934d
    e410:	4343475f 	movtmi	r4, #14175	@ 0x375f
    e414:	0020485f 	eoreq	r4, r0, pc, asr r8
    e418:	4453425f 	ldrbmi	r4, [r3], #-607	@ 0xfffffda1
    e41c:	5254505f 	subspl	r5, r4, #95	@ 0x5f
    e420:	46464944 	strbmi	r4, [r6], -r4, asr #18
    e424:	205f545f 	subscs	r5, pc, pc, asr r4	@ <UNPREDICTABLE>
    e428:	575f5f00 	ldrbpl	r5, [pc, -r0, lsl #30]
    e42c:	52414843 	subpl	r4, r1, #4390912	@ 0x430000
    e430:	0020545f 	eoreq	r5, r0, pc, asr r4
    e434:	43435f5f 	movtmi	r5, #16223	@ 0x3f5f
    e438:	5055535f 	subspl	r5, r5, pc, asr r3
    e43c:	54524f50 	ldrbpl	r4, [r2], #-3920	@ 0xfffff0b0
    e440:	5f5f5f53 	svcpl	0x005f5f53
    e444:	434e5546 	movtmi	r5, #58694	@ 0xe546
    e448:	31205f5f 			@ <UNDEFINED> instruction: 0x31205f5f
    e44c:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
    e450:	5f544e45 	svcpl	0x00544e45
    e454:	525f504d 	subspl	r5, pc, #77	@ 0x4d
    e458:	4c555345 	mrrcmi	3, 4, r5, r5, cr5	@ <UNPREDICTABLE>
    e45c:	284b5f54 	stmdacs	fp, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    e460:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    e464:	70282820 	eorvc	r2, r8, r0, lsr #16
    e468:	2d297274 	sfmcs	f7, 4, [r9, #-464]!	@ 0xfffffe30
    e46c:	706d5f3e 	rsbvc	r5, sp, lr, lsr pc
    e470:	725f3e2d 	subsvc	r3, pc, #720	@ 0x2d0
    e474:	6c757365 	ldclvs	3, cr7, [r5], #-404	@ 0xfffffe6c
    e478:	296b5f74 	stmdbcs	fp!, {r2, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
    e47c:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    e480:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
    e484:	616e4574 	smcvs	58452	@ 0xe454
    e488:	49656c62 	stmdbmi	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    e48c:	5f205152 	svcpl	0x00205152
    e490:	49564e5f 	ldmdbmi	r6, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^
    e494:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
    e498:	616e4574 	smcvs	58452	@ 0xe454
    e49c:	49656c62 	stmdbmi	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    e4a0:	43005152 	movwmi	r5, #338	@ 0x152
    e4a4:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    e4a8:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    e4ac:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    e4b0:	565f5243 	ldrbpl	r5, [pc], -r3, asr #4
    e4b4:	4f435f43 	svcmi	0x00435f43
    e4b8:	45524552 	ldrbmi	r4, [r2, #-1362]	@ 0xfffffaae
    e4bc:	5f544553 	svcpl	0x00544553
    e4c0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    e4c4:	54005530 	strpl	r5, [r0], #-1328	@ 0xfffffad0
    e4c8:	28204950 	stmdacs	r0!, {r4, r6, r8, fp, lr}
    e4cc:	49505428 	ldmdbmi	r0, {r3, r5, sl, ip, lr}^
    e4d0:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    e4d4:	292a2065 	stmdbcs	sl!, {r0, r2, r5, r6, sp}
    e4d8:	49505420 	ldmdbmi	r0, {r5, sl, ip, lr}^
    e4dc:	5341425f 	movtpl	r4, #4703	@ 0x125f
    e4e0:	00292045 	eoreq	r2, r9, r5, asr #32
    e4e4:	4e555f5f 	mrcmi	15, 2, r5, cr5, cr15, {2}
    e4e8:	47494c41 	strbmi	r4, [r9, -r1, asr #24]
    e4ec:	5f44454e 	svcpl	0x0044454e
    e4f0:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    e4f4:	525f3631 	subspl	r3, pc, #51380224	@ 0x3100000
    e4f8:	28444145 	stmdacs	r4, {r0, r2, r6, r8, lr}^
    e4fc:	72646461 	rsbvc	r6, r4, #1627389952	@ 0x61000000
    e500:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    e504:	6e6f6328 	cdpvs	3, 6, cr6, cr15, cr8, {1}
    e508:	73207473 			@ <UNDEFINED> instruction: 0x73207473
    e50c:	63757274 	cmnvs	r5, #116, 4	@ 0x40000007
    e510:	5f542074 	svcpl	0x00542074
    e514:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    e518:	525f3631 	subspl	r3, pc, #51380224	@ 0x3100000
    e51c:	20444145 	subcs	r4, r4, r5, asr #2
    e520:	6328292a 			@ <UNDEFINED> instruction: 0x6328292a
    e524:	74736e6f 	ldrbtvc	r6, [r3], #-3695	@ 0xfffff191
    e528:	696f7620 	stmdbvs	pc!, {r5, r9, sl, ip, sp, lr}^	@ <UNPREDICTABLE>
    e52c:	292a2064 	stmdbcs	sl!, {r2, r5, r6, sp}
    e530:	64646128 	strbtvs	r6, [r4], #-296	@ 0xfffffed8
    e534:	2d292972 			@ <UNDEFINED> instruction: 0x2d292972
    e538:	0029763e 	eoreq	r7, r9, lr, lsr r6
    e53c:	5f474953 	svcpl	0x00474953
    e540:	4d4f5441 	cfstrdmi	mvd5, [pc, #-260]	@ e444 <_Min_Stack_Size+0xe044>
    e544:	4d5f4349 	ldclmi	3, cr4, [pc, #-292]	@ e428 <_Min_Stack_Size+0xe028>
    e548:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
    e54c:	535f5f2d 	cmppl	pc, #45, 30	@ 0xb4
    e550:	4e494454 	mcrmi	4, 2, r4, cr9, cr4, {2}
    e554:	58455f54 	stmdapl	r5, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    e558:	4e492850 	mcrmi	8, 2, r2, cr9, cr0, {2}
    e55c:	414d5f54 	cmpmi	sp, r4, asr pc
    e560:	2d202958 			@ <UNDEFINED> instruction: 0x2d202958
    e564:	00293120 	eoreq	r3, r9, r0, lsr #2
    e568:	5f433249 	svcpl	0x00433249
    e56c:	5f315243 	svcpl	0x00315243
    e570:	54534f4e 	ldrbpl	r4, [r3], #-3918	@ 0xfffff0b2
    e574:	43544552 	cmpmi	r4, #343932928	@ 0x14800000
    e578:	734d5f48 	movtvc	r5, #57160	@ 0xdf48
    e57c:	3028206b 	eorcc	r2, r8, fp, rrx
    e580:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    e584:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    e588:	5f433249 	svcpl	0x00433249
    e58c:	5f315243 	svcpl	0x00315243
    e590:	54534f4e 	ldrbpl	r4, [r3], #-3918	@ 0xfffff0b2
    e594:	43544552 	cmpmi	r4, #343932928	@ 0x14800000
    e598:	6f505f48 	svcvs	0x00505f48
    e59c:	5f002973 	svcpl	0x00002973
    e5a0:	5f46464f 	svcpl	0x0046464f
    e5a4:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    e5a8:	52414c43 	subpl	r4, r1, #17152	@ 0x4300
    e5ac:	00204445 	eoreq	r4, r0, r5, asr #8
    e5b0:	5f545744 	svcpl	0x00545744
    e5b4:	4355534c 	cmpmi	r5, #76, 6	@ 0x30000001
    e5b8:	4c5f544e 	cfldrdmi	mvd5, [pc], {78}	@ 0x4e
    e5bc:	4e435553 	mcrmi	5, 2, r5, cr3, cr3, {2}
    e5c0:	6f505f54 	svcvs	0x00505f54
    e5c4:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    e5c8:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    e5cc:	4154495f 	cmpmi	r4, pc, asr r9
    e5d0:	54434254 	strbpl	r4, [r3], #-596	@ 0xfffffdac
    e5d4:	415f3052 	cmpmi	pc, r2, asr r0	@ <UNPREDICTABLE>
    e5d8:	41455254 	cmpmi	r5, r4, asr r2
    e5dc:	5f325944 	svcpl	0x00325944
    e5e0:	206b734d 	rsbcs	r7, fp, sp, asr #6
    e5e4:	31783028 	cmncc	r8, r8, lsr #32
    e5e8:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    e5ec:	4d544900 	vldrmi.16	s9, [r4, #-0]	@ <UNPREDICTABLE>
    e5f0:	49282820 	stmdbmi	r8!, {r5, fp, sp}
    e5f4:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ e5fc <_Min_Stack_Size+0xe1fc>
    e5f8:	20657079 	rsbcs	r7, r5, r9, ror r0
    e5fc:	4920292a 	stmdbmi	r0!, {r1, r3, r5, r8, fp, sp}
    e600:	425f4d54 	subsmi	r4, pc, #84, 26	@ 0x1500
    e604:	20455341 	subcs	r5, r5, r1, asr #6
    e608:	50470029 	subpl	r0, r7, r9, lsr #32
    e60c:	505f4f49 	subspl	r4, pc, r9, asr #30
    e610:	525f4e49 	subspl	r4, pc, #1168	@ 0x490
    e614:	54455345 	strbpl	r5, [r5], #-837	@ 0xfffffcbb
    e618:	5f003020 	svcpl	0x00003020
    e61c:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    e620:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    e624:	665f6574 			@ <UNDEFINED> instruction: 0x665f6574
    e628:	616d726f 	cmnvs	sp, pc, ror #4
    e62c:	74735f74 	ldrbtvc	r5, [r3], #-3956	@ 0xfffff08c
    e630:	6f6d6672 	svcvs	0x006d6672
    e634:	285f5f6e 	ldmdacs	pc, {r1, r2, r3, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    e638:	29622c61 	stmdbcs	r2!, {r0, r5, r6, sl, fp, sp}^
    e63c:	43520020 	cmpmi	r2, #32
    e640:	50475f43 	subpl	r5, r7, r3, asr #30
    e644:	5f444f49 	svcpl	0x00444f49
    e648:	5f4b4c43 	svcpl	0x004b4c43
    e64c:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    e650:	43522820 	cmpmi	r2, #32, 16	@ 0x200000
    e654:	413e2d43 	teqmi	lr, r3, asr #26
    e658:	45324250 	ldrmi	r4, [r2, #-592]!	@ 0xfffffdb0
    e65c:	7c20524e 	sfmvc	f5, 4, [r0], #-312	@ 0xfffffec8
    e660:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    e664:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    e668:	00292935 	eoreq	r2, r9, r5, lsr r9
    e66c:	5f545744 	svcpl	0x00545744
    e670:	444c4f46 	strbmi	r4, [ip], #-3910	@ 0xfffff0ba
    e674:	5f544e43 	svcpl	0x00544e43
    e678:	444c4f46 	strbmi	r4, [ip], #-3910	@ 0xfffff0ba
    e67c:	5f544e43 	svcpl	0x00544e43
    e680:	206b734d 	rsbcs	r7, fp, sp, asr #6
    e684:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    e688:	204c5546 	subcs	r5, ip, r6, asr #10
    e68c:	564e0029 	strbpl	r0, [lr], -r9, lsr #32
    e690:	475f4349 	ldrbmi	r4, [pc, -r9, asr #6]
    e694:	63417465 	movtvs	r7, #5221	@ 0x1465
    e698:	65766974 	ldrbvs	r6, [r6, #-2420]!	@ 0xfffff68c
    e69c:	4e5f5f20 	cdpmi	15, 5, cr5, cr15, cr0, {1}
    e6a0:	5f434956 	svcpl	0x00434956
    e6a4:	41746547 	cmnmi	r4, r7, asr #10
    e6a8:	76697463 	strbtvc	r7, [r9], -r3, ror #8
    e6ac:	5f5f0065 	svcpl	0x005f0065
    e6b0:	65766168 	ldrbvs	r6, [r6, #-360]!	@ 0xfffffe98
    e6b4:	6e6f6c5f 	mcrvs	12, 3, r6, cr15, cr15, {2}
    e6b8:	20323367 	eorscs	r3, r2, r7, ror #6
    e6bc:	50530031 	subspl	r0, r3, r1, lsr r0
    e6c0:	28203249 	stmdacs	r0!, {r0, r3, r6, r9, ip, sp}
    e6c4:	49505328 	ldmdbmi	r0, {r3, r5, r8, r9, ip, lr}^
    e6c8:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    e6cc:	66654465 	strbtvs	r4, [r5], -r5, ror #8
    e6d0:	53292a20 			@ <UNDEFINED> instruction: 0x53292a20
    e6d4:	5f324950 	svcpl	0x00324950
    e6d8:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    e6dc:	74730029 	ldrbtvc	r0, [r3], #-41	@ 0xffffffd7
    e6e0:	646f7472 	strbtvs	r7, [pc], #-1138	@ e6e8 <_Min_Stack_Size+0xe2e8>
    e6e4:	74732066 	ldrbtvc	r2, [r3], #-102	@ 0xffffff9a
    e6e8:	666f7472 			@ <UNDEFINED> instruction: 0x666f7472
    e6ec:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    e6f0:	53495f43 	movtpl	r5, #40771	@ 0x9f43
    e6f4:	20305245 	eorscs	r5, r0, r5, asr #4
    e6f8:	6f76282a 	svcvs	0x0076282a
    e6fc:	6974616c 	ldmdbvs	r4!, {r2, r3, r5, r6, r8, sp, lr}^
    e700:	7520656c 	strvc	r6, [r0, #-1388]!	@ 0xfffffa94
    e704:	33746e69 	cmncc	r4, #1680	@ 0x690
    e708:	20745f32 	rsbscs	r5, r4, r2, lsr pc
    e70c:	4e28292a 	vmulmi.f16	s4, s16, s21	@ <UNPREDICTABLE>
    e710:	5f434956 	svcpl	0x00434956
    e714:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    e718:	202b205f 	eorcs	r2, fp, pc, asr r0
    e71c:	29307830 	ldmdbcs	r0!, {r4, r5, fp, ip, sp, lr}
    e720:	535f5f00 	cmppl	pc, #0, 30
    e724:	2046424d 	subcs	r4, r6, sp, asr #4
    e728:	30307830 	eorscc	r7, r0, r0, lsr r8
    e72c:	4d003038 	stcmi	0, cr3, [r0, #-224]	@ 0xffffff20
    e730:	545f5550 	ldrbpl	r5, [pc], #-1360	@ e738 <_Min_Stack_Size+0xe338>
    e734:	5f455059 	svcpl	0x00455059
    e738:	41504553 	cmpmi	r0, r3, asr r5
    e73c:	45544152 	ldrbmi	r4, [r4, #-338]	@ 0xfffffeae
    e740:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e744:	00553020 	subseq	r3, r5, r0, lsr #32
    e748:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    e74c:	4d5f544e 	cfldrdmi	mvd5, [pc, #-312]	@ e61c <_Min_Stack_Size+0xe21c>
    e750:	4f545242 	svcmi	0x00545242
    e754:	535f4357 	cmppl	pc, #1543503873	@ 0x5c000001
    e758:	45544154 	ldrbmi	r4, [r4, #-340]	@ 0xfffffeac
    e75c:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    e760:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    e764:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    e768:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ e6bc <_Min_Stack_Size+0xe2bc>
    e76c:	2d637369 	stclcs	3, cr7, [r3, #-420]!	@ 0xfffffe5c
    e770:	626d5f3e 	rsbvs	r5, sp, #62, 30	@ 0xf8
    e774:	776f7472 			@ <UNDEFINED> instruction: 0x776f7472
    e778:	74735f63 	ldrbtvc	r5, [r3], #-3939	@ 0xfffff09d
    e77c:	29657461 	stmdbcs	r5!, {r0, r5, r6, sl, ip, sp, lr}^
    e780:	43324900 	teqmi	r2, #0, 18
    e784:	3152435f 	cmpcc	r2, pc, asr r3
    e788:	414e455f 	cmpmi	lr, pc, asr r5
    e78c:	49205052 	stmdbmi	r0!, {r1, r4, r6, ip, lr}
    e790:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    e794:	455f3152 	ldrbmi	r3, [pc, #-338]	@ e64a <_Min_Stack_Size+0xe24a>
    e798:	5052414e 	subspl	r4, r2, lr, asr #2
    e79c:	6b734d5f 	blvs	1ce1d20 <_Min_Stack_Size+0x1ce1920>
    e7a0:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
    e7a4:	41425f31 	cmpmi	r2, r1, lsr pc
