NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    e7a8:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    e7ac:	69726550 	ldmdbvs	r2!, {r4, r6, r8, sl, sp, lr}^
    e7b0:	72656870 	rsbvc	r6, r5, #112, 16	@ 0x700000
    e7b4:	5f736c61 	svcpl	0x00736c61
    e7b8:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    e7bc:	30202b20 	eorcc	r2, r0, r0, lsr #22
    e7c0:	30303078 	eorscc	r3, r0, r8, ror r0
    e7c4:	30303331 	eorscc	r3, r0, r1, lsr r3
    e7c8:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
    e7cc:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
    e7d0:	5346465f 	movtpl	r4, #26207	@ 0x665f
    e7d4:	74465f52 	strbvc	r5, [r6], #-3922	@ 0xfffff0ae
    e7d8:	536e6f4e 	cmnpl	lr, #312	@ 0x138
    e7dc:	5f706f74 	svcpl	0x00706f74
    e7e0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    e7e4:	4d005533 	cfstr32mi	mvfx5, [r0, #-204]	@ 0xffffff34
    e7e8:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    e7ec:	5f524142 	svcpl	0x00524142
    e7f0:	52444441 	subpl	r4, r4, #1090519040	@ 0x41000000
    e7f4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e7f8:	00553520 	subseq	r3, r5, r0, lsr #10
    e7fc:	5f55504d 	svcpl	0x0055504d
    e800:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
    e804:	4452535f 	ldrbmi	r5, [r2], #-863	@ 0xfffffca1
    e808:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e80c:	00553820 	subseq	r3, r5, r0, lsr #16
    e810:	706f7766 	rsbvc	r7, pc, r6, ror #14
    e814:	5f286e65 	svcpl	0x00286e65
    e818:	6f6f635f 	svcvs	0x006f635f
    e81c:	2c65696b 			@ <UNDEFINED> instruction: 0x2c65696b
    e820:	6e665f5f 	mcrvs	15, 3, r5, cr6, cr15, {2}
    e824:	75662029 	strbvc	r2, [r6, #-41]!	@ 0xffffffd7
    e828:	65706f6e 	ldrbvs	r6, [r0, #-3950]!	@ 0xfffff092
    e82c:	5f5f286e 	svcpl	0x005f286e
    e830:	6b6f6f63 	blvs	1bea5c4 <_Min_Stack_Size+0x1bea1c4>
    e834:	202c6569 	eorcs	r6, ip, r9, ror #10
    e838:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    e83c:	5f5f202c 	svcpl	0x005f202c
    e840:	202c6e66 	eorcs	r6, ip, r6, ror #28
    e844:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    e848:	554e202c 	strbpl	r2, [lr, #-44]	@ 0xffffffd4
    e84c:	00294c4c 	eoreq	r4, r9, ip, asr #24
    e850:	5f495054 	svcpl	0x00495054
    e854:	4f464946 	svcmi	0x00464946
    e858:	54455f30 	strbpl	r5, [r5], #-3888	@ 0xfffff0d0
    e85c:	4d5f324d 	lfmmi	f3, 2, [pc, #-308]	@ e730 <_Min_Stack_Size+0xe330>
    e860:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    e864:	46467830 			@ <UNDEFINED> instruction: 0x46467830
    e868:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    e86c:	5054203c 	subspl	r2, r4, ip, lsr r0
    e870:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    e874:	5f304f46 	svcpl	0x00304f46
    e878:	324d5445 	subcc	r5, sp, #1157627904	@ 0x45000000
    e87c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e880:	5f5f0029 	svcpl	0x005f0029
    e884:	49474542 	stmdbmi	r7, {r1, r6, r8, sl, lr}^
    e888:	45445f4e 	strbmi	r5, [r4, #-3918]	@ 0xfffff0b2
    e88c:	20534c43 	subscs	r4, r3, r3, asr #24
    e890:	42435300 	submi	r5, r3, #0, 6
    e894:	5346435f 	movtpl	r4, #25439	@ 0x635f
    e898:	54535f52 	ldrbpl	r5, [r3], #-3922	@ 0xfffff0ae
    e89c:	5252454b 	subspl	r4, r2, #314572800	@ 0x12c00000
    e8a0:	6b734d5f 	blvs	1ce1e24 <_Min_Stack_Size+0x1ce1a24>
    e8a4:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    e8a8:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    e8ac:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    e8b0:	5346435f 	movtpl	r4, #25439	@ 0x635f
    e8b4:	54535f52 	ldrbpl	r5, [r3], #-3922	@ 0xfffff0ae
    e8b8:	5252454b 	subspl	r4, r2, #314572800	@ 0x12c00000
    e8bc:	736f505f 	cmnvc	pc, #95	@ 0x5f
    e8c0:	43520029 	cmpmi	r2, #41	@ 0x29
    e8c4:	50475f43 	subpl	r5, r7, r3, asr #30
    e8c8:	5f414f49 	svcpl	0x00414f49
    e8cc:	5f4b4c43 	svcpl	0x004b4c43
    e8d0:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    e8d4:	43522820 	cmpmi	r2, #32, 16	@ 0x200000
    e8d8:	413e2d43 	teqmi	lr, r3, asr #26
    e8dc:	45324250 	ldrmi	r4, [r2, #-592]!	@ 0xfffffdb0
    e8e0:	7c20524e 	sfmvc	f5, 4, [r0], #-312	@ 0xfffffec8
    e8e4:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    e8e8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    e8ec:	00292932 	eoreq	r2, r9, r2, lsr r9
    e8f0:	4f495047 	svcmi	0x00495047
    e8f4:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
    e8f8:	5445535f 	strbpl	r5, [r5], #-863	@ 0xfffffca1
    e8fc:	5f003120 	svcpl	0x00003120
    e900:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    e904:	4d535f54 	ldclmi	15, cr5, [r3, #-336]	@ 0xfffffeb0
    e908:	5f4c4c41 	svcpl	0x004c4c41
    e90c:	43454843 	movtmi	r4, #22595	@ 0x5843
    e910:	4e495f4b 	cdpmi	15, 4, cr5, cr9, cr11, {2}
    e914:	70285449 	eorvc	r5, r8, r9, asr #8
    e918:	20297274 	eorcs	r7, r9, r4, ror r2
    e91c:	43435200 	movtmi	r5, #12800	@ 0x3200
    e920:	4153555f 	cmpmi	r3, pc, asr r5
    e924:	5f335452 	svcpl	0x00335452
    e928:	5f4b4c43 	svcpl	0x004b4c43
    e92c:	29284e45 	stmdbcs	r8!, {r0, r2, r6, r9, sl, fp, lr}
    e930:	43522820 	cmpmi	r2, #32, 16	@ 0x200000
    e934:	413e2d43 	teqmi	lr, r3, asr #26
    e938:	45314250 	ldrmi	r4, [r1, #-592]!	@ 0xfffffdb0
    e93c:	7c20524e 	sfmvc	f5, 4, [r0], #-312	@ 0xfffffec8
    e940:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    e944:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    e948:	29293831 	stmdbcs	r9!, {r0, r4, r5, fp, ip, sp}
    e94c:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
    e950:	495f3349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, ip, sp}^	@ <UNPREDICTABLE>
    e954:	39205152 	stmdbcc	r0!, {r1, r4, r6, r8, ip, lr}
    e958:	755f5f00 	ldrbvc	r5, [pc, #-3840]	@ da60 <_Min_Stack_Size+0xd660>
    e95c:	6573756e 	ldrbvs	r7, [r3, #-1390]!	@ 0xfffffa92
    e960:	5f5f2064 	svcpl	0x005f2064
    e964:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    e968:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    e96c:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    e970:	755f5f28 	ldrbvc	r5, [pc, #-3880]	@ da50 <_Min_Stack_Size+0xd650>
    e974:	6573756e 	ldrbvs	r7, [r3, #-1390]!	@ 0xfffffa92
    e978:	295f5f64 	ldmdbcs	pc, {r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    e97c:	52410029 	subpl	r0, r1, #41	@ 0x29
    e980:	504d5f4d 	subpl	r5, sp, sp, asr #30
    e984:	45525f55 	ldrbmi	r5, [r2, #-3925]	@ 0xfffff0ab
    e988:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    e98c:	5a49535f 	bpl	1263710 <_Min_Stack_Size+0x1263310>
    e990:	32315f45 	eorscc	r5, r1, #276	@ 0x114
    e994:	28204238 	stmdacs	r0!, {r3, r4, r5, r9, lr}
    e998:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    e99c:	745f3874 	ldrbvc	r3, [pc], #-2164	@ e9a4 <_Min_Stack_Size+0xe5a4>
    e9a0:	30783029 	rsbscc	r3, r8, r9, lsr #32
    e9a4:	00295536 	eoreq	r5, r9, r6, lsr r5
    e9a8:	6f6c5f5f 	svcvs	0x006c5f5f
    e9ac:	5f736b63 	svcpl	0x00736b63
    e9b0:	6c637865 	stclvs	8, cr7, [r3], #-404	@ 0xfffffe6c
    e9b4:	76697375 			@ <UNDEFINED> instruction: 0x76697375
    e9b8:	2e2e2865 	cdpcs	8, 2, cr2, cr14, cr5, {3}
    e9bc:	5f20292e 	svcpl	0x0020292e
    e9c0:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    e9c4:	6e615f6b 	cdpvs	15, 6, cr5, cr1, cr11, {3}
    e9c8:	61746f6e 	cmnvs	r4, lr, ror #30
    e9cc:	65286574 	strvs	r6, [r8, #-1396]!	@ 0xfffffa8c
    e9d0:	756c6378 	strbvc	r6, [ip, #-888]!	@ 0xfffffc88
    e9d4:	65766973 	ldrbvs	r6, [r6, #-2419]!	@ 0xfffff68d
    e9d8:	636f6c5f 	cmnvs	pc, #24320	@ 0x5f00
    e9dc:	75665f6b 	strbvc	r5, [r6, #-3947]!	@ 0xfffff095
    e9e0:	6974636e 	ldmdbvs	r4!, {r1, r2, r3, r5, r6, r8, r9, sp, lr}^
    e9e4:	5f286e6f 	svcpl	0x00286e6f
    e9e8:	5f41565f 	svcpl	0x0041565f
    e9ec:	53475241 	movtpl	r5, #29249	@ 0x7241
    e9f0:	29295f5f 	stmdbcs	r9!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    e9f4:	726f4300 	rsbvc	r4, pc, #0, 6
    e9f8:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    e9fc:	445f6775 	ldrbmi	r6, [pc], #-1909	@ ea04 <_Min_Stack_Size+0xe604>
    ea00:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    ea04:	445f435f 	ldrbmi	r4, [pc], #-863	@ ea0c <_Min_Stack_Size+0xe60c>
    ea08:	47554245 	ldrbmi	r4, [r5, -r5, asr #4]
    ea0c:	505f4e45 	subspl	r4, pc, r5, asr #28
    ea10:	3020736f 	eorcc	r7, r0, pc, ror #6
    ea14:	32490055 	subcc	r0, r9, #85	@ 0x55
    ea18:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    ea1c:	4d535f31 	ldclmi	15, cr5, [r3, #-196]	@ 0xffffff3c
    ea20:	50595442 	subspl	r5, r9, r2, asr #8
    ea24:	6f505f45 	svcvs	0x00505f45
    ea28:	33282073 			@ <UNDEFINED> instruction: 0x33282073
    ea2c:	54002955 	strpl	r2, [r0], #-2389	@ 0xfffff6ab
    ea30:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    ea34:	304f4649 	subcc	r4, pc, r9, asr #12
    ea38:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    ea3c:	5654415f 			@ <UNDEFINED> instruction: 0x5654415f
    ea40:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    ea44:	6b734d5f 	blvs	1ce1fc8 <_Min_Stack_Size+0x1ce1bc8>
    ea48:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    ea4c:	204c5531 	subcs	r5, ip, r1, lsr r5
    ea50:	54203c3c 	strtpl	r3, [r0], #-3132	@ 0xfffff3c4
    ea54:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    ea58:	304f4649 	subcc	r4, pc, r9, asr #12
    ea5c:	4d54495f 	vldrmi.16	s9, [r4, #-190]	@ 0xffffff42	@ <UNPREDICTABLE>
    ea60:	5654415f 			@ <UNDEFINED> instruction: 0x5654415f
    ea64:	44494c41 	strbmi	r4, [r9], #-3137	@ 0xfffff3bf
    ea68:	736f505f 	cmnvc	pc, #95	@ 0x5f
    ea6c:	53550029 	cmppl	r5, #41	@ 0x29
    ea70:	31545241 	cmpcc	r4, r1, asr #4
    ea74:	55282820 	strpl	r2, [r8, #-2080]!	@ 0xfffff7e0
    ea78:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    ea7c:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    ea80:	66654465 	strbtvs	r4, [r5], -r5, ror #8
    ea84:	55292a20 	strpl	r2, [r9, #-2592]!	@ 0xfffff5e0
    ea88:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    ea8c:	41425f31 	cmpmi	r2, r1, lsr pc
    ea90:	00294553 	eoreq	r4, r9, r3, asr r5
    ea94:	5f424353 	svcpl	0x00424353
    ea98:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    ea9c:	4d454d5f 	stclmi	13, cr4, [r5, #-380]	@ 0xfffffe84
    eaa0:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    eaa4:	5f525354 	svcpl	0x00525354
    eaa8:	206b734d 	rsbcs	r7, fp, sp, asr #6
    eaac:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    eab0:	204c5546 	subcs	r5, ip, r6, asr #10
    eab4:	32490029 	subcc	r0, r9, #41	@ 0x29
    eab8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    eabc:	4d445f32 	stclmi	15, cr5, [r4, #-200]	@ 0xffffff38
    eac0:	204e4541 	subcs	r4, lr, r1, asr #10
    eac4:	5f433249 	svcpl	0x00433249
    eac8:	5f325243 	svcpl	0x00325243
    eacc:	45414d44 	strbmi	r4, [r1, #-3396]	@ 0xfffff2bc
    ead0:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    ead4:	4e49006b 	cdpmi	0, 4, cr0, cr9, cr11, {3}
    ead8:	41465f54 	cmpmi	r6, r4, asr pc
    eadc:	5f385453 	svcpl	0x00385453
    eae0:	204e494d 	subcs	r4, lr, sp, asr #18
    eae4:	5f5f2d28 	svcpl	0x005f2d28
    eae8:	5f544e49 	svcpl	0x00544e49
    eaec:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    eaf0:	414d5f38 	cmpmi	sp, r8, lsr pc
    eaf4:	205f5f58 	subscs	r5, pc, r8, asr pc	@ <UNPREDICTABLE>
    eaf8:	2931202d 	ldmdbcs	r1!, {r0, r2, r3, r5, sp}
    eafc:	726f4300 	rsbvc	r4, pc, #0, 6
    eb00:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    eb04:	445f6775 	ldrbmi	r6, [pc], #-1909	@ eb0c <_Min_Stack_Size+0xe70c>
    eb08:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    eb0c:	4e4f4d5f 	mcrmi	13, 2, r4, cr15, cr15, {2}
    eb10:	4554535f 	ldrbmi	r5, [r4, #-863]	@ 0xfffffca1
    eb14:	6f505f50 	svcvs	0x00505f50
    eb18:	38312073 	ldmdacc	r1!, {r0, r1, r4, r5, r6, sp}
    eb1c:	43530055 	cmpmi	r3, #85	@ 0x55
    eb20:	41425f53 	cmpmi	r2, r3, asr pc
    eb24:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    eb28:	30457830 	subcc	r7, r5, r0, lsr r8
    eb2c:	30453030 	subcc	r3, r5, r0, lsr r0
    eb30:	4c553030 	mrrcmi	0, 3, r3, r5, cr0
    eb34:	43530029 	cmpmi	r3, #41	@ 0x29
    eb38:	48535f42 	ldmdami	r3, {r1, r6, r8, r9, sl, fp, ip, lr}^
    eb3c:	5f525343 	svcpl	0x00525343
    eb40:	464d454d 	strbmi	r4, [sp], -sp, asr #10
    eb44:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    eb48:	444e4550 	strbmi	r4, [lr], #-1360	@ 0xfffffab0
    eb4c:	505f4445 	subspl	r4, pc, r5, asr #8
    eb50:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    eb54:	44005533 	strmi	r5, [r0], #-1331	@ 0xfffffacd
    eb58:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    eb5c:	5f4c5254 	svcpl	0x004c5254
    eb60:	54534f50 	ldrbpl	r4, [r3], #-3920	@ 0xfffff0b0
    eb64:	53455250 	movtpl	r5, #21072	@ 0x5250
    eb68:	4d5f5445 	cfldrdmi	mvd5, [pc, #-276]	@ ea5c <_Min_Stack_Size+0xe65c>
    eb6c:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    eb70:	55467830 	strbpl	r7, [r6, #-2096]	@ 0xfffff7d0
    eb74:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    eb78:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
    eb7c:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
    eb80:	4f505f4c 	svcmi	0x00505f4c
    eb84:	52505453 	subspl	r5, r0, #1392508928	@ 0x53000000
    eb88:	54455345 	strbpl	r5, [r5], #-837	@ 0xfffffcbb
    eb8c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    eb90:	5f5f0029 	svcpl	0x005f0029
    eb94:	746e695f 	strbtvc	r6, [lr], #-2399	@ 0xfffff6a1
    eb98:	745f3233 	ldrbvc	r3, [pc], #-563	@ eba0 <_Min_Stack_Size+0xe7a0>
    eb9c:	6665645f 			@ <UNDEFINED> instruction: 0x6665645f
    eba0:	64656e69 	strbtvs	r6, [r5], #-3689	@ 0xfffff197
    eba4:	47003120 	strmi	r3, [r0, -r0, lsr #2]
    eba8:	414f4950 	cmpmi	pc, r0, asr r9	@ <UNPREDICTABLE>
    ebac:	5341425f 	movtpl	r4, #4703	@ 0x125f
    ebb0:	50282045 	eorpl	r2, r8, r5, asr #32
    ebb4:	70697265 	rsbvc	r7, r9, r5, ror #4
    ebb8:	61726568 	cmnvs	r2, r8, ror #10
    ebbc:	425f736c 	subsmi	r7, pc, #108, 6	@ 0xb0000001
    ebc0:	20455341 	subcs	r5, r5, r1, asr #6
    ebc4:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    ebc8:	31303030 	teqcc	r0, r0, lsr r0
    ebcc:	30303830 	eorscc	r3, r0, r0, lsr r8
    ebd0:	00294c55 	eoreq	r4, r9, r5, asr ip
    ebd4:	72616863 	rsbvc	r6, r1, #6488064	@ 0x630000
    ebd8:	00302b20 	eorseq	r2, r0, r0, lsr #22
    ebdc:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    ebe0:	5f323354 	svcpl	0x00323354
    ebe4:	45445f54 	strbmi	r5, [r4, #-3924]	@ 0xfffff0ac
    ebe8:	52414c43 	subpl	r4, r1, #17152	@ 0x4300
    ebec:	00204445 	eoreq	r4, r0, r5, asr #8
    ebf0:	6f6c665f 	svcvs	0x006c665f
    ebf4:	69666b63 	stmdbvs	r6!, {r0, r1, r5, r6, r8, r9, fp, sp, lr}^
    ebf8:	6628656c 	strtvs	r6, [r8], -ip, ror #10
    ebfc:	28202970 	stmdacs	r0!, {r4, r5, r6, r8, fp, sp}
    ec00:	70662828 	rsbvc	r2, r6, r8, lsr #16
    ec04:	5f3e2d29 	svcpl	0x003e2d29
    ec08:	67616c66 	strbvs	r6, [r1, -r6, ror #24]!
    ec0c:	20262073 	eorcs	r2, r6, r3, ror r0
    ec10:	53535f5f 	cmppl	r3, #380	@ 0x17c
    ec14:	20295254 	eorcs	r5, r9, r4, asr r2
    ec18:	2030203f 	eorscs	r2, r0, pc, lsr r0
    ec1c:	5f5f203a 	svcpl	0x005f203a
    ec20:	6b636f6c 	blvs	18ea9d8 <_Min_Stack_Size+0x18ea5d8>
    ec24:	7163615f 	cmnvc	r3, pc, asr r1
    ec28:	65726975 	ldrbvs	r6, [r2, #-2421]!	@ 0xfffff68b
    ec2c:	6365725f 	cmnvs	r5, #-268435451	@ 0xf0000005
    ec30:	69737275 	ldmdbvs	r3!, {r0, r2, r4, r5, r6, r9, ip, sp, lr}^
    ec34:	28286576 	stmdacs	r8!, {r1, r2, r4, r5, r6, r8, sl, sp, lr}
    ec38:	2d297066 	stccs	0, cr7, [r9, #-408]!	@ 0xfffffe68
    ec3c:	6f6c5f3e 	svcvs	0x006c5f3e
    ec40:	29296b63 	stmdbcs	r9!, {r0, r1, r5, r6, r8, r9, fp, sp, lr}
    ec44:	41525300 	cmpmi	r2, r0, lsl #6
    ec48:	41425f4d 	cmpmi	r2, sp, asr #30
    ec4c:	30204553 	eorcc	r4, r0, r3, asr r5
    ec50:	30303278 	eorscc	r3, r0, r8, ror r2
    ec54:	30303030 	eorscc	r3, r0, r0, lsr r0
    ec58:	004c5530 	subeq	r5, ip, r0, lsr r5
    ec5c:	636f6c42 	cmnvs	pc, #16896	@ 0x4200
    ec60:	676e696b 	strbvs	r6, [lr, -fp, ror #18]!
    ec64:	43324900 	teqmi	r2, #0, 18
    ec68:	3152435f 	cmpcc	r2, pc, asr r3
    ec6c:	454c415f 	strbmi	r4, [ip, #-351]	@ 0xfffffea1
    ec70:	505f5452 	subspl	r5, pc, r2, asr r4	@ <UNPREDICTABLE>
    ec74:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    ec78:	29553331 	ldmdbcs	r5, {r0, r4, r5, r8, r9, ip, sp}^
    ec7c:	54415f00 	strbpl	r5, [r1], #-3840	@ 0xfffff100
    ec80:	454c4946 	strbmi	r4, [ip, #-2374]	@ 0xfffff6ba
    ec84:	554f535f 	strbpl	r5, [pc, #-863]	@ e92d <_Min_Stack_Size+0xe52d>
    ec88:	00454352 	subeq	r4, r5, r2, asr r3
    ec8c:	4f435f5f 	svcmi	0x00435f5f
    ec90:	58455452 	stmdapl	r5, {r1, r4, r6, sl, ip, lr}^
    ec94:	28204d5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}
    ec98:	00295533 	eoreq	r5, r9, r3, lsr r5
    ec9c:	78655f5f 	stmdavc	r5!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    eca0:	74726f70 	ldrbtvc	r6, [r2], #-3952	@ 0xfffff090
    eca4:	5f206465 	svcpl	0x00206465
    eca8:	7474615f 	ldrbtvc	r6, [r4], #-351	@ 0xfffffea1
    ecac:	75626972 	strbvc	r6, [r2, #-2418]!	@ 0xfffff68e
    ecb0:	5f5f6574 	svcpl	0x005f6574
    ecb4:	5f5f2828 	svcpl	0x005f2828
    ecb8:	69736976 	ldmdbvs	r3!, {r1, r2, r4, r5, r6, r8, fp, sp, lr}^
    ecbc:	696c6962 	stmdbvs	ip!, {r1, r5, r6, r8, fp, sp, lr}^
    ecc0:	5f5f7974 	svcpl	0x005f7974
    ecc4:	65642228 	strbvs	r2, [r4, #-552]!	@ 0xfffffdd8
    ecc8:	6c756166 	ldfvse	f6, [r5], #-408	@ 0xfffffe68
    eccc:	29292274 	stmdbcs	r9!, {r2, r4, r5, r6, r9, sp}
    ecd0:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    ecd4:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
    ecd8:	505f4c52 	subspl	r4, pc, r2, asr ip	@ <UNPREDICTABLE>
    ecdc:	4d415343 	stclmi	3, cr5, [r1, #-268]	@ 0xfffffef4
    ece0:	4e454c50 	mcrmi	12, 2, r4, cr5, cr0, {2}
    ece4:	6f505f41 	svcvs	0x00505f41
    ece8:	32312073 	eorscc	r2, r1, #115	@ 0x73
    ecec:	5f5f0055 	svcpl	0x005f0055
    ecf0:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    ecf4:	4c494241 	sfmmi	f4, 2, [r9], {65}	@ 0x41
    ecf8:	5f595449 	svcpl	0x00595449
    ecfc:	47415250 	smlsldmi	r5, r1, r0, r2
    ed00:	505f414d 	subspl	r4, pc, sp, asr #2
    ed04:	20485355 	subcs	r5, r8, r5, asr r3
    ed08:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
    ed0c:	524e525f 	subpl	r5, lr, #-268435451	@ 0xf0000005
    ed10:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    ed14:	5f4e4f49 	svcpl	0x004e4f49
    ed18:	20736f50 	rsbscs	r6, r3, r0, asr pc
    ed1c:	53005530 	movwpl	r5, #1328	@ 0x530
    ed20:	28204243 	stmdacs	r0!, {r0, r1, r6, r9, lr}
    ed24:	42435328 	submi	r5, r3, #40, 6	@ 0xa0000000
    ed28:	7079545f 	rsbsvc	r5, r9, pc, asr r4
    ed2c:	292a2065 	stmdbcs	sl!, {r0, r2, r5, r6, sp}
    ed30:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
    ed34:	5341425f 	movtpl	r4, #4703	@ 0x125f
    ed38:	00292045 	eoreq	r2, r9, r5, asr #32
    ed3c:	5f424353 	svcpl	0x00424353
    ed40:	53434853 	movtpl	r4, #14419	@ 0x3853
    ed44:	56535f52 	usaxpl	r5, r3, r2
    ed48:	4c4c4143 	stfmie	f4, [ip], {67}	@ 0x43
    ed4c:	5f544341 	svcpl	0x00544341
    ed50:	206b734d 	rsbcs	r7, fp, sp, asr #6
    ed54:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    ed58:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ed5c:	5f424353 	svcpl	0x00424353
    ed60:	53434853 	movtpl	r4, #14419	@ 0x3853
    ed64:	56535f52 	usaxpl	r5, r3, r2
    ed68:	4c4c4143 	stfmie	f4, [ip], {67}	@ 0x43
    ed6c:	5f544341 	svcpl	0x00544341
    ed70:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    ed74:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    ed78:	41454c5f 	cmpmi	r5, pc, asr ip
    ed7c:	34365453 	ldrtcc	r5, [r6], #-1107	@ 0xfffffbad
    ed80:	4e494d5f 	mcrmi	13, 2, r4, cr9, cr15, {2}
    ed84:	5f2d2820 	svcpl	0x002d2820
    ed88:	544e495f 	strbpl	r4, [lr], #-2399	@ 0xfffff6a1
    ed8c:	41454c5f 	cmpmi	r5, pc, asr ip
    ed90:	34365453 	ldrtcc	r5, [r6], #-1107	@ 0xfffffbad
    ed94:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    ed98:	2d205f5f 	stccs	15, cr5, [r0, #-380]!	@ 0xfffffe84
    ed9c:	00293120 	eoreq	r3, r9, r0, lsr #2
    eda0:	5f424353 	svcpl	0x00424353
    eda4:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    eda8:	564e495f 			@ <UNDEFINED> instruction: 0x564e495f
    edac:	505f4350 	subspl	r4, pc, r0, asr r3	@ <UNPREDICTABLE>
    edb0:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    edb4:	5f424353 	svcpl	0x00424353
    edb8:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    edbc:	4753555f 			@ <UNDEFINED> instruction: 0x4753555f
    edc0:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    edc4:	5f525354 	svcpl	0x00525354
    edc8:	20736f50 	rsbscs	r6, r3, r0, asr pc
    edcc:	5532202b 	ldrpl	r2, [r2, #-43]!	@ 0xffffffd5
    edd0:	52410029 	subpl	r0, r1, #41	@ 0x29
    edd4:	504d5f4d 	subpl	r5, sp, sp, asr #30
    edd8:	50415f55 	subpl	r5, r1, r5, asr pc
    eddc:	4e4f4e5f 	mcrmi	14, 2, r4, cr15, cr15, {2}
    ede0:	55302045 	ldrpl	r2, [r0, #-69]!	@ 0xffffffbb
    ede4:	47495300 	strbmi	r5, [r9, -r0, lsl #6]
    ede8:	4f54415f 	svcmi	0x0054415f
    edec:	5f43494d 	svcpl	0x0043494d
    edf0:	2058414d 	subscs	r4, r8, sp, asr #2
    edf4:	535f5f28 	cmppl	pc, #40, 30	@ 0xa0
    edf8:	4e494454 	mcrmi	4, 2, r4, cr9, cr4, {2}
    edfc:	58455f54 	stmdapl	r5, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    ee00:	4e492850 	mcrmi	8, 2, r2, cr9, cr0, {2}
    ee04:	414d5f54 	cmpmi	sp, r4, asr pc
    ee08:	00292958 	eoreq	r2, r9, r8, asr r9
    ee0c:	5f424353 	svcpl	0x00424353
    ee10:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    ee14:	5445525f 	strbpl	r5, [r5], #-607	@ 0xfffffda1
    ee18:	41424f54 	cmpmi	r2, r4, asr pc
    ee1c:	4d5f4553 	cfldr64mi	mvdx4, [pc, #-332]	@ ecd8 <_Min_Stack_Size+0xe8d8>
    ee20:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    ee24:	204c5531 	subcs	r5, ip, r1, lsr r5
    ee28:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    ee2c:	495f4243 	ldmdbmi	pc, {r0, r1, r6, r9, lr}^	@ <UNPREDICTABLE>
    ee30:	5f525343 	svcpl	0x00525343
    ee34:	54544552 	ldrbpl	r4, [r4], #-1362	@ 0xfffffaae
    ee38:	5341424f 	movtpl	r4, #4687	@ 0x124f
    ee3c:	6f505f45 	svcvs	0x00505f45
    ee40:	5f002973 	svcpl	0x00002973
    ee44:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    ee48:	424d5f54 	submi	r5, sp, #84, 30	@ 0x150
    ee4c:	5f4e454c 	svcpl	0x004e454c
    ee50:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
    ee54:	74702845 	ldrbtvc	r2, [r0], #-2117	@ 0xfffff7bb
    ee58:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    ee5c:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    ee60:	5f3e2d29 	svcpl	0x003e2d29
    ee64:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    ee68:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ edbc <_Min_Stack_Size+0xe9bc>
    ee6c:	6e656c62 	cdpvs	12, 6, cr6, cr5, cr2, {3}
    ee70:	6174735f 	cmnvs	r4, pc, asr r3
    ee74:	00296574 	eoreq	r6, r9, r4, ror r5
    ee78:	43435f5f 	movtmi	r5, #16223	@ 0x3f5f
    ee7c:	5055535f 	subspl	r5, r5, pc, asr r3
    ee80:	54524f50 	ldrbpl	r4, [r2], #-3920	@ 0xfffff0b0
    ee84:	59445f53 	stmdbpl	r4, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    ee88:	494d414e 	stmdbmi	sp, {r1, r2, r3, r6, r8, lr}^
    ee8c:	52415f43 	subpl	r5, r1, #268	@ 0x10c
    ee90:	5f594152 	svcpl	0x00594152
    ee94:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    ee98:	41003120 	tstmi	r0, r0, lsr #2
    ee9c:	5f525350 	svcpl	0x00525350
    eea0:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
    eea4:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    eea8:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    eeac:	5041203c 	subpl	r2, r1, ip, lsr r0
    eeb0:	4e5f5253 	mrcmi	2, 2, r5, cr15, cr3, {2}
    eeb4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    eeb8:	50470029 	subpl	r0, r7, r9, lsr #32
    eebc:	505f4f49 	subspl	r4, pc, r9, asr #30
    eec0:	415f4e49 	cmpmi	pc, r9, asr #28
    eec4:	28206c6c 	stmdacs	r0!, {r2, r3, r5, r6, sl, fp, sp, lr}
    eec8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
    eecc:	5f363174 	svcpl	0x00363174
    eed0:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    eed4:	46464646 	strbmi	r4, [r6], -r6, asr #12
    eed8:	5f5f0029 	svcpl	0x005f0029
    eedc:	43415453 	movtmi	r5, #5203	@ 0x1453
    eee0:	494c5f4b 	stmdbmi	ip, {r0, r1, r3, r6, r8, r9, sl, fp, ip, lr}^
    eee4:	2054494d 	subscs	r4, r4, sp, asr #18
    eee8:	74535f5f 	ldrbvc	r5, [r3], #-3935	@ 0xfffff0a1
    eeec:	4c6b6361 	stclmi	3, cr6, [fp], #-388	@ 0xfffffe7c
    eef0:	74696d69 	strbtvc	r6, [r9], #-3433	@ 0xfffff297
