NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    eef4:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    eef8:	524f504d 	subpl	r5, pc, #77	@ 0x4d
    eefc:	53002054 	movwpl	r2, #84	@ 0x54
    ef00:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
    ef04:	5f525346 	svcpl	0x00525346
    ef08:	46535542 	ldrbmi	r5, [r3], -r2, asr #10
    ef0c:	544c5541 	strbpl	r5, [ip], #-1345	@ 0xfffffabf
    ef10:	505f5253 	subspl	r5, pc, r3, asr r2	@ <UNPREDICTABLE>
    ef14:	3820736f 	stmdacc	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    ef18:	505f0055 	subspl	r0, pc, r5, asr r0	@ <UNPREDICTABLE>
    ef1c:	5849534f 	stmdapl	r9, {r0, r1, r2, r3, r6, r8, r9, ip, lr}^
    ef20:	554f535f 	strbpl	r5, [pc, #-863]	@ ebc9 <_Min_Stack_Size+0xe7c9>
    ef24:	20454352 	subcs	r4, r5, r2, asr r3
    ef28:	50540031 	subspl	r0, r4, r1, lsr r0
    ef2c:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
    ef30:	5f304f46 	svcpl	0x00304f46
    ef34:	5f4d5449 	svcpl	0x004d5449
    ef38:	65747962 	ldrbvs	r7, [r4, #-2402]!	@ 0xfffff69e
    ef3c:	6e756f63 	cdpvs	15, 7, cr6, cr5, cr3, {3}
    ef40:	734d5f74 	movtvc	r5, #57204	@ 0xdf74
    ef44:	3028206b 	eorcc	r2, r8, fp, rrx
    ef48:	4c553378 	mrrcmi	3, 7, r3, r5, cr8
    ef4c:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ef50:	5f495054 	svcpl	0x00495054
    ef54:	4f464946 	svcmi	0x00464946
    ef58:	54495f30 	strbpl	r5, [r9], #-3888	@ 0xfffff0d0
    ef5c:	79625f4d 	stmdbvc	r2!, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    ef60:	6f636574 	svcvs	0x00636574
    ef64:	5f746e75 	svcpl	0x00746e75
    ef68:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    ef6c:	43324900 	teqmi	r2, #0, 18
    ef70:	3152435f 	cmpcc	r2, pc, asr r3
    ef74:	454c415f 	strbmi	r4, [ip, #-351]	@ 0xfffffea1
    ef78:	49205452 	stmdbmi	r0!, {r1, r4, r6, sl, ip, lr}
    ef7c:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    ef80:	415f3152 	cmpmi	pc, r2, asr r1	@ <UNPREDICTABLE>
    ef84:	5452454c 	ldrbpl	r4, [r2], #-1356	@ 0xfffffab4
    ef88:	6b734d5f 	blvs	1ce250c <_Min_Stack_Size+0x1ce210c>
    ef8c:	4d524100 	ldfmie	f4, [r2, #-0]
    ef90:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    ef94:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    ef98:	5f4e4f49 	svcpl	0x004e4f49
    ef9c:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
    efa0:	424b385f 	submi	r3, fp, #6225920	@ 0x5f0000
    efa4:	75282820 	strvc	r2, [r8, #-2080]!	@ 0xfffff7e0
    efa8:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
    efac:	3029745f 	eorcc	r7, r9, pc, asr r4
    efb0:	55433078 	strbpl	r3, [r3, #-120]	@ 0xffffff88
    efb4:	54490029 	strbpl	r0, [r9], #-41	@ 0xffffffd7
    efb8:	43545f4d 	cmpmi	r4, #308	@ 0x134
    efbc:	53545f52 	cmppl	r4, #328	@ 0x148
    efc0:	53455250 	movtpl	r5, #21072	@ 0x5250
    efc4:	454c4143 	strbmi	r4, [ip, #-323]	@ 0xfffffebd
    efc8:	6b734d5f 	blvs	1ce254c <_Min_Stack_Size+0x1ce214c>
    efcc:	55332820 	ldrpl	r2, [r3, #-2080]!	@ 0xfffff7e0
    efd0:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    efd4:	4d544920 	vldrmi.16	s9, [r4, #-64]	@ 0xffffffc0	@ <UNPREDICTABLE>
    efd8:	5243545f 	subpl	r5, r3, #1593835520	@ 0x5f000000
    efdc:	5053545f 	subspl	r5, r3, pc, asr r4
    efe0:	43534552 	cmpmi	r3, #343932928	@ 0x14800000
    efe4:	5f454c41 	svcpl	0x00454c41
    efe8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    efec:	42435300 	submi	r5, r3, #0, 6
    eff0:	5343495f 	movtpl	r4, #14687	@ 0x395f
    eff4:	45505f52 	ldrbmi	r5, [r0, #-3922]	@ 0xfffff0ae
    eff8:	5653444e 	ldrbpl	r4, [r3], -lr, asr #8
    effc:	5f544553 	svcpl	0x00544553
    f000:	206b734d 	rsbcs	r7, fp, sp, asr #6
    f004:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    f008:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    f00c:	5f424353 	svcpl	0x00424353
    f010:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    f014:	4e45505f 	mcrmi	0, 2, r5, cr5, cr15, {2}
    f018:	53565344 	cmppl	r6, #68, 6	@ 0x10000001
    f01c:	505f5445 	subspl	r5, pc, r5, asr #8
    f020:	0029736f 	eoreq	r7, r9, pc, ror #6
    f024:	6c6f6f62 	stclvs	15, cr6, [pc], #-392	@ eea4 <_Min_Stack_Size+0xeaa4>
    f028:	6f425f20 	svcvs	0x00425f20
    f02c:	5f006c6f 	svcpl	0x00006c6f
    f030:	504e535f 	subpl	r5, lr, pc, asr r3
    f034:	78302054 	ldmdavc	r0!, {r2, r4, r6, sp}
    f038:	30303830 	eorscc	r3, r0, r0, lsr r8
    f03c:	74656700 	strbtvc	r6, [r5], #-1792	@ 0xfffff900
    f040:	72616863 	rsbvc	r6, r1, #6488064	@ 0x630000
    f044:	6c6e755f 	cfstr64vs	mvdx7, [lr], #-380	@ 0xfffffe84
    f048:	656b636f 	strbvs	r6, [fp, #-879]!	@ 0xfffffc91
    f04c:	20292864 	eorcs	r2, r9, r4, ror #16
    f050:	7465675f 	strbtvc	r6, [r5], #-1887	@ 0xfffff8a1
    f054:	72616863 	rsbvc	r6, r1, #6488064	@ 0x630000
    f058:	6c6e755f 	cfstr64vs	mvdx7, [lr], #-380	@ 0xfffffe84
    f05c:	656b636f 	strbvs	r6, [fp, #-879]!	@ 0xfffffc91
    f060:	00292864 	eoreq	r2, r9, r4, ror #16
    f064:	5f433249 	svcpl	0x00433249
    f068:	5f315253 	svcpl	0x00315253
    f06c:	504f5453 	subpl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
    f070:	32492046 	subcc	r2, r9, #70	@ 0x46
    f074:	52535f43 	subspl	r5, r3, #268	@ 0x10c
    f078:	54535f31 	ldrbpl	r5, [r3], #-3889	@ 0xfffff0cf
    f07c:	5f46504f 	svcpl	0x0046504f
    f080:	006b734d 	rsbeq	r7, fp, sp, asr #6
    f084:	4e414e5f 	mcrmi	14, 2, r4, cr1, cr15, {2}
    f088:	4f465f4f 	svcmi	0x00465f4f
    f08c:	54414d52 	strbpl	r4, [r1], #-3410	@ 0xfffff2ae
    f090:	5f444554 	svcpl	0x00444554
    f094:	31204f49 			@ <UNDEFINED> instruction: 0x31204f49
    f098:	4f4c5f00 	svcmi	0x004c5f00
    f09c:	445f474e 	ldrbmi	r4, [pc], #-1870	@ f0a4 <_Min_Stack_Size+0xeca4>
    f0a0:	4c42554f 	cfstr64mi	mvdx5, [r2], {79}	@ 0x4f
    f0a4:	6f6c2045 	svcvs	0x006c2045
    f0a8:	6420676e 	strtvs	r6, [r0], #-1902	@ 0xfffff892
    f0ac:	6c62756f 	cfstr64vs	mvdx7, [r2], #-444	@ 0xfffffe44
    f0b0:	5f5f0065 	svcpl	0x005f0065
    f0b4:	64657375 	strbtvs	r7, [r5], #-885	@ 0xfffffc8b
    f0b8:	615f5f20 	cmpvs	pc, r0, lsr #30
    f0bc:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
    f0c0:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
    f0c4:	28285f5f 	stmdacs	r8!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
    f0c8:	73755f5f 	cmnvc	r5, #380	@ 0x17c
    f0cc:	5f5f6465 	svcpl	0x005f6465
    f0d0:	41002929 	tstmi	r0, r9, lsr #18
    f0d4:	5f525350 	svcpl	0x00525350
    f0d8:	734d5f43 	movtvc	r5, #57155	@ 0xdf43
    f0dc:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    f0e0:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    f0e4:	5041203c 	subpl	r2, r1, ip, lsr r0
    f0e8:	435f5253 	cmpmi	pc, #805306373	@ 0x30000005
    f0ec:	736f505f 	cmnvc	pc, #95	@ 0x5f
    f0f0:	52410029 	subpl	r0, r1, #41	@ 0x29
    f0f4:	504d5f4d 	subpl	r5, sp, sp, asr #30
    f0f8:	41525f55 	cmpmi	r2, r5, asr pc
    f0fc:	44285253 	strtmi	r5, [r8], #-595	@ 0xfffffdad
    f100:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
    f104:	7845656c 	stmdavc	r5, {r2, r3, r5, r6, r8, sl, sp, lr}^
    f108:	412c6365 			@ <UNDEFINED> instruction: 0x412c6365
    f10c:	73656363 	cmnvc	r5, #-1946157055	@ 0x8c000001
    f110:	72655073 	rsbvc	r5, r5, #115	@ 0x73
    f114:	7373696d 	cmnvc	r3, #1785856	@ 0x1b4000
    f118:	2c6e6f69 	stclcs	15, cr6, [lr], #-420	@ 0xfffffe5c
    f11c:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
    f120:	46747845 	ldrbtmi	r7, [r4], -r5, asr #16
    f124:	646c6569 	strbtvs	r6, [ip], #-1385	@ 0xfffffa97
    f128:	5373492c 	cmnpl	r3, #44, 18	@ 0xb0000
    f12c:	65726168 	ldrbvs	r6, [r2, #-360]!	@ 0xfffffe98
    f130:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    f134:	4373492c 	cmnmi	r3, #44, 18	@ 0xb0000
    f138:	65686361 	strbvs	r6, [r8, #-865]!	@ 0xfffffc9f
    f13c:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    f140:	4273492c 	rsbsmi	r4, r3, #44, 18	@ 0xb0000
    f144:	65666675 	strbvs	r6, [r6, #-1653]!	@ 0xfffff98b
    f148:	6c626172 	stfvse	f6, [r2], #-456	@ 0xfffffe38
    f14c:	75532c65 	ldrbvc	r2, [r3, #-3173]	@ 0xfffff39b
    f150:	67655262 	strbvs	r5, [r5, -r2, ror #4]!
    f154:	446e6f69 	strbtmi	r6, [lr], #-3945	@ 0xfffff097
    f158:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
    f15c:	532c656c 			@ <UNDEFINED> instruction: 0x532c656c
    f160:	29657a69 	stmdbcs	r5!, {r0, r3, r5, r6, r9, fp, ip, sp, lr}^
    f164:	4d524120 	ldfmie	f4, [r2, #-128]	@ 0xffffff80
    f168:	55504d5f 	ldrbpl	r4, [r0, #-3423]	@ 0xfffff2a1
    f16c:	5341525f 	movtpl	r5, #4703	@ 0x125f
    f170:	58455f52 	stmdapl	r5, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
    f174:	73694428 	cmnvc	r9, #40, 8	@ 0x28000000
    f178:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    f17c:	63657845 	cmnvs	r5, #4521984	@ 0x450000
    f180:	6341202c 	movtvs	r2, #4140	@ 0x102c
    f184:	73736563 	cmnvc	r3, #415236096	@ 0x18c00000
    f188:	6d726550 	cfldr64vs	mvdx6, [r2, #-320]!	@ 0xfffffec0
    f18c:	69737369 	ldmdbvs	r3!, {r0, r3, r5, r6, r8, r9, ip, sp, lr}^
    f190:	202c6e6f 	eorcs	r6, ip, pc, ror #28
    f194:	5f4d5241 	svcpl	0x004d5241
    f198:	5f55504d 	svcpl	0x0055504d
    f19c:	45434341 	strbmi	r4, [r3, #-833]	@ 0xfffffcbf
    f1a0:	285f5353 	ldmdacs	pc, {r0, r1, r4, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
    f1a4:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
    f1a8:	46747845 	ldrbtmi	r7, [r4], -r5, asr #16
    f1ac:	646c6569 	strbtvs	r6, [ip], #-1385	@ 0xfffffa97
    f1b0:	7349202c 	movtvc	r2, #36908	@ 0x902c
    f1b4:	72616853 	rsbvc	r6, r1, #5439488	@ 0x530000
    f1b8:	6c626165 	stfvse	f6, [r2], #-404	@ 0xfffffe6c
    f1bc:	49202c65 	stmdbmi	r0!, {r0, r2, r5, r6, sl, fp, sp}
    f1c0:	63614373 	cmnvs	r1, #-872415231	@ 0xcc000001
    f1c4:	62616568 	rsbvs	r6, r1, #104, 10	@ 0x1a000000
    f1c8:	202c656c 	eorcs	r6, ip, ip, ror #10
    f1cc:	75427349 	strbvc	r7, [r2, #-841]	@ 0xfffffcb7
    f1d0:	72656666 	rsbvc	r6, r5, #106954752	@ 0x6600000
    f1d4:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    f1d8:	53202c29 			@ <UNDEFINED> instruction: 0x53202c29
    f1dc:	65526275 	ldrbvs	r6, [r2, #-629]	@ 0xfffffd8b
    f1e0:	6e6f6967 	vnmulvs.f16	s13, s30, s15	@ <UNPREDICTABLE>
    f1e4:	61736944 	cmnvs	r3, r4, asr #18
    f1e8:	2c656c62 	stclcs	12, cr6, [r5], #-392	@ 0xfffffe78
    f1ec:	7a695320 	bvc	1a63e74 <_Min_Stack_Size+0x1a63a74>
    f1f0:	5f002965 	svcpl	0x00002965
    f1f4:	53424f5f 	movtpl	r4, #12127	@ 0x2f5f
    f1f8:	54454c4f 	strbpl	r4, [r5], #-3151	@ 0xfffff3b1
    f1fc:	414d5f45 	cmpmi	sp, r5, asr #30
    f200:	5f204854 	svcpl	0x00204854
    f204:	53424f5f 	movtpl	r4, #12127	@ 0x2f5f
    f208:	54454c4f 	strbpl	r4, [r5], #-3151	@ 0xfffff3b1
    f20c:	414d5f45 	cmpmi	sp, r5, asr #30
    f210:	445f4854 	ldrbmi	r4, [pc], #-2132	@ f218 <_Min_Stack_Size+0xee18>
    f214:	55414645 	strbpl	r4, [r1, #-1605]	@ 0xfffff9bb
    f218:	5f00544c 	svcpl	0x0000544c
    f21c:	4154535f 	cmpmi	r4, pc, asr r3
    f220:	5f434954 	svcpl	0x00434954
    f224:	43524f46 	cmpmi	r2, #280	@ 0x118
    f228:	4c4e4945 	mcrrmi	9, 4, r4, lr, cr5	@ <UNPREDICTABLE>
    f22c:	20454e49 	subcs	r4, r5, r9, asr #28
    f230:	74615f5f 	strbtvc	r5, [r1], #-3935	@ 0xfffff0a1
    f234:	62697274 	rsbvs	r7, r9, #116, 4	@ 0x40000007
    f238:	5f657475 	svcpl	0x00657475
    f23c:	6128285f 			@ <UNDEFINED> instruction: 0x6128285f
    f240:	7961776c 	stmdbvc	r1!, {r2, r3, r5, r6, r8, r9, sl, ip, sp, lr}^
    f244:	6e695f73 	mcrvs	15, 3, r5, cr9, cr3, {3}
    f248:	656e696c 	strbvs	r6, [lr, #-2412]!	@ 0xfffff694
    f24c:	73202929 			@ <UNDEFINED> instruction: 0x73202929
    f250:	69746174 	ldmdbvs	r4!, {r2, r4, r5, r6, r8, sp, lr}^
    f254:	6e692063 	cdpvs	0, 6, cr2, cr9, cr3, {3}
    f258:	656e696c 	strbvs	r6, [lr, #-2412]!	@ 0xfffff694
    f25c:	54535f00 	ldrbpl	r5, [r3], #-3840	@ 0xfffff100
    f260:	474e4952 	smlsldmi	r4, lr, r2, r9
    f264:	5f485f53 	svcpl	0x00485f53
    f268:	43530020 	cmpmi	r3, #32
    f26c:	4243536e 	submi	r5, r3, #-1207959551	@ 0xb8000001
    f270:	5443415f 	strbpl	r4, [r3], #-351	@ 0xfffffea1
    f274:	445f524c 	ldrbmi	r5, [pc], #-588	@ f27c <_Min_Stack_Size+0xee7c>
    f278:	434d5349 	movtmi	r5, #54089	@ 0xd349
    f27c:	4e494359 	mcrmi	3, 2, r4, cr9, cr9, {2}
    f280:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
    f284:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    f288:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    f28c:	726f4300 	rsbvc	r4, pc, #0, 6
    f290:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    f294:	445f6775 	ldrbmi	r6, [pc], #-1909	@ f29c <_Min_Stack_Size+0xee9c>
    f298:	52434d45 	subpl	r4, r3, #4416	@ 0x1140
    f29c:	4352545f 	cmpmi	r2, #1593835520	@ 0x5f000000
    f2a0:	5f414e45 	svcpl	0x00414e45
    f2a4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    f2a8:	00553432 	subseq	r3, r5, r2, lsr r4
    f2ac:	5f424353 	svcpl	0x00424353
    f2b0:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    f2b4:	4753555f 			@ <UNDEFINED> instruction: 0x4753555f
    f2b8:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    f2bc:	5f525354 	svcpl	0x00525354
    f2c0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    f2c4:	00553631 	subseq	r3, r5, r1, lsr r6
    f2c8:	5f433249 	svcpl	0x00433249
    f2cc:	5f315243 	svcpl	0x00315243
    f2d0:	52414e45 	subpl	r4, r1, #1104	@ 0x450
    f2d4:	6f505f50 	svcvs	0x00505f50
    f2d8:	34282073 	strtcc	r2, [r8], #-115	@ 0xffffff8d
    f2dc:	41002955 	tstmi	r0, r5, asr r9
    f2e0:	4d5f4d52 	ldclmi	13, cr4, [pc, #-328]	@ f1a0 <_Min_Stack_Size+0xeda0>
    f2e4:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    f2e8:	4f494745 	svcmi	0x00494745
    f2ec:	49535f4e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
    f2f0:	365f455a 			@ <UNDEFINED> instruction: 0x365f455a
    f2f4:	20424b34 	subcs	r4, r2, r4, lsr fp
    f2f8:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
    f2fc:	5f38746e 	svcpl	0x0038746e
    f300:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
    f304:	29554630 	ldmdbcs	r5, {r4, r5, r9, sl, lr}^
    f308:	42435300 	submi	r5, r3, #0, 6
    f30c:	5346435f 	movtpl	r4, #25439	@ 0x635f
    f310:	52505f52 	subspl	r5, r0, #328	@ 0x148
    f314:	53494345 	movtpl	r4, #37701	@ 0x9345
    f318:	5f525245 	svcpl	0x00525245
    f31c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    f320:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    f324:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    f328:	5f424353 	svcpl	0x00424353
    f32c:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    f330:	4552505f 	ldrbmi	r5, [r2, #-95]	@ 0xffffffa1
    f334:	45534943 	ldrbmi	r4, [r3, #-2371]	@ 0xfffff6bd
    f338:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    f33c:	0029736f 	eoreq	r7, r9, pc, ror #6
    f340:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    f344:	475f544e 	ldrbmi	r5, [pc, -lr, asr #8]
    f348:	41445445 	cmpmi	r4, r5, asr #8
    f34c:	455f4554 	ldrbmi	r4, [pc, #-1364]	@ ee00 <_Min_Stack_Size+0xea00>
    f350:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    f354:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    f358:	26282029 	strtcs	r2, [r8], -r9, lsr #32
    f35c:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    f360:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    f364:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    f368:	5f3e2d63 	svcpl	0x003e2d63
    f36c:	64746567 	ldrbtvs	r6, [r4], #-1383	@ 0xfffffa99
    f370:	5f657461 	svcpl	0x00657461
    f374:	29727265 	ldmdbcs	r2!, {r0, r2, r5, r6, r9, ip, sp, lr}^
    f378:	5f5f0029 	svcpl	0x005f0029
    f37c:	524f5456 	subpl	r5, pc, #1442840576	@ 0x56000000
    f380:	4552505f 	ldrbmi	r5, [r2, #-95]	@ 0xffffffa1
    f384:	544e4553 	strbpl	r4, [lr], #-1363	@ 0xfffffaad
    f388:	00553120 	subseq	r3, r5, r0, lsr #2
    f38c:	5f4d5241 	svcpl	0x004d5241
    f390:	5f55504d 	svcpl	0x0055504d
    f394:	465f5041 	ldrbmi	r5, [pc], -r1, asr #32
    f398:	204c4c55 	subcs	r4, ip, r5, asr ip
    f39c:	49005533 	stmdbmi	r0, {r0, r1, r4, r5, r8, sl, ip, lr}
    f3a0:	4c5f4d54 	mrrcmi	13, 5, r4, pc, cr4	@ <UNPREDICTABLE>
    f3a4:	415f5253 	cmpmi	pc, r3, asr r2	@ <UNPREDICTABLE>
    f3a8:	53454343 	movtpl	r4, #21315	@ 0x5343
    f3ac:	734d5f53 	movtvc	r5, #57171	@ 0xdf53
    f3b0:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    f3b4:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    f3b8:	5449203c 	strbpl	r2, [r9], #-60	@ 0xffffffc4
    f3bc:	534c5f4d 	movtpl	r5, #53069	@ 0xcf4d
    f3c0:	43415f52 	movtmi	r5, #8018	@ 0x1f52
    f3c4:	53534543 	cmppl	r3, #281018368	@ 0x10c00000
    f3c8:	736f505f 	cmnvc	pc, #95	@ 0x5f
    f3cc:	5f5f0029 	svcpl	0x005f0029
    f3d0:	59504f43 	ldmdbpl	r0, {r0, r1, r6, r8, r9, sl, fp, lr}^
    f3d4:	48474952 	stmdami	r7, {r1, r4, r6, r8, fp, lr}^
    f3d8:	29732854 	ldmdbcs	r3!, {r2, r4, r6, fp, sp}^
    f3dc:	72747320 	rsbsvc	r7, r4, #32, 6	@ 0x80000000
    f3e0:	20746375 	rsbscs	r6, r4, r5, ror r3
    f3e4:	61685f5f 	cmnvs	r8, pc, asr pc
    f3e8:	5f006b63 	svcpl	0x00006b63
    f3ec:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    f3f0:	4d545f54 	ldclmi	15, cr5, [r4, #-336]	@ 0xfffffeb0
    f3f4:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    f3f8:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
    f3fc:	29727470 	ldmdbcs	r2!, {r4, r5, r6, sl, ip, sp, lr}^
    f400:	6c5f3e2d 	mrrcvs	14, 2, r3, pc, cr13	@ <UNPREDICTABLE>
    f404:	6c61636f 	stclvs	3, cr6, [r1], #-444	@ 0xfffffe44
    f408:	656d6974 	strbvs	r6, [sp, #-2420]!	@ 0xfffff68c
    f40c:	6675625f 			@ <UNDEFINED> instruction: 0x6675625f
    f410:	58450029 	stmdapl	r5, {r0, r3, r5}^
    f414:	465f5449 	ldrbmi	r5, [pc], -r9, asr #8
    f418:	554c4941 	strbpl	r4, [ip, #-2369]	@ 0xfffff6bf
    f41c:	31204552 			@ <UNDEFINED> instruction: 0x31204552
    f420:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    f424:	53414d5f 	movtpl	r4, #7519	@ 0x1d5f
    f428:	414d5f4b 	cmpmi	sp, fp, asr #30
    f42c:	505f4b53 	subspl	r4, pc, r3, asr fp	@ <UNPREDICTABLE>
    f430:	3020736f 	eorcc	r7, r0, pc, ror #6
    f434:	50470055 	subpl	r0, r7, r5, asr r0
    f438:	535f4f49 	cmppl	pc, #292	@ 0x124
    f43c:	44454550 	strbmi	r4, [r5], #-1360	@ 0xfffffab0
    f440:	204d325f 	subcs	r3, sp, pc, asr r2
    f444:	30307830 	eorscc	r7, r0, r0, lsr r8
    f448:	30303030 	eorscc	r3, r0, r0, lsr r0
    f44c:	00753230 	rsbseq	r3, r5, r0, lsr r2
    f450:	5f545744 	svcpl	0x00545744
    f454:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    f458:	534f505f 	movtpl	r5, #61535	@ 0xf05f
    f45c:	45525054 	ldrbmi	r5, [r2, #-84]	@ 0xffffffac
    f460:	5f544553 	svcpl	0x00544553
    f464:	20736f50 	rsbscs	r6, r3, r0, asr pc
    f468:	54005531 	strpl	r5, [r0], #-1329	@ 0xfffffacf
    f46c:	495f4950 	ldmdbmi	pc, {r4, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
    f470:	42544154 	subsmi	r4, r4, #84, 2
    f474:	30525443 	subscc	r5, r2, r3, asr #8
    f478:	5254415f 	subspl	r4, r4, #-1073741801	@ 0xc0000017
    f47c:	59444145 	stmdbpl	r4, {r0, r2, r6, r8, lr}^
    f480:	6f505f31 	svcvs	0x00505f31
    f484:	55302073 	ldrpl	r2, [r0, #-115]!	@ 0xffffff8d
    f488:	42435300 	submi	r5, r3, #0, 6
    f48c:	5346435f 	movtpl	r4, #25439	@ 0x635f
    f490:	46425f52 			@ <UNDEFINED> instruction: 0x46425f52
    f494:	41565241 	cmpmi	r6, r1, asr #4
    f498:	5f44494c 	svcpl	0x0044494c
    f49c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    f4a0:	42435328 	submi	r5, r3, #40, 6	@ 0xa0000000
    f4a4:	5346435f 	movtpl	r4, #25439	@ 0x635f
    f4a8:	55425f52 	strbpl	r5, [r2, #-3922]	@ 0xfffff0ae
    f4ac:	55414653 	strbpl	r4, [r1, #-1619]	@ 0xfffff9ad
    f4b0:	5253544c 	subspl	r5, r3, #76, 8	@ 0x4c000000
    f4b4:	736f505f 	cmnvc	pc, #95	@ 0x5f
    f4b8:	37202b20 	strcc	r2, [r0, -r0, lsr #22]!
    f4bc:	4d002955 	vstrmi.16	s4, [r0, #-170]	@ 0xffffff56	@ <UNPREDICTABLE>
    f4c0:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    f4c4:	5f525341 	svcpl	0x00525341
    f4c8:	505f4e58 	subspl	r4, pc, r8, asr lr	@ <UNPREDICTABLE>
    f4cc:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    f4d0:	4e005538 	mcrmi	5, 0, r5, cr0, cr8, {1}
    f4d4:	5f434956 	svcpl	0x00434956
    f4d8:	33515249 	cmpcc	r1, #-1879048188	@ 0x90000004
    f4dc:	53555f39 	cmppl	r5, #57, 30	@ 0xe4
    f4e0:	33545241 	cmpcc	r4, #268435460	@ 0x10000004
    f4e4:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
    f4e8:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
    f4ec:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    f4f0:	4349564e 	movtmi	r5, #38478	@ 0x964e
    f4f4:	4543495f 	strbmi	r4, [r3, #-2399]	@ 0xfffff6a1
    f4f8:	7c203152 	stfvcs	f3, [r0], #-328	@ 0xfffffeb8
    f4fc:	3128203d 			@ <UNDEFINED> instruction: 0x3128203d
    f500:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    f504:	00292937 	eoreq	r2, r9, r7, lsr r9
    f508:	5f433249 	svcpl	0x00433249
    f50c:	5f315243 	svcpl	0x00315243
    f510:	45504e45 	ldrbmi	r4, [r0, #-3653]	@ 0xfffff1bb
    f514:	6f505f43 	svcvs	0x00505f43
    f518:	35282073 	strcc	r2, [r8, #-115]!	@ 0xffffff8d
    f51c:	44002955 	strmi	r2, [r0], #-2389	@ 0xfffff6ab
    f520:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    f524:	5f4c5254 	svcpl	0x004c5254
    f528:	54534f50 	ldrbpl	r4, [r3], #-3920	@ 0xfffff0b0
    f52c:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    f530:	6b734d5f 	blvs	1ce2ab4 <_Min_Stack_Size+0x1ce26b4>
    f534:	78302820 	ldmdavc	r0!, {r5, fp, sp}
    f538:	204c5546 	subcs	r5, ip, r6, asr #10
    f53c:	44203c3c 	strtmi	r3, [r0], #-3132	@ 0xfffff3c4
    f540:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    f544:	5f4c5254 	svcpl	0x004c5254
    f548:	54534f50 	ldrbpl	r4, [r3], #-3920	@ 0xfffff0b0
    f54c:	54494e49 	strbpl	r4, [r9], #-3657	@ 0xfffff1b7
    f550:	736f505f 	cmnvc	pc, #95	@ 0x5f
    f554:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
    f558:	58455f54 	stmdapl	r5, {r2, r4, r6, r8, r9, sl, fp, ip, lr}^
    f55c:	544e4343 	strbpl	r4, [lr], #-835	@ 0xfffffcbd
    f560:	4358455f 	cmpmi	r8, #398458880	@ 0x17c00000
    f564:	5f544e43 	svcpl	0x00544e43
    f568:	206b734d 	rsbcs	r7, fp, sp, asr #6
    f56c:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
    f570:	204c5546 	subcs	r5, ip, r6, asr #10
    f574:	5f5f0029 	svcpl	0x005f0029
    f578:	49464544 	stmdbmi	r6, {r2, r6, r8, sl, lr}^
    f57c:	5f44454e 	svcpl	0x0044454e
    f580:	657a6973 	ldrbvs	r6, [sl, #-2419]!	@ 0xfffff68d
    f584:	0020745f 	eoreq	r7, r0, pc, asr r4
    f588:	454c5f5f 	strbmi	r5, [ip, #-3935]	@ 0xfffff0a1
    f58c:	36545341 	ldrbcc	r5, [r4], -r1, asr #6
    f590:	6c222034 	stcvs	0, cr2, [r2], #-208	@ 0xffffff30
    f594:	4e00226c 	cdpmi	2, 0, cr2, cr0, cr12, {3}
    f598:	5f434956 	svcpl	0x00434956
    f59c:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    f5a0:	282a2031 	stmdacs	sl!, {r0, r4, r5, sp}
    f5a4:	616c6f76 	smcvs	50934	@ 0xc6f6
    f5a8:	656c6974 	strbvs	r6, [ip, #-2420]!	@ 0xfffff68c
    f5ac:	6e697520 	cdpvs	5, 6, cr7, cr9, cr0, {1}
    f5b0:	5f323374 	svcpl	0x00323374
    f5b4:	292a2074 	stmdbcs	sl!, {r2, r4, r5, r6, sp}
    f5b8:	49564e28 	ldmdbmi	r6, {r3, r5, r9, sl, fp, lr}^
    f5bc:	41425f43 	cmpmi	r2, r3, asr #30
    f5c0:	205f4553 	subscs	r4, pc, r3, asr r5	@ <UNPREDICTABLE>
    f5c4:	7830202b 	ldmdavc	r0!, {r0, r1, r3, r5, sp}
    f5c8:	41002934 	tstmi	r0, r4, lsr r9
    f5cc:	5f6f7475 	svcpl	0x006f7475
    f5d0:	72617453 	rsbvc	r7, r1, #1392508928	@ 0x53000000
    f5d4:	52410074 	subpl	r0, r1, #116	@ 0x74
    f5d8:	504d5f4d 	subpl	r5, sp, sp, asr #30
    f5dc:	45525f55 	ldrbmi	r5, [r2, #-3925]	@ 0xfffff0ab
    f5e0:	4e4f4947 	vmlsmi.f16	s9, s30, s14	@ <UNPREDICTABLE>
    f5e4:	5a49535f 	bpl	1264368 <_Min_Stack_Size+0x1263f68>
    f5e8:	47315f45 	ldrmi	r5, [r1, -r5, asr #30]!
    f5ec:	28282042 	stmdacs	r8!, {r1, r6, sp}
    f5f0:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
    f5f4:	29745f38 	ldmdbcs	r4!, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    f5f8:	44317830 	ldrtmi	r7, [r1], #-2096	@ 0xfffff7d0
    f5fc:	52002955 	andpl	r2, r0, #1392640	@ 0x154000
    f600:	555f4343 	ldrbpl	r4, [pc, #-835]	@ f2c5 <_Min_Stack_Size+0xeec5>
    f604:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
    f608:	4c435f32 	mcrrmi	15, 3, r5, r3, cr2
    f60c:	4e455f4b 	cdpmi	15, 4, cr5, cr5, cr11, {2}
    f610:	28202928 	stmdacs	r0!, {r3, r5, r8, fp, sp}
    f614:	2d434352 	stclcs	3, cr4, [r3, #-328]	@ 0xfffffeb8
    f618:	4250413e 	subsmi	r4, r0, #-2147483633	@ 0x8000000f
    f61c:	524e4531 	subpl	r4, lr, #205520896	@ 0xc400000
    f620:	203d7c20 	eorscs	r7, sp, r0, lsr #24
    f624:	3c203128 	stfccs	f3, [r0], #-160	@ 0xffffff60
    f628:	3731203c 			@ <UNDEFINED> instruction: 0x3731203c
