NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    f62c:	43002929 	movwmi	r2, #2345	@ 0x929
    f630:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    f634:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    f638:	4348445f 	movtmi	r4, #33887	@ 0x845f
    f63c:	435f5253 	cmpmi	pc, #805306373	@ 0x30000005
    f640:	4c41485f 	mcrrmi	8, 5, r4, r1, cr15
    f644:	6f505f54 	svcvs	0x00505f54
    f648:	55312073 	ldrpl	r2, [r1, #-115]!	@ 0xffffff8d
    f64c:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
    f650:	41454c5f 	cmpmi	r5, pc, asr ip
    f654:	36315453 			@ <UNDEFINED> instruction: 0x36315453
    f658:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    f65c:	5f5f2820 	svcpl	0x005f2820
    f660:	5f544e49 	svcpl	0x00544e49
    f664:	5341454c 	movtpl	r4, #5452	@ 0x154c
    f668:	5f363154 	svcpl	0x00363154
    f66c:	5f58414d 	svcpl	0x0058414d
    f670:	5f00295f 	svcpl	0x0000295f
    f674:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    f678:	43575f54 	cmpmi	r7, #84, 30	@ 0x150
    f67c:	424d4f54 	submi	r4, sp, #84, 30	@ 0x150
    f680:	4154535f 	cmpmi	r4, pc, asr r3
    f684:	70284554 	eorvc	r4, r8, r4, asr r5
    f688:	20297274 	eorcs	r7, r9, r4, ror r2
    f68c:	74702828 	ldrbtvc	r2, [r0], #-2088	@ 0xfffff7d8
    f690:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    f694:	73696d5f 	cmnvc	r9, #6080	@ 0x17c0
    f698:	5f3e2d63 	svcpl	0x003e2d63
    f69c:	6f746377 	svcvs	0x00746377
    f6a0:	735f626d 	cmpvc	pc, #-805306362	@ 0xd0000006
    f6a4:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
    f6a8:	6f430029 	svcvs	0x00430029
    f6ac:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    f6b0:	5f677562 	svcpl	0x00677562
    f6b4:	53434844 	movtpl	r4, #14404	@ 0x3844
    f6b8:	5f535f52 	svcpl	0x00535f52
    f6bc:	52474552 	subpl	r4, r7, #343932928	@ 0x14800000
    f6c0:	4d5f5944 	vldrmi.16	s11, [pc, #-136]	@ f640 <_Min_Stack_Size+0xf240>	@ <UNPREDICTABLE>
    f6c4:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    f6c8:	204c5531 	subcs	r5, ip, r1, lsr r5
    f6cc:	43203c3c 			@ <UNDEFINED> instruction: 0x43203c3c
    f6d0:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    f6d4:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    f6d8:	4348445f 	movtmi	r4, #33887	@ 0x845f
    f6dc:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    f6e0:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    f6e4:	5f594452 	svcpl	0x00594452
    f6e8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    f6ec:	42435300 	submi	r5, r3, #0, 6
    f6f0:	4348535f 	movtmi	r5, #33631	@ 0x835f
    f6f4:	555f5253 	ldrbpl	r5, [pc, #-595]	@ f4a9 <_Min_Stack_Size+0xf0a9>
    f6f8:	41464753 	cmpmi	r6, r3, asr r7
    f6fc:	45544c55 	ldrbmi	r4, [r4, #-3157]	@ 0xfffff3ab
    f700:	4d5f414e 	ldfmie	f4, [pc, #-312]	@ f5d0 <_Min_Stack_Size+0xf1d0>
    f704:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    f708:	204c5531 	subcs	r5, ip, r1, lsr r5
    f70c:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
    f710:	535f4243 	cmppl	pc, #805306372	@ 0x30000004
    f714:	52534348 	subspl	r4, r3, #72, 6	@ 0x20000001
    f718:	4753555f 			@ <UNDEFINED> instruction: 0x4753555f
    f71c:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    f720:	414e4554 	cmpmi	lr, r4, asr r5
    f724:	736f505f 	cmnvc	pc, #95	@ 0x5f
    f728:	43530029 	cmpmi	r3, #41	@ 0x29
    f72c:	43495f42 	movtmi	r5, #40770	@ 0x9f42
    f730:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    f734:	45505253 	ldrbmi	r5, [r0, #-595]	@ 0xfffffdad
    f738:	4e49444e 	cdpmi	4, 4, cr4, cr9, cr14, {2}
    f73c:	6f505f47 	svcvs	0x00505f47
    f740:	32322073 	eorscc	r2, r2, #115	@ 0x73
    f744:	6f430055 	svcvs	0x00430055
    f748:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
    f74c:	5f677562 	svcpl	0x00677562
    f750:	53524344 	cmppl	r2, #68, 6	@ 0x10000001
    f754:	45525f52 	ldrbmi	r5, [r2, #-3922]	@ 0xfffff0ae
    f758:	526e5747 	rsbpl	r5, lr, #18612224	@ 0x11c0000
    f75c:	6b734d5f 	blvs	1ce2ce0 <_Min_Stack_Size+0x1ce28e0>
    f760:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
    f764:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
    f768:	726f4320 	rsbvc	r4, pc, #32, 6	@ 0x80000000
    f76c:	62654465 	rsbvs	r4, r5, #1694498816	@ 0x65000000
    f770:	445f6775 	ldrbmi	r6, [pc], #-1909	@ f778 <_Min_Stack_Size+0xf378>
    f774:	52535243 	subspl	r5, r3, #805306372	@ 0x30000004
    f778:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    f77c:	5f526e57 	svcpl	0x00526e57
    f780:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    f784:	43324900 	teqmi	r2, #0, 18
    f788:	3152435f 	cmpcc	r2, pc, asr r3
    f78c:	534f505f 	movtpl	r5, #61535	@ 0xf05f
    f790:	43324920 	teqmi	r2, #32, 18	@ 0x80000
    f794:	3152435f 	cmpcc	r2, pc, asr r3
    f798:	534f505f 	movtpl	r5, #61535	@ 0xf05f
    f79c:	6b734d5f 	blvs	1ce2d20 <_Min_Stack_Size+0x1ce2920>
    f7a0:	495f5f00 	ldmdbmi	pc, {r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    f7a4:	3436544e 	ldrtcc	r5, [r6], #-1102	@ 0xfffffbb2
    f7a8:	6c6c2220 	sfmvs	f2, 2, [ip], #-128	@ 0xffffff80
    f7ac:	52410022 	subpl	r0, r1, #34	@ 0x22
    f7b0:	504d5f4d 	subpl	r5, sp, sp, asr #30
    f7b4:	52415f55 	subpl	r5, r1, #340	@ 0x154
    f7b8:	5f37564d 	svcpl	0x0037564d
    f7bc:	44002048 	strmi	r2, [r0], #-72	@ 0xffffffb8
    f7c0:	435f5457 	cmpmi	pc, #1459617792	@ 0x57000000
    f7c4:	5f4c5254 	svcpl	0x004c5254
    f7c8:	58454f4e 	stmdapl	r5, {r1, r2, r3, r6, r8, r9, sl, fp, lr}^
    f7cc:	49525454 	ldmdbmi	r2, {r2, r4, r6, sl, ip, lr}^
    f7d0:	734d5f47 	movtvc	r5, #57159	@ 0xdf47
    f7d4:	3028206b 	eorcc	r2, r8, fp, rrx
    f7d8:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    f7dc:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    f7e0:	5f545744 	svcpl	0x00545744
    f7e4:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    f7e8:	454f4e5f 	strbmi	r4, [pc, #-3679]	@ e991 <_Min_Stack_Size+0xe591>
    f7ec:	52545458 	subspl	r5, r4, #88, 8	@ 0x58000000
    f7f0:	505f4749 	subspl	r4, pc, r9, asr #14
    f7f4:	0029736f 	eoreq	r7, r9, pc, ror #6
    f7f8:	5f433249 	svcpl	0x00433249
    f7fc:	5f315243 	svcpl	0x00315243
    f800:	5f434550 	svcpl	0x00434550
    f804:	20736f50 	rsbscs	r6, r3, r0, asr pc
    f808:	55323128 	ldrpl	r3, [r2, #-296]!	@ 0xfffffed8
    f80c:	5f5f0029 	svcpl	0x005f0029
    f810:	434e4f43 	movtmi	r4, #61251	@ 0xef43
    f814:	78285441 	stmdavc	r8!, {r0, r6, sl, ip, lr}
    f818:	2029792c 	eorcs	r7, r9, ip, lsr #18
    f81c:	4f435f5f 	svcmi	0x00435f5f
    f820:	5441434e 	strbpl	r4, [r1], #-846	@ 0xfffffcb2
    f824:	2c782831 	ldclcs	8, cr2, [r8], #-196	@ 0xffffff3c
    f828:	49002979 	stmdbmi	r0, {r0, r3, r4, r5, r6, r8, fp, sp}
    f82c:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ f834 <_Min_Stack_Size+0xf434>
    f830:	535f5243 	cmppl	pc, #805306372	@ 0x30000004
    f834:	4e454f57 	mcrmi	15, 2, r4, cr5, cr7, {2}
    f838:	6f505f41 	svcvs	0x00505f41
    f83c:	55342073 	ldrpl	r2, [r4, #-115]!	@ 0xffffff8d
    f840:	53507800 	cmppl	r0, #0, 16
    f844:	43495f52 	movtmi	r5, #40786	@ 0x9f52
    f848:	54495f49 	strbpl	r5, [r9], #-3913	@ 0xfffff0b7
    f84c:	4d5f315f 	ldfmie	f3, [pc, #-380]	@ f6d8 <_Min_Stack_Size+0xf2d8>
    f850:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    f854:	46337830 			@ <UNDEFINED> instruction: 0x46337830
    f858:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    f85c:	5078203c 	rsbspl	r2, r8, ip, lsr r0
    f860:	495f5253 	ldmdbmi	pc, {r0, r1, r4, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
    f864:	495f4943 	ldmdbmi	pc, {r0, r1, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
    f868:	5f315f54 	svcpl	0x00315f54
    f86c:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
    f870:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    f874:	41425f43 	cmpmi	r2, r3, asr #30
    f878:	28204553 	stmdacs	r0!, {r0, r1, r4, r6, r8, sl, lr}
    f87c:	5f534353 	svcpl	0x00534353
    f880:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
    f884:	30202b20 	eorcc	r2, r0, r0, lsr #22
    f888:	30313078 	eorscc	r3, r1, r8, ror r0
    f88c:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
    f890:	43324900 	teqmi	r2, #0, 18
    f894:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
    f898:	4c534d5f 	mrrcmi	13, 5, r4, r3, cr15
    f89c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    f8a0:	55302820 	ldrpl	r2, [r0, #-2080]!	@ 0xfffff7e0
    f8a4:	504d0029 	subpl	r0, sp, r9, lsr #32
    f8a8:	41525f55 	cmpmi	r2, r5, asr pc
    f8ac:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    f8b0:	5f455a49 	svcpl	0x00455a49
    f8b4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    f8b8:	49005531 	stmdbmi	r0, {r0, r4, r5, r8, sl, ip, lr}
    f8bc:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ f8c4 <_Min_Stack_Size+0xf4c4>
    f8c0:	475f5243 	ldrbmi	r5, [pc, -r3, asr #4]
    f8c4:	52465354 	subpl	r5, r6, #84, 6	@ 0x50000001
    f8c8:	4d5f5145 	ldfmie	f5, [pc, #-276]	@ f7bc <_Min_Stack_Size+0xf3bc>
    f8cc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
    f8d0:	204c5533 	subcs	r5, ip, r3, lsr r5
    f8d4:	49203c3c 	stmdbmi	r0!, {r2, r3, r4, r5, sl, fp, ip, sp}
    f8d8:	545f4d54 	ldrbpl	r4, [pc], #-3412	@ f8e0 <_Min_Stack_Size+0xf4e0>
    f8dc:	475f5243 	ldrbmi	r5, [pc, -r3, asr #4]
    f8e0:	52465354 	subpl	r5, r6, #84, 6	@ 0x50000001
    f8e4:	505f5145 	subspl	r5, pc, r5, asr #2
    f8e8:	0029736f 	eoreq	r7, r9, pc, ror #6
    f8ec:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    f8f0:	28435f38 	stmdacs	r3, {r3, r4, r5, r8, r9, sl, fp, ip, lr}^
    f8f4:	5f202978 	svcpl	0x00202978
    f8f8:	4e49555f 	mcrmi	5, 2, r5, cr9, cr15, {2}
    f8fc:	435f3854 	cmpmi	pc, #84, 16	@ 0x540000
    f900:	00297828 	eoreq	r7, r9, r8, lsr #16
    f904:	5f4d5241 	svcpl	0x004d5241
    f908:	5f55504d 	svcpl	0x0055504d
    f90c:	505f5041 	subspl	r5, pc, r1, asr #32
    f910:	20564952 	subscs	r4, r6, r2, asr r9
    f914:	54005531 	strpl	r5, [r0], #-1329	@ 0xfffffacf
    f918:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
    f91c:	5f525346 	svcpl	0x00525346
    f920:	6f4e7446 	svcvs	0x004e7446
    f924:	6f74536e 	svcvs	0x0074536e
    f928:	734d5f70 	movtvc	r5, #57200	@ 0xdf70
    f92c:	3028206b 	eorcc	r2, r8, fp, rrx
    f930:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
    f934:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    f938:	5f495054 	svcpl	0x00495054
    f93c:	52534646 	subspl	r4, r3, #73400320	@ 0x4600000
    f940:	4e74465f 	mrcmi	6, 3, r4, cr4, cr15, {2}
    f944:	74536e6f 	ldrbvc	r6, [r3], #-3695	@ 0xfffff191
    f948:	505f706f 	subspl	r7, pc, pc, rrx
    f94c:	0029736f 	eoreq	r7, r9, pc, ror #6
    f950:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    f954:	415f544e 	cmpmi	pc, lr, asr #8
    f958:	49544353 	ldmdbmi	r4, {r0, r1, r4, r6, r8, r9, lr}^
    f95c:	535f454d 	cmppl	pc, #322961408	@ 0x13400000
    f960:	20455a49 	subcs	r5, r5, r9, asr #20
    f964:	4d003632 	stcmi	6, cr3, [r0, #-200]	@ 0xffffff38
    f968:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
    f96c:	5f525341 	svcpl	0x00525341
    f970:	6f505f43 	svcvs	0x00505f43
    f974:	37312073 			@ <UNDEFINED> instruction: 0x37312073
    f978:	43530055 	cmpmi	r3, #85	@ 0x55
    f97c:	4243536e 	submi	r5, r3, #-1207959551	@ 0xb8000001
    f980:	5443415f 	strbpl	r4, [r3], #-351	@ 0xfffffea1
    f984:	445f524c 	ldrbmi	r5, [pc], #-588	@ f98c <_Min_Stack_Size+0xf58c>
    f988:	4f465349 	svcmi	0x00465349
    f98c:	505f444c 	subspl	r4, pc, ip, asr #8
    f990:	3220736f 	eorcc	r7, r0, #-1140850687	@ 0xbc000001
    f994:	5f5f0055 	svcpl	0x005f0055
    f998:	65766168 	ldrbvs	r6, [r6, #-360]!	@ 0xfffffe98
    f99c:	6e6f6c5f 	mcrvs	12, 3, r6, cr15, cr15, {2}
    f9a0:	6e6f6c67 	cdpvs	12, 6, cr6, cr15, cr7, {3}
    f9a4:	20343667 	eorscs	r3, r4, r7, ror #12
    f9a8:	5f5f0031 	svcpl	0x005f0031
    f9ac:	204d5341 	subcs	r5, sp, r1, asr #6
    f9b0:	73615f5f 	cmnvc	r1, #380	@ 0x17c
    f9b4:	4353006d 	cmpmi	r3, #109	@ 0x6d
    f9b8:	46485f42 	strbmi	r5, [r8], -r2, asr #30
    f9bc:	465f5253 			@ <UNDEFINED> instruction: 0x465f5253
    f9c0:	4543524f 	strbmi	r5, [r3, #-591]	@ 0xfffffdb1
    f9c4:	734d5f44 	movtvc	r5, #57156	@ 0xdf44
    f9c8:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
    f9cc:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
    f9d0:	4353203c 	cmpmi	r3, #60	@ 0x3c
    f9d4:	46485f42 	strbmi	r5, [r8], -r2, asr #30
    f9d8:	465f5253 			@ <UNDEFINED> instruction: 0x465f5253
    f9dc:	4543524f 	strbmi	r5, [r3, #-591]	@ 0xfffffdb1
    f9e0:	6f505f44 	svcvs	0x00505f44
    f9e4:	5f002973 	svcpl	0x00002973
    f9e8:	42464f49 	submi	r4, r6, #292	@ 0x124
    f9ec:	00302046 	eorseq	r2, r0, r6, asr #32
    f9f0:	4349564e 	movtmi	r5, #38478	@ 0x964e
    f9f4:	4553555f 	ldrbmi	r5, [r3, #-1375]	@ 0xfffffaa1
    f9f8:	52495f52 	subpl	r5, r9, #328	@ 0x148
    f9fc:	464f5f51 			@ <UNDEFINED> instruction: 0x464f5f51
    fa00:	54455346 	strbpl	r5, [r5], #-838	@ 0xfffffcba
    fa04:	00363120 	eorseq	r3, r6, r0, lsr #2
    fa08:	4d49545f 	cfstrdmi	mvd5, [r9, #-380]	@ 0xfffffe84
    fa0c:	5f545f45 	svcpl	0x00545f45
    fa10:	695f5f20 	ldmdbvs	pc, {r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    fa14:	6c5f746e 	cfldrdvs	mvd7, [pc], {110}	@ 0x6e
    fa18:	74736165 	ldrbtvc	r6, [r3], #-357	@ 0xfffffe9b
    fa1c:	745f3436 	ldrbvc	r3, [pc], #-1078	@ fa24 <_Min_Stack_Size+0xf624>
    fa20:	74735f00 	ldrbtvc	r5, [r3], #-3840	@ 0xfffff100
    fa24:	72726564 	rsbsvc	r6, r2, #100, 10	@ 0x19000000
    fa28:	7828725f 	stmdavc	r8!, {r0, r1, r2, r3, r4, r6, r9, ip, sp, lr}
    fa2c:	525f2029 	subspl	r2, pc, #41	@ 0x29
    fa30:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    fa34:	4454535f 	ldrbmi	r5, [r4], #-863	@ 0xfffffca1
    fa38:	28525245 	ldmdacs	r2, {r0, r2, r6, r9, ip, lr}^
    fa3c:	5f002978 	svcpl	0x00002978
    fa40:	554e475f 	strbpl	r4, [lr, #-1887]	@ 0xfffff8a1
    fa44:	41565f43 	cmpmi	r6, r3, asr #30
    fa48:	53494c5f 	movtpl	r4, #40031	@ 0x9c5f
    fa4c:	4f435f54 	svcmi	0x00435f54
    fa50:	5441504d 	strbpl	r5, [r1], #-77	@ 0xffffffb3
    fa54:	4c494249 	sfmmi	f4, 2, [r9], {73}	@ 0x49
    fa58:	20595449 	subscs	r5, r9, r9, asr #8
    fa5c:	4e490031 	mcrmi	0, 2, r0, cr9, cr1, {1}
    fa60:	41465f54 	cmpmi	r6, r4, asr pc
    fa64:	32335453 	eorscc	r5, r3, #1392508928	@ 0x53000000
    fa68:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    fa6c:	5f5f2820 	svcpl	0x005f2820
    fa70:	5f544e49 	svcpl	0x00544e49
    fa74:	54534146 	ldrbpl	r4, [r3], #-326	@ 0xfffffeba
    fa78:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ f9b4 <_Min_Stack_Size+0xf5b4>
    fa7c:	5f5f5841 	svcpl	0x005f5841
    fa80:	5f5f0029 	svcpl	0x005f0029
    fa84:	54415353 	strbpl	r5, [r1], #-851	@ 0xfffffcad
    fa88:	47524128 	ldrbmi	r4, [r2, -r8, lsr #2]
    fa8c:	52412c31 	subpl	r2, r1, #12544	@ 0x3100
    fa90:	20293247 	eorcs	r3, r9, r7, asr #4
    fa94:	78655f5f 	stmdavc	r5!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    fa98:	736e6574 	cmnvc	lr, #116, 10	@ 0x1d000000
    fa9c:	5f6e6f69 	svcpl	0x006e6f69
    faa0:	7b28205f 	blvc	a17c24 <_Min_Stack_Size+0xa17824>
    faa4:	746e6920 	strbtvc	r6, [lr], #-2336	@ 0xfffff6e0
    faa8:	745f3233 	ldrbvc	r3, [pc], #-563	@ fab0 <_Min_Stack_Size+0xf6b0>
    faac:	525f5f20 	subspl	r5, pc, #32, 30	@ 0x80
    fab0:	202c5345 	eorcs	r5, ip, r5, asr #6
    fab4:	52415f5f 	subpl	r5, r1, #380	@ 0x17c
    fab8:	3d203147 	stfccs	f3, [r0, #-284]!	@ 0xfffffee4
    fabc:	52412820 	subpl	r2, r1, #32, 16	@ 0x200000
    fac0:	3b293147 	blcc	a5bfe4 <_Min_Stack_Size+0xa5bbe4>
    fac4:	415f5f20 	cmpmi	pc, r0, lsr #30
    fac8:	76204d53 			@ <UNDEFINED> instruction: 0x76204d53
    facc:	74616c6f 	strbtvc	r6, [r1], #-3183	@ 0xfffff391
    fad0:	20656c69 	rsbcs	r6, r5, r9, ror #24
    fad4:	73732228 	cmnvc	r3, #40, 4	@ 0x80000002
    fad8:	25207461 	strcs	r7, [r0, #-1121]!	@ 0xfffffb9f
    fadc:	25202c30 	strcs	r2, [r0, #-3120]!	@ 0xfffff3d0
    fae0:	25202c31 	strcs	r2, [r0, #-3121]!	@ 0xfffff3cf
    fae4:	3a202232 	bcc	8183b4 <_Min_Stack_Size+0x817fb4>
    fae8:	723d2220 	eorsvc	r2, sp, #32, 4
    faec:	5f282022 	svcpl	0x00282022
    faf0:	5345525f 	movtpl	r5, #21087	@ 0x525f
    faf4:	203a2029 	eorscs	r2, sl, r9, lsr #32
    faf8:	20224922 	eorcs	r4, r2, r2, lsr #18
    fafc:	47524128 	ldrbmi	r4, [r2, -r8, lsr #2]
    fb00:	202c2932 	eorcs	r2, ip, r2, lsr r9
    fb04:	20227222 	eorcs	r7, r2, r2, lsr #4
    fb08:	415f5f28 	cmpmi	pc, r8, lsr #30
    fb0c:	29314752 	ldmdbcs	r1!, {r1, r4, r6, r8, r9, sl, lr}
    fb10:	22203a20 	eorcs	r3, r0, #32, 20	@ 0x20000
    fb14:	20226363 	eorcs	r6, r2, r3, ror #6
    fb18:	5f203b29 	svcpl	0x00203b29
    fb1c:	5345525f 	movtpl	r5, #21087	@ 0x525f
    fb20:	297d203b 	ldmdbcs	sp!, {r0, r1, r3, r4, r5, sp}^
    fb24:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
    fb28:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
    fb2c:	4f495443 	svcmi	0x00495443
    fb30:	41445f4e 	cmpmi	r4, lr, asr #30
    fb34:	41564154 	cmpmi	r6, r4, asr r1
    fb38:	30524444 	subscc	r4, r2, r4, asr #8
    fb3c:	736f505f 	cmnvc	pc, #95	@ 0x5f
    fb40:	55323120 	ldrpl	r3, [r2, #-288]!	@ 0xfffffee0
    fb44:	42435300 	submi	r5, r3, #0, 6
    fb48:	4348535f 	movtmi	r5, #33631	@ 0x835f
    fb4c:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    fb50:	4c414356 	mcrrmi	3, 5, r4, r1, cr6
    fb54:	4e45504c 	cdpmi	0, 4, cr5, cr5, cr12, {2}
    fb58:	5f444544 	svcpl	0x00444544
    fb5c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    fb60:	00553531 	subseq	r3, r5, r1, lsr r5
    fb64:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    fb68:	5341465f 	movtpl	r4, #5727	@ 0x165f
    fb6c:	4d5f3854 	ldclmi	8, cr3, [pc, #-336]	@ fa24 <_Min_Stack_Size+0xf624>
    fb70:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
    fb74:	49555f5f 	ldmdbmi	r5, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
    fb78:	465f544e 	ldrbmi	r5, [pc], -lr, asr #8
    fb7c:	38545341 	ldmdacc	r4, {r0, r6, r8, r9, ip, lr}^
    fb80:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
    fb84:	00295f5f 	eoreq	r5, r9, pc, asr pc
    fb88:	4f525245 	svcmi	0x00525245
    fb8c:	00302052 	eorseq	r2, r0, r2, asr r0
    fb90:	4e475f5f 	mcrmi	15, 2, r5, cr7, cr15, {2}
    fb94:	494c4355 	stmdbmi	ip, {r0, r2, r4, r6, r8, r9, lr}^
    fb98:	4d5f454b 	cfldr64mi	mvdx4, [pc, #-300]	@ fa74 <_Min_Stack_Size+0xf674>
    fb9c:	5f485441 	svcpl	0x00485441
    fba0:	4c495542 	cfstr64mi	mvdx5, [r9], {66}	@ 0x42
    fba4:	5f4e4954 	svcpl	0x004e4954
    fba8:	534e4f43 	movtpl	r4, #61251	@ 0xef43
    fbac:	544e4154 	strbpl	r4, [lr], #-340	@ 0xfffffeac
    fbb0:	53002053 	movwpl	r2, #83	@ 0x53
    fbb4:	43536e43 	cmpmi	r3, #1072	@ 0x430
    fbb8:	28282042 	stmdacs	r8!, {r1, r6, sp}
    fbbc:	536e4353 	cmnpl	lr, #1275068417	@ 0x4c000001
    fbc0:	545f4243 	ldrbpl	r4, [pc], #-579	@ fbc8 <_Min_Stack_Size+0xf7c8>
    fbc4:	20657079 	rsbcs	r7, r5, r9, ror r0
    fbc8:	5320292a 			@ <UNDEFINED> instruction: 0x5320292a
    fbcc:	425f5343 	subsmi	r5, pc, #201326593	@ 0xc000001
    fbd0:	20455341 	subcs	r5, r5, r1, asr #6
    fbd4:	4f430029 	svcmi	0x00430029
    fbd8:	4f52544e 	svcmi	0x0052544e
    fbdc:	50535f4c 	subspl	r5, r3, ip, asr #30
    fbe0:	5f4c4553 	svcpl	0x004c4553
    fbe4:	20736f50 	rsbscs	r6, r3, r0, asr pc
    fbe8:	4d005531 	cfstr32mi	mvfx5, [r0, #-196]	@ 0xffffff3c
    fbec:	545f5550 	ldrbpl	r5, [pc], #-1360	@ fbf4 <_Min_Stack_Size+0xf7f4>
    fbf0:	5f455059 	svcpl	0x00455059
    fbf4:	47455244 	strbmi	r5, [r5, -r4, asr #4]
    fbf8:	5f4e4f49 	svcpl	0x004e4f49
    fbfc:	20736f50 	rsbscs	r6, r3, r0, asr pc
    fc00:	43005538 	movwmi	r5, #1336	@ 0x538
    fc04:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    fc08:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    fc0c:	4d45445f 	cfstrdmi	mvd4, [r5, #-380]	@ 0xfffffe84
    fc10:	565f5243 	ldrbpl	r5, [pc], -r3, asr #4
    fc14:	4d4d5f43 	stclmi	15, cr5, [sp, #-268]	@ 0xfffffef4
    fc18:	5f525245 	svcpl	0x00525245
    fc1c:	206b734d 	rsbcs	r7, fp, sp, asr #6
    fc20:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
    fc24:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    fc28:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
    fc2c:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
    fc30:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
    fc34:	5f52434d 	svcpl	0x0052434d
    fc38:	4d5f4356 	ldclmi	3, cr4, [pc, #-344]	@ fae8 <_Min_Stack_Size+0xf6e8>
    fc3c:	5252454d 	subspl	r4, r2, #322961408	@ 0x13400000
    fc40:	736f505f 	cmnvc	pc, #95	@ 0x5f
    fc44:	475f0029 	ldrbmi	r0, [pc, -r9, lsr #32]
    fc48:	4d5f4343 	ldclmi	3, cr4, [pc, #-268]	@ fb44 <_Min_Stack_Size+0xf744>
    fc4c:	415f5841 	cmpmi	pc, r1, asr #16
    fc50:	4e47494c 	vmlsmi.f16	s9, s14, s24	@ <UNPREDICTABLE>
    fc54:	0020545f 	eoreq	r5, r0, pc, asr r4
    fc58:	5f545744 	svcpl	0x00545744
    fc5c:	4c525443 	cfldrdmi	mvd5, [r2], {67}	@ 0x43
    fc60:	4358455f 	cmpmi	r8, #398458880	@ 0x17c00000
    fc64:	45545645 	ldrbmi	r5, [r4, #-1605]	@ 0xfffff9bb
    fc68:	505f414e 	subspl	r4, pc, lr, asr #2
    fc6c:	3120736f 			@ <UNDEFINED> instruction: 0x3120736f
    fc70:	43005538 	movwmi	r5, #1336	@ 0x538
    fc74:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
    fc78:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
    fc7c:	4348445f 	movtmi	r4, #33887	@ 0x845f
    fc80:	535f5253 	cmppl	pc, #805306373	@ 0x30000005
    fc84:	4745525f 	smlsldmi	r5, r5, pc, r2	@ <UNPREDICTABLE>
    fc88:	5f594452 	svcpl	0x00594452
    fc8c:	20736f50 	rsbscs	r6, r3, r0, asr pc
    fc90:	00553631 	subseq	r3, r5, r1, lsr r6
    fc94:	5f433249 	svcpl	0x00433249
    fc98:	5f315243 	svcpl	0x00315243
    fc9c:	5f534f50 	svcpl	0x00534f50
    fca0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    fca4:	55313128 	ldrpl	r3, [r1, #-296]!	@ 0xfffffed8
    fca8:	525f0029 	subspl	r0, pc, #41	@ 0x29
    fcac:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
    fcb0:	52424d5f 	subpl	r4, r2, #6080	@ 0x17c0
    fcb4:	5f4e454c 	svcpl	0x004e454c
    fcb8:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
    fcbc:	74702845 	ldrbtvc	r2, [r0], #-2117	@ 0xfffff7bb
    fcc0:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    fcc4:	72747028 	rsbsvc	r7, r4, #40	@ 0x28
    fcc8:	5f3e2d29 	svcpl	0x003e2d29
    fccc:	6373696d 	cmnvs	r3, #1785856	@ 0x1b4000
    fcd0:	6d5f3e2d 	ldclvs	14, cr3, [pc, #-180]	@ fc24 <_Min_Stack_Size+0xf824>
    fcd4:	656c7262 	strbvs	r7, [ip, #-610]!	@ 0xfffffd9e
    fcd8:	74735f6e 	ldrbtvc	r5, [r3], #-3950	@ 0xfffff092
    fcdc:	29657461 	stmdbcs	r5!, {r0, r5, r6, sl, ip, sp, lr}^
    fce0:	49564e00 	ldmdbmi	r6, {r9, sl, fp, lr}^
    fce4:	52495f43 	subpl	r5, r9, #268	@ 0x10c
    fce8:	455f3751 	ldrbmi	r3, [pc, #-1873]	@ f59f <_Min_Stack_Size+0xf19f>
    fcec:	31495458 	cmpcc	r9, r8, asr r4
    fcf0:	616e455f 	cmnvs	lr, pc, asr r5
    fcf4:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
    fcf8:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
    fcfc:	5f434956 	svcpl	0x00434956
    fd00:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
    fd04:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	@ 0xffffff40
    fd08:	20312820 	eorscs	r2, r1, r0, lsr #16
    fd0c:	37203c3c 			@ <UNDEFINED> instruction: 0x37203c3c
    fd10:	46002929 	strmi	r2, [r0], -r9, lsr #18
    fd14:	5f4f4649 	svcpl	0x004f4649
    fd18:	75716564 	ldrbvc	r6, [r1, #-1380]!	@ 0xfffffa9c
    fd1c:	00657565 	rsbeq	r7, r5, r5, ror #10
    fd20:	706f7266 	rsbvc	r7, pc, r6, ror #4
    fd24:	5f286e65 	svcpl	0x00286e65
    fd28:	6f6f635f 	svcvs	0x006f635f
    fd2c:	2c65696b 			@ <UNDEFINED> instruction: 0x2c65696b
    fd30:	6e665f5f 	mcrvs	15, 3, r5, cr6, cr15, {2}
    fd34:	75662029 	strbvc	r2, [r6, #-41]!	@ 0xffffffd7
    fd38:	65706f6e 	ldrbvs	r6, [r0, #-3950]!	@ 0xfffff092
    fd3c:	5f5f286e 	svcpl	0x005f286e
    fd40:	6b6f6f63 	blvs	1bebad4 <_Min_Stack_Size+0x1beb6d4>
    fd44:	202c6569 	eorcs	r6, ip, r9, ror #10
    fd48:	6e665f5f 	mcrvs	15, 3, r5, cr6, cr15, {2}
    fd4c:	554e202c 	strbpl	r2, [lr, #-44]	@ 0xffffffd4
    fd50:	202c4c4c 	eorcs	r4, ip, ip, asr #24
    fd54:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
    fd58:	554e202c 	strbpl	r2, [lr, #-44]	@ 0xffffffd4
    fd5c:	00294c4c 	eoreq	r4, r9, ip, asr #24
    fd60:	5f424353 	svcpl	0x00424353
    fd64:	5f524353 	svcpl	0x00524353
    fd68:	45454c53 	strbmi	r4, [r5, #-3155]	@ 0xfffff3ad
    fd6c:	454e4f50 	strbmi	r4, [lr, #-3920]	@ 0xfffff0b0
    fd70:	5f544958 	svcpl	0x00544958
    fd74:	20736f50 	rsbscs	r6, r3, r0, asr pc
    fd78:	5f005531 	svcpl	0x00005531
