NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    fd7c:	5a49535f 	bpl	1264b00 <_Min_Stack_Size+0x1264700>
    fd80:	5f545f45 	svcpl	0x00545f45
    fd84:	4900205f 	stmdbmi	r0, {r0, r1, r2, r3, r4, r6, sp}
    fd88:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
    fd8c:	535f3252 	cmppl	pc, #536870917	@ 0x20000005
    fd90:	4f48424d 	svcmi	0x0048424d
    fd94:	505f5453 	subspl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
    fd98:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    fd9c:	00295536 	eoreq	r5, r9, r6, lsr r5
    fda0:	544e4955 	strbpl	r4, [lr], #-2389	@ 0xfffff6ab
    fda4:	5f58414d 	svcpl	0x0058414d
    fda8:	2058414d 	subscs	r4, r8, sp, asr #2
    fdac:	555f5f28 	ldrbpl	r5, [pc, #-3880]	@ ee8c <_Min_Stack_Size+0xea8c>
    fdb0:	4d544e49 	ldclmi	14, cr4, [r4, #-292]	@ 0xfffffedc
    fdb4:	4d5f5841 	ldclmi	8, cr5, [pc, #-260]	@ fcb8 <_Min_Stack_Size+0xf8b8>
    fdb8:	5f5f5841 	svcpl	0x005f5841
    fdbc:	43530029 	cmpmi	r3, #41	@ 0x29
    fdc0:	46435f42 	strbmi	r5, [r3], -r2, asr #30
    fdc4:	4d5f5253 	lfmmi	f5, 2, [pc, #-332]	@ fc80 <_Min_Stack_Size+0xf880>
    fdc8:	454b5453 	strbmi	r5, [fp, #-1107]	@ 0xfffffbad
    fdcc:	505f5252 	subspl	r5, pc, r2, asr r2	@ <UNPREDICTABLE>
    fdd0:	2820736f 	stmdacs	r0!, {r0, r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}
    fdd4:	5f424353 	svcpl	0x00424353
    fdd8:	52534643 	subspl	r4, r3, #70254592	@ 0x4300000
    fddc:	4d454d5f 	stclmi	13, cr4, [r5, #-380]	@ 0xfffffe84
    fde0:	4c554146 	ldfmie	f4, [r5], {70}	@ 0x46
    fde4:	5f525354 	svcpl	0x00525354
    fde8:	20736f50 	rsbscs	r6, r3, r0, asr pc
    fdec:	5534202b 	ldrpl	r2, [r4, #-43]!	@ 0xffffffd5
    fdf0:	5f5f0029 	svcpl	0x005f0029
    fdf4:	7366666f 	cmnvc	r6, #116391936	@ 0x6f00000
    fdf8:	666f7465 	strbtvs	r7, [pc], -r5, ror #8
    fdfc:	70797428 	rsbsvc	r7, r9, r8, lsr #8
    fe00:	69662c65 	stmdbvs	r6!, {r0, r2, r5, r6, sl, fp, sp}^
    fe04:	29646c65 	stmdbcs	r4!, {r0, r2, r5, r6, sl, fp, sp, lr}^
    fe08:	66666f20 	strbtvs	r6, [r6], -r0, lsr #30
    fe0c:	6f746573 	svcvs	0x00746573
    fe10:	79742866 	ldmdbvc	r4!, {r1, r2, r5, r6, fp, sp}^
    fe14:	202c6570 	eorcs	r6, ip, r0, ror r5
    fe18:	6c656966 			@ <UNDEFINED> instruction: 0x6c656966
    fe1c:	5f002964 	svcpl	0x00002964
    fe20:	38544e49 	ldmdacc	r4, {r0, r3, r6, r9, sl, fp, lr}^
    fe24:	445f545f 	ldrbmi	r5, [pc], #-1119	@ fe2c <_Min_Stack_Size+0xfa2c>
    fe28:	414c4345 	cmpmi	ip, r5, asr #6
    fe2c:	20444552 	subcs	r4, r4, r2, asr r5
    fe30:	43435200 	movtmi	r5, #12800	@ 0x3200
    fe34:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
    fe38:	435f434f 	cmpmi	pc, #1006632961	@ 0x3c000001
    fe3c:	455f4b4c 	ldrbmi	r4, [pc, #-2892]	@ f2f8 <_Min_Stack_Size+0xeef8>
    fe40:	2029284e 	eorcs	r2, r9, lr, asr #16
    fe44:	43435228 	movtmi	r5, #12840	@ 0x3228
    fe48:	50413e2d 	subpl	r3, r1, sp, lsr #28
    fe4c:	4e453242 	cdpmi	2, 4, cr3, cr5, cr2, {2}
    fe50:	3d7c2052 	ldclcc	0, cr2, [ip, #-328]!	@ 0xfffffeb8
    fe54:	20312820 	eorscs	r2, r1, r0, lsr #16
    fe58:	34203c3c 	strtcc	r3, [r0], #-3132	@ 0xfffff3c4
    fe5c:	5f002929 	svcpl	0x00002929
    fe60:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    fe64:	54535f54 	ldrbpl	r5, [r3], #-3924	@ 0xfffff0ac
    fe68:	52524544 	subspl	r4, r2, #68, 10	@ 0x11000000
    fe6c:	74705f28 	ldrbtvc	r5, [r0], #-3880	@ 0xfffff0d8
    fe70:	28202972 	stmdacs	r0!, {r1, r4, r5, r6, r8, fp, sp}
    fe74:	74705f28 	ldrbtvc	r5, [r0], #-3880	@ 0xfffff0d8
    fe78:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
    fe7c:	6474735f 	ldrbtvs	r7, [r4], #-863	@ 0xfffffca1
    fe80:	29727265 	ldmdbcs	r2!, {r0, r2, r5, r6, r9, ip, sp, lr}^
    fe84:	4c5f5f00 	mrrcmi	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
    fe88:	45475241 	strbmi	r5, [r7, #-577]	@ 0xfffffdbf
    fe8c:	454c4946 	strbmi	r4, [ip, #-2374]	@ 0xfffff6ba
    fe90:	5349565f 	movtpl	r5, #38495	@ 0x965f
    fe94:	454c4249 	strbmi	r4, [ip, #-585]	@ 0xfffffdb7
    fe98:	49003020 	stmdbmi	r0, {r5, ip, sp}
    fe9c:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
    fea0:	505f3152 	subspl	r3, pc, r2, asr r1	@ <UNPREDICTABLE>
    fea4:	32492045 	subcc	r2, r9, #69	@ 0x45
    fea8:	52435f43 	subpl	r5, r3, #268	@ 0x10c
    feac:	45505f31 	ldrbmi	r5, [r0, #-3889]	@ 0xfffff0cf
    feb0:	6b734d5f 	blvs	1ce3434 <_Min_Stack_Size+0x1ce3034>
    feb4:	4e495500 	cdpmi	5, 4, cr5, cr9, cr0, {0}
    feb8:	5f343654 	svcpl	0x00343654
    febc:	29782843 	ldmdbcs	r8!, {r0, r1, r6, fp, sp}^
    fec0:	555f5f20 	ldrbpl	r5, [pc, #-3872]	@ efa8 <_Min_Stack_Size+0xeba8>
    fec4:	36544e49 	ldrbcc	r4, [r4], -r9, asr #28
    fec8:	28435f34 	stmdacs	r3, {r2, r4, r5, r8, r9, sl, fp, ip, lr}^
    fecc:	5f002978 	svcpl	0x00002978
    fed0:	5254535f 	subspl	r5, r4, #2080374785	@ 0x7c000001
    fed4:	28474e49 	stmdacs	r7, {r0, r3, r6, r9, sl, fp, lr}^
    fed8:	23202978 			@ <UNDEFINED> instruction: 0x23202978
    fedc:	5f5f0078 	svcpl	0x005f0078
    fee0:	525f4f4e 	subspl	r4, pc, #312	@ 0x138
    fee4:	52555445 	subspl	r5, r5, #1157627904	@ 0x45000000
    fee8:	5f5f204e 	svcpl	0x005f204e
    feec:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
    fef0:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
    fef4:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
    fef8:	6e5f5f28 	cdpvs	15, 5, cr5, cr15, cr8, {1}
    fefc:	7465726f 	strbtvc	r7, [r5], #-623	@ 0xfffffd91
    ff00:	5f6e7275 	svcpl	0x006e7275
    ff04:	0029295f 	eoreq	r2, r9, pc, asr r9
    ff08:	4d435f5f 	stclmi	15, cr5, [r3, #-380]	@ 0xfffffe84
    ff0c:	534d435f 	movtpl	r4, #54111	@ 0xd35f
    ff10:	565f5349 	ldrbpl	r5, [pc], -r9, asr #6
    ff14:	49535245 	ldmdbmi	r3, {r0, r2, r6, r9, ip, lr}^
    ff18:	28204e4f 	stmdacs	r0!, {r0, r1, r2, r3, r6, r9, sl, fp, lr}
    ff1c:	435f5f28 	cmpmi	pc, #40, 30	@ 0xa0
    ff20:	4d435f4d 	stclmi	15, cr5, [r3, #-308]	@ 0xfffffecc
    ff24:	5f534953 	svcpl	0x00534953
    ff28:	53524556 	cmppl	r2, #360710144	@ 0x15800000
    ff2c:	5f4e4f49 	svcpl	0x004e4f49
    ff30:	4e49414d 	dvfmiem	f4, f1, #5.0
    ff34:	203c3c20 	eorscs	r3, ip, r0, lsr #24
    ff38:	29553631 	ldmdbcs	r5, {r0, r4, r5, r9, sl, ip, sp}^
    ff3c:	5f207c20 	svcpl	0x00207c20
    ff40:	5f4d435f 	svcpl	0x004d435f
    ff44:	49534d43 	ldmdbmi	r3, {r0, r1, r6, r8, sl, fp, lr}^
    ff48:	45565f53 	ldrbmi	r5, [r6, #-3923]	@ 0xfffff0ad
    ff4c:	4f495352 	svcmi	0x00495352
    ff50:	55535f4e 	ldrbpl	r5, [r3, #-3918]	@ 0xfffff0b2
    ff54:	00292042 	eoreq	r2, r9, r2, asr #32
    ff58:	4e41525f 	mcrmi	2, 2, r5, cr1, cr15, {2}
    ff5c:	5f383444 	svcpl	0x00383444
    ff60:	44454553 	strbmi	r4, [r5], #-1363	@ 0xfffffaad
    ff64:	2820315f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, ip, sp}
    ff68:	62617830 	rsbvs	r7, r1, #48, 16	@ 0x300000
    ff6c:	00296463 	eoreq	r6, r9, r3, ror #8
    ff70:	50435f46 	subpl	r5, r3, r6, asr #30
    ff74:	30382055 	eorscc	r2, r8, r5, asr r0
    ff78:	30303030 	eorscc	r3, r0, r0, lsr r0
    ff7c:	004c5530 	subeq	r5, ip, r0, lsr r5
    ff80:	5359535f 	cmppl	r9, #2080374785	@ 0x7c000001
    ff84:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
    ff88:	50555354 	subspl	r5, r5, r4, asr r3
    ff8c:	0020485f 	eoreq	r4, r0, pc, asr r8
    ff90:	5f495054 	svcpl	0x00495054
    ff94:	47495254 	smlsldmi	r5, r9, r4, r2
    ff98:	5f524547 	svcpl	0x00524547
    ff9c:	47495254 	smlsldmi	r5, r9, r4, r2
    ffa0:	5f524547 	svcpl	0x00524547
    ffa4:	206b734d 	rsbcs	r7, fp, sp, asr #6
    ffa8:	31783028 	cmncc	r8, r8, lsr #32
    ffac:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
    ffb0:	64747300 	ldrbtvs	r7, [r4], #-768	@ 0xfffffd00
    ffb4:	5f206e69 	svcpl	0x00206e69
    ffb8:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
    ffbc:	54535f54 	ldrbpl	r5, [r3], #-3924	@ 0xfffff0ac
    ffc0:	284e4944 	stmdacs	lr, {r2, r6, r8, fp, lr}^
    ffc4:	4545525f 	strbmi	r5, [r5, #-607]	@ 0xfffffda1
    ffc8:	0029544e 	eoreq	r5, r9, lr, asr #8
    ffcc:	5f424353 	svcpl	0x00424353
    ffd0:	52534349 	subspl	r4, r3, #603979777	@ 0x24000001
    ffd4:	494d4e5f 	stmdbmi	sp, {r0, r1, r2, r3, r4, r6, r9, sl, fp, lr}^
    ffd8:	444e4550 	strbmi	r4, [lr], #-1360	@ 0xfffffab0
    ffdc:	5f544553 	svcpl	0x00544553
    ffe0:	20736f50 	rsbscs	r6, r3, r0, asr pc
    ffe4:	00553133 	subseq	r3, r5, r3, lsr r1
    ffe8:	54535f5f 	ldrbpl	r5, [r3], #-3935	@ 0xfffff0a1
    ffec:	43495441 	movtmi	r5, #37953	@ 0x9441
    fff0:	4c4e495f 	mcrrmi	9, 5, r4, lr, cr15	@ <UNPREDICTABLE>
    fff4:	20454e49 	subcs	r4, r5, r9, asr #28
    fff8:	74617473 	strbtvc	r7, [r1], #-1139	@ 0xfffffb8d
    fffc:	69206369 	stmdbvs	r0!, {r0, r3, r5, r6, r8, r9, sp, lr}
   10000:	6e696c6e 	cdpvs	12, 6, cr6, cr9, cr14, {3}
   10004:	5f5f0065 	svcpl	0x005f0065
   10008:	41494c41 	cmpmi	r9, r1, asr #24
   1000c:	29782853 	ldmdbcs	r8!, {r0, r1, r4, r6, fp, sp}^
   10010:	615f5f20 	cmpvs	pc, r0, lsr #30
   10014:	69727474 	ldmdbvs	r2!, {r2, r4, r5, r6, sl, ip, sp, lr}^
   10018:	65747562 	ldrbvs	r7, [r4, #-1378]!	@ 0xfffffa9e
   1001c:	28205f5f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}
   10020:	696c6128 	stmdbvs	ip!, {r3, r5, r8, sp, lr}^
   10024:	78287361 	stmdavc	r8!, {r0, r5, r6, r8, r9, ip, sp, lr}
   10028:	00292929 	eoreq	r2, r9, r9, lsr #18
   1002c:	4349564e 	movtmi	r5, #38478	@ 0x964e
   10030:	5152495f 	cmppl	r2, pc, asr r9
   10034:	455f3031 	ldrbmi	r3, [pc, #-49]	@ 1000b <_Min_Stack_Size+0xfc0b>
   10038:	34495458 	strbcc	r5, [r9], #-1112	@ 0xfffffba8
   1003c:	616e455f 	cmnvs	lr, pc, asr r5
   10040:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
   10044:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
   10048:	5f434956 	svcpl	0x00434956
   1004c:	52455349 	subpl	r5, r5, #603979777	@ 0x24000001
   10050:	3d7c2030 	ldclcc	0, cr2, [ip, #-192]!	@ 0xffffff40
   10054:	20312820 	eorscs	r2, r1, r0, lsr #16
   10058:	31203c3c 			@ <UNDEFINED> instruction: 0x31203c3c
   1005c:	00292930 	eoreq	r2, r9, r0, lsr r9
   10060:	616d5f5f 	cmnvs	sp, pc, asr pc
   10064:	636f6c6c 	cmnvs	pc, #108, 24	@ 0x6c00
   10068:	6b696c5f 	blvs	1a6b1ec <_Min_Stack_Size+0x1a6adec>
   1006c:	5f5f2065 	svcpl	0x005f2065
   10070:	72747461 	rsbsvc	r7, r4, #1627389952	@ 0x61000000
   10074:	74756269 	ldrbtvc	r6, [r5], #-617	@ 0xfffffd97
   10078:	285f5f65 	ldmdacs	pc, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
   1007c:	6d5f5f28 	ldclvs	15, cr5, [pc, #-160]	@ ffe4 <_Min_Stack_Size+0xfbe4>
   10080:	6f6c6c61 	svcvs	0x006c6c61
   10084:	295f5f63 	ldmdbcs	pc, {r0, r1, r5, r6, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
   10088:	43530029 	cmpmi	r3, #41	@ 0x29
   1008c:	46485f42 	strbmi	r5, [r8], -r2, asr #30
   10090:	445f5253 	ldrbmi	r5, [pc], #-595	@ 10098 <_Min_Stack_Size+0xfc98>
   10094:	47554245 	ldrbmi	r4, [r5, -r5, asr #4]
   10098:	5f545645 	svcpl	0x00545645
   1009c:	206b734d 	rsbcs	r7, fp, sp, asr #6
   100a0:	4c553128 	ldfmie	f3, [r5], {40}	@ 0x28
   100a4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
   100a8:	5f424353 	svcpl	0x00424353
   100ac:	52534648 	subspl	r4, r3, #72, 12	@ 0x4800000
   100b0:	4245445f 	submi	r4, r5, #1593835520	@ 0x5f000000
   100b4:	56454755 			@ <UNDEFINED> instruction: 0x56454755
   100b8:	6f505f54 	svcvs	0x00505f54
   100bc:	47002973 	smlsdxmi	r0, r3, r9, r2
   100c0:	5f4f4950 	svcpl	0x004f4950
   100c4:	5f4e4950 	svcpl	0x004e4950
   100c8:	28203431 	stmdacs	r0!, {r0, r4, r5, sl, ip, sp}
   100cc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   100d0:	5f363174 	svcpl	0x00363174
   100d4:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
   100d8:	30303034 	eorscc	r3, r0, r4, lsr r0
   100dc:	49460029 	stmdbmi	r6, {r0, r3, r5}^
   100e0:	414e454c 	cmpmi	lr, ip, asr #10
   100e4:	4d5f454d 	cfldr64mi	mvdx4, [pc, #-308]	@ ffb8 <_Min_Stack_Size+0xfbb8>
   100e8:	31205841 			@ <UNDEFINED> instruction: 0x31205841
   100ec:	00343230 	eorseq	r3, r4, r0, lsr r2
   100f0:	52535f5f 	subspl	r5, r3, #380	@ 0x17c
   100f4:	78302057 	ldmdavc	r0!, {r0, r1, r2, r4, r6, sp}
   100f8:	30313030 	eorscc	r3, r1, r0, lsr r0
   100fc:	45525f00 	ldrbmi	r5, [r2, #-3840]	@ 0xfffff100
   10100:	5f544e45 	svcpl	0x00544e45
   10104:	43454843 	movtmi	r4, #22595	@ 0x5843
   10108:	4d455f4b 	stclmi	15, cr5, [r5, #-300]	@ 0xfffffed4
   1010c:	45475245 	strbmi	r5, [r7, #-581]	@ 0xfffffdbb
   10110:	2859434e 	ldmdacs	r9, {r1, r2, r3, r6, r8, r9, lr}^
   10114:	29726176 	ldmdbcs	r2!, {r1, r2, r4, r5, r6, r8, sp, lr}^
   10118:	45525f20 	ldrbmi	r5, [r2, #-3872]	@ 0xfffff0e0
   1011c:	5f544e45 	svcpl	0x00544e45
   10120:	43454843 	movtmi	r4, #22595	@ 0x5843
   10124:	6176284b 	cmnvs	r6, fp, asr #16
   10128:	5f202c72 	svcpl	0x00202c72
   1012c:	72656d65 	rsbvc	r6, r5, #6464	@ 0x1940
   10130:	636e6567 	cmnvs	lr, #432013312	@ 0x19c00000
   10134:	63202c79 			@ <UNDEFINED> instruction: 0x63202c79
   10138:	20726168 	rsbscs	r6, r2, r8, ror #2
   1013c:	5f202c2a 	svcpl	0x00202c2a
   10140:	4e454552 	mcrmi	5, 2, r4, cr5, cr2, {2}
   10144:	4d455f54 	stclmi	15, cr5, [r5, #-336]	@ 0xfffffeb0
   10148:	45475245 	strbmi	r5, [r7, #-581]	@ 0xfffffdbb
   1014c:	5f59434e 	svcpl	0x0059434e
   10150:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
   10154:	0029202c 	eoreq	r2, r9, ip, lsr #32
   10158:	48545f5f 	ldmdami	r4, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
   1015c:	20574f52 	subscs	r4, r7, r2, asr pc
   10160:	6c5f5f00 	mrrcvs	15, 0, r5, pc, cr0	@ <UNPREDICTABLE>
   10164:	5f6b636f 	svcpl	0x006b636f
   10168:	75716361 	ldrbvc	r6, [r1, #-865]!	@ 0xfffffc9f
   1016c:	5f657269 	svcpl	0x00657269
   10170:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
   10174:	76697372 			@ <UNDEFINED> instruction: 0x76697372
   10178:	6f6c2865 	svcvs	0x006c2865
   1017c:	20296b63 	eorcs	r6, r9, r3, ror #22
   10180:	65725f5f 	ldrbvs	r5, [r2, #-3935]!	@ 0xfffff0a1
   10184:	67726174 			@ <UNDEFINED> instruction: 0x67726174
   10188:	6c5f7465 	cfldrdvs	mvd7, [pc], {101}	@ 0x65
   1018c:	5f6b636f 	svcpl	0x006b636f
   10190:	75716361 	ldrbvc	r6, [r1, #-865]!	@ 0xfffffc9f
   10194:	5f657269 	svcpl	0x00657269
   10198:	75636572 	strbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
   1019c:	76697372 			@ <UNDEFINED> instruction: 0x76697372
   101a0:	6f6c2865 	svcvs	0x006c2865
   101a4:	00296b63 	eoreq	r6, r9, r3, ror #22
   101a8:	41484357 	cmpmi	r8, r7, asr r3
   101ac:	494d5f52 	stmdbmi	sp, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
   101b0:	5f28204e 	svcpl	0x0028204e
   101b4:	4843575f 	stmdami	r3, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
   101b8:	4d5f5241 	lfmmi	f5, 2, [pc, #-260]	@ 100bc <_Min_Stack_Size+0xfcbc>
   101bc:	5f5f4e49 	svcpl	0x005f4e49
   101c0:	32490029 	subcc	r0, r9, #41	@ 0x29
   101c4:	52535f43 	subspl	r5, r3, #268	@ 0x10c
   101c8:	58545f31 	ldmdapl	r4, {r0, r4, r5, r8, r9, sl, fp, ip, lr}^
   101cc:	734d5f45 	movtvc	r5, #57157	@ 0xdf45
   101d0:	3028206b 	eorcc	r2, r8, fp, rrx
   101d4:	4c553178 	ldfmie	f3, [r5], {120}	@ 0x78
   101d8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
   101dc:	5f433249 	svcpl	0x00433249
   101e0:	5f315253 	svcpl	0x00315253
   101e4:	5f455854 	svcpl	0x00455854
   101e8:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
   101ec:	42435300 	submi	r5, r3, #0, 6
   101f0:	5249415f 	subpl	r4, r9, #-1073741801	@ 0xc0000017
   101f4:	505f5243 	subspl	r5, pc, r3, asr #4
   101f8:	52474952 	subpl	r4, r7, #1343488	@ 0x148000
   101fc:	5f50554f 	svcpl	0x0050554f
   10200:	206b734d 	rsbcs	r7, fp, sp, asr #6
   10204:	4c553728 	mrrcmi	7, 2, r3, r5, cr8
   10208:	203c3c20 	eorscs	r3, ip, r0, lsr #24
   1020c:	5f424353 	svcpl	0x00424353
   10210:	43524941 	cmpmi	r2, #1064960	@ 0x104000
   10214:	52505f52 	subspl	r5, r0, #328	@ 0x148
   10218:	4f524749 	svcmi	0x00524749
   1021c:	505f5055 	subspl	r5, pc, r5, asr r0	@ <UNPREDICTABLE>
   10220:	0029736f 	eoreq	r7, r9, pc, ror #6
   10224:	5f433249 	svcpl	0x00433249
   10228:	5f315253 	svcpl	0x00315253
   1022c:	5f465442 	svcpl	0x00465442
   10230:	20736f50 	rsbscs	r6, r3, r0, asr pc
   10234:	29553228 	ldmdbcs	r5, {r3, r5, r9, ip, sp}^
   10238:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
   1023c:	4d5f3631 	ldclmi	6, cr3, [pc, #-196]	@ 10180 <_Min_Stack_Size+0xfd80>
   10240:	28204e49 	stmdacs	r0!, {r0, r3, r6, r9, sl, fp, lr}
   10244:	495f5f2d 	ldmdbmi	pc, {r0, r2, r3, r5, r8, r9, sl, fp, ip, lr}^	@ <UNPREDICTABLE>
   10248:	3631544e 	ldrtcc	r5, [r1], -lr, asr #8
   1024c:	58414d5f 	stmdapl	r1, {r0, r1, r2, r3, r4, r6, r8, sl, fp, lr}^
   10250:	2d205f5f 	stccs	15, cr5, [r0, #-380]!	@ 0xfffffe84
   10254:	00293120 	eoreq	r3, r9, r0, lsr #2
   10258:	5f424353 	svcpl	0x00424353
   1025c:	5f524343 	svcpl	0x00524343
   10260:	414b5453 	cmpmi	fp, r3, asr r4
   10264:	4e47494c 	vmlsmi.f16	s9, s14, s24	@ <UNPREDICTABLE>
   10268:	736f505f 	cmnvc	pc, #95	@ 0x5f
   1026c:	00553920 	subseq	r3, r5, r0, lsr #18
   10270:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
   10274:	20323354 	eorscs	r3, r2, r4, asr r3
   10278:	00226c22 	eoreq	r6, r2, r2, lsr #24
   1027c:	505f455f 	subspl	r4, pc, pc, asr r5	@ <UNPREDICTABLE>
   10280:	545f5053 	ldrbpl	r5, [pc], #-83	@ 10288 <_Min_Stack_Size+0xfe88>
   10284:	006b7361 	rsbeq	r7, fp, r1, ror #6
   10288:	4349564e 	movtmi	r5, #38478	@ 0x964e
   1028c:	5152495f 	cmppl	r2, pc, asr r9
   10290:	535f3533 	cmppl	pc, #213909504	@ 0xcc00000
   10294:	5f314950 	svcpl	0x00314950
   10298:	61736944 	cmnvs	r3, r4, asr #18
   1029c:	28656c62 	stmdacs	r5!, {r1, r5, r6, sl, fp, sp, lr}^
   102a0:	4e282029 	cdpmi	0, 2, cr2, cr8, cr9, {1}
   102a4:	5f434956 	svcpl	0x00434956
   102a8:	52454349 	subpl	r4, r5, #603979777	@ 0x24000001
   102ac:	3d7c2031 	ldclcc	0, cr2, [ip, #-196]!	@ 0xffffff3c
   102b0:	20312820 	eorscs	r2, r1, r0, lsr #16
   102b4:	33203c3c 			@ <UNDEFINED> instruction: 0x33203c3c
   102b8:	53002929 	movwpl	r2, #2345	@ 0x929
   102bc:	435f4243 	cmpmi	pc, #805306372	@ 0x30000004
   102c0:	5f525346 	svcpl	0x00525346
   102c4:	43434144 	movtmi	r4, #12612	@ 0x3144
   102c8:	4c4f4956 	mcrrmi	9, 5, r4, pc, cr6	@ <UNPREDICTABLE>
   102cc:	6b734d5f 	blvs	1ce3850 <_Min_Stack_Size+0x1ce3450>
   102d0:	55312820 	ldrpl	r2, [r1, #-2080]!	@ 0xfffff7e0
   102d4:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
   102d8:	42435320 	submi	r5, r3, #32, 6	@ 0x80000000
   102dc:	5346435f 	movtpl	r4, #25439	@ 0x635f
   102e0:	41445f52 	cmpmi	r4, r2, asr pc
   102e4:	49564343 	ldmdbmi	r6, {r0, r1, r6, r8, r9, lr}^
   102e8:	505f4c4f 	subspl	r4, pc, pc, asr #24
   102ec:	0029736f 	eoreq	r7, r9, pc, ror #6
   102f0:	5f545744 	svcpl	0x00545744
   102f4:	434e5546 	movtmi	r5, #58694	@ 0xe546
   102f8:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
   102fc:	4e55465f 	mrcmi	6, 2, r4, cr5, cr15, {2}
   10300:	4f495443 	svcmi	0x00495443
   10304:	734d5f4e 	movtvc	r5, #57166	@ 0xdf4e
   10308:	3028206b 	eorcc	r2, r8, fp, rrx
   1030c:	4c554678 	mrrcmi	6, 7, r4, r5, cr8
   10310:	43002920 	movwmi	r2, #2336	@ 0x920
   10314:	4465726f 	strbtmi	r7, [r5], #-623	@ 0xfffffd91
   10318:	67756265 	ldrbvs	r6, [r5, -r5, ror #4]!
   1031c:	4348445f 	movtmi	r4, #33887	@ 0x845f
   10320:	435f5253 	cmpmi	pc, #805306373	@ 0x30000005
   10324:	4554535f 	ldrbmi	r5, [r4, #-863]	@ 0xfffffca1
   10328:	6f505f50 	svcvs	0x00505f50
   1032c:	55322073 	ldrpl	r2, [r2, #-115]!	@ 0xffffff8d
   10330:	49505400 	ldmdbmi	r0, {sl, ip, lr}^
   10334:	4154495f 	cmpmi	r4, pc, asr r9
   10338:	54434254 	strbpl	r4, [r3], #-596	@ 0xfffffdac
   1033c:	415f3052 	cmpmi	pc, r2, asr r0	@ <UNPREDICTABLE>
   10340:	41455254 	cmpmi	r5, r4, asr r2
   10344:	5f315944 	svcpl	0x00315944
   10348:	206b734d 	rsbcs	r7, fp, sp, asr #6
   1034c:	31783028 	cmncc	r8, r8, lsr #32
   10350:	29204c55 	stmdbcs	r0!, {r0, r2, r4, r6, sl, fp, lr}
   10354:	54574400 	ldrbpl	r4, [r7], #-1024	@ 0xfffffc00
   10358:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
   1035c:	4f4e5f4c 	svcmi	0x004e5f4c
   10360:	50435254 	subpl	r5, r3, r4, asr r2
   10364:	4d5f544b 	cfldrdmi	mvd5, [pc, #-300]	@ 10240 <_Min_Stack_Size+0xfe40>
   10368:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
   1036c:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
   10370:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
   10374:	54574420 	ldrbpl	r4, [r7], #-1056	@ 0xfffffbe0
   10378:	5254435f 	subspl	r4, r4, #2080374785	@ 0x7c000001
   1037c:	4f4e5f4c 	svcmi	0x004e5f4c
   10380:	50435254 	subpl	r5, r3, r4, asr r2
   10384:	505f544b 	subspl	r5, pc, fp, asr #8
   10388:	0029736f 	eoreq	r7, r9, pc, ror #6
   1038c:	43414d5f 	movtmi	r4, #7519	@ 0x1d5f
   10390:	454e4948 	strbmi	r4, [lr, #-2376]	@ 0xfffff6b8
   10394:	59545f5f 	ldmdbpl	r4, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
   10398:	5f534550 	svcpl	0x00534550
   1039c:	47002048 	strmi	r2, [r0, -r8, asr #32]
   103a0:	5f4f4950 	svcpl	0x004f4950
   103a4:	5f4e4950 	svcpl	0x004e4950
   103a8:	28203531 	stmdacs	r0!, {r0, r4, r5, r8, sl, ip, sp}
   103ac:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   103b0:	5f363174 	svcpl	0x00363174
   103b4:	78302974 	ldmdavc	r0!, {r2, r4, r5, r6, r8, fp, sp}
   103b8:	30303038 	eorscc	r3, r0, r8, lsr r0
   103bc:	525f0029 	subspl	r0, pc, #41	@ 0x29
   103c0:	544e4545 	strbpl	r4, [lr], #-1349	@ 0xfffffabb
   103c4:	494e495f 	stmdbmi	lr, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
   103c8:	54505f54 	ldrbpl	r5, [r0], #-3924	@ 0xfffff0ac
   103cc:	455a5f52 	ldrbmi	r5, [sl, #-3922]	@ 0xfffff0ae
   103d0:	44454f52 	strbmi	r4, [r5], #-3922	@ 0xfffff0ae
   103d4:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
   103d8:	207b2029 	rsbscs	r2, fp, r9, lsr #32
   103dc:	72617628 	rsbvc	r7, r1, #40, 12	@ 0x2800000
   103e0:	5f3e2d29 	svcpl	0x003e2d29
   103e4:	69647473 	stmdbvs	r4!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}^
   103e8:	203d206e 	eorscs	r2, sp, lr, rrx
   103ec:	735f5f26 	cmpvc	pc, #38, 30	@ 0x98
   103f0:	5d305b66 	vldmdbpl	r0!, {d5-<overflow reg d55>}
   103f4:	7628203b 			@ <UNDEFINED> instruction: 0x7628203b
   103f8:	2d297261 	sfmcs	f7, 4, [r9, #-388]!	@ 0xfffffe7c
   103fc:	74735f3e 	ldrbtvc	r5, [r3], #-3902	@ 0xfffff0c2
   10400:	74756f64 	ldrbtvc	r6, [r5], #-3940	@ 0xfffff09c
   10404:	26203d20 	strtcs	r3, [r0], -r0, lsr #26
   10408:	66735f5f 	uhsaxvs	r5, r3, pc	@ <UNPREDICTABLE>
   1040c:	3b5d315b 	blcc	175c980 <_Min_Stack_Size+0x175c580>
   10410:	61762820 	cmnvs	r6, r0, lsr #16
   10414:	3e2d2972 			@ <UNDEFINED> instruction: 0x3e2d2972
   10418:	6474735f 	ldrbtvs	r7, [r4], #-863	@ 0xfffffca1
   1041c:	20727265 	rsbscs	r7, r2, r5, ror #4
   10420:	5f26203d 	svcpl	0x0026203d
   10424:	5b66735f 	blpl	19ad1a8 <_Min_Stack_Size+0x19acda8>
   10428:	203b5d32 	eorscs	r5, fp, r2, lsr sp
   1042c:	5f5f007d 	svcpl	0x005f007d
   10430:	4c4c554e 	cfstr64mi	mvdx5, [ip], {78}	@ 0x4e
   10434:	4c494241 	sfmmi	f4, 2, [r9], {65}	@ 0x41
   10438:	5f595449 	svcpl	0x00595449
   1043c:	47415250 	smlsldmi	r5, r1, r0, r2
   10440:	505f414d 	subspl	r4, pc, sp, asr #2
   10444:	0020504f 	eoreq	r5, r0, pc, asr #32
   10448:	5f424353 	svcpl	0x00424353
   1044c:	43524941 	cmpmi	r2, #1064960	@ 0x104000
   10450:	45565f52 	ldrbmi	r5, [r6, #-3922]	@ 0xfffff0ae
   10454:	454b5443 	strbmi	r5, [fp, #-1091]	@ 0xfffffbbd
   10458:	41545359 	cmpmi	r4, r9, asr r3
   1045c:	734d5f54 	movtvc	r5, #57172	@ 0xdf54
   10460:	3028206b 	eorcc	r2, r8, fp, rrx
   10464:	46464678 			@ <UNDEFINED> instruction: 0x46464678
   10468:	204c5546 	subcs	r5, ip, r6, asr #10
   1046c:	53203c3c 			@ <UNDEFINED> instruction: 0x53203c3c
   10470:	415f4243 	cmpmi	pc, r3, asr #4
   10474:	52435249 	subpl	r5, r3, #-1879048188	@ 0x90000004
   10478:	4345565f 	movtmi	r5, #22111	@ 0x565f
   1047c:	59454b54 	stmdbpl	r5, {r2, r4, r6, r8, r9, fp, lr}^
   10480:	54415453 	strbpl	r5, [r1], #-1107	@ 0xfffffbad
   10484:	736f505f 	cmnvc	pc, #95	@ 0x5f
   10488:	5f5f0029 	svcpl	0x005f0029
   1048c:	6c697562 	cfstr64vs	mvdx7, [r9], #-392	@ 0xfffffe78
   10490:	5f6e6974 	svcpl	0x006e6974
   10494:	67696c61 	strbvs	r6, [r9, -r1, ror #24]!
   10498:	6f645f6e 	svcvs	0x00645f6e
   1049c:	78286e77 	stmdavc	r8!, {r0, r1, r2, r4, r5, r6, r9, sl, fp, sp, lr}
   104a0:	696c612c 	stmdbvs	ip!, {r2, r3, r5, r8, sp, lr}^
   104a4:	20296e67 	eorcs	r6, r9, r7, ror #28
   104a8:	5f5f2828 	svcpl	0x005f2828
   104ac:	65707974 	ldrbvs	r7, [r0, #-2420]!	@ 0xfffff68c
   104b0:	5f5f666f 	svcpl	0x005f666f
   104b4:	29297828 	stmdbcs	r9!, {r3, r5, fp, ip, sp, lr}
   104b8:	29782828 	ldmdbcs	r8!, {r3, r5, fp, sp}^
