NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   104bc:	287e2826 	ldmdacs	lr!, {r1, r2, r5, fp, sp}^
   104c0:	696c6128 	stmdbvs	ip!, {r3, r5, r8, sp, lr}^
   104c4:	2d296e67 	stccs	14, cr6, [r9, #-412]!	@ 0xfffffe64
   104c8:	29292931 	stmdbcs	r9!, {r0, r4, r5, r8, fp, sp}
   104cc:	50540029 	subspl	r0, r4, r9, lsr #32
   104d0:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
   104d4:	5f304f46 	svcpl	0x00304f46
   104d8:	304d5445 	subcc	r5, sp, r5, asr #8
   104dc:	736f505f 	cmnvc	pc, #95	@ 0x5f
   104e0:	00553020 	subseq	r3, r5, r0, lsr #32
   104e4:	65726f43 	ldrbvs	r6, [r2, #-3907]!	@ 0xfffff0bd
   104e8:	75626544 	strbvc	r6, [r2, #-1348]!	@ 0xfffffabc
   104ec:	45445f67 	strbmi	r5, [r4, #-3943]	@ 0xfffff099
   104f0:	5f52434d 	svcpl	0x0052434d
   104f4:	435f4356 	cmpmi	pc, #1476395009	@ 0x58000001
   104f8:	52454b48 	subpl	r4, r5, #72, 22	@ 0x12000
   104fc:	734d5f52 	movtvc	r5, #57170	@ 0xdf52
   10500:	3128206b 			@ <UNDEFINED> instruction: 0x3128206b
   10504:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
   10508:	6f43203c 	svcvs	0x0043203c
   1050c:	65446572 	strbvs	r6, [r4, #-1394]	@ 0xfffffa8e
   10510:	5f677562 	svcpl	0x00677562
   10514:	434d4544 	movtmi	r4, #54596	@ 0xd544
   10518:	43565f52 	cmpmi	r6, #328	@ 0x148
   1051c:	4b48435f 	blmi	12212a0 <_Min_Stack_Size+0x1220ea0>
   10520:	5f525245 	svcpl	0x00525245
   10524:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
   10528:	42435300 	submi	r5, r3, #0, 6
   1052c:	5346435f 	movtpl	r4, #25439	@ 0x635f
   10530:	454d5f52 	strbmi	r5, [sp, #-3922]	@ 0xfffff0ae
   10534:	5541464d 	strbpl	r4, [r1, #-1613]	@ 0xfffff9b3
   10538:	5253544c 	subspl	r5, r3, #76, 8	@ 0x4c000000
   1053c:	736f505f 	cmnvc	pc, #95	@ 0x5f
   10540:	00553020 	subseq	r3, r5, r0, lsr #32
   10544:	42444c5f 	submi	r4, r4, #24320	@ 0x5f00
   10548:	51455f4c 	cmppl	r5, ip, asr #30
   1054c:	4c42445f 	cfstrdmi	mvd4, [r2], {95}	@ 0x5f
   10550:	53003120 	movwpl	r3, #288	@ 0x120
   10554:	69547379 	ldmdbvs	r4, {r0, r3, r4, r5, r6, r8, r9, ip, sp, lr}^
   10558:	435f6b63 	cmpmi	pc, #101376	@ 0x18c00
   1055c:	42494c41 	submi	r4, r9, #16640	@ 0x4100
   10560:	4e45545f 	mcrmi	4, 2, r5, cr5, cr15, {2}
   10564:	505f534d 	subspl	r5, pc, sp, asr #6
   10568:	3020736f 	eorcc	r7, r0, pc, ror #6
   1056c:	57440055 	smlsldpl	r0, r4, r5, r0
   10570:	55465f54 	strbpl	r5, [r6, #-3924]	@ 0xfffff0ac
   10574:	4954434e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, r9, lr}^
   10578:	445f4e4f 	ldrbmi	r4, [pc], #-3663	@ 10580 <_Min_Stack_Size+0x10180>
   1057c:	56415441 	strbpl	r5, [r1], -r1, asr #8
   10580:	455a4953 	ldrbmi	r4, [sl, #-2387]	@ 0xfffff6ad
   10584:	6b734d5f 	blvs	1ce3b08 <_Min_Stack_Size+0x1ce3708>
   10588:	78302820 	ldmdavc	r0!, {r5, fp, sp}
   1058c:	204c5533 	subcs	r5, ip, r3, lsr r5
   10590:	44203c3c 	strtmi	r3, [r0], #-3132	@ 0xfffff3c4
   10594:	465f5457 			@ <UNDEFINED> instruction: 0x465f5457
   10598:	54434e55 	strbpl	r4, [r3], #-3669	@ 0xfffff1ab
   1059c:	5f4e4f49 	svcpl	0x004e4f49
   105a0:	41544144 	cmpmi	r4, r4, asr #2
   105a4:	5a495356 	bpl	1265304 <_Min_Stack_Size+0x1264f04>
   105a8:	6f505f45 	svcvs	0x00505f45
   105ac:	53002973 	movwpl	r2, #2419	@ 0x973
   105b0:	495f4243 	ldmdbmi	pc, {r0, r1, r6, r9, lr}^	@ <UNPREDICTABLE>
   105b4:	5f525343 	svcpl	0x00525343
   105b8:	444e4550 	strbmi	r4, [lr], #-1360	@ 0xfffffab0
   105bc:	45535453 	ldrbmi	r5, [r3, #-1107]	@ 0xfffffbad
   105c0:	6f505f54 	svcvs	0x00505f54
   105c4:	36322073 			@ <UNDEFINED> instruction: 0x36322073
   105c8:	32490055 	subcc	r0, r9, #85	@ 0x55
   105cc:	28203143 	stmdacs	r0!, {r0, r1, r6, r8, ip, sp}
   105d0:	43324928 	teqmi	r2, #40, 18	@ 0xa0000
   105d4:	7079545f 	rsbsvc	r5, r9, pc, asr r4
   105d8:	66654465 	strbtvs	r4, [r5], -r5, ror #8
   105dc:	3249292a 	subcc	r2, r9, #688128	@ 0xa8000
   105e0:	425f3143 	subsmi	r3, pc, #-1073741808	@ 0xc0000010
   105e4:	29455341 	stmdbcs	r5, {r0, r6, r8, r9, ip, lr}^
   105e8:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
   105ec:	5341525f 	movtpl	r5, #4703	@ 0x125f
   105f0:	54415f52 	strbpl	r5, [r1], #-3922	@ 0xfffff0ae
   105f4:	5f535254 	svcpl	0x00535254
   105f8:	20736f50 	rsbscs	r6, r3, r0, asr pc
   105fc:	00553631 	subseq	r3, r5, r1, lsr r6
   10600:	52415355 	subpl	r5, r1, #1409286145	@ 0x54000001
   10604:	28203254 	stmdacs	r0!, {r2, r4, r6, r9, ip, sp}
   10608:	41535528 	cmpmi	r3, r8, lsr #10
   1060c:	545f5452 	ldrbpl	r5, [pc], #-1106	@ 10614 <_Min_Stack_Size+0x10214>
   10610:	44657079 	strbtmi	r7, [r5], #-121	@ 0xffffff87
   10614:	2a206665 	bcs	829fb0 <_Min_Stack_Size+0x829bb0>
   10618:	41535529 	cmpmi	r3, r9, lsr #10
   1061c:	5f325452 	svcpl	0x00325452
   10620:	45534142 	ldrbmi	r4, [r3, #-322]	@ 0xfffffebe
   10624:	32490029 	subcc	r0, r9, #41	@ 0x29
   10628:	52535f43 	subspl	r5, r3, #268	@ 0x10c
   1062c:	45505f31 	ldrbmi	r5, [r0, #-3889]	@ 0xfffff0cf
   10630:	52524543 	subspl	r4, r2, #281018368	@ 0x10c00000
   10634:	43324920 	teqmi	r2, #32, 18	@ 0x80000
   10638:	3152535f 	cmpcc	r2, pc, asr r3
   1063c:	4345505f 	movtmi	r5, #20575	@ 0x505f
   10640:	5f525245 	svcpl	0x00525245
   10644:	006b734d 	rsbeq	r7, fp, sp, asr #6
   10648:	5f55504d 	svcpl	0x0055504d
   1064c:	52534152 	subspl	r4, r3, #-2147483628	@ 0x80000014
   10650:	5845545f 	stmdapl	r5, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
   10654:	6b734d5f 	blvs	1ce3bd8 <_Min_Stack_Size+0x1ce37d8>
   10658:	78302820 	ldmdavc	r0!, {r5, fp, sp}
   1065c:	204c5537 	subcs	r5, ip, r7, lsr r5
   10660:	4d203c3c 	stcmi	12, cr3, [r0, #-240]!	@ 0xffffff10
   10664:	525f5550 	subspl	r5, pc, #80, 10	@ 0x14000000
   10668:	5f525341 	svcpl	0x00525341
   1066c:	5f584554 	svcpl	0x00584554
   10670:	29736f50 	ldmdbcs	r3!, {r4, r6, r8, r9, sl, fp, sp, lr}^
   10674:	55504d00 	ldrbpl	r4, [r0, #-3328]	@ 0xfffff300
   10678:	5341525f 	movtpl	r5, #4703	@ 0x125f
   1067c:	5f535f52 	svcpl	0x00535f52
   10680:	20736f50 	rsbscs	r6, r3, r0, asr pc
   10684:	00553831 	subseq	r3, r5, r1, lsr r8
   10688:	5f495054 	svcpl	0x00495054
   1068c:	54564544 	ldrbpl	r4, [r6], #-1348	@ 0xfffffabc
   10690:	5f455059 	svcpl	0x00455059
   10694:	6f6a614d 	svcvs	0x006a614d
   10698:	70795472 	rsbsvc	r5, r9, r2, ror r4
   1069c:	734d5f65 	movtvc	r5, #57189	@ 0xdf65
   106a0:	3028206b 	eorcc	r2, r8, fp, rrx
   106a4:	4c554678 	mrrcmi	6, 7, r4, r5, cr8
   106a8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
   106ac:	5f495054 	svcpl	0x00495054
   106b0:	54564544 	ldrbpl	r4, [r6], #-1348	@ 0xfffffabc
   106b4:	5f455059 	svcpl	0x00455059
   106b8:	6f6a614d 	svcvs	0x006a614d
   106bc:	70795472 	rsbsvc	r5, r9, r2, ror r4
   106c0:	6f505f65 	svcvs	0x00505f65
   106c4:	5f002973 	svcpl	0x00002973
   106c8:	6c6f765f 	stclvs	6, cr7, [pc], #-380	@ 10554 <_Min_Stack_Size+0x10154>
   106cc:	6c697461 	cfstrdvs	mvd7, [r9], #-388	@ 0xfffffe7c
   106d0:	6f762065 	svcvs	0x00762065
   106d4:	6974616c 	ldmdbvs	r4!, {r2, r3, r5, r6, r8, sp, lr}^
   106d8:	5400656c 	strpl	r6, [r0], #-1388	@ 0xfffffa94
   106dc:	445f4950 	ldrbmi	r4, [pc], #-2384	@ 106e4 <_Min_Stack_Size+0x102e4>
   106e0:	44495645 	strbmi	r5, [r9], #-1605	@ 0xfffff9bb
   106e4:	6e694d5f 	mcrvs	13, 3, r4, cr9, cr15, {2}
   106e8:	53667542 	cmnpl	r6, #276824064	@ 0x10800000
   106ec:	734d5f7a 	movtvc	r5, #57210	@ 0xdf7a
   106f0:	3028206b 	eorcc	r2, r8, fp, rrx
   106f4:	4c553778 	mrrcmi	7, 7, r3, r5, cr8
   106f8:	203c3c20 	eorscs	r3, ip, r0, lsr #24
   106fc:	5f495054 	svcpl	0x00495054
   10700:	49564544 	ldmdbmi	r6, {r2, r6, r8, sl, lr}^
   10704:	694d5f44 	stmdbvs	sp, {r2, r6, r8, r9, sl, fp, ip, lr}^
   10708:	6675426e 	ldrbtvs	r4, [r5], -lr, ror #4
   1070c:	505f7a53 	subspl	r7, pc, r3, asr sl	@ <UNPREDICTABLE>
   10710:	0029736f 	eoreq	r7, r9, pc, ror #6
   10714:	5f495054 	svcpl	0x00495054
   10718:	4f464946 	svcmi	0x00464946
   1071c:	54455f30 	strbpl	r5, [r5], #-3888	@ 0xfffff0d0
   10720:	79625f4d 	stmdbvc	r2!, {r0, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   10724:	6f636574 	svcvs	0x00636574
   10728:	5f746e75 	svcpl	0x00746e75
   1072c:	206b734d 	rsbcs	r7, fp, sp, asr #6
   10730:	33783028 	cmncc	r8, #40	@ 0x28
   10734:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
   10738:	5054203c 	subspl	r2, r4, ip, lsr r0
   1073c:	49465f49 	stmdbmi	r6, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
   10740:	5f304f46 	svcpl	0x00304f46
   10744:	5f4d5445 	svcpl	0x004d5445
   10748:	65747962 	ldrbvs	r7, [r4, #-2402]!	@ 0xfffff69e
   1074c:	6e756f63 	cdpvs	15, 7, cr6, cr5, cr3, {3}
   10750:	6f505f74 	svcvs	0x00505f74
   10754:	45002973 	strmi	r2, [r0, #-2419]	@ 0xfffff68d
   10758:	31495458 	cmpcc	r9, r8, asr r4
   1075c:	5152495f 	cmppl	r2, pc, asr r9
   10760:	5f003720 	svcpl	0x00003720
   10764:	4645445f 			@ <UNDEFINED> instruction: 0x4645445f
   10768:	44454e49 	strbmi	r4, [r5], #-3657	@ 0xfffff1b7
   1076c:	7274705f 	rsbsvc	r7, r4, #95	@ 0x5f
   10770:	66666964 	strbtvs	r6, [r6], -r4, ror #18
   10774:	0020745f 	eoreq	r7, r0, pc, asr r4
   10778:	5f545744 	svcpl	0x00545744
   1077c:	434e5546 	movtmi	r5, #58694	@ 0xe546
   10780:	4e4f4954 			@ <UNDEFINED> instruction: 0x4e4f4954
   10784:	5441445f 	strbpl	r4, [r1], #-1119	@ 0xfffffba1
   10788:	44415641 	strbmi	r5, [r1], #-1601	@ 0xfffff9bf
   1078c:	5f315244 	svcpl	0x00315244
   10790:	206b734d 	rsbcs	r7, fp, sp, asr #6
   10794:	46783028 	ldrbtmi	r3, [r8], -r8, lsr #32
   10798:	3c204c55 	stccc	12, cr4, [r0], #-340	@ 0xfffffeac
   1079c:	5744203c 	smlaldxpl	r2, r4, ip, r0
   107a0:	55465f54 	strbpl	r5, [r6, #-3924]	@ 0xfffff0ac
   107a4:	4954434e 	ldmdbmi	r4, {r1, r2, r3, r6, r8, r9, lr}^
   107a8:	445f4e4f 	ldrbmi	r4, [pc], #-3663	@ 107b0 <_Min_Stack_Size+0x103b0>
   107ac:	56415441 	strbpl	r5, [r1], -r1, asr #8
   107b0:	52444441 	subpl	r4, r4, #1090519040	@ 0x41000000
   107b4:	6f505f31 	svcvs	0x00505f31
   107b8:	49002973 	stmdbmi	r0, {r0, r1, r4, r5, r6, r8, fp, sp}
   107bc:	535f4332 	cmppl	pc, #-939524096	@ 0xc8000000
   107c0:	475f3252 			@ <UNDEFINED> instruction: 0x475f3252
   107c4:	41434e45 	cmpmi	r3, r5, asr #28
   107c8:	4d5f4c4c 	ldclmi	12, cr4, [pc, #-304]	@ 106a0 <_Min_Stack_Size+0x102a0>
   107cc:	28206b73 	stmdacs	r0!, {r0, r1, r4, r5, r6, r8, r9, fp, sp, lr}
   107d0:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
   107d4:	3c3c204c 	ldccc	0, cr2, [ip], #-304	@ 0xfffffed0
   107d8:	43324920 	teqmi	r2, #32, 18	@ 0x80000
   107dc:	3252535f 	subscc	r5, r2, #2080374785	@ 0x7c000001
   107e0:	4e45475f 	mcrmi	7, 2, r4, cr5, cr15, {2}
   107e4:	4c4c4143 	stfmie	f4, [ip], {67}	@ 0x43
   107e8:	736f505f 	cmnvc	pc, #95	@ 0x5f
   107ec:	49570029 	ldmdbmi	r7, {r0, r3, r5}^
   107f0:	4d5f544e 	cfldrdmi	mvd5, [pc, #-312]	@ 106c0 <_Min_Stack_Size+0x102c0>
   107f4:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
   107f8:	49575f5f 	ldmdbmi	r7, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
   107fc:	4d5f544e 	cfldrdmi	mvd5, [pc, #-312]	@ 106cc <_Min_Stack_Size+0x102cc>
   10800:	5f5f5841 	svcpl	0x005f5841
   10804:	57440029 	strbpl	r0, [r4, -r9, lsr #32]
   10808:	54435f54 	strbpl	r5, [r3], #-3924	@ 0xfffff0ac
   1080c:	4e5f4c52 	mrcmi	12, 2, r4, cr15, cr2, {2}
   10810:	4352544f 	cmpmi	r2, #1325400064	@ 0x4f000000
   10814:	5f544b50 	svcpl	0x00544b50
   10818:	20736f50 	rsbscs	r6, r3, r0, asr pc
   1081c:	00553732 	subseq	r3, r5, r2, lsr r7
   10820:	57454e5f 	smlsldpl	r4, r5, pc, lr	@ <UNPREDICTABLE>
   10824:	5f42494c 	svcpl	0x0042494c
   10828:	49445453 	stmdbmi	r4, {r0, r1, r4, r6, sl, ip, lr}^
   1082c:	20485f4f 	subcs	r5, r8, pc, asr #30
   10830:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   10834:	495f3449 	ldmdbmi	pc, {r0, r3, r6, sl, ip, sp}^	@ <UNPREDICTABLE>
   10838:	31205152 			@ <UNDEFINED> instruction: 0x31205152
   1083c:	5f5f0030 	svcpl	0x005f0030
   10840:	74656773 	strbtvc	r6, [r5], #-1907	@ 0xfffff88d
   10844:	28725f63 	ldmdacs	r2!, {r0, r1, r5, r6, r8, r9, sl, fp, ip, lr}^
   10848:	74705f5f 	ldrbtvc	r5, [r0], #-3935	@ 0xfffff0a1
   1084c:	5f5f2c72 	svcpl	0x005f2c72
   10850:	5f202970 	svcpl	0x00202970
   10854:	6567735f 	strbvs	r7, [r7, #-863]!	@ 0xfffffca1
   10858:	725f6374 	subsvc	r6, pc, #116, 6	@ 0xd0000001
   1085c:	725f7761 	subsvc	r7, pc, #25427968	@ 0x1840000
   10860:	705f5f28 	subsvc	r5, pc, r8, lsr #30
   10864:	202c7274 	eorcs	r7, ip, r4, ror r2
   10868:	29705f5f 	ldmdbcs	r0!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
   1086c:	544e4900 	strbpl	r4, [lr], #-2304	@ 0xfffff700
   10870:	4d5f3233 	lfmmi	f3, 2, [pc, #-204]	@ 107ac <_Min_Stack_Size+0x103ac>
   10874:	28205841 	stmdacs	r0!, {r0, r6, fp, ip, lr}
   10878:	4e495f5f 	mcrmi	15, 2, r5, cr9, cr15, {2}
   1087c:	5f323354 	svcpl	0x00323354
   10880:	5f58414d 	svcpl	0x0058414d
   10884:	4e00295f 			@ <UNDEFINED> instruction: 0x4e00295f
   10888:	72455f6f 	subvc	r5, r5, #444	@ 0x1bc
   1088c:	00726f72 	rsbseq	r6, r2, r2, ror pc
   10890:	5f435653 	svcpl	0x00435653
   10894:	5f004449 	svcpl	0x00004449
   10898:	61656865 	cmnvs	r5, r5, ror #16
   1089c:	75430070 	strbvc	r0, [r3, #-112]	@ 0xffffff90
   108a0:	6e657272 	mcrvs	2, 3, r7, cr5, cr2, {3}
   108a4:	61545f74 	cmpvs	r4, r4, ror pc
   108a8:	53006b73 	movwpl	r6, #2931	@ 0xb73
   108ac:	6e5f4356 	mrcvs	3, 2, r4, cr15, cr6, {2}
   108b0:	65626d75 	strbvs	r6, [r2, #-3445]!	@ 0xfffff28b
   108b4:	794d0072 	stmdbvc	sp, {r1, r4, r5, r6}^
   108b8:	4f54525f 	svcmi	0x0054525f
   108bc:	72435f53 	subvc	r5, r3, #332	@ 0x14c
   108c0:	5f746165 	svcpl	0x00746165
   108c4:	6b736154 	blvs	1ce8e1c <_Min_Stack_Size+0x1ce8a1c>
   108c8:	5f534f00 	svcpl	0x00534f00
   108cc:	65646f4d 	strbvs	r6, [r4, #-3917]!	@ 0xfffff0b3
   108d0:	4f004449 	svcmi	0x00004449
   108d4:	73615453 	cmnvc	r1, #1392508928	@ 0x53000000
   108d8:	4500736b 	strmi	r7, [r0, #-875]	@ 0xfffffc95
   108dc:	726f7272 	rsbvc	r7, pc, #536870919	@ 0x20000007
   108e0:	7465725f 	strbtvc	r7, [r5], #-607	@ 0xfffffda1
   108e4:	5f534f00 	svcpl	0x00534f00
   108e8:	00435653 	subeq	r5, r3, r3, asr r6
   108ec:	525f794d 	subspl	r7, pc, #1261568	@ 0x134000
   108f0:	5f534f54 	svcpl	0x00534f54
   108f4:	61657243 	cmnvs	r5, r3, asr #4
   108f8:	74535f74 	ldrbvc	r5, [r3], #-3956	@ 0xfffff08c
   108fc:	006b6361 	rsbeq	r6, fp, r1, ror #6
   10900:	626d754e 	rsbvs	r7, sp, #327155712	@ 0x13800000
   10904:	415f7265 	cmpmi	pc, r5, ror #4
   10908:	76697463 	strbtvc	r7, [r9], -r3, ror #8
   1090c:	73615465 	cmnvc	r1, #1694498816	@ 0x65000000
   10910:	5200736b 	andpl	r7, r0, #-1409286143	@ 0xac000001
   10914:	79646165 	stmdbvc	r4!, {r0, r2, r5, r6, r8, sp, lr}^
   10918:	6575515f 	ldrbvs	r5, [r5, #-351]!	@ 0xfffffea1
   1091c:	465f6575 			@ <UNDEFINED> instruction: 0x465f6575
   10920:	004f4649 	subeq	r4, pc, r9, asr #12
   10924:	6b736154 	blvs	1ce8e7c <_Min_Stack_Size+0x1ce8a7c>
   10928:	6378655f 	cmnvs	r8, #398458880	@ 0x17c00000
   1092c:	65646565 	strbvs	r6, [r4, #-1381]!	@ 0xfffffa9b
   10930:	65685f64 	strbvs	r5, [r8, #-3940]!	@ 0xfffff09c
   10934:	4d007061 	stcmi	0, cr7, [r0, #-388]	@ 0xfffffe7c
   10938:	6f745279 	svcvs	0x00745279
   1093c:	72655f73 	rsbvc	r5, r5, #460	@ 0x1cc
   10940:	5f726f72 	svcpl	0x00726f72
   10944:	2e006469 	cdpcs	4, 0, cr6, cr0, cr9, {3}
   10948:	54522f2e 	ldrbpl	r2, [r2], #-3886	@ 0xfffff0d2
   1094c:	532f534f 			@ <UNDEFINED> instruction: 0x532f534f
   10950:	64656863 	strbtvs	r6, [r5], #-2147	@ 0xfffff79d
   10954:	72616c75 	rsbvc	r6, r1, #29952	@ 0x7500
   10958:	5000632e 	andpl	r6, r0, lr, lsr #6
   1095c:	53646e65 	cmnpl	r4, #1616	@ 0x650
   10960:	61485f56 	cmpvs	r8, r6, asr pc
   10964:	656c646e 	strbvs	r6, [ip, #-1134]!	@ 0xfffffb92
   10968:	74530072 	ldrbvc	r0, [r3], #-114	@ 0xffffff8e
   1096c:	5f6b6361 	svcpl	0x006b6361
   10970:	6d617246 	sfmvs	f7, 2, [r1, #-280]!	@ 0xfffffee8
   10974:	655f0065 	ldrbvs	r0, [pc, #-101]	@ 10917 <_Min_Stack_Size+0x10517>
   10978:	63617473 	cmnvs	r1, #1929379840	@ 0x73000000
   1097c:	7254006b 	subsvc	r0, r4, #107	@ 0x6b
   10980:	4e006665 	cfmadd32mi	mvax3, mvfx6, mvfx0, mvfx5
   10984:	5f747865 	svcpl	0x00747865
   10988:	6b736154 	blvs	1ce8ee0 <_Min_Stack_Size+0x1ce8ae0>
   1098c:	5f534f00 	svcpl	0x00534f00
   10990:	6e6e7552 	mcrvs	5, 3, r7, cr14, cr2, {2}
   10994:	00676e69 	rsbeq	r6, r7, r9, ror #28
   10998:	525f594d 	subspl	r5, pc, #1261568	@ 0x134000
   1099c:	5f534f54 	svcpl	0x00534f54
   109a0:	6b736154 	blvs	1ce8ef8 <_Min_Stack_Size+0x1ce8af8>
   109a4:	63617453 	cmnvs	r1, #1392508928	@ 0x53000000
   109a8:	6552006b 	ldrbvs	r0, [r2, #-107]	@ 0xffffff95
   109ac:	5f796461 	svcpl	0x00796461
   109b0:	75657551 	strbvc	r7, [r5, #-1361]!	@ 0xfffffaaf
   109b4:	65520065 	ldrbvs	r0, [r2, #-101]	@ 0xffffff9b
   109b8:	5f796461 	svcpl	0x00796461
   109bc:	55455551 	strbpl	r5, [r5, #-1361]	@ 0xfffffaaf
   109c0:	4e495f45 	cdpmi	15, 4, cr5, cr9, cr5, {2}
   109c4:	455f5449 	ldrbmi	r5, [pc, #-1097]	@ 10583 <_Min_Stack_Size+0x10183>
   109c8:	524f5252 	subpl	r5, pc, #536870917	@ 0x20000005
   109cc:	52594d00 	subspl	r4, r9, #0, 26
   109d0:	5f534f54 	svcpl	0x00534f54
   109d4:	656c6449 	strbvs	r6, [ip, #-1097]!	@ 0xfffffbb7
   109d8:	7361545f 	cmnvc	r1, #1593835520	@ 0x5f000000
   109dc:	534f006b 	movtpl	r0, #61547	@ 0xf06b
   109e0:	4356535f 	cmpmi	r6, #2080374785	@ 0x7c000001
   109e4:	7465535f 	strbtvc	r5, [r5], #-863	@ 0xfffffca1
   109e8:	50535000 	subspl	r5, r3, r0
   109ec:	7361545f 	cmnvc	r1, #1593835520	@ 0x5f000000
   109f0:	6f4c5f6b 	svcvs	0x004c5f6b
   109f4:	6f746163 	svcvs	0x00746163
   109f8:	534f0072 	movtpl	r0, #61554	@ 0xf072
   109fc:	7375535f 	cmnvc	r5, #2080374785	@ 0x7c000001
   10a00:	646e6570 	strbtvs	r6, [lr], #-1392	@ 0xfffffa90
   10a04:	4c444900 	mcrrmi	9, 0, r4, r4, cr0	@ <UNPREDICTABLE>
   10a08:	61545f45 	cmpvs	r4, r5, asr #30
   10a0c:	4f006b73 	svcmi	0x00006b73
   10a10:	6f435f53 	svcvs	0x00435f53
   10a14:	6f72746e 	svcvs	0x0072746e
   10a18:	455f006c 	ldrbmi	r0, [pc, #-108]	@ 109b4 <_Min_Stack_Size+0x105b4>
   10a1c:	50534d5f 	subspl	r4, r3, pc, asr sp
   10a20:	7361545f 	cmnvc	r1, #1593835520	@ 0x5f000000
   10a24:	4154006b 	cmpmi	r4, fp, rrx
   10a28:	5f534b53 	svcpl	0x00534b53
   10a2c:	5f58414d 	svcpl	0x0058414d
   10a30:	204d554e 	subcs	r5, sp, lr, asr #10
   10a34:	00303031 	eorseq	r3, r0, r1, lsr r0
   10a38:	5452594d 	ldrbpl	r5, [r2], #-2381	@ 0xfffff6b3
   10a3c:	495f534f 	ldmdbmi	pc, {r0, r1, r2, r3, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
   10a40:	0074696e 	rsbseq	r6, r4, lr, ror #18
   10a44:	4d5f535f 	ldclmi	3, cr5, [pc, #-380]	@ 108d0 <_Min_Stack_Size+0x104d0>
   10a48:	545f5053 	ldrbpl	r5, [pc], #-83	@ 10a50 <_Min_Stack_Size+0x10650>
   10a4c:	006b7361 	rsbeq	r7, fp, r1, ror #6
   10a50:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10a54:	36445036 			@ <UNDEFINED> instruction: 0x36445036
   10a58:	58452820 	stmdapl	r5, {r5, fp, sp}^
   10a5c:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   10a60:	5f4f4950 	svcpl	0x004f4950
   10a64:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   10a68:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 10a70 <_Min_Stack_Size+0x10670>
   10a6c:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   10a70:	2c364954 			@ <UNDEFINED> instruction: 0x2c364954
   10a74:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   10a78:	202c444f 	eorcs	r4, ip, pc, asr #8
   10a7c:	4f495047 	svcmi	0x00495047
   10a80:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   10a84:	202c365f 	eorcs	r3, ip, pc, asr r6
   10a88:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10a8c:	52495f36 	subpl	r5, r9, #54, 30	@ 0xd8
   10a90:	4d007d51 	stcmi	13, cr7, [r0, #-324]	@ 0xfffffebc
   10a94:	5f4c4143 	svcpl	0x004c4143
   10a98:	4f495047 	svcmi	0x00495047
   10a9c:	696e495f 	stmdbvs	lr!, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
   10aa0:	58450074 	stmdapl	r5, {r2, r4, r5, r6}^
   10aa4:	50394954 	eorspl	r4, r9, r4, asr r9
   10aa8:	28203942 	stmdacs	r0!, {r1, r6, r8, fp, ip, sp}
   10aac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10ab0:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   10ab4:	614d5f4f 	cmpvs	sp, pc, asr #30
   10ab8:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   10abc:	7b29745f 	blvc	a6dc40 <_Min_Stack_Size+0xa6d840>
   10ac0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10ac4:	47202c39 			@ <UNDEFINED> instruction: 0x47202c39
   10ac8:	424f4950 	submi	r4, pc, #80, 18	@ 0x140000
   10acc:	5047202c 	subpl	r2, r7, ip, lsr #32
   10ad0:	505f4f49 	subspl	r4, pc, r9, asr #30
   10ad4:	395f4e49 	ldmdbcc	pc, {r0, r3, r6, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
   10ad8:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   10adc:	5f394954 	svcpl	0x00394954
   10ae0:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   10ae4:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   10ae8:	00524349 	subseq	r4, r2, r9, asr #6
   10aec:	4f495047 	svcmi	0x00495047
   10af0:	74754f5f 	ldrbtvc	r4, [r5], #-3935	@ 0xfffff0a1
   10af4:	5f747570 	svcpl	0x00747570
   10af8:	65657053 	strbvs	r7, [r5, #-83]!	@ 0xffffffad
   10afc:	46410064 	strbmi	r0, [r1], -r4, rrx
   10b00:	475f4f49 	ldrbmi	r4, [pc, -r9, asr #30]
   10b04:	5f4f4950 	svcpl	0x004f4950
   10b08:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10b0c:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   10b10:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   10b14:	20297828 	eorcs	r7, r9, r8, lsr #16
   10b18:	20782828 	rsbscs	r2, r8, r8, lsr #16
   10b1c:	47203d3d 			@ <UNDEFINED> instruction: 0x47203d3d
   10b20:	414f4950 	cmpmi	pc, r0, asr r9	@ <UNPREDICTABLE>
   10b24:	203f2029 	eorscs	r2, pc, r9, lsr #32
   10b28:	203a2030 	eorscs	r2, sl, r0, lsr r0
   10b2c:	3d207828 	stccc	8, cr7, [r0, #-160]!	@ 0xffffff60
   10b30:	5047203d 	subpl	r2, r7, sp, lsr r0
   10b34:	29424f49 	stmdbcs	r2, {r0, r3, r6, r8, r9, sl, fp, lr}^
   10b38:	31203f20 			@ <UNDEFINED> instruction: 0x31203f20
   10b3c:	28203a20 	stmdacs	r0!, {r5, r9, fp, ip, sp}
   10b40:	3d3d2078 	ldccc	0, cr2, [sp, #-480]!	@ 0xfffffe20
   10b44:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   10b48:	2029434f 	eorcs	r4, r9, pc, asr #6
   10b4c:	2032203f 	eorscs	r2, r2, pc, lsr r0
   10b50:	7828203a 	stmdavc	r8!, {r1, r3, r4, r5, sp}
   10b54:	203d3d20 	eorscs	r3, sp, r0, lsr #26
   10b58:	4f495047 	svcmi	0x00495047
   10b5c:	3f202944 	svccc	0x00202944
   10b60:	3a203320 	bcc	81d7e8 <_Min_Stack_Size+0x81d3e8>
   10b64:	00293020 	eoreq	r3, r9, r0, lsr #32
   10b68:	5f495845 	svcpl	0x00495845
   10b6c:	006e6950 	rsbeq	r6, lr, r0, asr r9
   10b70:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10b74:	38435038 	stmdacc	r3, {r3, r4, r5, ip, lr}^
   10b78:	58452820 	stmdapl	r5, {r5, fp, sp}^
   10b7c:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   10b80:	5f4f4950 	svcpl	0x004f4950
   10b84:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   10b88:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 10b90 <_Min_Stack_Size+0x10790>
   10b8c:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   10b90:	2c384954 			@ <UNDEFINED> instruction: 0x2c384954
   10b94:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   10b98:	202c434f 	eorcs	r4, ip, pc, asr #6
   10b9c:	4f495047 	svcmi	0x00495047
   10ba0:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   10ba4:	202c385f 	eorcs	r3, ip, pc, asr r8
   10ba8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10bac:	52495f38 	subpl	r5, r9, #56, 30	@ 0xe0
   10bb0:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   10bb4:	31495458 	cmpcc	r9, r8, asr r4
   10bb8:	31445032 	cmpcc	r4, r2, lsr r0
   10bbc:	45282032 	strmi	r2, [r8, #-50]!	@ 0xffffffce
   10bc0:	5f495458 	svcpl	0x00495458
   10bc4:	4f495047 	svcmi	0x00495047
   10bc8:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   10bcc:	5f676e69 	svcpl	0x00676e69
   10bd0:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   10bd4:	31495458 	cmpcc	r9, r8, asr r4
   10bd8:	47202c32 			@ <UNDEFINED> instruction: 0x47202c32
   10bdc:	444f4950 	strbmi	r4, [pc], #-2384	@ 10be4 <_Min_Stack_Size+0x107e4>
   10be0:	5047202c 	subpl	r2, r7, ip, lsr #32
   10be4:	505f4f49 	subspl	r4, pc, r9, asr #30
   10be8:	315f4e49 	cmpcc	pc, r9, asr #28
   10bec:	45202c32 	strmi	r2, [r0, #-3122]!	@ 0xfffff3ce
   10bf0:	31495458 	cmpcc	r9, r8, asr r4
   10bf4:	52495f32 	subpl	r5, r9, #50, 30	@ 0xc8
   10bf8:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   10bfc:	31495458 	cmpcc	r9, r8, asr r4
   10c00:	31425031 	cmpcc	r2, r1, lsr r0
   10c04:	45282031 	strmi	r2, [r8, #-49]!	@ 0xffffffcf
