NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   10c08:	5f495458 	svcpl	0x00495458
   10c0c:	4f495047 	svcmi	0x00495047
   10c10:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   10c14:	5f676e69 	svcpl	0x00676e69
   10c18:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   10c1c:	31495458 	cmpcc	r9, r8, asr r4
   10c20:	47202c31 			@ <UNDEFINED> instruction: 0x47202c31
   10c24:	424f4950 	submi	r4, pc, #80, 18	@ 0x140000
   10c28:	5047202c 	subpl	r2, r7, ip, lsr #32
   10c2c:	505f4f49 	subspl	r4, pc, r9, asr #30
   10c30:	315f4e49 	cmpcc	pc, r9, asr #28
   10c34:	45202c31 	strmi	r2, [r0, #-3121]!	@ 0xfffff3cf
   10c38:	31495458 	cmpcc	r9, r8, asr r4
   10c3c:	52495f31 	subpl	r5, r9, #49, 30	@ 0xc4
   10c40:	50007d51 	andpl	r7, r0, r1, asr sp
   10c44:	5152495f 	cmppl	r2, pc, asr r9
   10c48:	6c61435f 	stclvs	3, cr4, [r1], #-380	@ 0xfffffe84
   10c4c:	6361426c 	cmnvs	r1, #108, 4	@ 0xc0000006
   10c50:	5845006b 	stmdapl	r5, {r0, r1, r3, r5, r6}^
   10c54:	34314954 	ldrtcc	r4, [r1], #-2388	@ 0xfffff6ac
   10c58:	34314150 	ldrtcc	r4, [r1], #-336	@ 0xfffffeb0
   10c5c:	58452820 	stmdapl	r5, {r5, fp, sp}^
   10c60:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   10c64:	5f4f4950 	svcpl	0x004f4950
   10c68:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   10c6c:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 10c74 <_Min_Stack_Size+0x10874>
   10c70:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   10c74:	34314954 	ldrtcc	r4, [r1], #-2388	@ 0xfffff6ac
   10c78:	5047202c 	subpl	r2, r7, ip, lsr #32
   10c7c:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   10c80:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   10c84:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   10c88:	34315f4e 	ldrtcc	r5, [r1], #-3918	@ 0xfffff0b2
   10c8c:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   10c90:	34314954 	ldrtcc	r4, [r1], #-2388	@ 0xfffff6ac
   10c94:	5152495f 	cmppl	r2, pc, asr r9
   10c98:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   10c9c:	30314954 	eorscc	r4, r1, r4, asr r9
   10ca0:	00303120 	eorseq	r3, r0, r0, lsr #2
   10ca4:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   10ca8:	5458455f 	ldrbpl	r4, [r8], #-1375	@ 0xfffffaa1
   10cac:	50475f49 	subpl	r5, r7, r9, asr #30
   10cb0:	555f4f49 	ldrbpl	r4, [pc, #-3913]	@ fd6f <_Min_Stack_Size+0xf96f>
   10cb4:	74616470 	strbtvc	r6, [r1], #-1136	@ 0xfffffb90
   10cb8:	58450065 	stmdapl	r5, {r0, r2, r5, r6}^
   10cbc:	50344954 	eorspl	r4, r4, r4, asr r9
   10cc0:	28203443 	stmdacs	r0!, {r0, r1, r6, sl, ip, sp}
   10cc4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10cc8:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   10ccc:	614d5f4f 	cmpvs	sp, pc, asr #30
   10cd0:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   10cd4:	7b29745f 	blvc	a6de58 <_Min_Stack_Size+0xa6da58>
   10cd8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10cdc:	47202c34 			@ <UNDEFINED> instruction: 0x47202c34
   10ce0:	434f4950 	movtmi	r4, #63824	@ 0xf950
   10ce4:	5047202c 	subpl	r2, r7, ip, lsr #32
   10ce8:	505f4f49 	subspl	r4, pc, r9, asr #30
   10cec:	345f4e49 	ldrbcc	r4, [pc], #-3657	@ 10cf4 <_Min_Stack_Size+0x108f4>
   10cf0:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   10cf4:	5f344954 	svcpl	0x00344954
   10cf8:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   10cfc:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   10d00:	20323149 	eorscs	r3, r2, r9, asr #2
   10d04:	45003231 	strmi	r3, [r0, #-561]	@ 0xfffffdcf
   10d08:	31495458 	cmpcc	r9, r8, asr r4
   10d0c:	20314150 	eorscs	r4, r1, r0, asr r1
   10d10:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   10d14:	50475f49 	subpl	r5, r7, r9, asr #30
   10d18:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 10bfc <_Min_Stack_Size+0x107fc>
   10d1c:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   10d20:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   10d24:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   10d28:	202c3149 	eorcs	r3, ip, r9, asr #2
   10d2c:	4f495047 	svcmi	0x00495047
   10d30:	47202c41 	strmi	r2, [r0, -r1, asr #24]!
   10d34:	5f4f4950 	svcpl	0x004f4950
   10d38:	5f4e4950 	svcpl	0x004e4950
   10d3c:	45202c31 	strmi	r2, [r0, #-3121]!	@ 0xfffff3cf
   10d40:	31495458 	cmpcc	r9, r8, asr r4
   10d44:	5152495f 	cmppl	r2, pc, asr r9
   10d48:	4641007d 			@ <UNDEFINED> instruction: 0x4641007d
   10d4c:	455f4f49 	ldrbmi	r4, [pc, #-3913]	@ fe0b <_Min_Stack_Size+0xfa0b>
   10d50:	43495458 	movtmi	r5, #37976	@ 0x9458
   10d54:	6f505f52 	svcvs	0x00505f52
   10d58:	69746973 	ldmdbvs	r4!, {r0, r1, r4, r5, r6, r8, fp, sp, lr}^
   10d5c:	45006e6f 	strmi	r6, [r0, #-3695]	@ 0xfffff191
   10d60:	38495458 	stmdacc	r9, {r3, r4, r6, sl, ip, lr}^
   10d64:	20384450 	eorscs	r4, r8, r0, asr r4
   10d68:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   10d6c:	50475f49 	subpl	r5, r7, r9, asr #30
   10d70:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 10c54 <_Min_Stack_Size+0x10854>
   10d74:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   10d78:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   10d7c:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   10d80:	202c3849 	eorcs	r3, ip, r9, asr #16
   10d84:	4f495047 	svcmi	0x00495047
   10d88:	47202c44 	strmi	r2, [r0, -r4, asr #24]!
   10d8c:	5f4f4950 	svcpl	0x004f4950
   10d90:	5f4e4950 	svcpl	0x004e4950
   10d94:	45202c38 	strmi	r2, [r0, #-3128]!	@ 0xfffff3c8
   10d98:	38495458 	stmdacc	r9, {r3, r4, r6, sl, ip, lr}^
   10d9c:	5152495f 	cmppl	r2, pc, asr r9
   10da0:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   10da4:	34314954 	ldrtcc	r4, [r1], #-2388	@ 0xfffff6ac
   10da8:	00343120 	eorseq	r3, r4, r0, lsr #2
   10dac:	52535446 	subspl	r5, r3, #1174405120	@ 0x46000000
   10db0:	755f5f00 	ldrbvc	r5, [pc, #-3840]	@ feb8 <_Min_Stack_Size+0xfab8>
   10db4:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
   10db8:	4500745f 	strmi	r7, [r0, #-1119]	@ 0xfffffba1
   10dbc:	31495458 	cmpcc	r9, r8, asr r4
   10dc0:	20314350 	eorscs	r4, r1, r0, asr r3
   10dc4:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   10dc8:	50475f49 	subpl	r5, r7, r9, asr #30
   10dcc:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 10cb0 <_Min_Stack_Size+0x108b0>
   10dd0:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   10dd4:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   10dd8:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   10ddc:	202c3149 	eorcs	r3, ip, r9, asr #2
   10de0:	4f495047 	svcmi	0x00495047
   10de4:	47202c43 	strmi	r2, [r0, -r3, asr #24]!
   10de8:	5f4f4950 	svcpl	0x004f4950
   10dec:	5f4e4950 	svcpl	0x004e4950
   10df0:	45202c31 	strmi	r2, [r0, #-3121]!	@ 0xfffff3cf
   10df4:	31495458 	cmpcc	r9, r8, asr r4
   10df8:	5152495f 	cmppl	r2, pc, asr r9
   10dfc:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   10e00:	495f4954 	ldmdbmi	pc, {r2, r4, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
   10e04:	445f5152 	ldrbmi	r5, [pc], #-338	@ 10e0c <_Min_Stack_Size+0x10a0c>
   10e08:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
   10e0c:	3020656c 	eorcc	r6, r0, ip, ror #10
   10e10:	6e695000 	cdpvs	0, 6, cr5, cr9, cr0, {0}
   10e14:	00474643 	subeq	r4, r7, r3, asr #12
   10e18:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10e1c:	43503431 	cmpmi	r0, #822083584	@ 0x31000000
   10e20:	28203431 	stmdacs	r0!, {r0, r4, r5, sl, ip, sp}
   10e24:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10e28:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   10e2c:	614d5f4f 	cmpvs	sp, pc, asr #30
   10e30:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   10e34:	7b29745f 	blvc	a6dfb8 <_Min_Stack_Size+0xa6dbb8>
   10e38:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10e3c:	202c3431 	eorcs	r3, ip, r1, lsr r4
   10e40:	4f495047 	svcmi	0x00495047
   10e44:	47202c43 	strmi	r2, [r0, -r3, asr #24]!
   10e48:	5f4f4950 	svcpl	0x004f4950
   10e4c:	5f4e4950 	svcpl	0x004e4950
   10e50:	202c3431 	eorcs	r3, ip, r1, lsr r4
   10e54:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10e58:	495f3431 	ldmdbmi	pc, {r0, r4, r5, sl, ip, sp}^	@ <UNPREDICTABLE>
   10e5c:	007d5152 	rsbseq	r5, sp, r2, asr r1
   10e60:	61647055 	qdsubvs	r7, r5, r4
   10e64:	455f6574 	ldrbmi	r6, [pc, #-1396]	@ 108f8 <_Min_Stack_Size+0x104f8>
   10e68:	00495458 	subeq	r5, r9, r8, asr r4
   10e6c:	52535452 	subspl	r5, r3, #1375731712	@ 0x52000000
   10e70:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   10e74:	79545f49 	ldmdbvc	r4, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
   10e78:	65446570 	strbvs	r6, [r4, #-1392]	@ 0xfffffa90
   10e7c:	58450066 	stmdapl	r5, {r1, r2, r5, r6}^
   10e80:	20394954 	eorscs	r4, r9, r4, asr r9
   10e84:	58450039 	stmdapl	r5, {r0, r3, r4, r5}^
   10e88:	50394954 	eorspl	r4, r9, r4, asr r9
   10e8c:	28203941 	stmdacs	r0!, {r0, r6, r8, fp, ip, sp}
   10e90:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10e94:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   10e98:	614d5f4f 	cmpvs	sp, pc, asr #30
   10e9c:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   10ea0:	7b29745f 	blvc	a6e024 <_Min_Stack_Size+0xa6dc24>
   10ea4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10ea8:	47202c39 			@ <UNDEFINED> instruction: 0x47202c39
   10eac:	414f4950 	cmpmi	pc, r0, asr r9	@ <UNPREDICTABLE>
   10eb0:	5047202c 	subpl	r2, r7, ip, lsr #32
   10eb4:	505f4f49 	subspl	r4, pc, r9, asr #30
   10eb8:	395f4e49 	ldmdbcc	pc, {r0, r3, r6, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
   10ebc:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   10ec0:	5f394954 	svcpl	0x00394954
   10ec4:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   10ec8:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   10ecc:	41503249 	cmpmi	r0, r9, asr #4
   10ed0:	45282032 	strmi	r2, [r8, #-50]!	@ 0xffffffce
   10ed4:	5f495458 	svcpl	0x00495458
   10ed8:	4f495047 	svcmi	0x00495047
   10edc:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   10ee0:	5f676e69 	svcpl	0x00676e69
   10ee4:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   10ee8:	32495458 	subcc	r5, r9, #88, 8	@ 0x58000000
   10eec:	5047202c 	subpl	r2, r7, ip, lsr #32
   10ef0:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   10ef4:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   10ef8:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   10efc:	2c325f4e 	ldccs	15, cr5, [r2], #-312	@ 0xfffffec8
   10f00:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   10f04:	495f3249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
   10f08:	007d5152 	rsbseq	r5, sp, r2, asr r1
   10f0c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10f10:	6972545f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
   10f14:	72656767 	rsbvc	r6, r5, #27000832	@ 0x19c0000
   10f18:	4c41465f 	mcrrmi	6, 5, r4, r1, cr15
   10f1c:	474e494c 	strbmi	r4, [lr, -ip, asr #18]
   10f20:	47003120 	strmi	r3, [r0, -r0, lsr #2]
   10f24:	5f4f4950 	svcpl	0x004f4950
   10f28:	45444f4d 	strbmi	r4, [r4, #-3917]	@ 0xfffff0b3
   10f2c:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   10f30:	72545f49 	subsvc	r5, r4, #292	@ 0x124
   10f34:	65676769 	strbvs	r6, [r7, #-1897]!	@ 0xfffff897
   10f38:	49525f72 	ldmdbmi	r2, {r1, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
   10f3c:	474e4953 	smlsldmi	r4, lr, r3, r9
   10f40:	45003020 	strmi	r3, [r0, #-32]	@ 0xffffffe0
   10f44:	37495458 	smlsldcc	r5, r9, r8, r4
   10f48:	20374150 	eorscs	r4, r7, r0, asr r1
   10f4c:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   10f50:	50475f49 	subpl	r5, r7, r9, asr #30
   10f54:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 10e38 <_Min_Stack_Size+0x10a38>
   10f58:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   10f5c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   10f60:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   10f64:	202c3749 	eorcs	r3, ip, r9, asr #14
   10f68:	4f495047 	svcmi	0x00495047
   10f6c:	47202c41 	strmi	r2, [r0, -r1, asr #24]!
   10f70:	5f4f4950 	svcpl	0x004f4950
   10f74:	5f4e4950 	svcpl	0x004e4950
   10f78:	45202c37 	strmi	r2, [r0, #-3127]!	@ 0xfffff3c9
   10f7c:	37495458 	smlsldcc	r5, r9, r8, r4
   10f80:	5152495f 	cmppl	r2, pc, asr r9
   10f84:	4552007d 	ldrbmi	r0, [r2, #-125]	@ 0xffffff83
   10f88:	56524553 			@ <UNDEFINED> instruction: 0x56524553
   10f8c:	00304445 	eorseq	r4, r0, r5, asr #8
   10f90:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10f94:	00372037 	eorseq	r2, r7, r7, lsr r0
   10f98:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10f9c:	44503131 	ldrbmi	r3, [r0], #-305	@ 0xfffffecf
   10fa0:	28203131 	stmdacs	r0!, {r0, r4, r5, r8, ip, sp}
   10fa4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10fa8:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   10fac:	614d5f4f 	cmpvs	sp, pc, asr #30
   10fb0:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   10fb4:	7b29745f 	blvc	a6e138 <_Min_Stack_Size+0xa6dd38>
   10fb8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10fbc:	202c3131 	eorcs	r3, ip, r1, lsr r1
   10fc0:	4f495047 	svcmi	0x00495047
   10fc4:	47202c44 	strmi	r2, [r0, -r4, asr #24]!
   10fc8:	5f4f4950 	svcpl	0x004f4950
   10fcc:	5f4e4950 	svcpl	0x004e4950
   10fd0:	202c3131 	eorcs	r3, ip, r1, lsr r1
   10fd4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10fd8:	495f3131 	ldmdbmi	pc, {r0, r4, r5, r8, ip, sp}^	@ <UNPREDICTABLE>
   10fdc:	007d5152 	rsbseq	r5, sp, r2, asr r1
   10fe0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10fe4:	42503331 	subsmi	r3, r0, #-1006632960	@ 0xc4000000
   10fe8:	28203331 	stmdacs	r0!, {r0, r4, r5, r8, r9, ip, sp}
   10fec:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   10ff0:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   10ff4:	614d5f4f 	cmpvs	sp, pc, asr #30
   10ff8:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   10ffc:	7b29745f 	blvc	a6e180 <_Min_Stack_Size+0xa6dd80>
   11000:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11004:	202c3331 	eorcs	r3, ip, r1, lsr r3
   11008:	4f495047 	svcmi	0x00495047
   1100c:	47202c42 	strmi	r2, [r0, -r2, asr #24]!
   11010:	5f4f4950 	svcpl	0x004f4950
   11014:	5f4e4950 	svcpl	0x004e4950
   11018:	202c3331 	eorcs	r3, ip, r1, lsr r3
   1101c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11020:	495f3331 	ldmdbmi	pc, {r0, r4, r5, r8, r9, ip, sp}^	@ <UNPREDICTABLE>
   11024:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11028:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1102c:	52495f34 	subpl	r5, r9, #52, 30	@ 0xd0
   11030:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
   11034:	72656c64 	rsbvc	r6, r5, #100, 24	@ 0x6400
   11038:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   1103c:	41503349 	cmpmi	r0, r9, asr #6
   11040:	45282033 	strmi	r2, [r8, #-51]!	@ 0xffffffcd
   11044:	5f495458 	svcpl	0x00495458
   11048:	4f495047 	svcmi	0x00495047
   1104c:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11050:	5f676e69 	svcpl	0x00676e69
   11054:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11058:	33495458 	movtcc	r5, #37976	@ 0x9458
   1105c:	5047202c 	subpl	r2, r7, ip, lsr #32
   11060:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   11064:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11068:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   1106c:	2c335f4e 	ldccs	15, cr5, [r3], #-312	@ 0xfffffec8
   11070:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   11074:	495f3349 	ldmdbmi	pc, {r0, r3, r6, r8, r9, ip, sp}^	@ <UNPREDICTABLE>
   11078:	007d5152 	rsbseq	r5, sp, r2, asr r1
   1107c:	69755f5f 	ldmdbvs	r5!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, fp, ip, lr}^
   11080:	3631746e 	ldrtcc	r7, [r1], -lr, ror #8
   11084:	4700745f 	smlsdmi	r0, pc, r4, r7	@ <UNPREDICTABLE>
   11088:	5f4f4950 	svcpl	0x004f4950
   1108c:	436e6950 	cmnmi	lr, #80, 18	@ 0x140000
   11090:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
   11094:	00745f67 	rsbseq	r5, r4, r7, ror #30
   11098:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1109c:	6e69505f 	mcrvs	0, 3, r5, cr9, cr15, {2}
   110a0:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
   110a4:	745f6769 	ldrbvc	r6, [pc], #-1897	@ 110ac <_Min_Stack_Size+0x10cac>
   110a8:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   110ac:	50353149 	eorspl	r3, r5, r9, asr #2
   110b0:	20353144 	eorscs	r3, r5, r4, asr #2
   110b4:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   110b8:	50475f49 	subpl	r5, r7, r9, asr #30
   110bc:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 10fa0 <_Min_Stack_Size+0x10ba0>
   110c0:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   110c4:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   110c8:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   110cc:	2c353149 	ldfcss	f3, [r5], #-292	@ 0xfffffedc
   110d0:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   110d4:	202c444f 	eorcs	r4, ip, pc, asr #8
   110d8:	4f495047 	svcmi	0x00495047
   110dc:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   110e0:	2c35315f 	ldfcss	f3, [r5], #-380	@ 0xfffffe84
   110e4:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   110e8:	5f353149 	svcpl	0x00353149
   110ec:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   110f0:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   110f4:	42503149 	subsmi	r3, r0, #1073741842	@ 0x40000012
   110f8:	45282031 	strmi	r2, [r8, #-49]!	@ 0xffffffcf
   110fc:	5f495458 	svcpl	0x00495458
   11100:	4f495047 	svcmi	0x00495047
   11104:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11108:	5f676e69 	svcpl	0x00676e69
   1110c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11110:	31495458 	cmpcc	r9, r8, asr r4
   11114:	5047202c 	subpl	r2, r7, ip, lsr #32
   11118:	2c424f49 	mcrrcs	15, 4, r4, r2, cr9
   1111c:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11120:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11124:	2c315f4e 	ldccs	15, cr5, [r1], #-312	@ 0xfffffec8
   11128:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   1112c:	495f3149 	ldmdbmi	pc, {r0, r3, r6, r8, ip, sp}^	@ <UNPREDICTABLE>
   11130:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11134:	5250414d 	subspl	r4, r0, #1073741843	@ 0x40000013
   11138:	58450032 	stmdapl	r5, {r1, r4, r5}^
   1113c:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   11140:	35314250 	ldrcc	r4, [r1, #-592]!	@ 0xfffffdb0
   11144:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11148:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   1114c:	5f4f4950 	svcpl	0x004f4950
   11150:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11154:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 1115c <_Min_Stack_Size+0x10d5c>
   11158:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   1115c:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   11160:	5047202c 	subpl	r2, r7, ip, lsr #32
   11164:	2c424f49 	mcrrcs	15, 4, r4, r2, cr9
   11168:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   1116c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11170:	35315f4e 	ldrcc	r5, [r1, #-3918]!	@ 0xfffff0b2
   11174:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11178:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   1117c:	5152495f 	cmppl	r2, pc, asr r9
   11180:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   11184:	30314954 	eorscc	r4, r1, r4, asr r9
   11188:	30314150 	eorscc	r4, r1, r0, asr r1
   1118c:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11190:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11194:	5f4f4950 	svcpl	0x004f4950
   11198:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   1119c:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 111a4 <_Min_Stack_Size+0x10da4>
   111a0:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   111a4:	30314954 	eorscc	r4, r1, r4, asr r9
   111a8:	5047202c 	subpl	r2, r7, ip, lsr #32
   111ac:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   111b0:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   111b4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   111b8:	30315f4e 	eorscc	r5, r1, lr, asr #30
   111bc:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   111c0:	30314954 	eorscc	r4, r1, r4, asr r9
   111c4:	5152495f 	cmppl	r2, pc, asr r9
   111c8:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   111cc:	31314954 	teqcc	r1, r4, asr r9
   111d0:	31314150 	teqcc	r1, r0, asr r1
   111d4:	58452820 	stmdapl	r5, {r5, fp, sp}^
   111d8:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   111dc:	5f4f4950 	svcpl	0x004f4950
   111e0:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   111e4:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 111ec <_Min_Stack_Size+0x10dec>
   111e8:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   111ec:	31314954 	teqcc	r1, r4, asr r9
   111f0:	5047202c 	subpl	r2, r7, ip, lsr #32
   111f4:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   111f8:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   111fc:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11200:	31315f4e 	teqcc	r1, lr, asr #30
   11204:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11208:	31314954 	teqcc	r1, r4, asr r9
   1120c:	5152495f 	cmppl	r2, pc, asr r9
   11210:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   11214:	50304954 	eorspl	r4, r0, r4, asr r9
   11218:	28203041 	stmdacs	r0!, {r0, r6, ip, sp}
   1121c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11220:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11224:	614d5f4f 	cmpvs	sp, pc, asr #30
   11228:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   1122c:	7b29745f 	blvc	a6e3b0 <_Min_Stack_Size+0xa6dfb0>
   11230:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11234:	47202c30 			@ <UNDEFINED> instruction: 0x47202c30
   11238:	414f4950 	cmpmi	pc, r0, asr r9	@ <UNPREDICTABLE>
   1123c:	5047202c 	subpl	r2, r7, ip, lsr #32
   11240:	505f4f49 	subspl	r4, pc, r9, asr #30
   11244:	305f4e49 	subscc	r4, pc, r9, asr #28
   11248:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   1124c:	5f304954 	svcpl	0x00304954
   11250:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   11254:	69725400 	ldmdbvs	r2!, {sl, ip, lr}^
   11258:	72656767 	rsbvc	r6, r5, #27000832	@ 0x19c0000
   1125c:	7361435f 	cmnvc	r1, #2080374785	@ 0x7c000001
   11260:	50470065 	subpl	r0, r7, r5, rrx
   11264:	00784f49 	rsbseq	r4, r8, r9, asr #30
   11268:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1126c:	41503331 	cmpmi	r0, r1, lsr r3
   11270:	28203331 	stmdacs	r0!, {r0, r4, r5, r8, r9, ip, sp}
   11274:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11278:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   1127c:	614d5f4f 	cmpvs	sp, pc, asr #30
   11280:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   11284:	7b29745f 	blvc	a6e408 <_Min_Stack_Size+0xa6e008>
   11288:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1128c:	202c3331 	eorcs	r3, ip, r1, lsr r3
   11290:	4f495047 	svcmi	0x00495047
   11294:	47202c41 	strmi	r2, [r0, -r1, asr #24]!
   11298:	5f4f4950 	svcpl	0x004f4950
   1129c:	5f4e4950 	svcpl	0x004e4950
   112a0:	202c3331 	eorcs	r3, ip, r1, lsr r3
   112a4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   112a8:	495f3331 	ldmdbmi	pc, {r0, r4, r5, r8, r9, ip, sp}^	@ <UNPREDICTABLE>
   112ac:	007d5152 	rsbseq	r5, sp, r2, asr r1
   112b0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   112b4:	00302030 	eorseq	r2, r0, r0, lsr r0
   112b8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   112bc:	35445035 	strbcc	r5, [r4, #-53]	@ 0xffffffcb
   112c0:	58452820 	stmdapl	r5, {r5, fp, sp}^
   112c4:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   112c8:	5f4f4950 	svcpl	0x004f4950
   112cc:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   112d0:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 112d8 <_Min_Stack_Size+0x10ed8>
   112d4:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   112d8:	2c354954 			@ <UNDEFINED> instruction: 0x2c354954
   112dc:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   112e0:	202c444f 	eorcs	r4, ip, pc, asr #8
   112e4:	4f495047 	svcmi	0x00495047
   112e8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   112ec:	202c355f 	eorcs	r3, ip, pc, asr r5
   112f0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   112f4:	52495f35 	subpl	r5, r9, #53, 30	@ 0xd4
   112f8:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   112fc:	35495458 	strbcc	r5, [r9, #-1112]	@ 0xfffffba8
   11300:	45003520 	strmi	r3, [r0, #-1312]	@ 0xfffffae0
   11304:	33495458 	movtcc	r5, #37976	@ 0x9458
   11308:	20334450 	eorscs	r4, r3, r0, asr r4
   1130c:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
