NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   11310:	50475f49 	subpl	r5, r7, r9, asr #30
   11314:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 111f8 <_Min_Stack_Size+0x10df8>
   11318:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   1131c:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   11320:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   11324:	202c3349 	eorcs	r3, ip, r9, asr #6
   11328:	4f495047 	svcmi	0x00495047
   1132c:	47202c44 	strmi	r2, [r0, -r4, asr #24]!
   11330:	5f4f4950 	svcpl	0x004f4950
   11334:	5f4e4950 	svcpl	0x004e4950
   11338:	45202c33 	strmi	r2, [r0, #-3123]!	@ 0xfffff3cd
   1133c:	33495458 	movtcc	r5, #37976	@ 0x9458
   11340:	5152495f 	cmppl	r2, pc, asr r9
   11344:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   11348:	50364954 	eorspl	r4, r6, r4, asr r9
   1134c:	28203642 	stmdacs	r0!, {r1, r6, r9, sl, ip, sp}
   11350:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11354:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11358:	614d5f4f 	cmpvs	sp, pc, asr #30
   1135c:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   11360:	7b29745f 	blvc	a6e4e4 <_Min_Stack_Size+0xa6e0e4>
   11364:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11368:	47202c36 			@ <UNDEFINED> instruction: 0x47202c36
   1136c:	424f4950 	submi	r4, pc, #80, 18	@ 0x140000
   11370:	5047202c 	subpl	r2, r7, ip, lsr #32
   11374:	505f4f49 	subspl	r4, pc, r9, asr #30
   11378:	365f4e49 	ldrbcc	r4, [pc], -r9, asr #28
   1137c:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11380:	5f364954 	svcpl	0x00364954
   11384:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   11388:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   1138c:	20333149 	eorscs	r3, r3, r9, asr #2
   11390:	45003331 	strmi	r3, [r0, #-817]	@ 0xfffffccf
   11394:	35495458 	strbcc	r5, [r9, #-1112]	@ 0xfffffba8
   11398:	20354350 	eorscs	r4, r5, r0, asr r3
   1139c:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   113a0:	50475f49 	subpl	r5, r7, r9, asr #30
   113a4:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 11288 <_Min_Stack_Size+0x10e88>
   113a8:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   113ac:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   113b0:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   113b4:	202c3549 	eorcs	r3, ip, r9, asr #10
   113b8:	4f495047 	svcmi	0x00495047
   113bc:	47202c43 	strmi	r2, [r0, -r3, asr #24]!
   113c0:	5f4f4950 	svcpl	0x004f4950
   113c4:	5f4e4950 	svcpl	0x004e4950
   113c8:	45202c35 	strmi	r2, [r0, #-3125]!	@ 0xfffff3cb
   113cc:	35495458 	strbcc	r5, [r9, #-1112]	@ 0xfffffba8
   113d0:	5152495f 	cmppl	r2, pc, asr r9
   113d4:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   113d8:	495f4954 	ldmdbmi	pc, {r2, r4, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
   113dc:	455f5152 	ldrbmi	r5, [pc, #-338]	@ 11292 <_Min_Stack_Size+0x10e92>
   113e0:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   113e4:	00312065 	eorseq	r2, r1, r5, rrx
   113e8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   113ec:	33425033 	movtcc	r5, #8243	@ 0x2033
   113f0:	58452820 	stmdapl	r5, {r5, fp, sp}^
   113f4:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   113f8:	5f4f4950 	svcpl	0x004f4950
   113fc:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11400:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11408 <_Min_Stack_Size+0x11008>
   11404:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11408:	2c334954 			@ <UNDEFINED> instruction: 0x2c334954
   1140c:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11410:	202c424f 	eorcs	r4, ip, pc, asr #4
   11414:	4f495047 	svcmi	0x00495047
   11418:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   1141c:	202c335f 	eorcs	r3, ip, pc, asr r3
   11420:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11424:	52495f33 	subpl	r5, r9, #51, 30	@ 0xcc
   11428:	5f007d51 	svcpl	0x00007d51
   1142c:	6e69755f 	mcrvs	5, 3, r7, cr9, cr15, {2}
   11430:	5f323374 	svcpl	0x00323374
   11434:	58450074 	stmdapl	r5, {r2, r4, r5, r6}^
   11438:	20364954 	eorscs	r4, r6, r4, asr r9
   1143c:	434c0036 	movtmi	r0, #49206	@ 0xc036
   11440:	4500524b 	strmi	r5, [r0, #-587]	@ 0xfffffdb5
   11444:	31495458 	cmpcc	r9, r8, asr r4
   11448:	31435033 	cmpcc	r3, r3, lsr r0
   1144c:	45282033 	strmi	r2, [r8, #-51]!	@ 0xffffffcd
   11450:	5f495458 	svcpl	0x00495458
   11454:	4f495047 	svcmi	0x00495047
   11458:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   1145c:	5f676e69 	svcpl	0x00676e69
   11460:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11464:	31495458 	cmpcc	r9, r8, asr r4
   11468:	47202c33 			@ <UNDEFINED> instruction: 0x47202c33
   1146c:	434f4950 	movtmi	r4, #63824	@ 0xf950
   11470:	5047202c 	subpl	r2, r7, ip, lsr #32
   11474:	505f4f49 	subspl	r4, pc, r9, asr #30
   11478:	315f4e49 	cmpcc	pc, r9, asr #28
   1147c:	45202c33 	strmi	r2, [r0, #-3123]!	@ 0xfffff3cd
   11480:	31495458 	cmpcc	r9, r8, asr r4
   11484:	52495f33 	subpl	r5, r9, #51, 30	@ 0xcc
   11488:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   1148c:	36495458 			@ <UNDEFINED> instruction: 0x36495458
   11490:	20364350 	eorscs	r4, r6, r0, asr r3
   11494:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   11498:	50475f49 	subpl	r5, r7, r9, asr #30
   1149c:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 11380 <_Min_Stack_Size+0x10f80>
   114a0:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   114a4:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   114a8:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   114ac:	202c3649 	eorcs	r3, ip, r9, asr #12
   114b0:	4f495047 	svcmi	0x00495047
   114b4:	47202c43 	strmi	r2, [r0, -r3, asr #24]!
   114b8:	5f4f4950 	svcpl	0x004f4950
   114bc:	5f4e4950 	svcpl	0x004e4950
   114c0:	45202c36 	strmi	r2, [r0, #-3126]!	@ 0xfffff3ca
   114c4:	36495458 			@ <UNDEFINED> instruction: 0x36495458
   114c8:	5152495f 	cmppl	r2, pc, asr r9
   114cc:	5645007d 			@ <UNDEFINED> instruction: 0x5645007d
   114d0:	4d005243 	sfmmi	f5, 4, [r0, #-268]	@ 0xfffffef4
   114d4:	5f4c4143 	svcpl	0x004c4143
   114d8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   114dc:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   114e0:	6e495f4f 	cdpvs	15, 4, cr5, cr9, cr15, {2}
   114e4:	4d007469 	cfstrsmi	mvf7, [r0, #-420]	@ 0xfffffe5c
   114e8:	5f4c4143 	svcpl	0x004c4143
   114ec:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   114f0:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   114f4:	65445f4f 	strbvs	r5, [r4, #-3919]	@ 0xfffff0b1
   114f8:	74696e69 	strbtvc	r6, [r9], #-3689	@ 0xfffff197
   114fc:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11500:	42503449 	subsmi	r3, r0, #1224736768	@ 0x49000000
   11504:	45282034 	strmi	r2, [r8, #-52]!	@ 0xffffffcc
   11508:	5f495458 	svcpl	0x00495458
   1150c:	4f495047 	svcmi	0x00495047
   11510:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11514:	5f676e69 	svcpl	0x00676e69
   11518:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   1151c:	34495458 	strbcc	r5, [r9], #-1112	@ 0xfffffba8
   11520:	5047202c 	subpl	r2, r7, ip, lsr #32
   11524:	2c424f49 	mcrrcs	15, 4, r4, r2, cr9
   11528:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   1152c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11530:	2c345f4e 	ldccs	15, cr5, [r4], #-312	@ 0xfffffec8
   11534:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   11538:	495f3449 	ldmdbmi	pc, {r0, r3, r6, sl, ip, sp}^	@ <UNPREDICTABLE>
   1153c:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11540:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11544:	6972545f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, ip, lr}^
   11548:	72656767 	rsbvc	r6, r5, #27000832	@ 0x19c0000
   1154c:	5349525f 	movtpl	r5, #37471	@ 0x925f
   11550:	5f474e49 	svcpl	0x00474e49
   11554:	5f444e41 	svcpl	0x00444e41
   11558:	4c4c4146 	stfmie	f4, [ip], {70}	@ 0x46
   1155c:	20474e49 	subcs	r4, r7, r9, asr #28
   11560:	58450032 	stmdapl	r5, {r1, r4, r5}^
   11564:	31314954 	teqcc	r1, r4, asr r9
   11568:	31314350 	teqcc	r1, r0, asr r3
   1156c:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11570:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11574:	5f4f4950 	svcpl	0x004f4950
   11578:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   1157c:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11584 <_Min_Stack_Size+0x11184>
   11580:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11584:	31314954 	teqcc	r1, r4, asr r9
   11588:	5047202c 	subpl	r2, r7, ip, lsr #32
   1158c:	2c434f49 	mcrrcs	15, 4, r4, r3, cr9
   11590:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11594:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11598:	31315f4e 	teqcc	r1, lr, asr #30
   1159c:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   115a0:	31314954 	teqcc	r1, r4, asr r9
   115a4:	5152495f 	cmppl	r2, pc, asr r9
   115a8:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   115ac:	50334954 	eorspl	r4, r3, r4, asr r9
   115b0:	28203343 	stmdacs	r0!, {r0, r1, r6, r8, r9, ip, sp}
   115b4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   115b8:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   115bc:	614d5f4f 	cmpvs	sp, pc, asr #30
   115c0:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   115c4:	7b29745f 	blvc	a6e748 <_Min_Stack_Size+0xa6e348>
   115c8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   115cc:	47202c33 			@ <UNDEFINED> instruction: 0x47202c33
   115d0:	434f4950 	movtmi	r4, #63824	@ 0xf950
   115d4:	5047202c 	subpl	r2, r7, ip, lsr #32
   115d8:	505f4f49 	subspl	r4, pc, r9, asr #30
   115dc:	335f4e49 	cmpcc	pc, #1168	@ 0x490
   115e0:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   115e4:	5f334954 	svcpl	0x00334954
   115e8:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   115ec:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   115f0:	41503649 	cmpmi	r0, r9, asr #12
   115f4:	45282036 	strmi	r2, [r8, #-54]!	@ 0xffffffca
   115f8:	5f495458 	svcpl	0x00495458
   115fc:	4f495047 	svcmi	0x00495047
   11600:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11604:	5f676e69 	svcpl	0x00676e69
   11608:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   1160c:	36495458 			@ <UNDEFINED> instruction: 0x36495458
   11610:	5047202c 	subpl	r2, r7, ip, lsr #32
   11614:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   11618:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   1161c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11620:	2c365f4e 	ldccs	15, cr5, [r6], #-312	@ 0xfffffec8
   11624:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   11628:	495f3649 	ldmdbmi	pc, {r0, r3, r6, r9, sl, ip, sp}^	@ <UNPREDICTABLE>
   1162c:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11630:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11634:	42503031 	subsmi	r3, r0, #49	@ 0x31
   11638:	28203031 	stmdacs	r0!, {r0, r4, r5, ip, sp}
   1163c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11640:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11644:	614d5f4f 	cmpvs	sp, pc, asr #30
   11648:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   1164c:	7b29745f 	blvc	a6e7d0 <_Min_Stack_Size+0xa6e3d0>
   11650:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11654:	202c3031 	eorcs	r3, ip, r1, lsr r0
   11658:	4f495047 	svcmi	0x00495047
   1165c:	47202c42 	strmi	r2, [r0, -r2, asr #24]!
   11660:	5f4f4950 	svcpl	0x004f4950
   11664:	5f4e4950 	svcpl	0x004e4950
   11668:	202c3031 	eorcs	r3, ip, r1, lsr r0
   1166c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11670:	495f3031 	ldmdbmi	pc, {r0, r4, r5, ip, sp}^	@ <UNPREDICTABLE>
   11674:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11678:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1167c:	37445037 	smlaldxcc	r5, r4, r7, r0
   11680:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11684:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11688:	5f4f4950 	svcpl	0x004f4950
   1168c:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11690:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11698 <_Min_Stack_Size+0x11298>
   11694:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11698:	2c374954 			@ <UNDEFINED> instruction: 0x2c374954
   1169c:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   116a0:	202c444f 	eorcs	r4, ip, pc, asr #8
   116a4:	4f495047 	svcmi	0x00495047
   116a8:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   116ac:	202c375f 	eorcs	r3, ip, pc, asr r7
   116b0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   116b4:	52495f37 	subpl	r5, r9, #55, 30	@ 0xdc
   116b8:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   116bc:	37495458 	smlsldcc	r5, r9, r8, r4
   116c0:	20374350 	eorscs	r4, r7, r0, asr r3
   116c4:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   116c8:	50475f49 	subpl	r5, r7, r9, asr #30
   116cc:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 115b0 <_Min_Stack_Size+0x111b0>
   116d0:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   116d4:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   116d8:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   116dc:	202c3749 	eorcs	r3, ip, r9, asr #14
   116e0:	4f495047 	svcmi	0x00495047
   116e4:	47202c43 	strmi	r2, [r0, -r3, asr #24]!
   116e8:	5f4f4950 	svcpl	0x004f4950
   116ec:	5f4e4950 	svcpl	0x004e4950
   116f0:	45202c37 	strmi	r2, [r0, #-3127]!	@ 0xfffff3c9
   116f4:	37495458 	smlsldcc	r5, r9, r8, r4
   116f8:	5152495f 	cmppl	r2, pc, asr r9
   116fc:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   11700:	50304954 	eorspl	r4, r0, r4, asr r9
   11704:	28203043 	stmdacs	r0!, {r0, r1, r6, ip, sp}
   11708:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1170c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11710:	614d5f4f 	cmpvs	sp, pc, asr #30
   11714:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   11718:	7b29745f 	blvc	a6e89c <_Min_Stack_Size+0xa6e49c>
   1171c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11720:	47202c30 			@ <UNDEFINED> instruction: 0x47202c30
   11724:	434f4950 	movtmi	r4, #63824	@ 0xf950
   11728:	5047202c 	subpl	r2, r7, ip, lsr #32
   1172c:	505f4f49 	subspl	r4, pc, r9, asr #30
   11730:	305f4e49 	subscc	r4, pc, r9, asr #28
   11734:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11738:	5f304954 	svcpl	0x00304954
   1173c:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   11740:	2f2e2e00 	svccs	0x002e2e00
   11744:	334d5453 	movtcc	r5, #54355	@ 0xd453
   11748:	30314632 	eorscc	r4, r1, r2, lsr r6
   1174c:	5f364333 	svcpl	0x00364333
   11750:	76697244 	strbtvc	r7, [r9], -r4, asr #4
   11754:	2f737265 	svccs	0x00737265
   11758:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
   1175c:	30316632 	eorscc	r6, r1, r2, lsr r6
   11760:	5f366333 	svcpl	0x00366333
   11764:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11768:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
   1176c:	2e726576 	mrccs	5, 3, r6, cr2, cr6, {3}
   11770:	58450063 	stmdapl	r5, {r0, r1, r5, r6}^
   11774:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   11778:	35314150 	ldrcc	r4, [r1, #-336]!	@ 0xfffffeb0
   1177c:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11780:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11784:	5f4f4950 	svcpl	0x004f4950
   11788:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   1178c:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11794 <_Min_Stack_Size+0x11394>
   11790:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11794:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   11798:	5047202c 	subpl	r2, r7, ip, lsr #32
   1179c:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   117a0:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   117a4:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   117a8:	35315f4e 	ldrcc	r5, [r1, #-3918]!	@ 0xfffff0b2
   117ac:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   117b0:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   117b4:	5152495f 	cmppl	r2, pc, asr r9
   117b8:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   117bc:	30314954 	eorscc	r4, r1, r4, asr r9
   117c0:	30314350 	eorscc	r4, r1, r0, asr r3
   117c4:	58452820 	stmdapl	r5, {r5, fp, sp}^
   117c8:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   117cc:	5f4f4950 	svcpl	0x004f4950
   117d0:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   117d4:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 117dc <_Min_Stack_Size+0x113dc>
   117d8:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   117dc:	30314954 	eorscc	r4, r1, r4, asr r9
   117e0:	5047202c 	subpl	r2, r7, ip, lsr #32
   117e4:	2c434f49 	mcrrcs	15, 4, r4, r3, cr9
   117e8:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   117ec:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   117f0:	30315f4e 	eorscc	r5, r1, lr, asr #30
   117f4:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   117f8:	30314954 	eorscc	r4, r1, r4, asr r9
   117fc:	5152495f 	cmppl	r2, pc, asr r9
   11800:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   11804:	30314954 	eorscc	r4, r1, r4, asr r9
   11808:	5f35315f 	svcpl	0x0035315f
   1180c:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
   11810:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
   11814:	45007265 	strmi	r7, [r0, #-613]	@ 0xfffffd9b
   11818:	30495458 	subcc	r5, r9, r8, asr r4
   1181c:	20304250 	eorscs	r4, r0, r0, asr r2
   11820:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   11824:	50475f49 	subpl	r5, r7, r9, asr #30
   11828:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 1170c <_Min_Stack_Size+0x1130c>
   1182c:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   11830:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   11834:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   11838:	202c3049 	eorcs	r3, ip, r9, asr #32
   1183c:	4f495047 	svcmi	0x00495047
   11840:	47202c42 	strmi	r2, [r0, -r2, asr #24]!
   11844:	5f4f4950 	svcpl	0x004f4950
   11848:	5f4e4950 	svcpl	0x004e4950
   1184c:	45202c30 	strmi	r2, [r0, #-3120]!	@ 0xfffff3d0
   11850:	30495458 	subcc	r5, r9, r8, asr r4
   11854:	5152495f 	cmppl	r2, pc, asr r9
   11858:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   1185c:	34314954 	ldrtcc	r4, [r1], #-2388	@ 0xfffff6ac
   11860:	34314450 	ldrtcc	r4, [r1], #-1104	@ 0xfffffbb0
   11864:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11868:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   1186c:	5f4f4950 	svcpl	0x004f4950
   11870:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11874:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 1187c <_Min_Stack_Size+0x1147c>
   11878:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   1187c:	34314954 	ldrtcc	r4, [r1], #-2388	@ 0xfffff6ac
   11880:	5047202c 	subpl	r2, r7, ip, lsr #32
   11884:	2c444f49 	mcrrcs	15, 4, r4, r4, cr9
   11888:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   1188c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11890:	34315f4e 	ldrtcc	r5, [r1], #-3918	@ 0xfffff0b2
   11894:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11898:	34314954 	ldrtcc	r4, [r1], #-2388	@ 0xfffff6ac
   1189c:	5152495f 	cmppl	r2, pc, asr r9
   118a0:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   118a4:	50304954 	eorspl	r4, r0, r4, asr r9
   118a8:	28203044 	stmdacs	r0!, {r2, r6, ip, sp}
   118ac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   118b0:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   118b4:	614d5f4f 	cmpvs	sp, pc, asr #30
   118b8:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   118bc:	7b29745f 	blvc	a6ea40 <_Min_Stack_Size+0xa6e640>
   118c0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   118c4:	47202c30 			@ <UNDEFINED> instruction: 0x47202c30
   118c8:	444f4950 	strbmi	r4, [pc], #-2384	@ 118d0 <_Min_Stack_Size+0x114d0>
   118cc:	5047202c 	subpl	r2, r7, ip, lsr #32
   118d0:	505f4f49 	subspl	r4, pc, r9, asr #30
   118d4:	305f4e49 	subscc	r4, pc, r9, asr #28
   118d8:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   118dc:	5f304954 	svcpl	0x00304954
   118e0:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   118e4:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   118e8:	41503449 	cmpmi	r0, r9, asr #8
   118ec:	45282034 	strmi	r2, [r8, #-52]!	@ 0xffffffcc
   118f0:	5f495458 	svcpl	0x00495458
   118f4:	4f495047 	svcmi	0x00495047
   118f8:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   118fc:	5f676e69 	svcpl	0x00676e69
   11900:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11904:	34495458 	strbcc	r5, [r9], #-1112	@ 0xfffffba8
   11908:	5047202c 	subpl	r2, r7, ip, lsr #32
   1190c:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   11910:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11914:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11918:	2c345f4e 	ldccs	15, cr5, [r4], #-312	@ 0xfffffec8
   1191c:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   11920:	495f3449 	ldmdbmi	pc, {r0, r3, r6, sl, ip, sp}^	@ <UNPREDICTABLE>
   11924:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11928:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1192c:	00342034 	eorseq	r2, r4, r4, lsr r0
   11930:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11934:	38415038 	stmdacc	r1, {r3, r4, r5, ip, lr}^
   11938:	58452820 	stmdapl	r5, {r5, fp, sp}^
   1193c:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11940:	5f4f4950 	svcpl	0x004f4950
   11944:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11948:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11950 <_Min_Stack_Size+0x11550>
   1194c:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11950:	2c384954 			@ <UNDEFINED> instruction: 0x2c384954
   11954:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11958:	202c414f 	eorcs	r4, ip, pc, asr #2
   1195c:	4f495047 	svcmi	0x00495047
   11960:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   11964:	202c385f 	eorcs	r3, ip, pc, asr r8
   11968:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   1196c:	52495f38 	subpl	r5, r9, #56, 30	@ 0xe0
   11970:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   11974:	31495458 	cmpcc	r9, r8, asr r4
   11978:	31312031 	teqcc	r1, r1, lsr r0
   1197c:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11980:	43503249 	cmpmi	r0, #-1879048188	@ 0x90000004
   11984:	45282032 	strmi	r2, [r8, #-50]!	@ 0xffffffce
   11988:	5f495458 	svcpl	0x00495458
   1198c:	4f495047 	svcmi	0x00495047
   11990:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11994:	5f676e69 	svcpl	0x00676e69
   11998:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   1199c:	32495458 	subcc	r5, r9, #88, 8	@ 0x58000000
   119a0:	5047202c 	subpl	r2, r7, ip, lsr #32
   119a4:	2c434f49 	mcrrcs	15, 4, r4, r3, cr9
   119a8:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   119ac:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   119b0:	2c325f4e 	ldccs	15, cr5, [r2], #-312	@ 0xfffffec8
   119b4:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   119b8:	495f3249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
   119bc:	007d5152 	rsbseq	r5, sp, r2, asr r1
   119c0:	45495753 	strbmi	r5, [r9, #-1875]	@ 0xfffff8ad
   119c4:	58450052 	stmdapl	r5, {r1, r4, r6}^
   119c8:	50354954 	eorspl	r4, r5, r4, asr r9
   119cc:	28203542 	stmdacs	r0!, {r1, r6, r8, sl, ip, sp}
   119d0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   119d4:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   119d8:	614d5f4f 	cmpvs	sp, pc, asr #30
   119dc:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   119e0:	7b29745f 	blvc	a6eb64 <_Min_Stack_Size+0xa6e764>
   119e4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   119e8:	47202c35 			@ <UNDEFINED> instruction: 0x47202c35
   119ec:	424f4950 	submi	r4, pc, #80, 18	@ 0x140000
   119f0:	5047202c 	subpl	r2, r7, ip, lsr #32
   119f4:	505f4f49 	subspl	r4, pc, r9, asr #30
   119f8:	355f4e49 	ldrbcc	r4, [pc, #-3657]	@ 10bb7 <_Min_Stack_Size+0x107b7>
   119fc:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11a00:	5f354954 	svcpl	0x00354954
   11a04:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   11a08:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11a0c:	50343149 	eorspl	r3, r4, r9, asr #2
   11a10:	20343142 	eorscs	r3, r4, r2, asr #2
   11a14:	54584528 	ldrbpl	r4, [r8], #-1320	@ 0xfffffad8
   11a18:	50475f49 	subpl	r5, r7, r9, asr #30
   11a1c:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 11900 <_Min_Stack_Size+0x11500>
   11a20:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   11a24:	29745f67 	ldmdbcs	r4!, {r0, r1, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
