NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   11a28:	5458457b 	ldrbpl	r4, [r8], #-1403	@ 0xfffffa85
   11a2c:	2c343149 	ldfcss	f3, [r4], #-292	@ 0xfffffedc
   11a30:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11a34:	202c424f 	eorcs	r4, ip, pc, asr #4
   11a38:	4f495047 	svcmi	0x00495047
   11a3c:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   11a40:	2c34315f 	ldfcss	f3, [r4], #-380	@ 0xfffffe84
   11a44:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   11a48:	5f343149 	svcpl	0x00343149
   11a4c:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   11a50:	51524900 	cmppl	r2, r0, lsl #18
   11a54:	004e455f 	subeq	r4, lr, pc, asr r5
   11a58:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11a5c:	31445031 	cmpcc	r4, r1, lsr r0
   11a60:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11a64:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11a68:	5f4f4950 	svcpl	0x004f4950
   11a6c:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11a70:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11a78 <_Min_Stack_Size+0x11678>
   11a74:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11a78:	2c314954 			@ <UNDEFINED> instruction: 0x2c314954
   11a7c:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11a80:	202c444f 	eorcs	r4, ip, pc, asr #8
   11a84:	4f495047 	svcmi	0x00495047
   11a88:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   11a8c:	202c315f 	eorcs	r3, ip, pc, asr r1
   11a90:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11a94:	52495f31 	subpl	r5, r9, #49, 30	@ 0xc4
   11a98:	4d007d51 	stcmi	13, cr7, [r0, #-324]	@ 0xfffffebc
   11a9c:	00525041 	subseq	r5, r2, r1, asr #32
   11aa0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11aa4:	37425037 	smlaldxcc	r5, r2, r7, r0
   11aa8:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11aac:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11ab0:	5f4f4950 	svcpl	0x004f4950
   11ab4:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11ab8:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11ac0 <_Min_Stack_Size+0x116c0>
   11abc:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11ac0:	2c374954 			@ <UNDEFINED> instruction: 0x2c374954
   11ac4:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11ac8:	202c424f 	eorcs	r4, ip, pc, asr #4
   11acc:	4f495047 	svcmi	0x00495047
   11ad0:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   11ad4:	202c375f 	eorcs	r3, ip, pc, asr r7
   11ad8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11adc:	52495f37 	subpl	r5, r9, #55, 30	@ 0xdc
   11ae0:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   11ae4:	32495458 	subcc	r5, r9, #88, 8	@ 0x58000000
   11ae8:	5152495f 	cmppl	r2, pc, asr r9
   11aec:	646e6148 	strbtvs	r6, [lr], #-328	@ 0xfffffeb8
   11af0:	0072656c 	rsbseq	r6, r2, ip, ror #10
   11af4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11af8:	44503331 	ldrbmi	r3, [r0], #-817	@ 0xfffffccf
   11afc:	28203331 	stmdacs	r0!, {r0, r4, r5, r8, r9, ip, sp}
   11b00:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b04:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11b08:	614d5f4f 	cmpvs	sp, pc, asr #30
   11b0c:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   11b10:	7b29745f 	blvc	a6ec94 <_Min_Stack_Size+0xa6e894>
   11b14:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b18:	202c3331 	eorcs	r3, ip, r1, lsr r3
   11b1c:	4f495047 	svcmi	0x00495047
   11b20:	47202c44 	strmi	r2, [r0, -r4, asr #24]!
   11b24:	5f4f4950 	svcpl	0x004f4950
   11b28:	5f4e4950 	svcpl	0x004e4950
   11b2c:	202c3331 	eorcs	r3, ip, r1, lsr r3
   11b30:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b34:	495f3331 	ldmdbmi	pc, {r0, r4, r5, r8, r9, ip, sp}^	@ <UNPREDICTABLE>
   11b38:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11b3c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b40:	43503231 	cmpmi	r0, #268435459	@ 0x10000003
   11b44:	28203231 	stmdacs	r0!, {r0, r4, r5, r9, ip, sp}
   11b48:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b4c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11b50:	614d5f4f 	cmpvs	sp, pc, asr #30
   11b54:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   11b58:	7b29745f 	blvc	a6ecdc <_Min_Stack_Size+0xa6e8dc>
   11b5c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b60:	202c3231 	eorcs	r3, ip, r1, lsr r2
   11b64:	4f495047 	svcmi	0x00495047
   11b68:	47202c43 	strmi	r2, [r0, -r3, asr #24]!
   11b6c:	5f4f4950 	svcpl	0x004f4950
   11b70:	5f4e4950 	svcpl	0x004e4950
   11b74:	202c3231 	eorcs	r3, ip, r1, lsr r2
   11b78:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b7c:	495f3231 	ldmdbmi	pc, {r0, r4, r5, r9, ip, sp}^	@ <UNPREDICTABLE>
   11b80:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11b84:	5f434e49 	svcpl	0x00434e49
   11b88:	334d5453 	movtcc	r5, #54355	@ 0xd453
   11b8c:	30314632 	eorscc	r4, r1, r2, lsr r6
   11b90:	5f364333 	svcpl	0x00364333
   11b94:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11b98:	4952445f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, sl, lr}^
   11b9c:	5f524556 	svcpl	0x00524556
   11ba0:	00205f48 	eoreq	r5, r0, r8, asr #30
   11ba4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11ba8:	00322032 	eorseq	r2, r2, r2, lsr r0
   11bac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11bb0:	5f355f39 	svcpl	0x00355f39
   11bb4:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
   11bb8:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
   11bbc:	45007265 	strmi	r7, [r0, #-613]	@ 0xfffffd9b
   11bc0:	31495458 	cmpcc	r9, r8, asr r4
   11bc4:	45003120 	strmi	r3, [r0, #-288]	@ 0xfffffee0
   11bc8:	31495458 	cmpcc	r9, r8, asr r4
   11bcc:	31425032 	cmpcc	r2, r2, lsr r0
   11bd0:	45282032 	strmi	r2, [r8, #-50]!	@ 0xffffffce
   11bd4:	5f495458 	svcpl	0x00495458
   11bd8:	4f495047 	svcmi	0x00495047
   11bdc:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11be0:	5f676e69 	svcpl	0x00676e69
   11be4:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11be8:	31495458 	cmpcc	r9, r8, asr r4
   11bec:	47202c32 			@ <UNDEFINED> instruction: 0x47202c32
   11bf0:	424f4950 	submi	r4, pc, #80, 18	@ 0x140000
   11bf4:	5047202c 	subpl	r2, r7, ip, lsr #32
   11bf8:	505f4f49 	subspl	r4, pc, r9, asr #30
   11bfc:	315f4e49 	cmpcc	pc, r9, asr #28
   11c00:	45202c32 	strmi	r2, [r0, #-3122]!	@ 0xfffff3ce
   11c04:	31495458 	cmpcc	r9, r8, asr r4
   11c08:	52495f32 	subpl	r5, r9, #50, 30	@ 0xc8
   11c0c:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   11c10:	5f495458 	svcpl	0x00495458
   11c14:	75706e49 	ldrbvc	r6, [r0, #-3657]!	@ 0xfffff1b7
   11c18:	6e694c74 	mcrvs	12, 3, r4, cr9, cr4, {3}
   11c1c:	754e5f65 	strbvc	r5, [lr, #-3941]	@ 0xfffff09b
   11c20:	7265626d 	rsbvc	r6, r5, #-805306362	@ 0xd0000006
   11c24:	49504700 	ldmdbmi	r0, {r8, r9, sl, lr}^
   11c28:	69505f4f 	ldmdbvs	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11c2c:	5047006e 	subpl	r0, r7, lr, rrx
   11c30:	505f4f49 	subspl	r4, pc, r9, asr #30
   11c34:	754e6e69 	strbvc	r6, [lr, #-3689]	@ 0xfffff197
   11c38:	7265626d 	rsbvc	r6, r5, #-805306362	@ 0xd0000006
   11c3c:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11c40:	44503249 	ldrbmi	r3, [r0], #-585	@ 0xfffffdb7
   11c44:	45282032 	strmi	r2, [r8, #-50]!	@ 0xffffffce
   11c48:	5f495458 	svcpl	0x00495458
   11c4c:	4f495047 	svcmi	0x00495047
   11c50:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11c54:	5f676e69 	svcpl	0x00676e69
   11c58:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11c5c:	32495458 	subcc	r5, r9, #88, 8	@ 0x58000000
   11c60:	5047202c 	subpl	r2, r7, ip, lsr #32
   11c64:	2c444f49 	mcrrcs	15, 4, r4, r4, cr9
   11c68:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11c6c:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11c70:	2c325f4e 	ldccs	15, cr5, [r2], #-312	@ 0xfffffec8
   11c74:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   11c78:	495f3249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
   11c7c:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11c80:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11c84:	39435039 	stmdbcc	r3, {r0, r3, r4, r5, ip, lr}^
   11c88:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11c8c:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11c90:	5f4f4950 	svcpl	0x004f4950
   11c94:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11c98:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11ca0 <_Min_Stack_Size+0x118a0>
   11c9c:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11ca0:	2c394954 			@ <UNDEFINED> instruction: 0x2c394954
   11ca4:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11ca8:	202c434f 	eorcs	r4, ip, pc, asr #6
   11cac:	4f495047 	svcmi	0x00495047
   11cb0:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   11cb4:	202c395f 	eorcs	r3, ip, pc, asr r9
   11cb8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11cbc:	52495f39 	subpl	r5, r9, #57, 30	@ 0xe4
   11cc0:	41007d51 	tstmi	r0, r1, asr sp
   11cc4:	5f4f4946 	svcpl	0x004f4946
   11cc8:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
   11ccc:	00666544 	rsbeq	r6, r6, r4, asr #10
   11cd0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11cd4:	52495f33 	subpl	r5, r9, #51, 30	@ 0xcc
   11cd8:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
   11cdc:	72656c64 	rsbvc	r6, r5, #100, 24	@ 0x6400
   11ce0:	49464100 	stmdbmi	r6, {r8, lr}^
   11ce4:	58455f4f 	stmdapl	r5, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11ce8:	52434954 	subpl	r4, r3, #84, 18	@ 0x150000
   11cec:	646e695f 	strbtvs	r6, [lr], #-2399	@ 0xfffff6a1
   11cf0:	42007865 	andmi	r7, r0, #6619136	@ 0x650000
   11cf4:	00525253 	subseq	r5, r2, r3, asr r2
   11cf8:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11cfc:	52495f30 	subpl	r5, r9, #48, 30	@ 0xc0
   11d00:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
   11d04:	72656c64 	rsbvc	r6, r5, #100, 24	@ 0x6400
   11d08:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11d0c:	50475f49 	subpl	r5, r7, r9, asr #30
   11d10:	4d5f4f49 	ldclmi	15, cr4, [pc, #-292]	@ 11bf4 <_Min_Stack_Size+0x117f4>
   11d14:	6e697061 	cdpvs	0, 6, cr7, cr9, cr1, {3}
   11d18:	00745f67 	rsbseq	r5, r4, r7, ror #30
   11d1c:	4f495047 	svcmi	0x00495047
   11d20:	7079545f 	rsbsvc	r5, r9, pc, asr r4
   11d24:	66654465 	strbtvs	r4, [r5], -r5, ror #8
   11d28:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11d2c:	66435f49 	strbvs	r5, [r3], -r9, asr #30
   11d30:	58450067 	stmdapl	r5, {r0, r1, r2, r5, r6}^
   11d34:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   11d38:	35314350 	ldrcc	r4, [r1, #-848]!	@ 0xfffffcb0
   11d3c:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11d40:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11d44:	5f4f4950 	svcpl	0x004f4950
   11d48:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11d4c:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11d54 <_Min_Stack_Size+0x11954>
   11d50:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11d54:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   11d58:	5047202c 	subpl	r2, r7, ip, lsr #32
   11d5c:	2c434f49 	mcrrcs	15, 4, r4, r3, cr9
   11d60:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11d64:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11d68:	35315f4e 	ldrcc	r5, [r1, #-3918]!	@ 0xfffff0b2
   11d6c:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11d70:	35314954 	ldrcc	r4, [r1, #-2388]!	@ 0xfffff6ac
   11d74:	5152495f 	cmppl	r2, pc, asr r9
   11d78:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   11d7c:	50344954 	eorspl	r4, r4, r4, asr r9
   11d80:	28203444 	stmdacs	r0!, {r2, r6, sl, ip, sp}
   11d84:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11d88:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11d8c:	614d5f4f 	cmpvs	sp, pc, asr #30
   11d90:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   11d94:	7b29745f 	blvc	a6ef18 <_Min_Stack_Size+0xa6eb18>
   11d98:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11d9c:	47202c34 			@ <UNDEFINED> instruction: 0x47202c34
   11da0:	444f4950 	strbmi	r4, [pc], #-2384	@ 11da8 <_Min_Stack_Size+0x119a8>
   11da4:	5047202c 	subpl	r2, r7, ip, lsr #32
   11da8:	505f4f49 	subspl	r4, pc, r9, asr #30
   11dac:	345f4e49 	ldrbcc	r4, [pc], #-3657	@ 11db4 <_Min_Stack_Size+0x119b4>
   11db0:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11db4:	5f344954 	svcpl	0x00344954
   11db8:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   11dbc:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11dc0:	20353149 	eorscs	r3, r5, r9, asr #2
   11dc4:	47003531 	smladxmi	r0, r1, r5, r3
   11dc8:	5152495f 	cmppl	r2, pc, asr r9
   11dcc:	6c61435f 	stclvs	3, cr4, [r1], #-380	@ 0xfffffe84
   11dd0:	6361626c 	cmnvs	r1, #108, 4	@ 0xc0000006
   11dd4:	5845006b 	stmdapl	r5, {r0, r1, r3, r5, r6}^
   11dd8:	32314954 	eorscc	r4, r1, #84, 18	@ 0x150000
   11ddc:	32314150 	eorscc	r4, r1, #80, 2
   11de0:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11de4:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11de8:	5f4f4950 	svcpl	0x004f4950
   11dec:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11df0:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11df8 <_Min_Stack_Size+0x119f8>
   11df4:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11df8:	32314954 	eorscc	r4, r1, #84, 18	@ 0x150000
   11dfc:	5047202c 	subpl	r2, r7, ip, lsr #32
   11e00:	2c414f49 	mcrrcs	15, 4, r4, r1, cr9
   11e04:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11e08:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11e0c:	32315f4e 	eorscc	r5, r1, #312	@ 0x138
   11e10:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11e14:	32314954 	eorscc	r4, r1, #84, 18	@ 0x150000
   11e18:	5152495f 	cmppl	r2, pc, asr r9
   11e1c:	5845007d 	stmdapl	r5, {r0, r2, r3, r4, r5, r6}^
   11e20:	50384954 	eorspl	r4, r8, r4, asr r9
   11e24:	28203842 	stmdacs	r0!, {r1, r6, fp, ip, sp}
   11e28:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11e2c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   11e30:	614d5f4f 	cmpvs	sp, pc, asr #30
   11e34:	676e6970 			@ <UNDEFINED> instruction: 0x676e6970
   11e38:	7b29745f 	blvc	a6efbc <_Min_Stack_Size+0xa6ebbc>
   11e3c:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11e40:	47202c38 			@ <UNDEFINED> instruction: 0x47202c38
   11e44:	424f4950 	submi	r4, pc, #80, 18	@ 0x140000
   11e48:	5047202c 	subpl	r2, r7, ip, lsr #32
   11e4c:	505f4f49 	subspl	r4, pc, r9, asr #30
   11e50:	385f4e49 	ldmdacc	pc, {r0, r3, r6, r9, sl, fp, lr}^	@ <UNPREDICTABLE>
   11e54:	5845202c 	stmdapl	r5, {r2, r3, r5, sp}^
   11e58:	5f384954 	svcpl	0x00384954
   11e5c:	7d515249 	lfmvc	f5, 2, [r1, #-292]	@ 0xfffffedc
   11e60:	54584500 	ldrbpl	r4, [r8], #-1280	@ 0xfffffb00
   11e64:	42503249 	subsmi	r3, r0, #-1879048188	@ 0x90000004
   11e68:	45282032 	strmi	r2, [r8, #-50]!	@ 0xffffffce
   11e6c:	5f495458 	svcpl	0x00495458
   11e70:	4f495047 	svcmi	0x00495047
   11e74:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11e78:	5f676e69 	svcpl	0x00676e69
   11e7c:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11e80:	32495458 	subcc	r5, r9, #88, 8	@ 0x58000000
   11e84:	5047202c 	subpl	r2, r7, ip, lsr #32
   11e88:	2c424f49 	mcrrcs	15, 4, r4, r2, cr9
   11e8c:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11e90:	49505f4f 	ldmdbmi	r0, {r0, r1, r2, r3, r6, r8, r9, sl, fp, ip, lr}^
   11e94:	2c325f4e 	ldccs	15, cr5, [r2], #-312	@ 0xfffffec8
   11e98:	54584520 	ldrbpl	r4, [r8], #-1312	@ 0xfffffae0
   11e9c:	495f3249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
   11ea0:	007d5152 	rsbseq	r5, sp, r2, asr r1
   11ea4:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11ea8:	00332033 	eorseq	r2, r3, r3, lsr r0
   11eac:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11eb0:	00382038 	eorseq	r2, r8, r8, lsr r0
   11eb4:	5f545649 	svcpl	0x00545649
   11eb8:	5f515249 	svcpl	0x00515249
   11ebc:	626d754e 	rsbvs	r7, sp, #327155712	@ 0x13800000
   11ec0:	44007265 	strmi	r7, [r0], #-613	@ 0xfffffd9b
   11ec4:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
   11ec8:	4e5f656c 	cdpmi	5, 5, cr6, cr15, cr12, {3}
   11ecc:	00434956 	subeq	r4, r3, r6, asr r9
   11ed0:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11ed4:	39445039 	stmdbcc	r4, {r0, r3, r4, r5, ip, lr}^
   11ed8:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11edc:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11ee0:	5f4f4950 	svcpl	0x004f4950
   11ee4:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11ee8:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11ef0 <_Min_Stack_Size+0x11af0>
   11eec:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11ef0:	2c394954 			@ <UNDEFINED> instruction: 0x2c394954
   11ef4:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11ef8:	202c444f 	eorcs	r4, ip, pc, asr #8
   11efc:	4f495047 	svcmi	0x00495047
   11f00:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   11f04:	202c395f 	eorcs	r3, ip, pc, asr r9
   11f08:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11f0c:	52495f39 	subpl	r5, r9, #57, 30	@ 0xe4
   11f10:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   11f14:	31495458 	cmpcc	r9, r8, asr r4
   11f18:	5152495f 	cmppl	r2, pc, asr r9
   11f1c:	646e6148 	strbtvs	r6, [lr], #-328	@ 0xfffffeb8
   11f20:	0072656c 	rsbseq	r6, r2, ip, ror #10
   11f24:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
   11f28:	4e5f656c 	cdpmi	5, 5, cr6, cr15, cr12, {3}
   11f2c:	00434956 	subeq	r4, r3, r6, asr r9
   11f30:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11f34:	35415035 	strbcc	r5, [r1, #-53]	@ 0xffffffcb
   11f38:	58452820 	stmdapl	r5, {r5, fp, sp}^
   11f3c:	475f4954 			@ <UNDEFINED> instruction: 0x475f4954
   11f40:	5f4f4950 	svcpl	0x004f4950
   11f44:	6970614d 	ldmdbvs	r0!, {r0, r2, r3, r6, r8, sp, lr}^
   11f48:	745f676e 	ldrbvc	r6, [pc], #-1902	@ 11f50 <_Min_Stack_Size+0x11b50>
   11f4c:	58457b29 	stmdapl	r5, {r0, r3, r5, r8, r9, fp, ip, sp, lr}^
   11f50:	2c354954 			@ <UNDEFINED> instruction: 0x2c354954
   11f54:	49504720 	ldmdbmi	r0, {r5, r8, r9, sl, lr}^
   11f58:	202c414f 	eorcs	r4, ip, pc, asr #2
   11f5c:	4f495047 	svcmi	0x00495047
   11f60:	4e49505f 	mcrmi	0, 2, r5, cr9, cr15, {2}
   11f64:	202c355f 	eorcs	r3, ip, pc, asr r5
   11f68:	49545845 	ldmdbmi	r4, {r0, r2, r6, fp, ip, lr}^
   11f6c:	52495f35 	subpl	r5, r9, #53, 30	@ 0xd4
   11f70:	45007d51 	strmi	r7, [r0, #-3409]	@ 0xfffff2af
   11f74:	31495458 	cmpcc	r9, r8, asr r4
   11f78:	31445030 	cmpcc	r4, r0, lsr r0
   11f7c:	45282030 	strmi	r2, [r8, #-48]!	@ 0xffffffd0
   11f80:	5f495458 	svcpl	0x00495458
   11f84:	4f495047 	svcmi	0x00495047
   11f88:	70614d5f 	rsbvc	r4, r1, pc, asr sp
   11f8c:	5f676e69 	svcpl	0x00676e69
   11f90:	457b2974 	ldrbmi	r2, [fp, #-2420]!	@ 0xfffff68c
   11f94:	31495458 	cmpcc	r9, r8, asr r4
   11f98:	47202c30 			@ <UNDEFINED> instruction: 0x47202c30
   11f9c:	444f4950 	strbmi	r4, [pc], #-2384	@ 11fa4 <_Min_Stack_Size+0x11ba4>
   11fa0:	5047202c 	subpl	r2, r7, ip, lsr #32
   11fa4:	505f4f49 	subspl	r4, pc, r9, asr #30
   11fa8:	315f4e49 	cmpcc	pc, r9, asr #28
   11fac:	45202c30 	strmi	r2, [r0, #-3120]!	@ 0xfffff3d0
   11fb0:	31495458 	cmpcc	r9, r8, asr r4
   11fb4:	52495f30 	subpl	r5, r9, #48, 30	@ 0xc0
   11fb8:	49007d51 	stmdbmi	r0, {r0, r4, r6, r8, sl, fp, ip, sp, lr}
   11fbc:	6d5f4332 	ldclvs	3, cr4, [pc, #-200]	@ 11efc <_Min_Stack_Size+0x11afc>
   11fc0:	5f65646f 	svcpl	0x0065646f
   11fc4:	20433249 	subcs	r3, r3, r9, asr #4
   11fc8:	32490030 	subcc	r0, r9, #48	@ 0x30
   11fcc:	4c465f43 	mcrrmi	15, 4, r5, r6, cr3
   11fd0:	425f4741 	subsmi	r4, pc, #17039360	@ 0x1040000
   11fd4:	00595355 	subseq	r5, r9, r5, asr r3
   11fd8:	32433249 	subcc	r3, r3, #-1879048188	@ 0x90000004
   11fdc:	444e495f 	strbmi	r4, [lr], #-2399	@ 0xfffff6a1
   11fe0:	31205845 			@ <UNDEFINED> instruction: 0x31205845
   11fe4:	616c6600 	cmnvs	ip, r0, lsl #12
   11fe8:	64003167 	strvs	r3, [r0], #-359	@ 0xfffffe99
   11fec:	4f617461 	svcmi	0x00617461
   11ff0:	73007475 	movwvc	r7, #1141	@ 0x475
   11ff4:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
   11ff8:	41434d00 	cmpmi	r3, r0, lsl #26
   11ffc:	43525f4c 	cmpmi	r2, #76, 30	@ 0x130
   12000:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
   12004:	4c435074 	mcrrmi	0, 7, r5, r3, cr4
   12008:	7246314b 	subvc	r3, r6, #-1073741806	@ 0xc0000012
   1200c:	49007165 	stmdbmi	r0, {r0, r2, r5, r6, r8, ip, sp, lr}
   12010:	4d5f4332 	ldclmi	3, cr4, [pc, #-200]	@ 11f50 <_Min_Stack_Size+0x11b50>
   12014:	0065646f 	rsbeq	r6, r5, pc, ror #8
   12018:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   1201c:	4332495f 	teqmi	r2, #1556480	@ 0x17c000
   12020:	6e49445f 	mcrvs	4, 2, r4, cr9, cr15, {2}
   12024:	49007469 	stmdbmi	r0, {r0, r3, r5, r6, sl, ip, sp, lr}
   12028:	415f4332 	cmpmi	pc, r2, lsr r3	@ <UNPREDICTABLE>
   1202c:	65726464 	ldrbvs	r6, [r2, #-1124]!	@ 0xfffffb9c
   12030:	6e697373 	mcrvs	3, 3, r7, cr9, cr3, {3}
   12034:	6c535f67 	mrrcvs	15, 6, r5, r3, cr7
   12038:	5f657661 	svcpl	0x00657661
   1203c:	65646f4d 	strbvs	r6, [r4, #-3917]!	@ 0xfffff0b3
   12040:	6962375f 	stmdbvs	r2!, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, sp}^
   12044:	00302074 	eorseq	r2, r0, r4, ror r0
   12048:	71657266 	cmnvc	r5, r6, ror #4
   1204c:	676e6172 			@ <UNDEFINED> instruction: 0x676e6172
   12050:	32490065 	subcc	r0, r9, #101	@ 0x65
   12054:	69445f43 	stmdbvs	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
   12058:	74636572 	strbtvc	r6, [r3], #-1394	@ 0xfffffa8e
   1205c:	5f6e6f69 	svcpl	0x006e6f69
   12060:	6e617254 	mcrvs	2, 3, r7, cr1, cr4, {2}
   12064:	74696d73 	strbtvc	r6, [r9], #-3443	@ 0xfffff28d
   12068:	00726574 	rsbseq	r6, r2, r4, ror r5
   1206c:	65706552 	ldrbvs	r6, [r0, #-1362]!	@ 0xfffffaae
   12070:	64657461 	strbtvs	r7, [r5], #-1121	@ 0xfffffb9f
   12074:	6174535f 	cmnvs	r4, pc, asr r3
   12078:	49007472 	stmdbmi	r0, {r1, r4, r5, r6, sl, ip, sp, lr}
   1207c:	5f314332 	svcpl	0x00314332
   12080:	45444e49 	strbmi	r4, [r4, #-3657]	@ 0xfffff1b7
   12084:	00302058 	eorseq	r2, r0, r8, asr r0
   12088:	75736572 	ldrbvc	r6, [r3, #-1394]!	@ 0xfffffa8e
   1208c:	6c00746c 	cfstrsvs	mvf7, [r0], {108}	@ 0x6c
   12090:	65747361 	ldrbvs	r7, [r4, #-865]!	@ 0xfffffc9f
   12094:	746e6576 	strbtvc	r6, [lr], #-1398	@ 0xfffffa8a
   12098:	74616400 	strbtvc	r6, [r1], #-1024	@ 0xfffffc00
   1209c:	6e654c61 	cdpvs	12, 6, cr4, cr5, cr1, {3}
   120a0:	43324900 	teqmi	r2, #0, 18
   120a4:	6e65475f 	mcrvs	7, 3, r4, cr5, cr15, {2}
   120a8:	6c617261 	sfmvs	f7, 2, [r1], #-388	@ 0xfffffe7c
   120ac:	6464415f 	strbtvs	r4, [r4], #-351	@ 0xfffffea1
   120b0:	73736572 	cmnvc	r3, #478150656	@ 0x1c800000
   120b4:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
   120b8:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
   120bc:	41003020 	tstmi	r0, r0, lsr #32
   120c0:	45324250 	ldrmi	r4, [r2, #-592]!	@ 0xfffffdb0
   120c4:	7000524e 	andvc	r5, r0, lr, asr #4
   120c8:	006b6c63 	rsbeq	r6, fp, r3, ror #24
   120cc:	5453414d 	ldrbpl	r4, [r3], #-333	@ 0xfffffeb3
   120d0:	425f5245 	subsmi	r5, pc, #1342177284	@ 0x50000004
   120d4:	5f455459 	svcpl	0x00455459
   120d8:	4e415254 	mcrmi	2, 2, r5, cr1, cr4, {2}
   120dc:	54494d53 	strbpl	r4, [r9], #-3411	@ 0xfffff2ad
   120e0:	474e4954 	smlsldmi	r4, lr, r4, r9
   120e4:	45534800 	ldrbmi	r4, [r3, #-2048]	@ 0xfffff800
   120e8:	6f6c435f 	svcvs	0x006c435f
   120ec:	28206b63 	stmdacs	r0!, {r0, r1, r5, r6, r8, r9, fp, sp, lr}
   120f0:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   120f4:	745f3233 	ldrbvc	r3, [pc], #-563	@ 120fc <_Min_Stack_Size+0x11cfc>
   120f8:	30363129 	eorscc	r3, r6, r9, lsr #2
   120fc:	30303030 	eorscc	r3, r0, r0, lsr r0
   12100:	32490030 	subcc	r0, r9, #48	@ 0x30
   12104:	69445f43 	stmdbvs	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
   12108:	74636572 	strbtvc	r6, [r3], #-1394	@ 0xfffffa8e
   1210c:	5f6e6f69 	svcpl	0x006e6f69
   12110:	69636552 	stmdbvs	r3!, {r1, r4, r6, r8, sl, sp, lr}^
   12114:	00657665 	rsbeq	r7, r5, r5, ror #12
   12118:	5f433249 	svcpl	0x00433249
   1211c:	3152414f 	cmpcc	r2, pc, asr #2
   12120:	43324900 	teqmi	r2, #0, 18
   12124:	52414f5f 	subpl	r4, r1, #380	@ 0x17c
   12128:	69500032 	ldmdbvs	r0, {r1, r4, r5}^
   1212c:	6766436e 	strbvs	r4, [r6, -lr, ror #6]!
   12130:	2f2e2e00 	svccs	0x002e2e00
   12134:	334d5453 	movtcc	r5, #54355	@ 0xd453
   12138:	30314632 	eorscc	r4, r1, r2, lsr r6
   1213c:	5f364333 	svcpl	0x00364333
   12140:	76697244 	strbtvc	r7, [r9], -r4, asr #4
   12144:	2f737265 	svccs	0x00737265
   12148:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
   1214c:	30316632 	eorscc	r6, r1, r2, lsr r6
