NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   12150:	5f366333 	svcpl	0x00366333
   12154:	5f433249 	svcpl	0x00433249
   12158:	76697244 	strbtvc	r7, [r9], -r4, asr #4
   1215c:	632e7265 			@ <UNDEFINED> instruction: 0x632e7265
   12160:	43324900 	teqmi	r2, #0, 18
   12164:	6b63415f 	blvs	18e26e8 <_Min_Stack_Size+0x18e22e8>
   12168:	6c776f6e 	ldclvs	15, cr6, [r7], #-440	@ 0xfffffe48
   1216c:	65676465 	strbvs	r6, [r7, #-1125]!	@ 0xfffffb9b
   12170:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
   12174:	45006769 	strmi	r6, [r0, #-1897]	@ 0xfffff897
   12178:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   1217c:	75445f65 	strbvc	r5, [r4, #-3941]	@ 0xfffff09b
   12180:	415f6c61 	cmpmi	pc, r1, ror #24
   12184:	49006464 	stmdbmi	r0, {r2, r5, r6, sl, sp, lr}
   12188:	00784332 	rsbseq	r4, r8, r2, lsr r3
   1218c:	706f7453 	rsbvc	r7, pc, r3, asr r4	@ <UNPREDICTABLE>
   12190:	6e6f435f 	mcrvs	3, 3, r4, cr15, cr15, {2}
   12194:	69746964 	ldmdbvs	r4!, {r2, r5, r6, r8, fp, sp, lr}^
   12198:	49006e6f 	stmdbmi	r0, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}
   1219c:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
   121a0:	66005243 	strvs	r5, [r0], -r3, asr #4
   121a4:	3267616c 	rsbcc	r6, r7, #108, 2
   121a8:	76656400 	strbtvc	r6, [r5], -r0, lsl #8
   121ac:	72646441 	rsbvc	r6, r4, #1090519040	@ 0x41000000
   121b0:	49534800 	ldmdbmi	r3, {fp, lr}^
   121b4:	5f43525f 	svcpl	0x0043525f
   121b8:	206b6c43 	rsbcs	r6, fp, r3, asr #24
   121bc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   121c0:	5f323374 	svcpl	0x00323374
   121c4:	30382974 	eorscc	r2, r8, r4, ror r9
   121c8:	30303030 	eorscc	r3, r0, r0, lsr r0
   121cc:	32490030 	subcc	r0, r9, #48	@ 0x30
   121d0:	52435f43 	subpl	r5, r3, #268	@ 0x10c
   121d4:	434d0032 	movtmi	r0, #53298	@ 0xd032
   121d8:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	@ <UNPREDICTABLE>
   121dc:	4d5f4332 	ldclmi	3, cr4, [pc, #-200]	@ 1211c <_Min_Stack_Size+0x11d1c>
   121e0:	65747361 	ldrbvs	r7, [r4, #-865]!	@ 0xfffffc9f
   121e4:	58525f72 	ldmdapl	r2, {r1, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
   121e8:	43324900 	teqmi	r2, #0, 18
   121ec:	5f56455f 	svcpl	0x0056455f
   121f0:	41544144 	cmpmi	r4, r4, asr #2
   121f4:	5643525f 			@ <UNDEFINED> instruction: 0x5643525f
   121f8:	43324900 	teqmi	r2, #0, 18
   121fc:	4b43415f 	blmi	10e2780 <_Min_Stack_Size+0x10e2380>
   12200:	7369445f 	cmnvc	r9, #1593835520	@ 0x5f000000
   12204:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
   12208:	49003020 	stmdbmi	r0, {r5, ip, sp}
   1220c:	6d5f4332 	ldclvs	3, cr4, [pc, #-200]	@ 1214c <_Min_Stack_Size+0x11d4c>
   12210:	5f65646f 	svcpl	0x0065646f
   12214:	55424d53 	strbpl	r4, [r2, #-3411]	@ 0xfffff2ad
   12218:	32492053 	subcc	r2, r9, #83	@ 0x53
   1221c:	52435f43 	subpl	r5, r3, #268	@ 0x10c
   12220:	4d535f31 	ldclmi	15, cr5, [r3, #-196]	@ 0xffffff3c
   12224:	00535542 	subseq	r5, r3, r2, asr #10
   12228:	31433249 	cmpcc	r3, r9, asr #4
   1222c:	5f56455f 	svcpl	0x0056455f
   12230:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
   12234:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
   12238:	49007265 	stmdbmi	r0, {r0, r2, r5, r6, r9, ip, sp, lr}
   1223c:	495f4332 	ldmdbmi	pc, {r1, r4, r5, r8, r9, lr}^	@ <UNPREDICTABLE>
   12240:	5474696e 	ldrbtpl	r6, [r4], #-2414	@ 0xfffff692
   12244:	44657079 	strbtmi	r7, [r5], #-121	@ 0xffffff87
   12248:	42006665 	andmi	r6, r0, #105906176	@ 0x6500000
   1224c:	00524344 	subseq	r4, r2, r4, asr #6
   12250:	65727453 	ldrbvs	r7, [r2, #-1107]!	@ 0xfffffbad
   12254:	4d686374 	stclmi	3, cr6, [r8, #-464]!	@ 0xfffffe30
   12258:	0065646f 	rsbeq	r6, r5, pc, ror #8
   1225c:	706d6574 	rsbvc	r6, sp, r4, ror r5
   12260:	00676572 	rsbeq	r6, r7, r2, ror r5
   12264:	5f433249 	svcpl	0x00433249
   12268:	646e6553 	strbtvs	r6, [lr], #-1363	@ 0xfffffaad
   1226c:	72646441 	rsbvc	r6, r4, #1090519040	@ 0x41000000
   12270:	00737365 	rsbseq	r7, r3, r5, ror #6
   12274:	6d6d7564 	cfstr64vs	mvdx7, [sp, #-400]!	@ 0xfffffe70
   12278:	65725f79 	ldrbvs	r5, [r2, #-3961]!	@ 0xfffff087
   1227c:	49006461 	stmdbmi	r0, {r0, r5, r6, sl, sp, lr}
   12280:	535f434e 	cmppl	pc, #939524097	@ 0x38000001
   12284:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
   12288:	33303146 	teqcc	r0, #-2147483631	@ 0x80000011
   1228c:	495f3643 	ldmdbmi	pc, {r0, r1, r6, r9, sl, ip, sp}^	@ <UNPREDICTABLE>
   12290:	445f4332 	ldrbmi	r4, [pc], #-818	@ 12298 <_Min_Stack_Size+0x11e98>
   12294:	45564952 	ldrbmi	r4, [r6, #-2386]	@ 0xfffff6ae
   12298:	5f485f52 	svcpl	0x00485f52
   1229c:	32490020 	subcc	r0, r9, #32
   122a0:	455f3243 	ldrbmi	r3, [pc, #-579]	@ 12065 <_Min_Stack_Size+0x11c65>
   122a4:	52495f52 	subpl	r5, r9, #328	@ 0x148
   122a8:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
   122ac:	72656c64 	rsbvc	r6, r5, #100, 24	@ 0x6400
   122b0:	41434d00 	cmpmi	r3, r0, lsl #26
   122b4:	32495f4c 	subcc	r5, r9, #76, 30	@ 0x130
   122b8:	6c535f43 	mrrcvs	15, 4, r5, r3, cr3
   122bc:	53657661 	cmnpl	r5, #101711872	@ 0x6100000
   122c0:	44646e65 	strbtmi	r6, [r4], #-3685	@ 0xfffff19b
   122c4:	00617461 	rsbeq	r7, r1, r1, ror #8
   122c8:	5f433249 	svcpl	0x00433249
   122cc:	76616c53 			@ <UNDEFINED> instruction: 0x76616c53
   122d0:	64615f65 	strbtvs	r5, [r1], #-3941	@ 0xfffff09b
   122d4:	73657264 	cmnvc	r5, #100, 4	@ 0x40000006
   122d8:	32490073 	subcc	r0, r9, #115	@ 0x73
   122dc:	56455f43 	strbpl	r5, [r5], -r3, asr #30
   122e0:	5441445f 	strbpl	r4, [r1], #-1119	@ 0xfffffba1
   122e4:	45525f41 	ldrbmi	r5, [r2, #-3905]	@ 0xfffff0bf
   122e8:	32490051 	subcc	r0, r9, #81	@ 0x51
   122ec:	63415f43 	movtvs	r5, #8003	@ 0x1f43
   122f0:	6f435f6b 	svcvs	0x00435f6b
   122f4:	6f72746e 	svcvs	0x0072746e
   122f8:	3249006c 	subcc	r0, r9, #108	@ 0x6c
   122fc:	74535f43 	ldrbvc	r5, [r3], #-3907	@ 0xfffff0bd
   12300:	74636572 	strbtvc	r6, [r3], #-1394	@ 0xfffffa8e
   12304:	6f4d6863 	svcvs	0x004d6863
   12308:	455f6564 	ldrbmi	r6, [pc, #-1380]	@ 11dac <_Min_Stack_Size+0x119ac>
   1230c:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   12310:	00302065 	eorseq	r2, r0, r5, rrx
   12314:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   12318:	4332495f 	teqmi	r2, #1556480	@ 0x17c000
   1231c:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   12320:	65535f4f 	ldrbvs	r5, [r3, #-3919]	@ 0xfffff0b1
   12324:	69505f74 	ldmdbvs	r0, {r2, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
   12328:	4700736e 	strmi	r7, [r0, -lr, ror #6]
   1232c:	72656e65 	rsbvc	r6, r5, #1616	@ 0x650
   12330:	435f6c61 	cmpmi	pc, #24832	@ 0x6100
   12334:	5f6c6c61 	svcpl	0x006c6c61
   12338:	72646441 	rsbvc	r6, r4, #1090519040	@ 0x41000000
   1233c:	5f737365 	svcpl	0x00737365
   12340:	65746544 	ldrbvs	r6, [r4, #-1348]!	@ 0xfffffabc
   12344:	6f697463 	svcvs	0x00697463
   12348:	434d006e 	movtmi	r0, #53358	@ 0xd06e
   1234c:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	@ <UNPREDICTABLE>
   12350:	4d5f4332 	ldclmi	3, cr4, [pc, #-200]	@ 12290 <_Min_Stack_Size+0x11e90>
   12354:	65747361 	ldrbvs	r7, [r4, #-865]!	@ 0xfffffc9f
   12358:	58545f72 	ldmdapl	r4, {r1, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
   1235c:	43324900 	teqmi	r2, #0, 18
   12360:	3152435f 	cmpcc	r2, pc, asr r3
   12364:	43324900 	teqmi	r2, #0, 18
   12368:	7274535f 	rsbsvc	r5, r4, #2080374785	@ 0x7c000001
   1236c:	63746365 	cmnvs	r4, #-1811939327	@ 0x94000001
   12370:	646f4d68 	strbtvs	r4, [pc], #-3432	@ 12378 <_Min_Stack_Size+0x11f78>
   12374:	69445f65 	stmdbvs	r4, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   12378:	6c626173 	stfvse	f6, [r2], #-460	@ 0xfffffe34
   1237c:	32492065 	subcc	r2, r9, #101	@ 0x65
   12380:	52435f43 	subpl	r5, r3, #268	@ 0x10c
   12384:	4f4e5f31 	svcmi	0x004e5f31
   12388:	45525453 	ldrbmi	r5, [r2, #-1107]	@ 0xfffffbad
   1238c:	00484354 	subeq	r4, r8, r4, asr r3
   12390:	5f433249 	svcpl	0x00433249
   12394:	46746547 	ldrbtmi	r6, [r4], -r7, asr #10
   12398:	5367616c 	cmnpl	r7, #108, 2
   1239c:	75746174 	ldrbvc	r6, [r4, #-372]!	@ 0xfffffe8c
   123a0:	65530073 	ldrbvs	r0, [r3, #-115]	@ 0xffffff8d
   123a4:	646e6f63 	strbtvs	r6, [lr], #-3939	@ 0xfffff09d
   123a8:	5f797261 	svcpl	0x00797261
   123ac:	00646441 	rsbeq	r6, r4, r1, asr #8
   123b0:	32425041 	subcc	r5, r2, #65	@ 0x41
   123b4:	52545352 	subspl	r5, r4, #1207959553	@ 0x48000001
   123b8:	616c5300 	cmnvs	ip, r0, lsl #6
   123bc:	535f6576 	cmppl	pc, #494927872	@ 0x1d800000
   123c0:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
   123c4:	5f530073 	svcpl	0x00530073
   123c8:	5f433249 	svcpl	0x00433249
   123cc:	76616c53 			@ <UNDEFINED> instruction: 0x76616c53
   123d0:	64415f65 	strbvs	r5, [r1], #-3941	@ 0xfffff09b
   123d4:	73657264 	cmnvc	r5, #100, 4	@ 0x40000006
   123d8:	32490073 	subcc	r0, r9, #115	@ 0x73
   123dc:	43535f43 	cmpmi	r3, #268	@ 0x10c
   123e0:	535f4b4c 	cmppl	pc, #76, 22	@ 0x13000
   123e4:	30355f4d 	eorscc	r5, r5, sp, asr #30
   123e8:	3528204b 	strcc	r2, [r8, #-75]!	@ 0xffffffb5
   123ec:	30303030 	eorscc	r3, r0, r0, lsr r0
   123f0:	294c5530 	stmdbcs	ip, {r4, r5, r8, sl, ip, lr}^
   123f4:	77654e00 	strbvc	r4, [r5, -r0, lsl #28]!
   123f8:	74617453 	strbtvc	r7, [r1], #-1107	@ 0xfffffbad
   123fc:	32490065 	subcc	r0, r9, #101	@ 0x65
   12400:	52445f43 	subpl	r5, r4, #268	@ 0x10c
   12404:	47464300 	strbmi	r4, [r6, -r0, lsl #6]
   12408:	66003252 			@ <UNDEFINED> instruction: 0x66003252
   1240c:	0067616c 	rsbeq	r6, r7, ip, ror #2
   12410:	5f433249 	svcpl	0x00433249
   12414:	535f5645 	cmppl	pc, #72351744	@ 0x4500000
   12418:	00504f54 	subseq	r4, r0, r4, asr pc
   1241c:	5f433249 	svcpl	0x00433249
   12420:	616e6547 	cmnvs	lr, r7, asr #10
   12424:	5f6c6172 	svcpl	0x006c6172
   12428:	72646441 	rsbvc	r6, r4, #1090519040	@ 0x41000000
   1242c:	5f737365 	svcpl	0x00737365
   12430:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
   12434:	4920656c 	stmdbmi	r0!, {r2, r3, r5, r6, r8, sl, sp, lr}
   12438:	435f4332 	cmpmi	pc, #-939524096	@ 0xc8000000
   1243c:	455f3152 	ldrbmi	r3, [pc, #-338]	@ 122f2 <_Min_Stack_Size+0x11ef2>
   12440:	0043474e 	subeq	r4, r3, lr, asr #14
   12444:	5f433249 	svcpl	0x00433249
   12448:	656e6547 	strbvs	r6, [lr, #-1351]!	@ 0xfffffab9
   1244c:	65746172 	ldrbvs	r6, [r4, #-370]!	@ 0xfffffe8e
   12450:	504f5453 	subpl	r5, pc, r3, asr r4	@ <UNPREDICTABLE>
   12454:	6d657400 	cfstrdvs	mvd7, [r5, #-0]
   12458:	74003170 	strvc	r3, [r0], #-368	@ 0xfffffe90
   1245c:	32706d65 	rsbscc	r6, r0, #6464	@ 0x1940
   12460:	6d657400 	cfstrdvs	mvd7, [r5, #-0]
   12464:	49003370 	stmdbmi	r0, {r4, r5, r6, r8, r9, ip, sp}
   12468:	455f4332 	ldrbmi	r4, [pc, #-818]	@ 1213e <_Min_Stack_Size+0x11d3e>
   1246c:	44415f56 	strbmi	r5, [r1], #-3926	@ 0xfffff0aa
   12470:	4d5f5244 	lfmmi	f5, 2, [pc, #-272]	@ 12368 <_Min_Stack_Size+0x11f68>
   12474:	68637461 	stmdavs	r3!, {r0, r5, r6, sl, ip, sp, lr}^
   12478:	50006465 	andpl	r6, r0, r5, ror #8
   1247c:	616c535f 	cmnvs	ip, pc, asr r3
   12480:	455f6576 	ldrbmi	r6, [pc, #-1398]	@ 11f12 <_Min_Stack_Size+0x11b12>
   12484:	746e6576 	strbtvc	r6, [lr], #-1398	@ 0xfffffa8a
   12488:	6c61435f 	stclvs	3, cr4, [r1], #-380	@ 0xfffffe84
   1248c:	6361426c 	cmnvs	r1, #108, 4	@ 0xc0000006
   12490:	3249006b 	subcc	r0, r9, #107	@ 0x6b
   12494:	43535f43 	cmpmi	r3, #268	@ 0x10c
   12498:	535f4b4c 	cmppl	pc, #76, 22	@ 0x13000
   1249c:	30315f4d 	eorscc	r5, r1, sp, asr #30
   124a0:	28204b30 	stmdacs	r0!, {r4, r5, r8, r9, fp, lr}
   124a4:	30303031 	eorscc	r3, r0, r1, lsr r0
   124a8:	55303030 	ldrpl	r3, [r0, #-48]!	@ 0xffffffd0
   124ac:	4400294c 	strmi	r2, [r0], #-2380	@ 0xfffff6b4
   124b0:	42415349 	submi	r5, r1, #603979777	@ 0x24000001
   124b4:	5700454c 	strpl	r4, [r0, -ip, asr #10]
   124b8:	5f687469 	svcpl	0x00687469
   124bc:	706f7453 	rsbvc	r7, pc, r3, asr r4	@ <UNPREDICTABLE>
   124c0:	616c5300 	cmnvs	ip, r0, lsl #6
   124c4:	535f6576 	cmppl	pc, #494927872	@ 0x1d800000
   124c8:	65746174 	ldrbvs	r6, [r4, #-372]!	@ 0xfffffe8c
   124cc:	42504100 	subsmi	r4, r0, #0, 2
   124d0:	54535231 	ldrbpl	r5, [r3], #-561	@ 0xfffffdcf
   124d4:	50410052 	subpl	r0, r1, r2, asr r0
   124d8:	4e453142 	dvfmism	f3, f5, f2
   124dc:	75460052 	strbvc	r0, [r6, #-82]	@ 0xffffffae
   124e0:	6974636e 	ldmdbvs	r4!, {r1, r2, r3, r5, r6, r8, r9, sp, lr}^
   124e4:	6c616e6f 	stclvs	14, cr6, [r1], #-444	@ 0xfffffe44
   124e8:	74617453 	strbtvc	r7, [r1], #-1107	@ 0xfffffbad
   124ec:	69460065 	stmdbvs	r6, {r0, r2, r5, r6}^
   124f0:	5f747372 	svcpl	0x00747372
   124f4:	00646441 	rsbeq	r6, r4, r1, asr #8
   124f8:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   124fc:	4332495f 	teqmi	r2, #1556480	@ 0x17c000
   12500:	616c535f 	cmnvs	ip, pc, asr r3
   12504:	65526576 	ldrbvs	r6, [r2, #-1398]	@ 0xfffffa8a
   12508:	76696563 	strbtvc	r6, [r9], -r3, ror #10
   1250c:	74614465 	strbtvc	r4, [r1], #-1125	@ 0xfffffb9b
   12510:	32490061 	subcc	r0, r9, #97	@ 0x61
   12514:	52535f43 	subspl	r5, r3, #268	@ 0x10c
   12518:	32490031 	subcc	r0, r9, #49	@ 0x31
   1251c:	52535f43 	subspl	r5, r3, #268	@ 0x10c
   12520:	32490032 	subcc	r0, r9, #50	@ 0x32
   12524:	69445f43 	stmdbvs	r4, {r0, r1, r6, r8, r9, sl, fp, ip, lr}^
   12528:	74636572 	strbtvc	r6, [r3], #-1394	@ 0xfffffa8e
   1252c:	006e6f69 	rsbeq	r6, lr, r9, ror #30
   12530:	5f433249 	svcpl	0x00433249
   12534:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
   12538:	00666544 	rsbeq	r6, r6, r4, asr #10
   1253c:	5f433249 	svcpl	0x00433249
   12540:	5f4b4341 	svcpl	0x004b4341
   12544:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
   12548:	2820656c 	stmdacs	r0!, {r2, r3, r5, r6, r8, sl, sp, lr}
   1254c:	5f433249 	svcpl	0x00433249
   12550:	5f315243 	svcpl	0x00315243
   12554:	294b4341 	stmdbcs	fp, {r0, r6, r8, r9, lr}^
   12558:	6f6c4700 	svcvs	0x006c4700
   1255c:	5f6c6162 	svcpl	0x006c6162
   12560:	5f433249 	svcpl	0x00433249
   12564:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
   12568:	49006769 	stmdbmi	r0, {r0, r3, r5, r6, r8, r9, sl, sp, lr}
   1256c:	455f4332 	ldrbmi	r4, [pc, #-818]	@ 12242 <_Min_Stack_Size+0x11e42>
   12570:	544e4556 	strbpl	r4, [lr], #-1366	@ 0xfffffaaa
   12574:	53414d5f 	movtpl	r4, #7519	@ 0x1d5f
   12578:	5f524554 	svcpl	0x00524554
   1257c:	45545942 	ldrbmi	r5, [r4, #-2370]	@ 0xfffff6be
   12580:	4152545f 	cmpmi	r2, pc, asr r4
   12584:	494d534e 	stmdbmi	sp, {r1, r2, r3, r6, r8, r9, ip, lr}^
   12588:	4e495454 	mcrmi	4, 2, r5, cr9, cr4, {2}
   1258c:	28282047 	stmdacs	r8!, {r0, r1, r2, r6, sp}
   12590:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   12594:	745f3233 	ldrbvc	r3, [pc], #-563	@ 1259c <_Min_Stack_Size+0x1219c>
   12598:	30783029 	rsbscc	r3, r8, r9, lsr #32
   1259c:	30373030 	eorscc	r3, r7, r0, lsr r0
   125a0:	29303830 	ldmdbcs	r0!, {r4, r5, fp, ip, sp}
   125a4:	38564500 	ldmdacc	r6, {r8, sl, lr}^
   125a8:	5200315f 	andpl	r3, r0, #-1073741801	@ 0xc0000017
   125ac:	54455345 	strbpl	r5, [r5], #-837	@ 0xfffffcbb
   125b0:	434e4900 	movtmi	r4, #59648	@ 0xe900
   125b4:	4d54535f 	ldclmi	3, cr5, [r4, #-380]	@ 0xfffffe84
   125b8:	30463233 	subcc	r3, r6, r3, lsr r2
   125bc:	36433331 			@ <UNDEFINED> instruction: 0x36433331
   125c0:	4343525f 	movtmi	r5, #12895	@ 0x325f
   125c4:	4952445f 	ldmdbmi	r2, {r0, r1, r2, r3, r4, r6, sl, lr}^
   125c8:	5f524556 	svcpl	0x00524556
   125cc:	00205f48 	eoreq	r5, r0, r8, asr #30
   125d0:	5f434352 	svcpl	0x00434352
   125d4:	65707954 	ldrbvs	r7, [r0, #-2388]!	@ 0xfffff6ac
   125d8:	00666544 	rsbeq	r6, r6, r4, asr #10
   125dc:	32433249 	subcc	r3, r3, #-1879048188	@ 0x90000004
   125e0:	5f56455f 	svcpl	0x0056455f
   125e4:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
   125e8:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
   125ec:	62007265 	andvs	r7, r0, #1342177286	@ 0x50000006
   125f0:	74737469 	ldrbtvc	r7, [r3], #-1129	@ 0xfffffb97
   125f4:	73757461 	cmnvc	r5, #1627389952	@ 0x61000000
   125f8:	414e4500 	cmpmi	lr, r0, lsl #10
   125fc:	00454c42 	subeq	r4, r5, r2, asr #24
   12600:	5f433249 	svcpl	0x00433249
   12604:	656e6547 	strbvs	r6, [lr, #-1351]!	@ 0xfffffab9
   12608:	65746172 	ldrbvs	r6, [r4, #-370]!	@ 0xfffffe8e
   1260c:	52415453 	subpl	r5, r1, #1392508928	@ 0x53000000
   12610:	48410054 	stmdami	r1, {r2, r4, r6}^
   12614:	524e4542 	subpl	r4, lr, #276824064	@ 0x10800000
   12618:	42484100 	submi	r4, r8, #0, 2
   1261c:	00525453 	subseq	r5, r2, r3, asr r4
   12620:	68746977 	ldmdavs	r4!, {r0, r1, r2, r4, r5, r6, r8, fp, sp, lr}^
   12624:	5f74756f 	svcpl	0x0074756f
   12628:	706f7453 	rsbvc	r7, pc, r3, asr r4	@ <UNPREDICTABLE>
   1262c:	43324900 	teqmi	r2, #0, 18
   12630:	6f6c435f 	svcvs	0x006c435f
   12634:	70536b63 	subsvc	r6, r3, r3, ror #22
   12638:	00646565 	rsbeq	r6, r4, r5, ror #10
   1263c:	65706572 	ldrbvs	r6, [r0, #-1394]!	@ 0xfffffa8e
   12640:	64657461 	strbtvs	r7, [r5], #-1121	@ 0xfffffb9f
   12644:	6174735f 	cmnvs	r4, pc, asr r3
   12648:	49007472 	stmdbmi	r0, {r1, r4, r5, r6, sl, ip, sp, lr}
   1264c:	5f314332 	svcpl	0x00314332
   12650:	495f5245 	ldmdbmi	pc, {r0, r2, r6, r9, ip, lr}^	@ <UNPREDICTABLE>
   12654:	61485152 	cmpvs	r8, r2, asr r1
   12658:	656c646e 	strbvs	r6, [ip, #-1134]!	@ 0xfffffb92
   1265c:	434d0072 	movtmi	r0, #53362	@ 0xd072
   12660:	495f4c41 	ldmdbmi	pc, {r0, r6, sl, fp, lr}^	@ <UNPREDICTABLE>
   12664:	495f4332 	ldmdbmi	pc, {r1, r4, r5, r8, r9, lr}^	@ <UNPREDICTABLE>
   12668:	0074696e 	rsbseq	r6, r4, lr, ror #18
   1266c:	5f433249 	svcpl	0x00433249
   12670:	53495254 	movtpl	r5, #37460	@ 0x9254
   12674:	32490045 	subcc	r0, r9, #69	@ 0x45
   12678:	64415f43 	strbvs	r5, [r1], #-3907	@ 0xfffff0bd
   1267c:	73657264 	cmnvc	r5, #100, 4	@ 0x40000006
   12680:	676e6973 			@ <UNDEFINED> instruction: 0x676e6973
   12684:	616c535f 	cmnvs	ip, pc, asr r3
   12688:	4d5f6576 	cfldr64mi	mvdx6, [pc, #-472]	@ 124b8 <_Min_Stack_Size+0x120b8>
   1268c:	5f65646f 	svcpl	0x0065646f
   12690:	69623031 	stmdbvs	r2!, {r0, r4, r5, ip, sp}^
   12694:	75282074 	strvc	r2, [r8, #-116]!	@ 0xffffff8c
   12698:	38746e69 	ldmdacc	r4!, {r0, r3, r5, r6, r9, sl, fp, sp, lr}^
   1269c:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
   126a0:	313c3c31 	teqcc	ip, r1, lsr ip
   126a4:	49002935 	stmdbmi	r0, {r0, r2, r4, r5, r8, fp, sp}
   126a8:	455f4332 	ldrbmi	r4, [pc, #-818]	@ 1237e <_Min_Stack_Size+0x11f7e>
   126ac:	524f5252 	subpl	r5, pc, #536870917	@ 0x20000005
   126b0:	0046415f 	subeq	r4, r6, pc, asr r1
   126b4:	5f433249 	svcpl	0x00433249
   126b8:	72646441 	rsbvc	r6, r4, #1090519040	@ 0x41000000
   126bc:	69737365 	ldmdbvs	r3!, {r0, r2, r5, r6, r8, r9, ip, sp, lr}^
   126c0:	4d5f676e 	ldclmi	7, cr6, [pc, #-440]	@ 12510 <_Min_Stack_Size+0x12110>
   126c4:	0065646f 	rsbeq	r6, r5, pc, ror #8
   126c8:	5f433249 	svcpl	0x00433249
   126cc:	74696e49 	strbtvc	r6, [r9], #-3657	@ 0xfffff1b7
   126d0:	75727453 	ldrbvc	r7, [r2, #-1107]!	@ 0xfffffbad
   126d4:	53007463 	movwpl	r7, #1123	@ 0x463
   126d8:	525f4950 	subspl	r4, pc, #80, 18	@ 0x140000
   126dc:	43524358 	cmpmi	r2, #88, 6	@ 0x60000001
   126e0:	50530052 	subspl	r0, r3, r2, asr r0
   126e4:	495f3249 	ldmdbmi	pc, {r0, r3, r6, r9, ip, sp}^	@ <UNPREDICTABLE>
   126e8:	5845444e 	stmdapl	r5, {r1, r2, r3, r6, sl, lr}^
   126ec:	49003120 	stmdbmi	r0, {r5, r8, ip, sp}
   126f0:	455f5152 	ldrbmi	r5, [pc, #-338]	@ 125a6 <_Min_Stack_Size+0x121a6>
   126f4:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   126f8:	6c470065 	mcrrvs	0, 6, r0, r7, cr5
   126fc:	6c61626f 	sfmvs	f6, 2, [r1], #-444	@ 0xfffffe44
   12700:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
   12704:	6e6f435f 	mcrvs	3, 3, r4, cr15, cr15, {2}
   12708:	00676966 	rsbeq	r6, r7, r6, ror #18
   1270c:	5f495053 	svcpl	0x00495053
   12710:	53005244 	movwpl	r5, #580	@ 0x244
   12714:	435f4950 	cmpmi	pc, #80, 18	@ 0x140000
   12718:	6b636f6c 	blvs	18ee4d0 <_Min_Stack_Size+0x18ee0d0>
   1271c:	6168505f 	qdsubvs	r5, pc, r8	@ <UNPREDICTABLE>
   12720:	325f6573 	subscc	r6, pc, #482344960	@ 0x1cc00000
   12724:	45474445 	strbmi	r4, [r7, #-1093]	@ 0xfffffbbb
   12728:	7269665f 	rsbvc	r6, r9, #99614720	@ 0x5f00000
   1272c:	645f7473 	ldrbvs	r7, [pc], #-1139	@ 12734 <_Min_Stack_Size+0x12334>
   12730:	5f617461 	svcpl	0x00617461
   12734:	74706163 	ldrbtvc	r6, [r0], #-355	@ 0xfffffe9d
   12738:	5f657275 	svcpl	0x00657275
   1273c:	65676465 	strbvs	r6, [r7, #-1125]!	@ 0xfffffb9b
   12740:	78302820 	ldmdavc	r0!, {r5, fp, sp}
   12744:	3c3c5531 	cfldr32cc	mvfx5, [ip], #-196	@ 0xffffff3c
   12748:	74002930 	strvc	r2, [r0], #-2352	@ 0xfffff6d0
   1274c:	6572706d 	ldrbvs	r7, [r2, #-109]!	@ 0xffffff93
   12750:	52435f67 	subpl	r5, r3, #412	@ 0x19c
   12754:	54700032 	ldrbtpl	r0, [r0], #-50	@ 0xffffffce
   12758:	66754278 			@ <UNDEFINED> instruction: 0x66754278
   1275c:	00726566 	rsbseq	r6, r2, r6, ror #10
   12760:	5f495053 	svcpl	0x00495053
   12764:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   12768:	45544152 	ldrbmi	r4, [r4, #-338]	@ 0xfffffeae
   1276c:	53455250 	movtpl	r5, #21072	@ 0x5250
   12770:	454c4143 	strbmi	r4, [ip, #-323]	@ 0xfffffebd
   12774:	32315f52 	eorscc	r5, r1, #328	@ 0x148
   12778:	30282038 	eorcc	r2, r8, r8, lsr r0
   1277c:	30313162 	eorscc	r3, r1, r2, ror #2
   12780:	3c3c2055 	ldccc	0, cr2, [ip], #-340	@ 0xfffffeac
   12784:	00293320 	eoreq	r3, r9, r0, lsr #6
   12788:	5f495053 	svcpl	0x00495053
   1278c:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   12790:	45544152 	ldrbmi	r4, [r4, #-338]	@ 0xfffffeae
   12794:	53455250 	movtpl	r5, #21072	@ 0x5250
   12798:	454c4143 	strbmi	r4, [ip, #-323]	@ 0xfffffebd
   1279c:	20385f52 	eorscs	r5, r8, r2, asr pc
   127a0:	30623028 	rsbcc	r3, r2, r8, lsr #32
   127a4:	20553031 	subscs	r3, r5, r1, lsr r0
   127a8:	33203c3c 			@ <UNDEFINED> instruction: 0x33203c3c
   127ac:	6f500029 	svcvs	0x00500029
   127b0:	6e696c6c 	cdpvs	12, 6, cr6, cr9, cr12, {3}
   127b4:	616e6567 	cmnvs	lr, r7, ror #10
   127b8:	00656c62 	rsbeq	r6, r5, r2, ror #24
   127bc:	49525245 	ldmdbmi	r2, {r0, r2, r6, r9, ip, lr}^
   127c0:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   127c4:	4352435f 	cmpmi	r2, #2080374785	@ 0x7c000001
   127c8:	53005250 	movwpl	r5, #592	@ 0x250
   127cc:	465f4950 			@ <UNDEFINED> instruction: 0x465f4950
   127d0:	656d6172 	strbvs	r6, [sp, #-370]!	@ 0xfffffe8e
   127d4:	726f465f 	rsbvc	r4, pc, #99614720	@ 0x5f00000
   127d8:	5f74616d 	svcpl	0x0074616d
   127dc:	5f42534c 	svcpl	0x0042534c
   127e0:	6e617274 	mcrvs	2, 3, r7, cr1, cr4, {3}
   127e4:	74696d73 	strbtvc	r6, [r9], #-3443	@ 0xfffff28d
   127e8:	5f646574 	svcpl	0x00646574
   127ec:	73726966 	cmnvc	r2, #1671168	@ 0x198000
   127f0:	30282074 	eorcc	r2, r8, r4, ror r0
   127f4:	3c553178 	ldfcce	f3, [r5], {120}	@ 0x78
   127f8:	0029373c 	eoreq	r3, r9, ip, lsr r7
   127fc:	6c6c6f50 	stclvs	15, cr6, [ip], #-320	@ 0xfffffec0
   12800:	64676e69 	strbtvs	r6, [r7], #-3689	@ 0xfffff197
   12804:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
   12808:	4d00656c 	cfstr32mi	mvfx6, [r0, #-432]	@ 0xfffffe50
   1280c:	5f4c4143 	svcpl	0x004c4143
   12810:	5f495053 	svcpl	0x00495053
   12814:	6e496544 	cdpvs	5, 4, cr6, cr9, cr4, {2}
   12818:	53007469 	movwpl	r7, #1129	@ 0x469
   1281c:	425f4950 	subsmi	r4, pc, #80, 18	@ 0x140000
   12820:	52445541 	subpl	r5, r4, #272629760	@ 0x10400000
   12824:	50455441 	subpl	r5, r5, r1, asr #8
   12828:	43534552 	cmpmi	r3, #343932928	@ 0x14800000
   1282c:	52454c41 	subpl	r4, r5, #16640	@ 0x4100
   12830:	2820345f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, sl, ip, sp}
   12834:	30306230 	eorscc	r6, r0, r0, lsr r2
   12838:	3c205531 	cfstr32cc	mvfx5, [r0], #-196	@ 0xffffff3c
   1283c:	2033203c 	eorscs	r2, r3, ip, lsr r0
   12840:	61440029 	cmpvs	r4, r9, lsr #32
   12844:	69536174 	ldmdbvs	r3, {r2, r4, r5, r6, r8, sp, lr}^
   12848:	6900657a 	stmdbvs	r0, {r1, r3, r4, r5, r6, r8, sl, sp, lr}
   1284c:	735f7172 	cmpvc	pc, #-2147483620	@ 0x8000001c
   12850:	53006372 	movwpl	r6, #882	@ 0x372
   12854:	4e5f4950 			@ <UNDEFINED> instruction: 0x4e5f4950
   12858:	485f5353 	ldmdami	pc, {r0, r1, r4, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
   1285c:	5f647261 	svcpl	0x00647261
   12860:	7473614d 	ldrbtvc	r6, [r3], #-333	@ 0xfffffeb3
   12864:	535f7265 	cmppl	pc, #1342177286	@ 0x50000006
   12868:	756f5f53 	strbvc	r5, [pc, #-3923]!	@ 1191d <_Min_Stack_Size+0x1151d>
   1286c:	74757074 	ldrbtvc	r7, [r5], #-116	@ 0xffffff8c
   12870:	616e655f 	cmnvs	lr, pc, asr r5
   12874:	20656c62 	rsbcs	r6, r5, r2, ror #24
   12878:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
