NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   1287c:	5f363174 	svcpl	0x00363174
   12880:	30282974 	eorcc	r2, r8, r4, ror r9
   12884:	3c553178 	ldfcce	f3, [r5], {120}	@ 0x78
   12888:	0029323c 	eoreq	r3, r9, ip, lsr r2
   1288c:	6c6c6f50 	stclvs	15, cr6, [ip], #-320	@ 0xfffffec0
   12890:	4d676e69 	stclmi	14, cr6, [r7, #-420]!	@ 0xfffffe5c
   12894:	69686365 	stmdbvs	r8!, {r0, r2, r5, r6, r8, r9, sp, lr}^
   12898:	53006d73 	movwpl	r6, #3443	@ 0xd73
   1289c:	5f324950 	svcpl	0x00324950
   128a0:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
   128a4:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
   128a8:	53007265 	movwpl	r7, #613	@ 0x265
   128ac:	495f4950 	ldmdbmi	pc, {r4, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
   128b0:	52505332 	subspl	r5, r0, #-939524096	@ 0xc8000000
   128b4:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   128b8:	7461445f 	strbtvc	r4, [r1], #-1119	@ 0xfffffba1
   128bc:	7a695361 	bvc	1a67648 <_Min_Stack_Size+0x1a67248>
   128c0:	36315f65 	ldrtcc	r5, [r1], -r5, ror #30
   128c4:	20544942 	subscs	r4, r4, r2, asr #18
   128c8:	31783028 	cmncc	r8, r8, lsr #32
   128cc:	313c3c55 	teqcc	ip, r5, asr ip
   128d0:	53002931 	movwpl	r2, #2353	@ 0x931
   128d4:	495f4950 	ldmdbmi	pc, {r4, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
   128d8:	455f5152 	ldrbmi	r5, [pc, #-338]	@ 1278e <_Min_Stack_Size+0x1238e>
   128dc:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   128e0:	52455f65 	subpl	r5, r5, #404	@ 0x194
   128e4:	20454952 	subcs	r4, r5, r2, asr r9
   128e8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   128ec:	5f323374 	svcpl	0x00323374
   128f0:	28202974 	stmdacs	r0!, {r2, r4, r5, r6, r8, fp, sp}
   128f4:	353c3c31 	ldrcc	r3, [ip, #-3121]!	@ 0xfffff3cf
   128f8:	6f430029 	svcvs	0x00430029
   128fc:	6e756d6d 	cdpvs	13, 7, cr6, cr5, cr13, {3}
   12900:	74616369 	strbtvc	r6, [r1], #-873	@ 0xfffffc97
   12904:	5f6e6f69 	svcpl	0x006e6f69
   12908:	65646f4d 	strbvs	r6, [r4, #-3917]!	@ 0xfffff0b3
   1290c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12910:	53534e5f 	cmppl	r3, #1520	@ 0x5f0
   12914:	7261485f 	rsbvc	r4, r1, #6225920	@ 0x5f0000
   12918:	614d5f64 	cmpvs	sp, r4, ror #30
   1291c:	72657473 	rsbvc	r7, r5, #1929379840	@ 0x73000000
   12920:	5f53535f 	svcpl	0x0053535f
   12924:	7074756f 	rsbsvc	r7, r4, pc, ror #10
   12928:	645f7475 	ldrbvs	r7, [pc], #-1141	@ 12930 <_Min_Stack_Size+0x12530>
   1292c:	62617369 	rsbvs	r7, r1, #-1543503871	@ 0xa4000001
   12930:	7e20656c 	cfsh64vc	mvdx6, mvdx0, #60
   12934:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   12938:	5f363174 	svcpl	0x00363174
   1293c:	30282974 	eorcc	r2, r8, r4, ror r9
   12940:	3c553178 	ldfcce	f3, [r5], {120}	@ 0x78
   12944:	0029323c 	eoreq	r3, r9, ip, lsr r2
   12948:	5f495053 	svcpl	0x00495053
   1294c:	504b4c43 	subpl	r4, fp, r3, asr #24
   12950:	72616c6f 	rsbvc	r6, r1, #28416	@ 0x6f00
   12954:	5f797469 	svcpl	0x00797469
   12958:	48474948 	stmdami	r7, {r3, r6, r8, fp, lr}^
   1295c:	6568775f 	strbvs	r7, [r8, #-1887]!	@ 0xfffff8a1
   12960:	64695f6e 	strbtvs	r5, [r9], #-3950	@ 0xfffff092
   12964:	2820656c 	stmdacs	r0!, {r2, r3, r5, r6, r8, sl, sp, lr}
   12968:	55317830 	ldrpl	r7, [r1, #-2096]!	@ 0xfffff7d0
   1296c:	29313c3c 	ldmdbcs	r1!, {r2, r3, r4, r5, sl, fp, ip, sp}
   12970:	6c6f5000 	stclvs	0, cr5, [pc], #-0	@ 12978 <_Min_Stack_Size+0x12578>
   12974:	676e696c 	strbvs	r6, [lr, -ip, ror #18]!
   12978:	4d006e45 	stcmi	14, cr6, [r0, #-276]	@ 0xfffffeec
   1297c:	5f4c4143 	svcpl	0x004c4143
   12980:	5f495053 	svcpl	0x00495053
   12984:	646e6553 	strbtvs	r6, [lr], #-1363	@ 0xfffffaad
   12988:	61746144 	cmnvs	r4, r4, asr #2
   1298c:	4b4c4300 	blmi	1323594 <_Min_Stack_Size+0x1323194>
   12990:	73616850 	cmnvc	r1, #80, 16	@ 0x500000
   12994:	50530065 	subspl	r0, r3, r5, rrx
   12998:	52495f49 	subpl	r5, r9, #292	@ 0x124
   1299c:	6e455f51 	mcrvs	15, 2, r5, cr5, cr1, {2}
   129a0:	656c6261 	strbvs	r6, [ip, #-609]!	@ 0xfffffd9f
   129a4:	4558545f 	ldrbmi	r5, [r8, #-1119]	@ 0xfffffba1
   129a8:	28204549 	stmdacs	r0!, {r0, r3, r6, r8, sl, lr}
   129ac:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   129b0:	745f3233 	ldrbvc	r3, [pc], #-563	@ 129b8 <_Min_Stack_Size+0x125b8>
   129b4:	31282029 			@ <UNDEFINED> instruction: 0x31282029
   129b8:	29373c3c 	ldmdbcs	r7!, {r2, r3, r4, r5, sl, fp, ip, sp}
   129bc:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   129c0:	5332495f 	teqpl	r2, #1556480	@ 0x17c000
   129c4:	52474643 	subpl	r4, r7, #70254592	@ 0x4300000
   129c8:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   129cc:	7461445f 	strbtvc	r4, [r1], #-1119	@ 0xfffffba1
   129d0:	7a695361 	bvc	1a6775c <_Min_Stack_Size+0x1a6735c>
   129d4:	42385f65 	eorsmi	r5, r8, #404	@ 0x194
   129d8:	28205449 	stmdacs	r0!, {r0, r3, r6, sl, ip, lr}
   129dc:	30307830 	eorscc	r7, r0, r0, lsr r8
   129e0:	30303030 	eorscc	r3, r0, r0, lsr r0
   129e4:	29553030 	ldmdbcs	r5, {r4, r5, ip, sp}^
   129e8:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   129ec:	53534e5f 	cmppl	r3, #1520	@ 0x5f0
   129f0:	666f535f 			@ <UNDEFINED> instruction: 0x666f535f
   129f4:	534e5f74 	movtpl	r5, #61300	@ 0xef74
   129f8:	746e4953 	strbtvc	r4, [lr], #-2387	@ 0xfffff6ad
   129fc:	616e7265 	cmnvs	lr, r5, ror #4
   12a00:	666f536c 	strbtvs	r5, [pc], -ip, ror #6
   12a04:	65535f74 	ldrbvs	r5, [r3, #-3956]	@ 0xfffff08c
   12a08:	75282074 	strvc	r2, [r8, #-116]!	@ 0xffffff8c
   12a0c:	31746e69 	cmncc	r4, r9, ror #28
   12a10:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
   12a14:	78302828 	ldmdavc	r0!, {r3, r5, fp, sp}
   12a18:	3c3c5531 	cfldr32cc	mvfx5, [ip], #-196	@ 0xffffff3c
   12a1c:	7c202939 			@ <UNDEFINED> instruction: 0x7c202939
   12a20:	78302820 	ldmdavc	r0!, {r5, fp, sp}
   12a24:	3c3c5531 	cfldr32cc	mvfx5, [ip], #-196	@ 0xffffff3c
   12a28:	00292938 	eoreq	r2, r9, r8, lsr r9
   12a2c:	31495053 	qdaddcc	r5, r3, r9
   12a30:	444e495f 	strbmi	r4, [lr], #-2399	@ 0xfffff6a1
   12a34:	30205845 	eorcc	r5, r0, r5, asr #16
   12a38:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12a3c:	4358545f 	cmpmi	r8, #1593835520	@ 0x5f000000
   12a40:	00524352 	subseq	r4, r2, r2, asr r3
   12a44:	5f495053 	svcpl	0x00495053
   12a48:	504b4c43 	subpl	r4, fp, r3, asr #24
   12a4c:	72616c6f 	rsbvc	r6, r1, #28416	@ 0x6f00
   12a50:	5f797469 	svcpl	0x00797469
   12a54:	5f574f4c 	svcpl	0x00574f4c
   12a58:	6e656877 	mcrvs	8, 3, r6, cr5, cr7, {3}
   12a5c:	6c64695f 			@ <UNDEFINED> instruction: 0x6c64695f
   12a60:	30282065 	eorcc	r2, r8, r5, rrx
   12a64:	30303078 	eorscc	r3, r0, r8, ror r0
   12a68:	30303030 	eorscc	r3, r0, r0, lsr r0
   12a6c:	00295530 	eoreq	r5, r9, r0, lsr r5
   12a70:	78495053 	stmdavc	r9, {r0, r1, r4, r6, ip, lr}^
   12a74:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12a78:	0052535f 	subseq	r5, r2, pc, asr r3
   12a7c:	5f495053 	svcpl	0x00495053
   12a80:	636f6c43 	cmnvs	pc, #17152	@ 0x4300
   12a84:	68505f6b 	ldmdavs	r0, {r0, r1, r3, r5, r6, r8, r9, sl, fp, ip, lr}^
   12a88:	5f657361 	svcpl	0x00657361
   12a8c:	47444531 	smlaldxmi	r4, r4, r1, r5	@ <UNPREDICTABLE>
   12a90:	69665f45 	stmdbvs	r6!, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
   12a94:	5f747372 	svcpl	0x00747372
   12a98:	61746164 	cmnvs	r4, r4, ror #2
   12a9c:	7061635f 	rsbvc	r6, r1, pc, asr r3
   12aa0:	65727574 	ldrbvs	r7, [r2, #-1396]!	@ 0xfffffa8c
   12aa4:	6764655f 			@ <UNDEFINED> instruction: 0x6764655f
   12aa8:	30282065 	eorcc	r2, r8, r5, rrx
   12aac:	30303078 	eorscc	r3, r0, r8, ror r0
   12ab0:	30303030 	eorscc	r3, r0, r0, lsr r0
   12ab4:	00295530 	eoreq	r5, r9, r0, lsr r5
   12ab8:	5f495053 	svcpl	0x00495053
   12abc:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   12ac0:	45544152 	ldrbmi	r4, [r4, #-338]	@ 0xfffffeae
   12ac4:	53455250 	movtpl	r5, #21072	@ 0x5250
   12ac8:	454c4143 	strbmi	r4, [ip, #-323]	@ 0xfffffebd
   12acc:	20325f52 	eorscs	r5, r2, r2, asr pc
   12ad0:	30783028 	rsbscc	r3, r8, r8, lsr #32
   12ad4:	30303030 	eorscc	r3, r0, r0, lsr r0
   12ad8:	55303030 	ldrpl	r3, [r0, #-48]!	@ 0xffffffd0
   12adc:	65520029 	ldrbvs	r0, [r2, #-41]	@ 0xffffffd7
   12ae0:	76726573 			@ <UNDEFINED> instruction: 0x76726573
   12ae4:	53006465 	movwpl	r6, #1125	@ 0x465
   12ae8:	495f4950 	ldmdbmi	pc, {r4, r6, r8, fp, lr}^	@ <UNPREDICTABLE>
   12aec:	455f5152 	ldrbmi	r5, [pc, #-338]	@ 129a2 <_Min_Stack_Size+0x125a2>
   12af0:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   12af4:	4f4e5f65 	svcmi	0x004e5f65
   12af8:	2820454e 	stmdacs	r0!, {r1, r2, r3, r6, r8, sl, lr}
   12afc:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   12b00:	745f3233 	ldrbvc	r3, [pc], #-563	@ 12b08 <_Min_Stack_Size+0x12708>
   12b04:	29302829 	ldmdbcs	r0!, {r0, r3, r5, fp, sp}
   12b08:	706d7400 	rsbvc	r7, sp, r0, lsl #8
   12b0c:	5f676572 	svcpl	0x00676572
   12b10:	00315243 	eorseq	r5, r1, r3, asr #4
   12b14:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   12b18:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
   12b1c:	5f58545f 	svcpl	0x0058545f
   12b20:	44005852 	strmi	r5, [r0], #-2130	@ 0xfffff7ae
   12b24:	63697665 	cmnvs	r9, #105906176	@ 0x6500000
   12b28:	6f4d5f65 	svcvs	0x004d5f65
   12b2c:	52006564 	andpl	r6, r0, #100, 10	@ 0x19000000
   12b30:	00454e58 	subeq	r4, r5, r8, asr lr
   12b34:	31495053 	qdaddcc	r5, r3, r9
   12b38:	5152495f 	cmppl	r2, pc, asr r9
   12b3c:	646e6148 	strbtvs	r6, [lr], #-328	@ 0xfffffeb8
   12b40:	0072656c 	rsbseq	r6, r2, ip, ror #10
   12b44:	5f495053 	svcpl	0x00495053
   12b48:	545f5253 	ldrbpl	r5, [pc], #-595	@ 12b50 <_Min_Stack_Size+0x12750>
   12b4c:	28204558 	stmdacs	r0!, {r3, r4, r6, r8, sl, lr}
   12b50:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   12b54:	745f3874 	ldrbvc	r3, [pc], #-2164	@ 12b5c <_Min_Stack_Size+0x1275c>
   12b58:	30783029 	rsbscc	r3, r8, r9, lsr #32
   12b5c:	53002932 	movwpl	r2, #2354	@ 0x932
   12b60:	445f4950 	ldrbmi	r4, [pc], #-2384	@ 12b68 <_Min_Stack_Size+0x12768>
   12b64:	63697665 	cmnvs	r9, #105906176	@ 0x6500000
   12b68:	6f4d5f65 	svcvs	0x004d5f65
   12b6c:	535f6564 	cmppl	pc, #100, 10	@ 0x19000000
   12b70:	4556414c 	ldrbmi	r4, [r6, #-332]	@ 0xfffffeb4
   12b74:	78302820 	ldmdavc	r0!, {r5, fp, sp}
   12b78:	30303030 	eorscc	r3, r0, r0, lsr r0
   12b7c:	30303030 	eorscc	r3, r0, r0, lsr r0
   12b80:	53002955 	movwpl	r2, #2389	@ 0x955
   12b84:	425f4950 	subsmi	r4, pc, #80, 18	@ 0x140000
   12b88:	52445541 	subpl	r5, r4, #272629760	@ 0x10400000
   12b8c:	50455441 	subpl	r5, r5, r1, asr #8
   12b90:	43534552 	cmpmi	r3, #343932928	@ 0x14800000
   12b94:	52454c41 	subpl	r4, r5, #16640	@ 0x4100
   12b98:	3635325f 			@ <UNDEFINED> instruction: 0x3635325f
   12b9c:	62302820 	eorsvs	r2, r0, #32, 16	@ 0x200000
   12ba0:	55313131 	ldrpl	r3, [r1, #-305]!	@ 0xfffffecf
   12ba4:	203c3c20 	eorscs	r3, ip, r0, lsr #24
   12ba8:	53002933 	movwpl	r2, #2355	@ 0x933
   12bac:	4e5f4950 			@ <UNDEFINED> instruction: 0x4e5f4950
   12bb0:	535f5353 	cmppl	pc, #1275068417	@ 0x4c000001
   12bb4:	5f74666f 	svcpl	0x0074666f
   12bb8:	4953534e 	ldmdbmi	r3, {r1, r2, r3, r6, r8, r9, ip, lr}^
   12bbc:	7265746e 	rsbvc	r7, r5, #1845493760	@ 0x6e000000
   12bc0:	536c616e 	cmnpl	ip, #-2147483621	@ 0x8000001b
   12bc4:	5f74666f 	svcpl	0x0074666f
   12bc8:	65736552 	ldrbvs	r6, [r3, #-1362]!	@ 0xfffffaae
   12bcc:	75282074 	strvc	r2, [r8, #-116]!	@ 0xffffff8c
   12bd0:	31746e69 	cmncc	r4, r9, ror #28
   12bd4:	29745f36 	ldmdbcs	r4!, {r1, r2, r4, r5, r8, r9, sl, fp, ip, lr}^
   12bd8:	31783028 	cmncc	r8, r8, lsr #32
   12bdc:	393c3c55 	ldmdbcc	ip!, {r0, r2, r4, r6, sl, fp, ip, sp}
   12be0:	50530029 	subspl	r0, r3, r9, lsr #32
   12be4:	49445f49 	stmdbmi	r4, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
   12be8:	54434552 	strbpl	r4, [r3], #-1362	@ 0xfffffaae
   12bec:	5f4e4f49 	svcpl	0x004e4f49
   12bf0:	4e494c31 	mcrmi	12, 2, r4, cr9, cr1, {1}
   12bf4:	65725f45 	ldrbvs	r5, [r2, #-3909]!	@ 0xfffff0bb
   12bf8:	76696563 	strbtvc	r6, [r9], -r3, ror #10
   12bfc:	6e6f5f65 	cdpvs	15, 6, cr5, cr15, cr5, {3}
   12c00:	2820796c 	stmdacs	r0!, {r2, r3, r5, r6, r8, fp, ip, sp, lr}
   12c04:	31783028 	cmncc	r8, r8, lsr #32
   12c08:	313c3c55 	teqcc	ip, r5, asr ip
   12c0c:	29202935 	stmdbcs	r0!, {r0, r2, r4, r5, r8, fp, sp}
   12c10:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12c14:	5249445f 	subpl	r4, r9, #1593835520	@ 0x5f000000
   12c18:	49544345 	ldmdbmi	r4, {r0, r2, r6, r8, r9, lr}^
   12c1c:	325f4e4f 	subscc	r4, pc, #1264	@ 0x4f0
   12c20:	454e494c 	strbmi	r4, [lr, #-2380]	@ 0xfffff6b4
   12c24:	30282053 	eorcc	r2, r8, r3, asr r0
   12c28:	30303078 	eorscc	r3, r0, r8, ror r0
   12c2c:	30303030 	eorscc	r3, r0, r0, lsr r0
   12c30:	00295530 	eoreq	r5, r9, r0, lsr r5
   12c34:	5f495053 	svcpl	0x00495053
   12c38:	5f515249 	svcpl	0x00515249
   12c3c:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
   12c40:	525f656c 	subspl	r6, pc, #108, 10	@ 0x1b000000
   12c44:	49454e58 	stmdbmi	r5, {r3, r4, r6, r9, sl, fp, lr}^
   12c48:	28282045 	stmdacs	r8!, {r0, r2, r6, sp}
   12c4c:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   12c50:	745f3233 	ldrbvc	r3, [pc], #-563	@ 12c58 <_Min_Stack_Size+0x12858>
   12c54:	3c312829 	ldccc	8, cr2, [r1], #-164	@ 0xffffff5c
   12c58:	2929363c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, sl, ip, sp}
   12c5c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12c60:	7079545f 	rsbsvc	r5, r9, pc, asr r4
   12c64:	66654465 	strbtvs	r4, [r5], -r5, ror #8
   12c68:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12c6c:	5249445f 	subpl	r4, r9, #1593835520	@ 0x5f000000
   12c70:	49544345 	ldmdbmi	r4, {r0, r2, r6, r8, r9, lr}^
   12c74:	325f4e4f 	subscc	r4, pc, #1264	@ 0x4f0
   12c78:	454e494c 	strbmi	r4, [lr, #-2380]	@ 0xfffff6b4
   12c7c:	58525f53 	ldmdapl	r2, {r0, r1, r4, r6, r8, r9, sl, fp, ip, lr}^
   12c80:	594c4e4f 	stmdbpl	ip, {r0, r1, r2, r3, r6, r9, sl, fp, lr}^
   12c84:	78302820 	ldmdavc	r0!, {r5, fp, sp}
   12c88:	3c3c5531 	cfldr32cc	mvfx5, [ip], #-196	@ 0xffffff3c
   12c8c:	00293031 	eoreq	r3, r9, r1, lsr r0
   12c90:	52495f53 	subpl	r5, r9, #332	@ 0x14c
   12c94:	52535f51 	subspl	r5, r3, #324	@ 0x144
   12c98:	50530043 	subspl	r0, r3, r3, asr #32
   12c9c:	52435f49 	subpl	r5, r3, #292	@ 0x124
   12ca0:	50530031 	subspl	r0, r3, r1, lsr r0
   12ca4:	52435f49 	subpl	r5, r3, #292	@ 0x124
   12ca8:	2e2e0032 	mcrcs	0, 1, r0, cr14, cr2, {1}
   12cac:	4d54532f 	ldclmi	3, cr5, [r4, #-188]	@ 0xffffff44
   12cb0:	31463233 	cmpcc	r6, r3, lsr r2
   12cb4:	36433330 			@ <UNDEFINED> instruction: 0x36433330
   12cb8:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
   12cbc:	73726576 	cmnvc	r2, #494927872	@ 0x1d800000
   12cc0:	6d74732f 	ldclvs	3, cr7, [r4, #-188]!	@ 0xffffff44
   12cc4:	31663233 	cmncc	r6, r3, lsr r2
   12cc8:	36633330 			@ <UNDEFINED> instruction: 0x36633330
   12ccc:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
   12cd0:	6972445f 	ldmdbvs	r2!, {r0, r1, r2, r3, r4, r6, sl, lr}^
   12cd4:	2e726576 	mrccs	5, 3, r6, cr2, cr6, {3}
   12cd8:	50530063 	subspl	r0, r3, r3, rrx
   12cdc:	49445f49 	stmdbmi	r4, {r0, r3, r6, r8, r9, sl, fp, ip, lr}^
   12ce0:	54434552 	strbpl	r4, [r3], #-1362	@ 0xfffffaae
   12ce4:	5f4e4f49 	svcpl	0x004e4f49
   12ce8:	4e494c31 	mcrmi	12, 2, r4, cr9, cr1, {1}
   12cec:	72745f45 	rsbsvc	r5, r4, #276	@ 0x114
   12cf0:	6d736e61 	ldclvs	14, cr6, [r3, #-388]!	@ 0xfffffe7c
   12cf4:	6f5f7469 	svcvs	0x005f7469
   12cf8:	20796c6e 	rsbscs	r6, r9, lr, ror #24
   12cfc:	78302828 	ldmdavc	r0!, {r3, r5, fp, sp}
   12d00:	3c3c5531 	cfldr32cc	mvfx5, [ip], #-196	@ 0xffffff3c
   12d04:	20293531 	eorcs	r3, r9, r1, lsr r5
   12d08:	3028207c 	eorcc	r2, r8, ip, ror r0
   12d0c:	3c553178 	ldfcce	f3, [r5], {120}	@ 0x78
   12d10:	2934313c 	ldmdbcs	r4!, {r2, r3, r4, r5, r8, ip, sp}
   12d14:	50530029 	subspl	r0, r3, r9, lsr #32
   12d18:	41425f49 	cmpmi	r2, r9, asr #30
   12d1c:	41524455 	cmpmi	r2, r5, asr r4
   12d20:	52504554 	subspl	r4, r0, #84, 10	@ 0x15000000
   12d24:	41435345 	cmpmi	r3, r5, asr #6
   12d28:	5f52454c 	svcpl	0x0052454c
   12d2c:	28203233 	stmdacs	r0!, {r0, r1, r4, r5, r9, ip, sp}
   12d30:	30316230 	eorscc	r6, r1, r0, lsr r2
   12d34:	3c205530 	cfstr32cc	mvfx5, [r0], #-192	@ 0xffffff40
   12d38:	2933203c 	ldmdbcs	r3!, {r2, r3, r4, r5, sp}
   12d3c:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12d40:	5541425f 	strbpl	r4, [r1, #-607]	@ 0xfffffda1
   12d44:	54415244 	strbpl	r5, [r1], #-580	@ 0xfffffdbc
   12d48:	45525045 	ldrbmi	r5, [r2, #-69]	@ 0xffffffbb
   12d4c:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
   12d50:	315f5245 	cmpcc	pc, r5, asr #4
   12d54:	30282036 	eorcc	r2, r8, r6, lsr r0
   12d58:	31313062 	teqcc	r1, r2, rrx
   12d5c:	3c3c2055 	ldccc	0, cr2, [ip], #-340	@ 0xfffffeac
   12d60:	00293320 	eoreq	r3, r9, r0, lsr #6
   12d64:	5f495053 	svcpl	0x00495053
   12d68:	6d617246 	sfmvs	f7, 2, [r1, #-280]!	@ 0xfffffee8
   12d6c:	6f465f65 	svcvs	0x00465f65
   12d70:	74616d72 	strbtvc	r6, [r1], #-3442	@ 0xfffff28e
   12d74:	42534d5f 	subsmi	r4, r3, #6080	@ 0x17c0
   12d78:	6172745f 	cmnvs	r2, pc, asr r4
   12d7c:	696d736e 	stmdbvs	sp!, {r1, r2, r3, r5, r6, r8, r9, ip, sp, lr}^
   12d80:	64657474 	strbtvs	r7, [r5], #-1140	@ 0xfffffb8c
   12d84:	7269665f 	rsbvc	r6, r9, #99614720	@ 0x5f00000
   12d88:	28207473 	stmdacs	r0!, {r0, r1, r4, r5, r6, sl, ip, sp, lr}
   12d8c:	30307830 	eorscc	r7, r0, r0, lsr r8
   12d90:	30303030 	eorscc	r3, r0, r0, lsr r0
   12d94:	29553030 	ldmdbcs	r5, {r4, r5, ip, sp}^
   12d98:	6f6c4700 	svcvs	0x006c4700
   12d9c:	5f6c6162 	svcpl	0x006c6162
   12da0:	5f495053 	svcpl	0x00495053
   12da4:	666e6f43 	strbtvs	r6, [lr], -r3, asr #30
   12da8:	00316769 	eorseq	r6, r1, r9, ror #14
   12dac:	626f6c47 	rsbvs	r6, pc, #18176	@ 0x4700
   12db0:	535f6c61 	cmppl	pc, #24832	@ 0x6100
   12db4:	435f4950 	cmpmi	pc, #80, 18	@ 0x140000
   12db8:	69666e6f 	stmdbvs	r6!, {r0, r1, r2, r3, r5, r6, r9, sl, fp, sp, lr}^
   12dbc:	53003267 	movwpl	r3, #615	@ 0x267
   12dc0:	535f4950 	cmppl	pc, #80, 18	@ 0x140000
   12dc4:	58525f52 	ldmdapl	r2, {r1, r4, r6, r8, r9, sl, fp, ip, lr}^
   12dc8:	2820454e 	stmdacs	r0!, {r1, r2, r3, r6, r8, sl, lr}
   12dcc:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   12dd0:	745f3874 	ldrbvc	r3, [pc], #-2164	@ 12dd8 <_Min_Stack_Size+0x129d8>
   12dd4:	30783029 	rsbscc	r3, r8, r9, lsr #32
   12dd8:	53002931 	movwpl	r2, #2353	@ 0x931
   12ddc:	4e5f4950 			@ <UNDEFINED> instruction: 0x4e5f4950
   12de0:	485f5353 	ldmdami	pc, {r0, r1, r4, r6, r8, r9, ip, lr}^	@ <UNPREDICTABLE>
   12de4:	5f647261 	svcpl	0x00647261
   12de8:	76616c53 			@ <UNDEFINED> instruction: 0x76616c53
   12dec:	28282065 	stmdacs	r8!, {r0, r2, r5, r6, sp}
   12df0:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   12df4:	745f3631 	ldrbvc	r3, [pc], #-1585	@ 12dfc <_Min_Stack_Size+0x129fc>
   12df8:	30783029 	rsbscc	r3, r8, r9, lsr #32
   12dfc:	29303030 	ldmdbcs	r0!, {r4, r5, ip, sp}
   12e00:	41434d00 	cmpmi	r3, r0, lsl #26
   12e04:	50535f4c 	subspl	r5, r3, ip, asr #30
   12e08:	65525f49 	ldrbvs	r5, [r2, #-3913]	@ 0xfffff0b7
   12e0c:	76696563 	strbtvc	r6, [r9], -r3, ror #10
   12e10:	74614465 	strbtvc	r4, [r1], #-1125	@ 0xfffffb9b
   12e14:	72460061 	subvc	r0, r6, #97	@ 0x61
   12e18:	5f656d61 	svcpl	0x00656d61
   12e1c:	6d726f46 	ldclvs	15, cr6, [r2, #-280]!	@ 0xfffffee8
   12e20:	53007461 	movwpl	r7, #1121	@ 0x461
   12e24:	445f4950 	ldrbmi	r4, [pc], #-2384	@ 12e2c <_Min_Stack_Size+0x12a2c>
   12e28:	63697665 	cmnvs	r9, #105906176	@ 0x6500000
   12e2c:	6f4d5f65 	svcvs	0x004d5f65
   12e30:	4d5f6564 	cfldr64mi	mvdx6, [pc, #-400]	@ 12ca8 <_Min_Stack_Size+0x128a8>
   12e34:	45545341 	ldrbmi	r5, [r4, #-833]	@ 0xfffffcbf
   12e38:	30282052 	eorcc	r2, r8, r2, asr r0
   12e3c:	3c553178 	ldfcce	f3, [r5], {120}	@ 0x78
   12e40:	0029323c 	eoreq	r3, r9, ip, lsr r2
   12e44:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   12e48:	4950535f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, ip, lr}^
   12e4c:	696e495f 	stmdbvs	lr!, {r0, r1, r2, r3, r4, r6, r8, fp, lr}^
   12e50:	434d0074 	movtmi	r0, #53364	@ 0xd074
   12e54:	535f4c41 	cmppl	pc, #16640	@ 0x4100
   12e58:	475f4950 			@ <UNDEFINED> instruction: 0x475f4950
   12e5c:	5f4f4950 	svcpl	0x004f4950
   12e60:	5f746553 	svcpl	0x00746553
   12e64:	736e6950 	cmnvc	lr, #80, 18	@ 0x140000
   12e68:	49505300 	ldmdbmi	r0, {r8, r9, ip, lr}^
   12e6c:	5541425f 	strbpl	r4, [r1, #-607]	@ 0xfffffda1
   12e70:	54415244 	strbpl	r5, [r1], #-580	@ 0xfffffdbc
   12e74:	45525045 	ldrbmi	r5, [r2, #-69]	@ 0xffffffbb
   12e78:	4c414353 	mcrrmi	3, 5, r4, r1, cr3
   12e7c:	49005245 	stmdbmi	r0, {r0, r2, r6, r9, ip, lr}
   12e80:	535f434e 	cmppl	pc, #939524097	@ 0x38000001
   12e84:	32334d54 	eorscc	r4, r3, #84, 26	@ 0x1500
   12e88:	33303146 	teqcc	r0, #-2147483631	@ 0x80000011
   12e8c:	535f3643 	cmppl	pc, #70254592	@ 0x4300000
   12e90:	445f4950 	ldrbmi	r4, [pc], #-2384	@ 12e98 <_Min_Stack_Size+0x12a98>
   12e94:	45564952 	ldrbmi	r4, [r6, #-2386]	@ 0xfffff6ae
   12e98:	5f485f52 	svcpl	0x00485f52
   12e9c:	50530020 	subspl	r0, r3, r0, lsr #32
   12ea0:	41425f49 	cmpmi	r2, r9, asr #30
   12ea4:	41524455 	cmpmi	r2, r5, asr r4
   12ea8:	52504554 	subspl	r4, r0, #84, 10	@ 0x15000000
   12eac:	41435345 	cmpmi	r3, r5, asr #6
   12eb0:	5f52454c 	svcpl	0x0052454c
   12eb4:	28203436 	stmdacs	r0!, {r1, r2, r4, r5, sl, ip, sp}
   12eb8:	30316230 	eorscc	r6, r1, r0, lsr r2
   12ebc:	3c205531 	cfstr32cc	mvfx5, [r0], #-196	@ 0xffffff3c
   12ec0:	2933203c 	ldmdbcs	r3!, {r2, r3, r4, r5, sp}
   12ec4:	4b4c4300 	blmi	1323acc <_Min_Stack_Size+0x13236cc>
   12ec8:	616c6f50 	cmnvs	ip, r0, asr pc
   12ecc:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
   12ed0:	56494400 	strbpl	r4, [r9], -r0, lsl #8
   12ed4:	6172465f 	cmnvs	r2, pc, asr r6
   12ed8:	6f697463 	svcvs	0x00697463
   12edc:	505f286e 	subspl	r2, pc, lr, ror #16
   12ee0:	5f4b4c43 	svcpl	0x004b4c43
   12ee4:	41425f2c 	cmpmi	r2, ip, lsr #30
   12ee8:	295f4455 	ldmdbcs	pc, {r0, r2, r4, r6, sl, lr}^	@ <UNPREDICTABLE>
   12eec:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
   12ef0:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   12ef4:	2029745f 	eorcs	r7, r9, pc, asr r4
   12ef8:	55282828 	strpl	r2, [r8, #-2088]!	@ 0xfffff7d8
   12efc:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
   12f00:	5f564944 	svcpl	0x00564944
   12f04:	314c554d 	cmpcc	ip, sp, asr #10
   12f08:	5f283030 	svcpl	0x00283030
   12f0c:	4b4c4350 	blmi	1323c54 <_Min_Stack_Size+0x1323854>
   12f10:	5f202c5f 	svcpl	0x00202c5f
   12f14:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   12f18:	2d20295f 			@ <UNDEFINED> instruction: 0x2d20295f
   12f1c:	6e614d20 	cdpvs	13, 6, cr4, cr1, cr0, {1}
   12f20:	73736974 	cmnvc	r3, #116, 18	@ 0x1d0000
   12f24:	554d5f61 	strbpl	r5, [sp, #-3937]	@ 0xfffff09f
   12f28:	3030314c 	eorscc	r3, r0, ip, asr #2
   12f2c:	43505f28 	cmpmi	r0, #40, 30	@ 0xa0
   12f30:	2c5f4b4c 	mrrccs	11, 4, r4, pc, cr12	@ <UNPREDICTABLE>
   12f34:	41425f20 	cmpmi	r2, r0, lsr #30
   12f38:	295f4455 	ldmdbcs	pc, {r0, r2, r4, r6, sl, lr}^	@ <UNPREDICTABLE>
   12f3c:	2a202920 	bcs	81d3c4 <_Min_Stack_Size+0x81cfc4>
   12f40:	20363120 	eorscs	r3, r6, r0, lsr #2
   12f44:	202f2029 	eorcs	r2, pc, r9, lsr #32
   12f48:	20303031 	eorscs	r3, r0, r1, lsr r0
   12f4c:	434d0029 	movtmi	r0, #53289	@ 0xd029
   12f50:	555f4c41 	ldrbpl	r4, [pc, #-3137]	@ 12317 <_Min_Stack_Size+0x11f17>
   12f54:	5f545241 	svcpl	0x00545241
   12f58:	65636552 	strbvs	r6, [r3, #-1362]!	@ 0xfffffaae
   12f5c:	44657669 	strbtmi	r7, [r5], #-1641	@ 0xfffff997
   12f60:	00617461 	rsbeq	r7, r1, r1, ror #8
   12f64:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   12f68:	7561425f 	strbvc	r4, [r1, #-607]!	@ 0xfffffda1
   12f6c:	74615264 	strbtvc	r5, [r1], #-612	@ 0xfffffd9c
   12f70:	32395f65 	eorscc	r5, r9, #404	@ 0x194
   12f74:	30303631 	eorscc	r3, r0, r1, lsr r6
   12f78:	31323920 	teqcc	r2, r0, lsr #18
   12f7c:	00303036 	eorseq	r3, r0, r6, lsr r0
   12f80:	64756142 	ldrbtvs	r6, [r5], #-322	@ 0xfffffebe
   12f84:	65746152 	ldrbvs	r6, [r4, #-338]!	@ 0xfffffeae
   12f88:	6c6f5000 	stclvs	0, cr5, [pc], #-0	@ 12f90 <_Min_Stack_Size+0x12b90>
   12f8c:	676e696c 	strbvs	r6, [lr, -ip, ror #18]!
   12f90:	63656d5f 	cmnvs	r5, #6080	@ 0x17c0
   12f94:	6d736968 			@ <UNDEFINED> instruction: 0x6d736968
   12f98:	41535500 	cmpmi	r3, r0, lsl #10
   12f9c:	00785452 	rsbseq	r5, r8, r2, asr r4
   12fa0:	746e614d 	strbtvc	r6, [lr], #-333	@ 0xfffffeb3
   12fa4:	61737369 	cmnvs	r3, r9, ror #6
   12fa8:	4c554d5f 	mrrcmi	13, 5, r4, r5, cr15
