NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   12fac:	28303031 	ldmdacs	r0!, {r0, r4, r5, ip, sp}
   12fb0:	4c43505f 	mcrrmi	0, 5, r5, r3, cr15
   12fb4:	5f2c5f4b 	svcpl	0x002c5f4b
   12fb8:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   12fbc:	2820295f 	stmdacs	r0!, {r0, r1, r2, r3, r4, r6, r8, fp, sp}
   12fc0:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   12fc4:	745f3233 	ldrbvc	r3, [pc], #-563	@ 12fcc <_Min_Stack_Size+0x12bcc>
   12fc8:	55282029 	strpl	r2, [r8, #-41]!	@ 0xffffffd7
   12fcc:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
   12fd0:	28564944 	ldmdacs	r6, {r2, r6, r8, fp, lr}^
   12fd4:	4c43505f 	mcrrmi	0, 5, r5, r3, cr15
   12fd8:	202c5f4b 	eorcs	r5, ip, fp, asr #30
   12fdc:	5541425f 	strbpl	r4, [r1, #-607]	@ 0xfffffda1
   12fe0:	20295f44 	eorcs	r5, r9, r4, asr #30
   12fe4:	3031202a 	eorscc	r2, r1, sl, lsr #32
   12fe8:	4d002930 	vstrmi.16	s4, [r0, #-96]	@ 0xffffffa0	@ <UNPREDICTABLE>
   12fec:	5f4c4143 	svcpl	0x004c4143
   12ff0:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   12ff4:	4941575f 	stmdbmi	r1, {r0, r1, r2, r3, r4, r6, r8, r9, sl, ip, lr}^
   12ff8:	43545f54 	cmpmi	r4, #84, 30	@ 0x150
   12ffc:	41434d00 	cmpmi	r3, r0, lsl #26
   13000:	41555f4c 	cmpmi	r5, ip, asr #30
   13004:	495f5452 	ldmdbmi	pc, {r1, r4, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
   13008:	0074696e 	rsbseq	r6, r4, lr, ror #18
   1300c:	706f7453 	rsbvc	r7, pc, r3, asr r4	@ <UNPREDICTABLE>
   13010:	73746942 	cmnvc	r4, #1081344	@ 0x108000
   13014:	434e4900 	movtmi	r4, #59648	@ 0xe900
   13018:	4d54535f 	ldclmi	3, cr5, [r4, #-380]	@ 0xfffffe84
   1301c:	31463233 	cmpcc	r6, r3, lsr r2
   13020:	36433330 			@ <UNDEFINED> instruction: 0x36433330
   13024:	4153555f 	cmpmi	r3, pc, asr r5
   13028:	445f5452 	ldrbmi	r5, [pc], #-1106	@ 13030 <_Min_Stack_Size+0x12c30>
   1302c:	45564952 	ldrbmi	r4, [r6, #-2386]	@ 0xfffff6ae
   13030:	5f485f52 	svcpl	0x00485f52
   13034:	64700020 	ldrbtvs	r0, [r0], #-32	@ 0xffffffe0
   13038:	00617461 	rsbeq	r7, r1, r1, ror #8
   1303c:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   13040:	5241555f 	subpl	r5, r1, #398458880	@ 0x17c00000
   13044:	65445f54 	strbvs	r5, [r4, #-3924]	@ 0xfffff0ac
   13048:	74696e49 	strbtvc	r6, [r9], #-3657	@ 0xfffff1b7
   1304c:	52415500 	subpl	r5, r1, #0, 10
   13050:	61505f54 	cmpvs	r0, r4, asr pc
   13054:	79746972 	ldmdbvc	r4!, {r1, r4, r5, r6, r8, fp, sp, lr}^
   13058:	444f5f5f 	strbmi	r5, [pc], #-3935	@ 13060 <_Min_Stack_Size+0x12c60>
   1305c:	28282044 	stmdacs	r8!, {r2, r6, sp}
   13060:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   13064:	745f3233 	ldrbvc	r3, [pc], #-563	@ 1306c <_Min_Stack_Size+0x12c6c>
   13068:	3c312829 	ldccc	8, cr2, [r1], #-164	@ 0xffffff5c
   1306c:	2030313c 	eorscs	r3, r0, ip, lsr r1
   13070:	3c31207c 	ldccc	0, cr2, [r1], #-496	@ 0xfffffe10
   13074:	2929393c 	stmdbcs	r9!, {r2, r3, r4, r5, r8, fp, ip, sp}
   13078:	2f2e2e00 	svccs	0x002e2e00
   1307c:	334d5453 	movtcc	r5, #54355	@ 0xd453
   13080:	30314632 	eorscc	r4, r1, r2, lsr r6
   13084:	5f364333 	svcpl	0x00364333
   13088:	76697244 	strbtvc	r7, [r9], -r4, asr #4
   1308c:	2f737265 	svccs	0x00737265
   13090:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
   13094:	30316632 	eorscc	r6, r1, r2, lsr r6
   13098:	5f366333 	svcpl	0x00366333
   1309c:	52415355 	subpl	r5, r1, #1409286145	@ 0x54000001
   130a0:	72445f54 	subvc	r5, r4, #84, 30	@ 0x150
   130a4:	72657669 	rsbvc	r7, r5, #110100480	@ 0x6900000
   130a8:	4d00632e 	stcmi	3, cr6, [r0, #-184]	@ 0xffffff48
   130ac:	5f4c4143 	svcpl	0x004c4143
   130b0:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   130b4:	4950475f 	ldmdbmi	r0, {r0, r1, r2, r3, r4, r6, r8, r9, sl, lr}^
   130b8:	65535f4f 	ldrbvs	r5, [r3, #-3919]	@ 0xfffff0b1
   130bc:	69505f74 	ldmdbvs	r0, {r2, r4, r5, r6, r8, r9, sl, fp, ip, lr}^
   130c0:	5000736e 	andpl	r7, r0, lr, ror #6
   130c4:	6f6c7961 	svcvs	0x006c7961
   130c8:	4c5f6461 	cfldrdmi	mvd6, [pc], {97}	@ 0x61
   130cc:	74676e65 	strbtvc	r6, [r7], #-3685	@ 0xfffff19b
   130d0:	41550068 	cmpmi	r5, r8, rrx
   130d4:	495f5452 	ldmdbmi	pc, {r1, r4, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
   130d8:	455f5152 	ldrbmi	r5, [pc, #-338]	@ 12f8e <_Min_Stack_Size+0x12b8e>
   130dc:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   130e0:	58525f65 	ldmdapl	r2, {r0, r2, r5, r6, r8, r9, sl, fp, ip, lr}^
   130e4:	4549454e 	strbmi	r4, [r9, #-1358]	@ 0xfffffab2
   130e8:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
   130ec:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   130f0:	2029745f 	eorcs	r7, r9, pc, asr r4
   130f4:	3c3c3128 	ldfccs	f3, [ip], #-160	@ 0xffffff60
   130f8:	55002935 	strpl	r2, [r0, #-2357]	@ 0xfffff6cb
   130fc:	5f545241 	svcpl	0x00545241
   13100:	64756142 	ldrbtvs	r6, [r5], #-322	@ 0xfffffebe
   13104:	65746152 	ldrbvs	r6, [r4, #-338]!	@ 0xfffffeae
   13108:	3637355f 			@ <UNDEFINED> instruction: 0x3637355f
   1310c:	35203030 	strcc	r3, [r0, #-48]!	@ 0xffffffd0
   13110:	30303637 	eorscc	r3, r0, r7, lsr r6
   13114:	52415500 	subpl	r5, r1, #0, 10
   13118:	61425f54 	cmpvs	r2, r4, asr pc
   1311c:	61526475 	cmpvs	r2, r5, ror r4
   13120:	325f6574 	subscc	r6, pc, #116, 10	@ 0x1d000000
   13124:	30343033 	eorscc	r3, r4, r3, lsr r0
   13128:	33322030 	teqcc	r2, #48	@ 0x30
   1312c:	30303430 	eorscc	r3, r0, r0, lsr r4
   13130:	52415500 	subpl	r5, r1, #0, 10
   13134:	61425f54 	cmpvs	r2, r4, asr pc
   13138:	61526475 	cmpvs	r2, r5, ror r4
   1313c:	395f6574 	ldmdbcc	pc, {r2, r4, r5, r6, r8, sl, sp, lr}^	@ <UNPREDICTABLE>
   13140:	20303036 	eorscs	r3, r0, r6, lsr r0
   13144:	30303639 	eorscc	r3, r0, r9, lsr r6
   13148:	52415500 	subpl	r5, r1, #0, 10
   1314c:	61425f54 	cmpvs	r2, r4, asr pc
   13150:	61526475 	cmpvs	r2, r5, ror r4
   13154:	315f6574 	cmpcc	pc, r4, ror r5	@ <UNPREDICTABLE>
   13158:	30303239 	eorscc	r3, r0, r9, lsr r2
   1315c:	32393120 	eorscc	r3, r9, #32, 2
   13160:	55003030 	strpl	r3, [r0, #-48]	@ 0xffffffd0
   13164:	5f545241 	svcpl	0x00545241
   13168:	706f7453 	rsbvc	r7, pc, r3, asr r4	@ <UNPREDICTABLE>
   1316c:	73746942 	cmnvc	r4, #1081344	@ 0x108000
   13170:	20315f5f 	eorscs	r5, r1, pc, asr pc
   13174:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   13178:	5f323374 	svcpl	0x00323374
   1317c:	30282974 	eorcc	r2, r8, r4, ror r9
   13180:	41550029 	cmpmi	r5, r9, lsr #32
   13184:	495f5452 	ldmdbmi	pc, {r1, r4, r6, sl, ip, lr}^	@ <UNPREDICTABLE>
   13188:	455f5152 	ldrbmi	r5, [pc, #-338]	@ 1303e <_Min_Stack_Size+0x12c3e>
   1318c:	6c62616e 	stfvse	f6, [r2], #-440	@ 0xfffffe48
   13190:	45505f65 	ldrbmi	r5, [r0, #-3941]	@ 0xfffff09b
   13194:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
   13198:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   1319c:	2029745f 	eorcs	r7, r9, pc, asr r4
   131a0:	3c3c3128 	ldfccs	f3, [ip], #-160	@ 0xffffff60
   131a4:	55002938 	strpl	r2, [r0, #-2360]	@ 0xfffff6c8
   131a8:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
   131ac:	7079545f 	rsbsvc	r5, r9, pc, asr r4
   131b0:	66654465 	strbtvs	r4, [r5], -r5, ror #8
   131b4:	6f6c4700 	svcvs	0x006c4700
   131b8:	5f6c6162 	svcpl	0x006c6162
   131bc:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   131c0:	6e6f435f 	mcrvs	3, 3, r4, cr15, cr15, {2}
   131c4:	00676966 	rsbeq	r6, r7, r6, ror #18
   131c8:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   131cc:	7961505f 	stmdbvc	r1!, {r0, r1, r2, r3, r4, r6, ip, lr}^
   131d0:	64616f6c 	strbtvs	r6, [r1], #-3948	@ 0xfffff094
   131d4:	6e654c5f 	mcrvs	12, 3, r4, cr5, cr15, {2}
   131d8:	5f687467 	svcpl	0x00687467
   131dc:	28204238 	stmdacs	r0!, {r3, r4, r5, r9, lr}
   131e0:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   131e4:	745f3233 	ldrbvc	r3, [pc], #-563	@ 131ec <_Min_Stack_Size+0x12dec>
   131e8:	29302829 	ldmdbcs	r0!, {r0, r3, r5, fp, sp}
   131ec:	41535500 	cmpmi	r3, r0, lsl #10
   131f0:	5f335452 	svcpl	0x00335452
   131f4:	48515249 	ldmdami	r1, {r0, r3, r6, r9, ip, lr}^
   131f8:	6c646e61 	stclvs	14, cr6, [r4], #-388	@ 0xfffffe7c
   131fc:	55007265 	strpl	r7, [r0, #-613]	@ 0xfffffd9b
   13200:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
   13204:	646f4d5f 	strbtvs	r4, [pc], #-3423	@ 1320c <_Min_Stack_Size+0x12e0c>
   13208:	53550065 	cmppl	r5, #101	@ 0x65
   1320c:	44545241 	ldrbmi	r5, [r4], #-577	@ 0xfffffdbf
   13210:	5f285649 	svcpl	0x00285649
   13214:	4b4c4350 	blmi	1323f5c <_Min_Stack_Size+0x1323b5c>
   13218:	425f2c5f 	subsmi	r2, pc, #24320	@ 0x5f00
   1321c:	5f445541 	svcpl	0x00445541
   13220:	75282029 	strvc	r2, [r8, #-41]!	@ 0xffffffd7
   13224:	33746e69 	cmncc	r4, #1680	@ 0x690
   13228:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
   1322c:	505f2820 	subspl	r2, pc, r0, lsr #16
   13230:	5f4b4c43 	svcpl	0x004b4c43
   13234:	3631282f 	ldrtcc	r2, [r1], -pc, lsr #16
   13238:	5f202a20 	svcpl	0x00202a20
   1323c:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   13240:	2929205f 	stmdbcs	r9!, {r0, r1, r2, r3, r4, r6, sp}
   13244:	46774800 	ldrbtmi	r4, [r7], -r0, lsl #16
   13248:	43776f6c 	cmnmi	r7, #108, 30	@ 0x1b0
   1324c:	55006c74 	strpl	r6, [r0, #-3188]	@ 0xfffff38c
   13250:	5f545241 	svcpl	0x00545241
   13254:	64756142 	ldrbtvs	r6, [r5], #-322	@ 0xfffffebe
   13258:	65746152 	ldrbvs	r6, [r4, #-338]!	@ 0xfffffeae
   1325c:	3034325f 	eorscc	r3, r4, pc, asr r2
   13260:	34322030 	ldrtcc	r2, [r2], #-48	@ 0xffffffd0
   13264:	55003030 	strpl	r3, [r0, #-48]	@ 0xffffffd0
   13268:	5f545241 	svcpl	0x00545241
   1326c:	6c467748 	mcrrvs	7, 4, r7, r6, cr8
   13270:	7443776f 	strbvc	r7, [r3], #-1903	@ 0xfffff891
   13274:	4f4e5f6c 	svcmi	0x004e5f6c
   13278:	2820454e 	stmdacs	r0!, {r1, r2, r3, r6, r8, sl, lr}
   1327c:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   13280:	745f3233 	ldrbvc	r3, [pc], #-563	@ 13288 <_Min_Stack_Size+0x12e88>
   13284:	29302829 	ldmdbcs	r0!, {r0, r3, r5, fp, sp}
   13288:	52415500 	subpl	r5, r1, #0, 10
   1328c:	52425f54 	subpl	r5, r2, #84, 30	@ 0x150
   13290:	65525f52 	ldrbvs	r5, [r2, #-3922]	@ 0xfffff0ae
   13294:	74736967 	ldrbtvc	r6, [r3], #-2407	@ 0xfffff699
   13298:	5f287265 	svcpl	0x00287265
   1329c:	4b4c4350 	blmi	1323fe4 <_Min_Stack_Size+0x1323be4>
   132a0:	425f2c5f 	subsmi	r2, pc, #24320	@ 0x5f00
   132a4:	5f445541 	svcpl	0x00445541
   132a8:	28282029 	stmdacs	r8!, {r0, r3, r5, sp}
   132ac:	6e614d20 	cdpvs	13, 6, cr4, cr1, cr0, {1}
   132b0:	73736974 	cmnvc	r3, #116, 18	@ 0x1d0000
   132b4:	5f282061 	svcpl	0x00282061
   132b8:	4b4c4350 	blmi	1324000 <_Min_Stack_Size+0x1323c00>
   132bc:	5f202c5f 	svcpl	0x00202c5f
   132c0:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   132c4:	2920295f 	stmdbcs	r0!, {r0, r1, r2, r3, r4, r6, r8, fp, sp}
   132c8:	343c3c20 	ldrtcc	r3, [ip], #-3104	@ 0xfffff3e0
   132cc:	287c2920 	ldmdacs	ip!, {r5, r8, fp, sp}^
   132d0:	49442820 	stmdbmi	r4, {r5, fp, sp}^
   132d4:	72465f56 	subvc	r5, r6, #344	@ 0x158
   132d8:	69746361 	ldmdbvs	r4!, {r0, r5, r6, r8, r9, sp, lr}^
   132dc:	5f286e6f 	svcpl	0x00286e6f
   132e0:	4b4c4350 	blmi	1324028 <_Min_Stack_Size+0x1323c28>
   132e4:	5f202c5f 	svcpl	0x00202c5f
   132e8:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   132ec:	2029295f 	eorcs	r2, r9, pc, asr r9
   132f0:	78302026 	ldmdavc	r0!, {r1, r2, r5, sp}
   132f4:	00292046 	eoreq	r2, r9, r6, asr #32
   132f8:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   132fc:	7261505f 	rsbvc	r5, r1, #95	@ 0x5f
   13300:	5f797469 	svcpl	0x00797469
   13304:	4556455f 	ldrbmi	r4, [r6, #-1375]	@ 0xfffffaa1
   13308:	2828204e 	stmdacs	r8!, {r1, r2, r3, r6, sp}
   1330c:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   13310:	745f3233 	ldrbvc	r3, [pc], #-563	@ 13318 <_Min_Stack_Size+0x12f18>
   13314:	3c3c3129 	ldfccs	f3, [ip], #-164	@ 0xffffff5c
   13318:	00293031 	eoreq	r3, r9, r1, lsr r0
   1331c:	4c41434d 	mcrrmi	3, 4, r4, r1, cr13
   13320:	5241555f 	subpl	r5, r1, #398458880	@ 0x17c00000
   13324:	65535f54 	ldrbvs	r5, [r3, #-3924]	@ 0xfffff0ac
   13328:	6144646e 	cmpvs	r4, lr, ror #8
   1332c:	55006174 	strpl	r6, [r0, #-372]	@ 0xfffffe8c
   13330:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
   13334:	5f564944 	svcpl	0x00564944
   13338:	314c554d 	cmpcc	ip, sp, asr #10
   1333c:	5f283030 	svcpl	0x00283030
   13340:	4b4c4350 	blmi	1324088 <_Min_Stack_Size+0x1323c88>
   13344:	425f2c5f 	subsmi	r2, pc, #24320	@ 0x5f00
   13348:	5f445541 	svcpl	0x00445541
   1334c:	75282029 	strvc	r2, [r8, #-41]!	@ 0xffffffd7
   13350:	33746e69 	cmncc	r4, #1680	@ 0x690
   13354:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
   13358:	28202820 	stmdacs	r0!, {r5, fp, sp}
   1335c:	2a203532 	bcs	82082c <_Min_Stack_Size+0x82042c>
   13360:	43505f20 	cmpmi	r0, #32, 30	@ 0x80
   13364:	205f4b4c 	subscs	r4, pc, ip, asr #22
   13368:	202f2029 	eorcs	r2, pc, r9, lsr #32
   1336c:	2a203428 	bcs	820414 <_Min_Stack_Size+0x820014>
   13370:	41425f20 	cmpmi	r2, r0, lsr #30
   13374:	205f4455 	subscs	r4, pc, r5, asr r4	@ <UNPREDICTABLE>
   13378:	55002929 	strpl	r2, [r0, #-2345]	@ 0xfffff6d7
   1337c:	5f545241 	svcpl	0x00545241
   13380:	6c467748 	mcrrvs	7, 4, r7, r6, cr8
   13384:	7443776f 	strbvc	r7, [r3], #-1903	@ 0xfffff891
   13388:	54435f6c 	strbpl	r5, [r3], #-3948	@ 0xfffff094
   1338c:	28282053 	stmdacs	r8!, {r0, r1, r4, r6, sp}
   13390:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   13394:	745f3233 	ldrbvc	r3, [pc], #-563	@ 1339c <_Min_Stack_Size+0x12f9c>
   13398:	3c3c3129 	ldfccs	f3, [ip], #-164	@ 0xffffff5c
   1339c:	55002939 	strpl	r2, [r0, #-2361]	@ 0xfffff6c7
   133a0:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
   133a4:	52495f31 	subpl	r5, r9, #49, 30	@ 0xc4
   133a8:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
   133ac:	72656c64 	rsbvc	r6, r5, #100, 24	@ 0x6400
   133b0:	50544700 	subspl	r4, r4, r0, lsl #14
   133b4:	614d0052 	qdaddvs	r0, r2, sp
   133b8:	7369746e 	cmnvc	r9, #1845493760	@ 0x6e000000
   133bc:	5f286173 	svcpl	0x00286173
   133c0:	4b4c4350 	blmi	1324108 <_Min_Stack_Size+0x1323d08>
   133c4:	425f2c5f 	subsmi	r2, pc, #24320	@ 0x5f00
   133c8:	5f445541 	svcpl	0x00445541
   133cc:	75282029 	strvc	r2, [r8, #-41]!	@ 0xffffffd7
   133d0:	33746e69 	cmncc	r4, #1680	@ 0x690
   133d4:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
   133d8:	53552820 	cmppl	r5, #32, 16	@ 0x200000
   133dc:	44545241 	ldrbmi	r5, [r4], #-577	@ 0xfffffdbf
   133e0:	5f285649 	svcpl	0x00285649
   133e4:	4b4c4350 	blmi	132412c <_Min_Stack_Size+0x1323d2c>
   133e8:	5f202c5f 	svcpl	0x00202c5f
   133ec:	44554142 	ldrbmi	r4, [r5], #-322	@ 0xfffffebe
   133f0:	2920295f 	stmdbcs	r0!, {r0, r1, r2, r3, r4, r6, r8, fp, sp}
   133f4:	78527000 	ldmdavc	r2, {ip, sp, lr}^
   133f8:	66667542 	strbtvs	r7, [r6], -r2, asr #10
   133fc:	55007265 	strpl	r7, [r0, #-613]	@ 0xfffffd9b
   13400:	5f545241 	svcpl	0x00545241
   13404:	64756142 	ldrbtvs	r6, [r5], #-322	@ 0xfffffebe
   13408:	65746152 	ldrbvs	r6, [r4, #-338]!	@ 0xfffffeae
   1340c:	3036345f 	eorscc	r3, r6, pc, asr r4
   13410:	20303038 	eorscs	r3, r0, r8, lsr r0
   13414:	38303634 	ldmdacc	r0!, {r2, r4, r5, r9, sl, ip, sp}
   13418:	55003030 	strpl	r3, [r0, #-48]	@ 0xffffffd0
   1341c:	5f545241 	svcpl	0x00545241
   13420:	706f7453 	rsbvc	r7, pc, r3, asr r4	@ <UNPREDICTABLE>
   13424:	73746942 	cmnvc	r4, #1081344	@ 0x108000
   13428:	5f315f5f 	svcpl	0x00315f5f
   1342c:	666c6168 	strbtvs	r6, [ip], -r8, ror #2
   13430:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
   13434:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   13438:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
   1343c:	313c3c33 	teqcc	ip, r3, lsr ip
   13440:	55002932 	strpl	r2, [r0, #-2354]	@ 0xfffff6ce
   13444:	5f545241 	svcpl	0x00545241
   13448:	64756142 	ldrbtvs	r6, [r5], #-322	@ 0xfffffebe
   1344c:	65746152 	ldrbvs	r6, [r4, #-338]!	@ 0xfffffeae
   13450:	3035345f 	eorscc	r3, r5, pc, asr r4
   13454:	30303030 	eorscc	r3, r0, r0, lsr r0
   13458:	30353420 	eorscc	r3, r5, r0, lsr #8
   1345c:	30303030 	eorscc	r3, r0, r0, lsr r0
   13460:	52415500 	subpl	r5, r1, #0, 10
   13464:	4f4d5f54 	svcmi	0x004d5f54
   13468:	525f4544 	subspl	r4, pc, #68, 10	@ 0x11000000
   1346c:	75282058 	strvc	r2, [r8, #-88]!	@ 0xffffffa8
   13470:	33746e69 	cmncc	r4, #1680	@ 0x690
   13474:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
   13478:	3c312820 	ldccc	8, cr2, [r1], #-128	@ 0xffffff80
   1347c:	0029323c 	eoreq	r3, r9, ip, lsr r2
   13480:	69726150 	ldmdbvs	r2!, {r4, r6, r8, sp, lr}^
   13484:	55007974 	strpl	r7, [r0, #-2420]	@ 0xfffff68c
   13488:	5f545241 	svcpl	0x00545241
   1348c:	5f515249 	svcpl	0x00515249
   13490:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
   13494:	545f656c 	ldrbpl	r6, [pc], #-1388	@ 1349c <_Min_Stack_Size+0x1309c>
   13498:	28282043 	stmdacs	r8!, {r0, r1, r6, sp}
   1349c:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   134a0:	745f3233 	ldrbvc	r3, [pc], #-563	@ 134a8 <_Min_Stack_Size+0x130a8>
   134a4:	3c312829 	ldccc	8, cr2, [r1], #-164	@ 0xffffff5c
   134a8:	2929363c 	stmdbcs	r9!, {r2, r3, r4, r5, r9, sl, ip, sp}
   134ac:	52415500 	subpl	r5, r1, #0, 10
   134b0:	61505f54 	cmpvs	r0, r4, asr pc
   134b4:	616f6c79 	smcvs	63177	@ 0xf6c9
   134b8:	654c5f64 	strbvs	r5, [ip, #-3940]	@ 0xfffff09c
   134bc:	6874676e 	ldmdavs	r4!, {r1, r2, r3, r5, r6, r8, r9, sl, sp, lr}^
   134c0:	2042395f 	subcs	r3, r2, pc, asr r9
   134c4:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   134c8:	5f323374 	svcpl	0x00323374
   134cc:	31282974 			@ <UNDEFINED> instruction: 0x31282974
   134d0:	32313c3c 	eorscc	r3, r1, #60, 24	@ 0x3c00
   134d4:	41550029 	cmpmi	r5, r9, lsr #32
   134d8:	505f5452 	subspl	r5, pc, r2, asr r4	@ <UNPREDICTABLE>
   134dc:	74697261 	strbtvc	r7, [r9], #-609	@ 0xfffffd9f
   134e0:	4e5f5f79 	mrcmi	15, 2, r5, cr15, cr9, {3}
   134e4:	20454e4f 	subcs	r4, r5, pc, asr #28
   134e8:	6e697528 	cdpvs	5, 6, cr7, cr9, cr8, {1}
   134ec:	5f323374 	svcpl	0x00323374
   134f0:	30282974 	eorcc	r2, r8, r4, ror r9
   134f4:	41550029 	cmpmi	r5, r9, lsr #32
   134f8:	535f5452 	cmppl	pc, #1375731712	@ 0x52000000
   134fc:	42706f74 	rsbsmi	r6, r0, #116, 30	@ 0x1d0
   13500:	5f737469 	svcpl	0x00737469
   13504:	6c61685f 	stclvs	8, cr6, [r1], #-380	@ 0xfffffe84
   13508:	75282066 	strvc	r2, [r8, #-102]!	@ 0xffffff9a
   1350c:	33746e69 	cmncc	r4, #1680	@ 0x690
   13510:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
   13514:	3c3c3128 	ldfccs	f3, [ip], #-160	@ 0xffffff60
   13518:	00293231 	eoreq	r3, r9, r1, lsr r2
   1351c:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   13520:	5152495f 	cmppl	r2, pc, asr r9
   13524:	616e455f 	cmnvs	lr, pc, asr r5
   13528:	5f656c62 	svcpl	0x00656c62
   1352c:	454e4f4e 	strbmi	r4, [lr, #-3918]	@ 0xfffff0b2
   13530:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
   13534:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   13538:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
   1353c:	55002930 	strpl	r2, [r0, #-2352]	@ 0xfffff6d0
   13540:	5f545241 	svcpl	0x00545241
   13544:	64756142 	ldrbtvs	r6, [r5], #-322	@ 0xfffffebe
   13548:	65746152 	ldrbvs	r6, [r4, #-338]!	@ 0xfffffeae
   1354c:	3532325f 	ldrcc	r3, [r2, #-607]!	@ 0xfffffda1
   13550:	30303030 	eorscc	r3, r0, r0, lsr r0
   13554:	35323220 	ldrcc	r3, [r2, #-544]!	@ 0xfffffde0
   13558:	30303030 	eorscc	r3, r0, r0, lsr r0
   1355c:	52415500 	subpl	r5, r1, #0, 10
   13560:	77485f54 	smlsldvc	r5, r8, r4, pc	@ <UNPREDICTABLE>
   13564:	776f6c46 	strbvc	r6, [pc, -r6, asr #24]!
   13568:	5f6c7443 	svcpl	0x006c7443
   1356c:	5f535452 	svcpl	0x00535452
   13570:	20535443 	subscs	r5, r3, r3, asr #8
   13574:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
   13578:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   1357c:	2829745f 	stmdacs	r9!, {r0, r1, r2, r3, r4, r6, sl, ip, sp, lr}
   13580:	383c3c31 	ldmdacc	ip!, {r0, r4, r5, sl, fp, ip, sp}
   13584:	31207c20 			@ <UNDEFINED> instruction: 0x31207c20
   13588:	29393c3c 	ldmdbcs	r9!, {r2, r3, r4, r5, sl, fp, ip, sp}
   1358c:	41550029 	cmpmi	r5, r9, lsr #32
   13590:	4d5f5452 	cfldrdmi	mvd5, [pc, #-328]	@ 13450 <_Min_Stack_Size+0x13050>
   13594:	5f45444f 	svcpl	0x0045444f
   13598:	525f5854 	subspl	r5, pc, #84, 16	@ 0x540000
   1359c:	28282058 	stmdacs	r8!, {r3, r4, r6, sp}
   135a0:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   135a4:	745f3233 	ldrbvc	r3, [pc], #-563	@ 135ac <_Min_Stack_Size+0x131ac>
   135a8:	3c312829 	ldccc	8, cr2, [r1], #-164	@ 0xffffff5c
   135ac:	7c20323c 	sfmvc	f3, 4, [r0], #-240	@ 0xffffff10
   135b0:	3c3c3120 	ldfccs	f3, [ip], #-128	@ 0xffffff80
   135b4:	00292933 	eoreq	r2, r9, r3, lsr r9
   135b8:	54524155 	ldrbpl	r4, [r2], #-341	@ 0xfffffeab
   135bc:	444f4d5f 	strbmi	r4, [pc], #-3423	@ 135c4 <_Min_Stack_Size+0x131c4>
   135c0:	58545f45 	ldmdapl	r4, {r0, r2, r6, r8, r9, sl, fp, ip, lr}^
   135c4:	69752820 	ldmdbvs	r5!, {r5, fp, sp}^
   135c8:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   135cc:	2029745f 	eorcs	r7, r9, pc, asr r4
   135d0:	3c3c3128 	ldfccs	f3, [ip], #-160	@ 0xffffff60
   135d4:	55002933 	strpl	r2, [r0, #-2355]	@ 0xfffff6cd
   135d8:	5f545241 	svcpl	0x00545241
   135dc:	64756142 	ldrbtvs	r6, [r5], #-322	@ 0xfffffebe
   135e0:	65746152 	ldrbvs	r6, [r4, #-338]!	@ 0xfffffeae
   135e4:	3531315f 	ldrcc	r3, [r1, #-351]!	@ 0xfffffea1
   135e8:	20303032 	eorscs	r3, r0, r2, lsr r0
   135ec:	32353131 	eorscc	r3, r5, #1073741836	@ 0x4000000c
   135f0:	55003030 	strpl	r3, [r0, #-48]	@ 0xffffffd0
   135f4:	5f545241 	svcpl	0x00545241
   135f8:	5f515249 	svcpl	0x00515249
   135fc:	62616e45 	rsbvs	r6, r1, #1104	@ 0x450
   13600:	545f656c 	ldrbpl	r6, [pc], #-1388	@ 13608 <_Min_Stack_Size+0x13208>
   13604:	28204558 	stmdacs	r0!, {r3, r4, r6, r8, sl, lr}
   13608:	746e6975 	strbtvc	r6, [lr], #-2421	@ 0xfffff68b
   1360c:	745f3233 	ldrbvc	r3, [pc], #-563	@ 13614 <_Min_Stack_Size+0x13214>
   13610:	31282029 			@ <UNDEFINED> instruction: 0x31282029
   13614:	29373c3c 	ldmdbcs	r7!, {r2, r3, r4, r5, sl, fp, ip, sp}
   13618:	41434d00 	cmpmi	r3, r0, lsl #26
   1361c:	43525f4c 	cmpmi	r2, #76, 30	@ 0x130
   13620:	65475f43 	strbvs	r5, [r7, #-3907]	@ 0xfffff0bd
   13624:	4c435074 	mcrrmi	0, 7, r5, r3, cr4
   13628:	7246324b 	subvc	r3, r6, #-1342177276	@ 0xb0000004
   1362c:	55007165 	strpl	r7, [r0, #-357]	@ 0xfffffe9b
   13630:	54524153 	ldrbpl	r4, [r2], #-339	@ 0xfffffead
   13634:	52495f32 	subpl	r5, r9, #50, 30	@ 0xc8
   13638:	6e614851 	mcrvs	8, 3, r4, cr1, cr1, {2}
   1363c:	72656c64 	rsbvc	r6, r5, #100, 24	@ 0x6400
   13640:	52415500 	subpl	r5, r1, #0, 10
   13644:	77485f54 	smlsldvc	r5, r8, r4, pc	@ <UNPREDICTABLE>
   13648:	776f6c46 	strbvc	r6, [pc, -r6, asr #24]!
   1364c:	5f6c7443 	svcpl	0x006c7443
   13650:	20535452 	subscs	r5, r3, r2, asr r4
   13654:	69752828 	ldmdbvs	r5!, {r3, r5, fp, sp}^
   13658:	3233746e 	eorscc	r7, r3, #1845493760	@ 0x6e000000
   1365c:	3129745f 			@ <UNDEFINED> instruction: 0x3129745f
   13660:	29383c3c 	ldmdbcs	r8!, {r2, r3, r4, r5, sl, fp, ip, sp}
   13664:	52415500 	subpl	r5, r1, #0, 10
   13668:	74535f54 	ldrbvc	r5, [r3], #-3924	@ 0xfffff0ac
   1366c:	6942706f 	stmdbvs	r2, {r0, r1, r2, r3, r5, r6, ip, sp, lr}^
   13670:	5f5f7374 	svcpl	0x005f7374
   13674:	75282032 	strvc	r2, [r8, #-50]!	@ 0xffffffce
   13678:	33746e69 	cmncc	r4, #1680	@ 0x690
   1367c:	29745f32 	ldmdbcs	r4!, {r1, r4, r5, r8, r9, sl, fp, ip, lr}^
   13680:	3c3c3228 	lfmcc	f3, 4, [ip], #-160	@ 0xffffff60
   13684:	00293231 	eoreq	r3, r9, r1, lsr r2
   13688:	6f727245 	svcvs	0x00727245
   1368c:	64695f72 	strbtvs	r5, [r9], #-3954	@ 0xfffff08e
   13690:	73617400 	cmnvc	r1, #0, 8
   13694:	00315f6b 	eorseq	r5, r1, fp, ror #30
   13698:	6b736174 	blvs	1cebc70 <_Min_Stack_Size+0x1ceb870>
   1369c:	7400325f 	strvc	r3, [r0], #-607	@ 0xfffffda1
   136a0:	5f6b7361 	svcpl	0x006b7361
   136a4:	61740033 	cmnvs	r4, r3, lsr r0
   136a8:	00316b73 	eorseq	r6, r1, r3, ror fp
   136ac:	6b736174 	blvs	1cebc84 <_Min_Stack_Size+0x1ceb884>
   136b0:	61740032 	cmnvs	r4, r2, lsr r0
   136b4:	00336b73 	eorseq	r6, r3, r3, ror fp
   136b8:	6f727265 	svcvs	0x00727265
   136bc:	2e2e0072 	mcrcs	0, 1, r0, cr14, cr2, {3}
   136c0:	6372532f 	cmnvs	r2, #-1140850688	@ 0xbc000000
   136c4:	69616d2f 	stmdbvs	r1!, {r0, r1, r2, r3, r5, r8, sl, fp, sp, lr}^
   136c8:	00632e6e 	rsbeq	r2, r3, lr, ror #28
   136cc:	6e69616d 	powvsez	f6, f1, #5.0
   136d0:	2f2e2e00 	svccs	0x002e2e00
   136d4:	72617453 	rsbvc	r7, r1, #1392508928	@ 0x53000000
   136d8:	2f707574 	svccs	0x00707574
