NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
   136dc:	72617473 	rsbvc	r7, r1, #1929379840	@ 0x73000000
   136e0:	5f707574 	svcpl	0x00707574
   136e4:	336d7473 	cmncc	sp, #1929379840	@ 0x73000000
   136e8:	30316632 	eorscc	r6, r1, r2, lsr r6
   136ec:	74366333 	ldrtvc	r6, [r6], #-819	@ 0xfffffccd
   136f0:	00732e78 	rsbseq	r2, r3, r8, ror lr
   136f4:	20554e47 	subscs	r4, r5, r7, asr #28
   136f8:	32205341 	eorcc	r5, r0, #67108865	@ 0x4000001
   136fc:	2e30342e 	cdpcs	4, 3, cr3, cr0, cr14, {1}
   13700:	65520030 	ldrbvs	r0, [r2, #-48]	@ 0xffffffd0
   13704:	5f746573 	svcpl	0x00746573
   13708:	646e6148 	strbtvs	r6, [lr], #-328	@ 0xfffffeb8
   1370c:	0072656c 	rsbseq	r6, r2, ip, ror #10

Disassembly of section .comment:

00000000 <.comment>:
   0:	3a434347 	bcc	10d0d24 <_Min_Stack_Size+0x10d0924>
   4:	4e472820 	cdpmi	8, 4, cr2, cr7, cr0, {1}
   8:	6f542055 	svcvs	0x00542055
   c:	20736c6f 	rsbscs	r6, r3, pc, ror #24
  10:	20726f66 	rsbscs	r6, r2, r6, ror #30
  14:	334d5453 	movtcc	r5, #54355	@ 0xd453
  18:	32312032 	eorscc	r2, r1, #50	@ 0x32
  1c:	722e332e 	eorvc	r3, lr, #-1207959552	@ 0xb8000000
  20:	2e316c65 	cdpcs	12, 3, cr6, cr1, cr5, {3}
  24:	34323032 	ldrtcc	r3, [r2], #-50	@ 0xffffffce
  28:	32313630 	eorscc	r3, r1, #48, 12	@ 0x3000000
  2c:	3133312d 	teqcc	r3, sp, lsr #2
  30:	31202935 			@ <UNDEFINED> instruction: 0x31202935
  34:	2e332e32 	mrccs	14, 1, r2, cr3, cr2, {1}
  38:	30322031 	eorscc	r2, r2, r1, lsr r0
  3c:	36303332 			@ <UNDEFINED> instruction: 0x36303332
  40:	Address 0x40 is out of bounds.


Disassembly of section .debug_frame:

00000000 <.debug_frame>:
   0:	0000000c 	andeq	r0, r0, ip
   4:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
   8:	7c020001 	stcvc	0, cr0, [r2], {1}
   c:	000d0c0e 	andeq	r0, sp, lr, lsl #24
  10:	0000000c 	andeq	r0, r0, ip
  14:	00000000 	andeq	r0, r0, r0
  18:	08000170 	stmdaeq	r0, {r4, r5, r6, r8}
  1c:	00000002 	andeq	r0, r0, r2
  20:	0000000c 	andeq	r0, r0, ip
  24:	00000000 	andeq	r0, r0, r0
  28:	08000172 	stmdaeq	r0, {r1, r4, r5, r6, r8}
  2c:	00000002 	andeq	r0, r0, r2
  30:	0000000c 	andeq	r0, r0, ip
  34:	00000000 	andeq	r0, r0, r0
  38:	08000174 	stmdaeq	r0, {r2, r4, r5, r6, r8}
  3c:	00000002 	andeq	r0, r0, r2
  40:	0000000c 	andeq	r0, r0, ip
	...
  4c:	00000002 	andeq	r0, r0, r2
  50:	0000000c 	andeq	r0, r0, ip
  54:	00000000 	andeq	r0, r0, r0
  58:	08000176 	stmdaeq	r0, {r1, r2, r4, r5, r6, r8}
  5c:	00000012 	andeq	r0, r0, r2, lsl r0
  60:	0000000c 	andeq	r0, r0, ip
	...
  6c:	00000002 	andeq	r0, r0, r2
  70:	0000000c 	andeq	r0, r0, ip
  74:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
  78:	7c020001 	stcvc	0, cr0, [r2], {1}
  7c:	000d0c0e 	andeq	r0, sp, lr, lsl #24
  80:	0000000c 	andeq	r0, r0, ip
  84:	00000070 	andeq	r0, r0, r0, ror r0
  88:	08000188 	stmdaeq	r0, {r3, r7, r8}
  8c:	00000016 	andeq	r0, r0, r6, lsl r0
  90:	0000000c 	andeq	r0, r0, ip
  94:	00000070 	andeq	r0, r0, r0, ror r0
  98:	00000000 	andeq	r0, r0, r0
  9c:	00000048 	andeq	r0, r0, r8, asr #32
  a0:	0000000c 	andeq	r0, r0, ip
  a4:	00000070 	andeq	r0, r0, r0, ror r0
  a8:	00000000 	andeq	r0, r0, r0
  ac:	00000040 	andeq	r0, r0, r0, asr #32
  b0:	0000000c 	andeq	r0, r0, ip
  b4:	00000070 	andeq	r0, r0, r0, ror r0
  b8:	00000000 	andeq	r0, r0, r0
  bc:	00000026 	andeq	r0, r0, r6, lsr #32
  c0:	0000000c 	andeq	r0, r0, ip
  c4:	00000070 	andeq	r0, r0, r0, ror r0
  c8:	00000000 	andeq	r0, r0, r0
  cc:	00000002 	andeq	r0, r0, r2
  d0:	0000000c 	andeq	r0, r0, ip
  d4:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
  d8:	7c020001 	stcvc	0, cr0, [r2], {1}
  dc:	000d0c0e 	andeq	r0, sp, lr, lsl #24
  e0:	0000000c 	andeq	r0, r0, ip
  e4:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
  e8:	0800019e 	stmdaeq	r0, {r1, r2, r3, r4, r7, r8}
  ec:	00000004 	andeq	r0, r0, r4
  f0:	0000000c 	andeq	r0, r0, ip
  f4:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
  f8:	080001a2 	stmdaeq	r0, {r1, r5, r7, r8}
  fc:	00000002 	andeq	r0, r0, r2
 100:	0000000c 	andeq	r0, r0, ip
 104:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
 108:	080001a4 	stmdaeq	r0, {r2, r5, r7, r8}
 10c:	00000002 	andeq	r0, r0, r2
 110:	0000000c 	andeq	r0, r0, ip
 114:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
 118:	00000000 	andeq	r0, r0, r0
 11c:	00000022 	andeq	r0, r0, r2, lsr #32
 120:	0000000c 	andeq	r0, r0, ip
 124:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
 128:	080001a8 	stmdaeq	r0, {r3, r5, r7, r8}
 12c:	00000024 	andeq	r0, r0, r4, lsr #32
 130:	00000018 	andeq	r0, r0, r8, lsl r0
 134:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
 138:	080001cc 	stmdaeq	r0, {r2, r3, r6, r7, r8}
 13c:	00000040 	andeq	r0, r0, r0, asr #32
 140:	84040e41 	strhi	r0, [r4], #-3649	@ 0xfffff1bf
 144:	0ec45e01 	cdpeq	14, 12, cr5, cr4, cr1, {0}
 148:	00000000 	andeq	r0, r0, r0
 14c:	00000018 	andeq	r0, r0, r8, lsl r0
 150:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
 154:	0800020c 	stmdaeq	r0, {r2, r3, r9}
 158:	0000003c 	andeq	r0, r0, ip, lsr r0
 15c:	84080e4b 	strhi	r0, [r8], #-3659	@ 0xfffff1b5
 160:	4d018e02 	stcmi	14, cr8, [r1, #-8]
 164:	cec4000e 	cdpgt	0, 12, cr0, cr4, cr14, {0}
 168:	00000018 	andeq	r0, r0, r8, lsl r0
 16c:	000000d0 	ldrdeq	r0, [r0], -r0	@ <UNPREDICTABLE>
 170:	08000248 	stmdaeq	r0, {r3, r6, r9}
 174:	00000060 	andeq	r0, r0, r0, rrx
 178:	83100e41 	tsthi	r0, #1040	@ 0x410
 17c:	85038404 	strhi	r8, [r3, #-1028]	@ 0xfffffbfc
 180:	00018e02 	andeq	r8, r1, r2, lsl #28
 184:	0000000c 	andeq	r0, r0, ip
 188:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
 18c:	7c020001 	stcvc	0, cr0, [r2], {1}
 190:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 194:	0000000c 	andeq	r0, r0, ip
 198:	00000184 	andeq	r0, r0, r4, lsl #3
 19c:	00000000 	andeq	r0, r0, r0
 1a0:	00000096 	muleq	r0, r6, r0
 1a4:	0000000c 	andeq	r0, r0, ip
 1a8:	00000184 	andeq	r0, r0, r4, lsl #3
 1ac:	00000000 	andeq	r0, r0, r0
 1b0:	00000096 	muleq	r0, r6, r0
 1b4:	0000000c 	andeq	r0, r0, ip
 1b8:	00000184 	andeq	r0, r0, r4, lsl #3
 1bc:	00000000 	andeq	r0, r0, r0
 1c0:	00000074 	andeq	r0, r0, r4, ror r0
 1c4:	00000020 	andeq	r0, r0, r0, lsr #32
 1c8:	00000184 	andeq	r0, r0, r4, lsl #3
 1cc:	00000000 	andeq	r0, r0, r0
 1d0:	00000120 	andeq	r0, r0, r0, lsr #2
 1d4:	840c0e41 	strhi	r0, [ip], #-3649	@ 0xfffff1bf
 1d8:	8e028503 	cfsh32hi	mvfx8, mvfx2, #3
 1dc:	180e4101 	stmdane	lr, {r0, r8, lr}
 1e0:	0e0a6102 	adfeqe	f6, f2, f2
 1e4:	000b410c 	andeq	r4, fp, ip, lsl #2
 1e8:	00000014 	andeq	r0, r0, r4, lsl r0
 1ec:	00000184 	andeq	r0, r0, r4, lsl #3
 1f0:	00000000 	andeq	r0, r0, r0
 1f4:	00000008 	andeq	r0, r0, r8
 1f8:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 1fc:	00018e02 	andeq	r8, r1, r2, lsl #28
 200:	00000014 	andeq	r0, r0, r4, lsl r0
 204:	00000184 	andeq	r0, r0, r4, lsl #3
 208:	00000000 	andeq	r0, r0, r0
 20c:	00000008 	andeq	r0, r0, r8
 210:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 214:	00018e02 	andeq	r8, r1, r2, lsl #28
 218:	00000014 	andeq	r0, r0, r4, lsl r0
 21c:	00000184 	andeq	r0, r0, r4, lsl #3
 220:	080002a8 	stmdaeq	r0, {r3, r5, r7, r9}
 224:	0000001c 	andeq	r0, r0, ip, lsl r0
 228:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 22c:	00018e02 	andeq	r8, r1, r2, lsl #28
 230:	00000014 	andeq	r0, r0, r4, lsl r0
 234:	00000184 	andeq	r0, r0, r4, lsl #3
 238:	080002c4 	stmdaeq	r0, {r2, r6, r7, r9}
 23c:	0000001c 	andeq	r0, r0, ip, lsl r0
 240:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 244:	00018e02 	andeq	r8, r1, r2, lsl #28
 248:	00000014 	andeq	r0, r0, r4, lsl r0
 24c:	00000184 	andeq	r0, r0, r4, lsl #3
 250:	080002e0 	stmdaeq	r0, {r5, r6, r7, r9}
 254:	0000001c 	andeq	r0, r0, ip, lsl r0
 258:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 25c:	00018e02 	andeq	r8, r1, r2, lsl #28
 260:	00000014 	andeq	r0, r0, r4, lsl r0
 264:	00000184 	andeq	r0, r0, r4, lsl #3
 268:	080002fc 	stmdaeq	r0, {r2, r3, r4, r5, r6, r7, r9}
 26c:	0000001c 	andeq	r0, r0, ip, lsl r0
 270:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 274:	00018e02 	andeq	r8, r1, r2, lsl #28
 278:	00000014 	andeq	r0, r0, r4, lsl r0
 27c:	00000184 	andeq	r0, r0, r4, lsl #3
 280:	08000318 	stmdaeq	r0, {r3, r4, r8, r9}
 284:	0000001c 	andeq	r0, r0, ip, lsl r0
 288:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 28c:	00018e02 	andeq	r8, r1, r2, lsl #28
 290:	00000014 	andeq	r0, r0, r4, lsl r0
 294:	00000184 	andeq	r0, r0, r4, lsl #3
 298:	08000334 	stmdaeq	r0, {r2, r4, r5, r8, r9}
 29c:	00000090 	muleq	r0, r0, r0
 2a0:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 2a4:	00018e02 	andeq	r8, r1, r2, lsl #28
 2a8:	00000014 	andeq	r0, r0, r4, lsl r0
 2ac:	00000184 	andeq	r0, r0, r4, lsl #3
 2b0:	00000000 	andeq	r0, r0, r0
 2b4:	000000a8 	andeq	r0, r0, r8, lsr #1
 2b8:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 2bc:	00018e02 	andeq	r8, r1, r2, lsl #28
 2c0:	0000000c 	andeq	r0, r0, ip
 2c4:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
 2c8:	7c020001 	stcvc	0, cr0, [r2], {1}
 2cc:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 2d0:	00000018 	andeq	r0, r0, r8, lsl r0
 2d4:	000002c0 	andeq	r0, r0, r0, asr #5
 2d8:	00000000 	andeq	r0, r0, r0
 2dc:	00000158 	andeq	r0, r0, r8, asr r1
 2e0:	84100e41 	ldrhi	r0, [r0], #-3649	@ 0xfffff1bf
 2e4:	86038504 	strhi	r8, [r3], -r4, lsl #10
 2e8:	00018e02 	andeq	r8, r1, r2, lsl #28
 2ec:	0000000c 	andeq	r0, r0, ip
 2f0:	000002c0 	andeq	r0, r0, r0, asr #5
 2f4:	00000000 	andeq	r0, r0, r0
 2f8:	0000006c 	andeq	r0, r0, ip, rrx
 2fc:	0000001c 	andeq	r0, r0, ip, lsl r0
 300:	000002c0 	andeq	r0, r0, r0, asr #5
 304:	00000000 	andeq	r0, r0, r0
 308:	00000070 	andeq	r0, r0, r0, ror r0
 30c:	84080e41 	strhi	r0, [r8], #-3649	@ 0xfffff1bf
 310:	41018e02 	tstmi	r1, r2, lsl #28
 314:	0a4d100e 	beq	1344354 <_Min_Stack_Size+0x1343f54>
 318:	0b41080e 	bleq	1042358 <_Min_Stack_Size+0x1041f58>
 31c:	0000000c 	andeq	r0, r0, ip
 320:	000002c0 	andeq	r0, r0, r0, asr #5
 324:	00000000 	andeq	r0, r0, r0
 328:	00000004 	andeq	r0, r0, r4
 32c:	0000000c 	andeq	r0, r0, ip
 330:	000002c0 	andeq	r0, r0, r0, asr #5
 334:	00000000 	andeq	r0, r0, r0
 338:	00000006 	andeq	r0, r0, r6
 33c:	0000000c 	andeq	r0, r0, ip
 340:	000002c0 	andeq	r0, r0, r0, asr #5
 344:	00000000 	andeq	r0, r0, r0
 348:	00000050 	andeq	r0, r0, r0, asr r0
 34c:	00000018 	andeq	r0, r0, r8, lsl r0
 350:	000002c0 	andeq	r0, r0, r0, asr #5
 354:	00000000 	andeq	r0, r0, r0
 358:	0000002e 	andeq	r0, r0, lr, lsr #32
 35c:	84100e41 	ldrhi	r0, [r0], #-3649	@ 0xfffff1bf
 360:	86038504 	strhi	r8, [r3], -r4, lsl #10
 364:	00018e02 	andeq	r8, r1, r2, lsl #28
 368:	00000020 	andeq	r0, r0, r0, lsr #32
 36c:	000002c0 	andeq	r0, r0, r0, asr #5
 370:	00000000 	andeq	r0, r0, r0
 374:	00000088 	andeq	r0, r0, r8, lsl #1
 378:	83200e42 			@ <UNDEFINED> instruction: 0x83200e42
 37c:	85078408 	strhi	r8, [r7, #-1032]	@ 0xfffffbf8
 380:	87058606 	strhi	r8, [r5, -r6, lsl #12]
 384:	89038804 	stmdbhi	r3, {r2, fp, pc}
 388:	00018e02 	andeq	r8, r1, r2, lsl #28
 38c:	00000020 	andeq	r0, r0, r0, lsr #32
 390:	000002c0 	andeq	r0, r0, r0, asr #5
 394:	00000000 	andeq	r0, r0, r0
 398:	000000bc 	strheq	r0, [r0], -ip
 39c:	84200e42 	strthi	r0, [r0], #-3650	@ 0xfffff1be
 3a0:	86078508 	strhi	r8, [r7], -r8, lsl #10
 3a4:	88058706 	stmdahi	r5, {r1, r2, r8, r9, sl, pc}
 3a8:	8a038904 	bhi	e27c0 <_Min_Stack_Size+0xe23c0>
 3ac:	00018e02 	andeq	r8, r1, r2, lsl #28
 3b0:	0000000c 	andeq	r0, r0, ip
 3b4:	000002c0 	andeq	r0, r0, r0, asr #5
 3b8:	00000000 	andeq	r0, r0, r0
 3bc:	0000000e 	andeq	r0, r0, lr
 3c0:	0000000c 	andeq	r0, r0, ip
 3c4:	000002c0 	andeq	r0, r0, r0, asr #5
 3c8:	00000000 	andeq	r0, r0, r0
 3cc:	00000016 	andeq	r0, r0, r6, lsl r0
 3d0:	0000000c 	andeq	r0, r0, ip
 3d4:	000002c0 	andeq	r0, r0, r0, asr #5
 3d8:	00000000 	andeq	r0, r0, r0
 3dc:	00000016 	andeq	r0, r0, r6, lsl r0
 3e0:	0000000c 	andeq	r0, r0, ip
 3e4:	000002c0 	andeq	r0, r0, r0, asr #5
 3e8:	080003c4 	stmdaeq	r0, {r2, r6, r7, r8, r9}
 3ec:	00000002 	andeq	r0, r0, r2
 3f0:	00000014 	andeq	r0, r0, r4, lsl r0
 3f4:	000002c0 	andeq	r0, r0, r0, asr #5
 3f8:	080003c8 	stmdaeq	r0, {r3, r6, r7, r8, r9}
 3fc:	00000084 	andeq	r0, r0, r4, lsl #1
 400:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 404:	00018e02 	andeq	r8, r1, r2, lsl #28
 408:	0000001c 	andeq	r0, r0, ip, lsl r0
 40c:	000002c0 	andeq	r0, r0, r0, asr #5
 410:	0800044c 	stmdaeq	r0, {r2, r3, r6, sl}
 414:	000000a8 	andeq	r0, r0, r8, lsr #1
 418:	84080e41 	strhi	r0, [r8], #-3649	@ 0xfffff1bf
 41c:	41018e02 	tstmi	r1, r2, lsl #28
 420:	4f02100e 	svcmi	0x0002100e
 424:	0000080e 	andeq	r0, r0, lr, lsl #16
 428:	0000000c 	andeq	r0, r0, ip
 42c:	000002c0 	andeq	r0, r0, r0, asr #5
 430:	080004f4 	stmdaeq	r0, {r2, r4, r5, r6, r7, sl}
 434:	00000002 	andeq	r0, r0, r2
 438:	0000000c 	andeq	r0, r0, ip
 43c:	000002c0 	andeq	r0, r0, r0, asr #5
 440:	080004f6 	stmdaeq	r0, {r1, r2, r4, r5, r6, r7, sl}
 444:	00000002 	andeq	r0, r0, r2
 448:	0000000c 	andeq	r0, r0, ip
 44c:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
 450:	7c020001 	stcvc	0, cr0, [r2], {1}
 454:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 458:	00000018 	andeq	r0, r0, r8, lsl r0
 45c:	00000448 	andeq	r0, r0, r8, asr #8
 460:	00000000 	andeq	r0, r0, r0
 464:	000000ec 	andeq	r0, r0, ip, ror #1
 468:	840c0e41 	strhi	r0, [ip], #-3649	@ 0xfffff1bf
 46c:	8e028503 	cfsh32hi	mvfx8, mvfx2, #3
 470:	00000001 	andeq	r0, r0, r1
 474:	0000000c 	andeq	r0, r0, ip
 478:	00000448 	andeq	r0, r0, r8, asr #8
 47c:	00000000 	andeq	r0, r0, r0
 480:	0000005c 	andeq	r0, r0, ip, asr r0
 484:	0000000c 	andeq	r0, r0, ip
 488:	00000448 	andeq	r0, r0, r8, asr #8
 48c:	00000000 	andeq	r0, r0, r0
 490:	0000001a 	andeq	r0, r0, sl, lsl r0
 494:	00000018 	andeq	r0, r0, r8, lsl r0
 498:	00000448 	andeq	r0, r0, r8, asr #8
 49c:	00000000 	andeq	r0, r0, r0
 4a0:	00000034 	andeq	r0, r0, r4, lsr r0
 4a4:	84040e41 	strhi	r0, [r4], #-3649	@ 0xfffff1bf
 4a8:	0ec45401 	cdpeq	4, 12, cr5, cr4, cr1, {0}
 4ac:	00000000 	andeq	r0, r0, r0
 4b0:	00000018 	andeq	r0, r0, r8, lsl r0
 4b4:	00000448 	andeq	r0, r0, r8, asr #8
 4b8:	00000000 	andeq	r0, r0, r0
 4bc:	00000034 	andeq	r0, r0, r4, lsr r0
 4c0:	84040e41 	strhi	r0, [r4], #-3649	@ 0xfffff1bf
 4c4:	0ec45401 	cdpeq	4, 12, cr5, cr4, cr1, {0}
 4c8:	00000000 	andeq	r0, r0, r0
 4cc:	00000014 	andeq	r0, r0, r4, lsl r0
 4d0:	00000448 	andeq	r0, r0, r8, asr #8
 4d4:	080004f8 	stmdaeq	r0, {r3, r4, r5, r6, r7, sl}
 4d8:	00000030 	andeq	r0, r0, r0, lsr r0
 4dc:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 4e0:	00018e02 	andeq	r8, r1, r2, lsl #28
 4e4:	00000014 	andeq	r0, r0, r4, lsl r0
 4e8:	00000448 	andeq	r0, r0, r8, asr #8
 4ec:	08000528 	stmdaeq	r0, {r3, r5, r8, sl}
 4f0:	00000030 	andeq	r0, r0, r0, lsr r0
 4f4:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 4f8:	00018e02 	andeq	r8, r1, r2, lsl #28
 4fc:	00000020 	andeq	r0, r0, r0, lsr #32
 500:	00000448 	andeq	r0, r0, r8, asr #8
 504:	00000000 	andeq	r0, r0, r0
 508:	00000214 	andeq	r0, r0, r4, lsl r2
 50c:	84100e41 	ldrhi	r0, [r0], #-3649	@ 0xfffff1bf
 510:	86038504 	strhi	r8, [r3], -r4, lsl #10
 514:	41018e02 	tstmi	r1, r2, lsl #28
 518:	0a47180e 	beq	11c6558 <_Min_Stack_Size+0x11c6158>
 51c:	0b41100e 	bleq	104455c <_Min_Stack_Size+0x104415c>
 520:	0000000c 	andeq	r0, r0, ip
 524:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
 528:	7c020001 	stcvc	0, cr0, [r2], {1}
 52c:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 530:	00000018 	andeq	r0, r0, r8, lsl r0
 534:	00000520 	andeq	r0, r0, r0, lsr #10
 538:	00000000 	andeq	r0, r0, r0
 53c:	0000011c 	andeq	r0, r0, ip, lsl r1
 540:	83100e41 	tsthi	r0, #1040	@ 0x410
 544:	85038404 	strhi	r8, [r3, #-1028]	@ 0xfffffbfc
 548:	00018e02 	andeq	r8, r1, r2, lsl #28
 54c:	0000000c 	andeq	r0, r0, ip
 550:	00000520 	andeq	r0, r0, r0, lsr #10
 554:	00000000 	andeq	r0, r0, r0
 558:	00000078 	andeq	r0, r0, r8, ror r0
 55c:	0000000c 	andeq	r0, r0, ip
 560:	00000520 	andeq	r0, r0, r0, lsr #10
 564:	00000000 	andeq	r0, r0, r0
 568:	00000010 	andeq	r0, r0, r0, lsl r0
 56c:	0000000c 	andeq	r0, r0, ip
 570:	00000520 	andeq	r0, r0, r0, lsr #10
 574:	00000000 	andeq	r0, r0, r0
 578:	0000000a 	andeq	r0, r0, sl
 57c:	0000000c 	andeq	r0, r0, ip
 580:	00000520 	andeq	r0, r0, r0, lsr #10
 584:	00000000 	andeq	r0, r0, r0
 588:	00000028 	andeq	r0, r0, r8, lsr #32
 58c:	0000001c 	andeq	r0, r0, ip, lsl r0
 590:	00000520 	andeq	r0, r0, r0, lsr #10
 594:	00000000 	andeq	r0, r0, r0
 598:	000000cc 	andeq	r0, r0, ip, asr #1
 59c:	84080e41 	strhi	r0, [r8], #-3649	@ 0xfffff1bf
 5a0:	41018e02 	tstmi	r1, r2, lsl #28
 5a4:	0a4a100e 	beq	12845e4 <_Min_Stack_Size+0x12841e4>
 5a8:	0b41080e 	bleq	10425e8 <_Min_Stack_Size+0x10421e8>
 5ac:	00000014 	andeq	r0, r0, r4, lsl r0
 5b0:	00000520 	andeq	r0, r0, r0, lsr #10
 5b4:	08000558 	stmdaeq	r0, {r3, r4, r6, r8, sl}
 5b8:	00000010 	andeq	r0, r0, r0, lsl r0
 5bc:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 5c0:	00018e02 	andeq	r8, r1, r2, lsl #28
 5c4:	00000014 	andeq	r0, r0, r4, lsl r0
 5c8:	00000520 	andeq	r0, r0, r0, lsr #10
 5cc:	08000568 	stmdaeq	r0, {r3, r5, r6, r8, sl}
 5d0:	00000010 	andeq	r0, r0, r0, lsl r0
 5d4:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 5d8:	00018e02 	andeq	r8, r1, r2, lsl #28
 5dc:	00000014 	andeq	r0, r0, r4, lsl r0
 5e0:	00000520 	andeq	r0, r0, r0, lsr #10
 5e4:	08000578 	stmdaeq	r0, {r3, r4, r5, r6, r8, sl}
 5e8:	00000010 	andeq	r0, r0, r0, lsl r0
 5ec:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 5f0:	00018e02 	andeq	r8, r1, r2, lsl #28
 5f4:	0000000c 	andeq	r0, r0, ip
 5f8:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
 5fc:	7c020001 	stcvc	0, cr0, [r2], {1}
 600:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 604:	0000000c 	andeq	r0, r0, ip
 608:	000005f4 	strdeq	r0, [r0], -r4
 60c:	08000588 	stmdaeq	r0, {r3, r7, r8, sl}
 610:	00000002 	andeq	r0, r0, r2
 614:	0000000c 	andeq	r0, r0, ip
 618:	000005f4 	strdeq	r0, [r0], -r4
 61c:	0800058a 	stmdaeq	r0, {r1, r3, r7, r8, sl}
 620:	00000002 	andeq	r0, r0, r2
 624:	0000000c 	andeq	r0, r0, ip
 628:	000005f4 	strdeq	r0, [r0], -r4
 62c:	0800058c 	stmdaeq	r0, {r2, r3, r7, r8, sl}
 630:	00000002 	andeq	r0, r0, r2
 634:	00000014 	andeq	r0, r0, r4, lsl r0
 638:	000005f4 	strdeq	r0, [r0], -r4
 63c:	08000590 	stmdaeq	r0, {r4, r7, r8, sl}
 640:	00000094 	muleq	r0, r4, r0
 644:	83080e41 	movwhi	r0, #36417	@ 0x8e41
 648:	00018e02 	andeq	r8, r1, r2, lsl #28
 64c:	0000000c 	andeq	r0, r0, ip
 650:	ffffffff 			@ <UNDEFINED> instruction: 0xffffffff
 654:	7c020001 	stcvc	0, cr0, [r2], {1}
 658:	000d0c0e 	andeq	r0, sp, lr, lsl #24
 65c:	00000018 	andeq	r0, r0, r8, lsl r0
 660:	0000064c 	andeq	r0, r0, ip, asr #12
 664:	08000678 	stmdaeq	r0, {r3, r4, r5, r6, r9, sl}
 668:	00000048 	andeq	r0, r0, r8, asr #32
 66c:	84100e41 	ldrhi	r0, [r0], #-3649	@ 0xfffff1bf
 670:	86038504 	strhi	r8, [r3], -r4, lsl #10
 674:	00018e02 	andeq	r8, r1, r2, lsl #28

Disassembly of section .debug_loc:

