NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
00000000 <.debug_loc>:
	...
      18:	00500001 	subseq	r0, r0, r1
      1c:	00000000 	andeq	r0, r0, r0
      20:	04000000 	streq	r0, [r0], #-0
      24:	5001f300 	andpl	pc, r1, r0, lsl #6
      28:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
      2c:	00000000 	andeq	r0, r0, r0
      30:	50000100 	andpl	r0, r0, r0, lsl #2
	...
      3c:	01f30004 	mvnseq	r0, r4
      40:	00009f50 	andeq	r9, r0, r0, asr pc
      44:	00000000 	andeq	r0, r0, r0
      48:	00010000 	andeq	r0, r1, r0
      4c:	00000050 	andeq	r0, r0, r0, asr r0
      50:	00000000 	andeq	r0, r0, r0
      54:	f3000400 	vshl.u8	d0, d0, d0
      58:	009f5001 	addseq	r5, pc, r1
      5c:	00000000 	andeq	r0, r0, r0
      60:	01000000 	mrseq	r0, (UNDEF: 0)
      64:	00005000 	andeq	r5, r0, r0
      68:	00000000 	andeq	r0, r0, r0
      6c:	00040000 	andeq	r0, r4, r0
      70:	9f5001f3 	svcls	0x005001f3
	...
      94:	00500001 	subseq	r0, r0, r1
      98:	00000000 	andeq	r0, r0, r0
      9c:	04000000 	streq	r0, [r0], #-0
      a0:	5001f300 	andpl	pc, r1, r0, lsl #6
      a4:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
      a8:	00000000 	andeq	r0, r0, r0
      ac:	50000100 	andpl	r0, r0, r0, lsl #2
	...
      b8:	01f30004 	mvnseq	r0, r4
      bc:	00009f50 	andeq	r9, r0, r0, asr pc
      c0:	00000000 	andeq	r0, r0, r0
      c4:	00010000 	andeq	r0, r1, r0
      c8:	00000050 	andeq	r0, r0, r0, asr r0
      cc:	00000000 	andeq	r0, r0, r0
      d0:	f3000400 	vshl.u8	d0, d0, d0
      d4:	009f5001 	addseq	r5, pc, r1
      d8:	00000000 	andeq	r0, r0, r0
      dc:	01000000 	mrseq	r0, (UNDEF: 0)
      e0:	00005000 	andeq	r5, r0, r0
      e4:	00000000 	andeq	r0, r0, r0
      e8:	00040000 	andeq	r0, r4, r0
      ec:	9f5001f3 	svcls	0x005001f3
	...
     104:	00010000 	andeq	r0, r1, r0
     108:	00000051 	andeq	r0, r0, r1, asr r0
     10c:	00000000 	andeq	r0, r0, r0
     110:	f3000400 	vshl.u8	d0, d0, d0
     114:	009f5101 	addseq	r5, pc, r1, lsl #2
     118:	00000000 	andeq	r0, r0, r0
     11c:	01000000 	mrseq	r0, (UNDEF: 0)
     120:	00005100 	andeq	r5, r0, r0, lsl #2
	...
     140:	00010000 	andeq	r0, r1, r0
     144:	00000050 	andeq	r0, r0, r0, asr r0
     148:	00000000 	andeq	r0, r0, r0
     14c:	f3000400 	vshl.u8	d0, d0, d0
     150:	009f5001 	addseq	r5, pc, r1
     154:	00000000 	andeq	r0, r0, r0
     158:	01000000 	mrseq	r0, (UNDEF: 0)
     15c:	00005000 	andeq	r5, r0, r0
     160:	00000000 	andeq	r0, r0, r0
     164:	00040000 	andeq	r0, r4, r0
     168:	9f5001f3 	svcls	0x005001f3
	...
     174:	00500001 	subseq	r0, r0, r1
     178:	00000000 	andeq	r0, r0, r0
     17c:	04000000 	streq	r0, [r0], #-0
     180:	5001f300 	andpl	pc, r1, r0, lsl #6
     184:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     188:	00000000 	andeq	r0, r0, r0
     18c:	50000100 	andpl	r0, r0, r0, lsl #2
	...
     198:	01f30004 	mvnseq	r0, r4
     19c:	00009f50 	andeq	r9, r0, r0, asr pc
	...
     1b4:	00510001 	subseq	r0, r1, r1
     1b8:	00000000 	andeq	r0, r0, r0
     1bc:	04000000 	streq	r0, [r0], #-0
     1c0:	5101f300 	mrspl	pc, SP_irq	@ <UNPREDICTABLE>
     1c4:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     1c8:	00000000 	andeq	r0, r0, r0
     1cc:	51000100 	mrspl	r0, (UNDEF: 16)
	...
     1e0:	08000188 	stmdaeq	r0, {r3, r7, r8}
     1e4:	08000198 	stmdaeq	r0, {r3, r4, r7, r8}
     1e8:	98500001 	ldmdals	r0, {r0}^
     1ec:	9a080001 	bls	2001f8 <_Min_Stack_Size+0x1ffdf8>
     1f0:	04080001 	streq	r0, [r8], #-1
     1f4:	5001f300 	andpl	pc, r1, r0, lsl #6
     1f8:	00019a9f 	muleq	r1, pc, sl	@ <UNPREDICTABLE>
     1fc:	00019c08 	andeq	r9, r1, r8, lsl #24
     200:	50000108 	andpl	r0, r0, r8, lsl #2
     204:	0800019c 	stmdaeq	r0, {r2, r3, r4, r7, r8}
     208:	0800019e 	stmdaeq	r0, {r1, r2, r3, r4, r7, r8}
     20c:	01f30004 	mvnseq	r0, r4
     210:	00009f50 	andeq	r9, r0, r0, asr pc
     214:	00000000 	andeq	r0, r0, r0
     218:	020c0000 	andeq	r0, ip, #0
     21c:	02220800 	eoreq	r0, r2, #0, 16
     220:	00020800 	andeq	r0, r2, r0, lsl #16
     224:	0222007d 	eoreq	r0, r2, #125	@ 0x7d
     228:	023c0800 	eorseq	r0, ip, #0, 16
     22c:	00020800 	andeq	r0, r2, r0, lsl #16
     230:	023c087d 	eorseq	r0, ip, #8192000	@ 0x7d0000
     234:	02480800 	subeq	r0, r8, #0, 16
     238:	00020800 	andeq	r0, r2, r0, lsl #16
     23c:	0000007d 	andeq	r0, r0, sp, ror r0
	...
     24c:	020c0000 	andeq	r0, ip, #0
     250:	02330800 	eorseq	r0, r3, #0, 16
     254:	00010800 	andeq	r0, r1, r0, lsl #16
     258:	00023350 	andeq	r3, r2, r0, asr r3
     25c:	00023c08 	andeq	r3, r2, r8, lsl #24
     260:	54000108 	strpl	r0, [r0], #-264	@ 0xfffffef8
     264:	0800023c 	stmdaeq	r0, {r2, r3, r4, r5, r9}
     268:	0800023e 	stmdaeq	r0, {r1, r2, r3, r4, r5, r9}
     26c:	3e500001 	cdpcc	0, 5, cr0, cr0, cr1, {0}
     270:	48080002 	stmdami	r8, {r1}
     274:	04080002 	streq	r0, [r8], #-2
     278:	5001f300 	andpl	pc, r1, r0, lsl #6
     27c:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     280:	00000000 	andeq	r0, r0, r0
     284:	00010200 	andeq	r0, r1, r0, lsl #4
     288:	00020c00 	andeq	r0, r2, r0, lsl #24
     28c:	00023a08 	andeq	r3, r2, r8, lsl #20
     290:	30000208 	andcc	r0, r0, r8, lsl #4
     294:	00023c9f 	muleq	r2, pc, ip	@ <UNPREDICTABLE>
     298:	00023e08 	andeq	r3, r2, r8, lsl #28
     29c:	30000208 	andcc	r0, r0, r8, lsl #4
     2a0:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     2a4:	00000000 	andeq	r0, r0, r0
     2a8:	0001cc00 	andeq	ip, r1, r0, lsl #24
     2ac:	0001ce08 	andeq	ip, r1, r8, lsl #28
     2b0:	7d000208 	sfmvc	f0, 4, [r0, #-32]	@ 0xffffffe0
     2b4:	0001ce00 	andeq	ip, r1, r0, lsl #28
     2b8:	00020a08 	andeq	r0, r2, r8, lsl #20
     2bc:	7d000208 	sfmvc	f0, 4, [r0, #-32]	@ 0xffffffe0
     2c0:	00020a04 	andeq	r0, r2, r4, lsl #20
     2c4:	00020c08 	andeq	r0, r2, r8, lsl #24
     2c8:	7d000208 	sfmvc	f0, 4, [r0, #-32]	@ 0xffffffe0
	...
     2d4:	00000200 	andeq	r0, r0, r0, lsl #4
     2d8:	00000101 	andeq	r0, r0, r1, lsl #2
     2dc:	0001f600 	andeq	pc, r1, r0, lsl #12
     2e0:	0001fa08 	andeq	pc, r1, r8, lsl #20
     2e4:	30000208 	andcc	r0, r0, r8, lsl #4
     2e8:	0001fa9f 	muleq	r1, pc, sl	@ <UNPREDICTABLE>
     2ec:	00020408 	andeq	r0, r2, r8, lsl #8
     2f0:	3d000508 	cfstr32cc	mvfx0, [r0, #-32]	@ 0xffffffe0
     2f4:	9f1c0073 	svcls	0x001c0073
     2f8:	08000204 	stmdaeq	r0, {r2, r9}
     2fc:	08000206 	stmdaeq	r0, {r1, r2, r9}
     300:	733e0005 	teqvc	lr, #5
     304:	069f1c00 	ldreq	r1, [pc], r0, lsl #24
     308:	0c080002 	stceq	0, cr0, [r8], {2}
     30c:	05080002 	streq	r0, [r8, #-2]
     310:	00733d00 	rsbseq	r3, r3, r0, lsl #26
     314:	00009f1c 	andeq	r9, r0, ip, lsl pc
     318:	00000000 	andeq	r0, r0, r0
     31c:	02480000 	subeq	r0, r8, #0
     320:	024a0800 	subeq	r0, sl, #0, 16
     324:	00020800 	andeq	r0, r2, r0, lsl #16
     328:	024a007d 	subeq	r0, sl, #125	@ 0x7d
     32c:	02a80800 	adceq	r0, r8, #0, 16
     330:	00020800 	andeq	r0, r2, r0, lsl #16
     334:	0000107d 	andeq	r1, r0, sp, ror r0
     338:	00000000 	andeq	r0, r0, r0
     33c:	00010000 	andeq	r0, r1, r0
     340:	00000000 	andeq	r0, r0, r0
     344:	0800024a 	stmdaeq	r0, {r1, r3, r6, r9}
     348:	08000262 	stmdaeq	r0, {r1, r5, r6, r9}
     34c:	9f300002 	svcls	0x00300002
     350:	08000262 	stmdaeq	r0, {r1, r5, r6, r9}
     354:	08000286 	stmdaeq	r0, {r1, r2, r7, r9}
     358:	00740007 	rsbseq	r0, r4, r7
     35c:	2e302448 	cdpcs	4, 3, cr2, cr0, cr8, {2}
     360:	0002869f 	muleq	r2, pc, r6	@ <UNPREDICTABLE>
     364:	00028c08 	andeq	r8, r2, r8, lsl #24
     368:	74000a08 	strvc	r0, [r0], #-2568	@ 0xfffff5f8
     36c:	30244800 	eorcc	r4, r4, r0, lsl #16
     370:	2200702e 	andcs	r7, r0, #46	@ 0x2e
     374:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     378:	00000000 	andeq	r0, r0, r0
     37c:	a2000300 	andge	r0, r0, #0, 6
     380:	a4080001 	strge	r0, [r8], #-1
     384:	05080001 	streq	r0, [r8, #-1]
     388:	06187000 	ldreq	r7, [r8], -r0
     38c:	00001c32 	andeq	r1, r0, r2, lsr ip
	...
     39c:	00020000 	andeq	r0, r2, r0
     3a0:	0000007d 	andeq	r0, r0, sp, ror r0
     3a4:	00000000 	andeq	r0, r0, r0
     3a8:	00020000 	andeq	r0, r2, r0
     3ac:	0000087d 	andeq	r0, r0, sp, ror r8
     3b0:	00000000 	andeq	r0, r0, r0
     3b4:	03340000 	teqeq	r4, #0
     3b8:	03360800 	teqeq	r6, #0, 16
     3bc:	00020800 	andeq	r0, r2, r0, lsl #16
     3c0:	0336007d 	teqeq	r6, #125	@ 0x7d
     3c4:	03c40800 	biceq	r0, r4, #0, 16
     3c8:	00020800 	andeq	r0, r2, r0, lsl #16
     3cc:	0000087d 	andeq	r0, r0, sp, ror r8
     3d0:	00000000 	andeq	r0, r0, r0
     3d4:	03180000 	tsteq	r8, #0
     3d8:	031a0800 	tsteq	sl, #0, 16
     3dc:	00020800 	andeq	r0, r2, r0, lsl #16
     3e0:	031a007d 	tsteq	sl, #125	@ 0x7d
     3e4:	03340800 	teqeq	r4, #0, 16
     3e8:	00020800 	andeq	r0, r2, r0, lsl #16
     3ec:	0000087d 	andeq	r0, r0, sp, ror r8
     3f0:	00000000 	andeq	r0, r0, r0
     3f4:	02fc0000 	rscseq	r0, ip, #0
     3f8:	02fe0800 	rscseq	r0, lr, #0, 16
     3fc:	00020800 	andeq	r0, r2, r0, lsl #16
     400:	02fe007d 	rscseq	r0, lr, #125	@ 0x7d
     404:	03180800 	tsteq	r8, #0, 16
     408:	00020800 	andeq	r0, r2, r0, lsl #16
     40c:	0000087d 	andeq	r0, r0, sp, ror r8
     410:	00000000 	andeq	r0, r0, r0
     414:	02e00000 	rsceq	r0, r0, #0
     418:	02e20800 	rsceq	r0, r2, #0, 16
     41c:	00020800 	andeq	r0, r2, r0, lsl #16
     420:	02e2007d 	rsceq	r0, r2, #125	@ 0x7d
     424:	02fc0800 	rscseq	r0, ip, #0, 16
     428:	00020800 	andeq	r0, r2, r0, lsl #16
     42c:	0000087d 	andeq	r0, r0, sp, ror r8
     430:	00000000 	andeq	r0, r0, r0
     434:	02c40000 	sbceq	r0, r4, #0
     438:	02c60800 	sbceq	r0, r6, #0, 16
     43c:	00020800 	andeq	r0, r2, r0, lsl #16
     440:	02c6007d 	sbceq	r0, r6, #125	@ 0x7d
     444:	02e00800 	rsceq	r0, r0, #0, 16
     448:	00020800 	andeq	r0, r2, r0, lsl #16
     44c:	0000087d 	andeq	r0, r0, sp, ror r8
     450:	00000000 	andeq	r0, r0, r0
     454:	02a80000 	adceq	r0, r8, #0
     458:	02aa0800 	adceq	r0, sl, #0, 16
     45c:	00020800 	andeq	r0, r2, r0, lsl #16
     460:	02aa007d 	adceq	r0, sl, #125	@ 0x7d
     464:	02c40800 	sbceq	r0, r4, #0, 16
     468:	00020800 	andeq	r0, r2, r0, lsl #16
     46c:	0000087d 	andeq	r0, r0, sp, ror r8
	...
     47c:	00020000 	andeq	r0, r2, r0
     480:	0000007d 	andeq	r0, r0, sp, ror r0
     484:	00000000 	andeq	r0, r0, r0
     488:	00020000 	andeq	r0, r2, r0
     48c:	00000c7d 	andeq	r0, r0, sp, ror ip
     490:	00000000 	andeq	r0, r0, r0
     494:	00020000 	andeq	r0, r2, r0
     498:	0000187d 	andeq	r1, r0, sp, ror r8
     49c:	00000000 	andeq	r0, r0, r0
     4a0:	00020000 	andeq	r0, r2, r0
     4a4:	00000c7d 	andeq	r0, r0, sp, ror ip
     4a8:	00000000 	andeq	r0, r0, r0
     4ac:	00020000 	andeq	r0, r2, r0
     4b0:	0000187d 	andeq	r1, r0, sp, ror r8
	...
     4c4:	00010000 	andeq	r0, r1, r0
     4c8:	00000050 	andeq	r0, r0, r0, asr r0
     4cc:	00000000 	andeq	r0, r0, r0
     4d0:	54000100 	strpl	r0, [r0], #-256	@ 0xffffff00
	...
     4e8:	00710005 	rsbseq	r0, r1, r5
     4ec:	009f2532 	addseq	r2, pc, r2, lsr r5	@ <UNPREDICTABLE>
     4f0:	00000000 	andeq	r0, r0, r0
     4f4:	07000000 	streq	r0, [r0, -r0]
     4f8:	94007400 	strls	r7, [r0], #-1024	@ 0xfffffc00
     4fc:	9f253202 	svcls	0x00253202
	...
     508:	00000001 	andeq	r0, r0, r1
	...
     514:	00710005 	rsbseq	r0, r1, r5
     518:	009f1a33 	addseq	r1, pc, r3, lsr sl	@ <UNPREDICTABLE>
     51c:	00000000 	andeq	r0, r0, r0
     520:	07000000 	streq	r0, [r0, -r0]
     524:	94007400 	strls	r7, [r0], #-1024	@ 0xfffffc00
     528:	9f1a3301 	svcls	0x001a3301
	...
     53c:	007d0002 	rsbseq	r0, sp, r2
	...
     548:	087d0002 	ldmdaeq	sp!, {r1}^
	...
     560:	00500001 	subseq	r0, r0, r1
     564:	00000000 	andeq	r0, r0, r0
     568:	04000000 	streq	r0, [r0], #-0
     56c:	5001f300 	andpl	pc, r1, r0, lsl #6
     570:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
	...
     580:	7d000200 	sfmvc	f0, 4, [r0, #-0]
	...
     58c:	7d000200 	sfmvc	f0, 4, [r0, #-0]
     590:	00000008 	andeq	r0, r0, r8
	...
     5a4:	50000100 	andpl	r0, r0, r0, lsl #2
	...
     5b0:	01f30004 	mvnseq	r0, r4
     5b4:	00009f50 	andeq	r9, r0, r0, asr pc
     5b8:	00000000 	andeq	r0, r0, r0
     5bc:	03c80000 	biceq	r0, r8, #0
     5c0:	03ca0800 	biceq	r0, sl, #0, 16
     5c4:	00020800 	andeq	r0, r2, r0, lsl #16
     5c8:	03ca007d 	biceq	r0, sl, #125	@ 0x7d
     5cc:	044c0800 	strbeq	r0, [ip], #-2048	@ 0xfffff800
     5d0:	00020800 	andeq	r0, r2, r0, lsl #16
     5d4:	0000087d 	andeq	r0, r0, sp, ror r8
     5d8:	00000000 	andeq	r0, r0, r0
     5dc:	02000000 	andeq	r0, r0, #0
     5e0:	00000002 	andeq	r0, r0, r2
	...
     5f0:	03c80000 	biceq	r0, r8, #0
     5f4:	03e20800 	mvneq	r0, #0, 16
     5f8:	00010800 	andeq	r0, r1, r0, lsl #16
     5fc:	0003e250 	andeq	lr, r3, r0, asr r2
     600:	0003e408 	andeq	lr, r3, r8, lsl #8
     604:	f3000408 	vshl.u8	d0, d8, d0
     608:	e49f5001 	ldr	r5, [pc], #1	@ 610 <_Min_Stack_Size+0x210>
     60c:	fa080003 	blx	200620 <_Min_Stack_Size+0x200220>
     610:	01080003 	tsteq	r8, r3
     614:	03fa5000 	mvnseq	r5, #0
     618:	03fe0800 	mvnseq	r0, #0, 16
     61c:	00040800 	andeq	r0, r4, r0, lsl #16
     620:	9f5001f3 	svcls	0x005001f3
     624:	080003fe 	stmdaeq	r0, {r1, r2, r3, r4, r5, r6, r7, r8, r9}
     628:	0800040c 	stmdaeq	r0, {r2, r3, sl}
     62c:	0c500001 	mrrceq	0, 0, r0, r0, cr1	@ <UNPREDICTABLE>
     630:	10080004 	andne	r0, r8, r4
     634:	04080004 	streq	r0, [r8], #-4
     638:	5001f300 	andpl	pc, r1, r0, lsl #6
     63c:	0004109f 	muleq	r4, pc, r0	@ <UNPREDICTABLE>
     640:	00042608 	andeq	r2, r4, r8, lsl #12
     644:	50000108 	andpl	r0, r0, r8, lsl #2
     648:	08000426 	stmdaeq	r0, {r1, r2, r5, sl}
     64c:	0800042a 	stmdaeq	r0, {r1, r3, r5, sl}
     650:	01f30004 	mvnseq	r0, r4
     654:	042a9f50 	strteq	r9, [sl], #-3920	@ 0xfffff0b0
     658:	04400800 	strbeq	r0, [r0], #-2048	@ 0xfffff800
     65c:	00010800 	andeq	r0, r1, r0, lsl #16
     660:	00044050 	andeq	r4, r4, r0, asr r0
     664:	00044c08 	andeq	r4, r4, r8, lsl #24
     668:	f3000408 	vshl.u8	d0, d8, d0
     66c:	009f5001 	addseq	r5, pc, r1
	...
     678:	00000202 	andeq	r0, r0, r2, lsl #4
	...
     688:	c8000000 	stmdagt	r0, {}	@ <UNPREDICTABLE>
     68c:	e2080003 	and	r0, r8, #3
     690:	01080003 	tsteq	r8, r3
     694:	03e25100 	mvneq	r5, #0, 2
     698:	03e40800 	mvneq	r0, #0, 16
     69c:	00040800 	andeq	r0, r4, r0, lsl #16
     6a0:	9f5101f3 	svcls	0x005101f3
     6a4:	080003e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, r9}
     6a8:	080003fb 	stmdaeq	r0, {r0, r1, r3, r4, r5, r6, r7, r8, r9}
     6ac:	fb510001 	blx	14406ba <_Min_Stack_Size+0x14402ba>
     6b0:	fe080003 	cdp2	0, 0, cr0, cr8, cr3, {0}
     6b4:	04080003 	streq	r0, [r8], #-3
     6b8:	5101f300 	mrspl	pc, SP_irq	@ <UNPREDICTABLE>
     6bc:	0003fe9f 	muleq	r3, pc, lr	@ <UNPREDICTABLE>
     6c0:	00040d08 	andeq	r0, r4, r8, lsl #26
     6c4:	51000108 	tstpl	r0, r8, lsl #2
     6c8:	0800040d 	stmdaeq	r0, {r0, r2, r3, sl}
     6cc:	08000410 	stmdaeq	r0, {r4, sl}
     6d0:	01f30004 	mvnseq	r0, r4
     6d4:	04109f51 	ldreq	r9, [r0], #-3921	@ 0xfffff0af
     6d8:	04270800 	strteq	r0, [r7], #-2048	@ 0xfffff800
     6dc:	00010800 	andeq	r0, r1, r0, lsl #16
     6e0:	00042751 	andeq	r2, r4, r1, asr r7
     6e4:	00042a08 	andeq	r2, r4, r8, lsl #20
     6e8:	f3000408 	vshl.u8	d0, d8, d0
     6ec:	2a9f5101 	bcs	fe7d4af8 <_estack+0xde7d22f8>
     6f0:	41080004 	tstmi	r8, r4
     6f4:	01080004 	tsteq	r8, r4
     6f8:	04415100 	strbeq	r5, [r1], #-256	@ 0xffffff00
     6fc:	044c0800 	strbeq	r0, [ip], #-2048	@ 0xfffff800
     700:	00040800 	andeq	r0, r4, r0, lsl #16
     704:	9f5101f3 	svcls	0x005101f3
	...
     710:	02000000 	andeq	r0, r0, #0
     714:	00000002 	andeq	r0, r0, r2
	...
     72c:	03d20000 	bicseq	r0, r2, #0
     730:	03e20800 	mvneq	r0, #0, 16
     734:	00010800 	andeq	r0, r1, r0, lsl #16
     738:	0003e253 	andeq	lr, r3, r3, asr r2
     73c:	0003e208 	andeq	lr, r3, r8, lsl #4
     740:	31001508 	tstcc	r0, r8, lsl #10
     744:	fed88070 	mrc2	0, 6, r8, cr8, cr0, {3}
     748:	00707bff 	ldrshteq	r7, [r0], #-191	@ 0xffffff41
     74c:	0054000c 	subseq	r0, r4, ip
     750:	01282e40 			@ <UNDEFINED> instruction: 0x01282e40
     754:	9f131600 	svcls	0x00131600
     758:	080003e2 	stmdaeq	r0, {r1, r5, r6, r7, r8, r9}
     75c:	080003e4 	stmdaeq	r0, {r2, r5, r6, r7, r8, r9}
     760:	f3310019 	vqadd.u64	d0, d1, d9
     764:	000c5001 	andeq	r5, ip, r1
     768:	1c400054 	mcrrne	0, 5, r0, r0, cr4
     76c:	0c5001f3 	ldfeqe	f0, [r0], {243}	@ 0xf3
     770:	40005400 	andmi	r5, r0, r0, lsl #8
     774:	0001282e 	andeq	r2, r1, lr, lsr #16
     778:	e49f1316 	ldr	r1, [pc], #790	@ 780 <_Min_Stack_Size+0x380>
     77c:	f0080003 			@ <UNDEFINED> instruction: 0xf0080003
     780:	01080003 	tsteq	r8, r3
     784:	03f05300 	mvnseq	r5, #0, 6
     788:	03fa0800 	mvnseq	r0, #0, 16
     78c:	00150800 	andseq	r0, r5, r0, lsl #16
     790:	d8807031 	stmle	r0, {r0, r4, r5, ip, sp, lr}
     794:	707bfffe 	ldrshtvc	pc, [fp], #-254	@ 0xffffff02	@ <UNPREDICTABLE>
     798:	54000c00 	strpl	r0, [r0], #-3072	@ 0xfffff400
     79c:	282e4000 	stmdacs	lr!, {lr}
     7a0:	13160001 	tstne	r6, #1
     7a4:	0003fa9f 	muleq	r3, pc, sl	@ <UNPREDICTABLE>
     7a8:	0003fe08 	andeq	pc, r3, r8, lsl #28
     7ac:	31001908 	tstcc	r0, r8, lsl #18
     7b0:	0c5001f3 	ldfeqe	f0, [r0], {243}	@ 0xf3
     7b4:	40005400 	andmi	r5, r0, r0, lsl #8
     7b8:	5001f31c 	andpl	pc, r1, ip, lsl r3	@ <UNPREDICTABLE>
     7bc:	0054000c 	subseq	r0, r4, ip
     7c0:	01282e40 			@ <UNDEFINED> instruction: 0x01282e40
     7c4:	9f131600 	svcls	0x00131600
     7c8:	080003fe 	stmdaeq	r0, {r1, r2, r3, r4, r5, r6, r7, r8, r9}
     7cc:	08000402 	stmdaeq	r0, {r1, sl}
     7d0:	02530001 	subseq	r0, r3, #1
     7d4:	0c080004 	stceq	0, cr0, [r8], {4}
     7d8:	15080004 	strne	r0, [r8, #-4]
     7dc:	80703100 	rsbshi	r3, r0, r0, lsl #2
     7e0:	7bfffed8 	blvc	348 <_Min_Heap_Size+0x148>
     7e4:	000c0070 	andeq	r0, ip, r0, ror r0
     7e8:	2e400054 	mcrcs	0, 2, r0, cr0, cr4, {2}
     7ec:	16000128 	strne	r0, [r0], -r8, lsr #2
     7f0:	040c9f13 	streq	r9, [ip], #-3859	@ 0xfffff0ed
     7f4:	04100800 	ldreq	r0, [r0], #-2048	@ 0xfffff800
     7f8:	00190800 	andseq	r0, r9, r0, lsl #16
     7fc:	5001f331 	andpl	pc, r1, r1, lsr r3	@ <UNPREDICTABLE>
     800:	0054000c 	subseq	r0, r4, ip
     804:	01f31c40 	mvnseq	r1, r0, asr #24
     808:	54000c50 	strpl	r0, [r0], #-3152	@ 0xfffff3b0
     80c:	282e4000 	stmdacs	lr!, {lr}
     810:	13160001 	tstne	r6, #1
     814:	0004109f 	muleq	r4, pc, r0	@ <UNPREDICTABLE>
     818:	00041c08 	andeq	r1, r4, r8, lsl #24
     81c:	53000108 	movwpl	r0, #264	@ 0x108
     820:	0800041c 	stmdaeq	r0, {r2, r3, r4, sl}
     824:	08000426 	stmdaeq	r0, {r1, r2, r5, sl}
     828:	70310015 	eorsvc	r0, r1, r5, lsl r0
     82c:	fffed880 			@ <UNDEFINED> instruction: 0xfffed880
     830:	0c00707b 	stceq	0, cr7, [r0], {123}	@ 0x7b
     834:	40005400 	andmi	r5, r0, r0, lsl #8
     838:	0001282e 	andeq	r2, r1, lr, lsr #16
     83c:	269f1316 			@ <UNDEFINED> instruction: 0x269f1316
     840:	2a080004 	bcs	200858 <_Min_Stack_Size+0x200458>
     844:	19080004 	stmdbne	r8, {r2}
     848:	01f33100 	mvnseq	r3, r0, lsl #2
     84c:	54000c50 	strpl	r0, [r0], #-3152	@ 0xfffff3b0
     850:	f31c4000 	vhadd.u16	d4, d12, d0
     854:	000c5001 	andeq	r5, ip, r1
     858:	2e400054 	mcrcs	0, 2, r0, cr0, cr4, {2}
     85c:	16000128 	strne	r0, [r0], -r8, lsr #2
     860:	042a9f13 	strteq	r9, [sl], #-3859	@ 0xfffff0ed
     864:	04360800 	ldrteq	r0, [r6], #-2048	@ 0xfffff800
     868:	00010800 	andeq	r0, r1, r0, lsl #16
     86c:	00043653 	andeq	r3, r4, r3, asr r6
     870:	00044008 	andeq	r4, r4, r8
     874:	31001508 	tstcc	r0, r8, lsl #10
     878:	fed88070 	mrc2	0, 6, r8, cr8, cr0, {3}
     87c:	00707bff 	ldrshteq	r7, [r0], #-191	@ 0xffffff41
     880:	0054000c 	subseq	r0, r4, ip
     884:	01282e40 			@ <UNDEFINED> instruction: 0x01282e40
     888:	9f131600 	svcls	0x00131600
     88c:	08000440 	stmdaeq	r0, {r6, sl}
     890:	0800044c 	stmdaeq	r0, {r2, r3, r6, sl}
     894:	f3310019 	vqadd.u64	d0, d1, d9
     898:	000c5001 	andeq	r5, ip, r1
     89c:	1c400054 	mcrrne	0, 5, r0, r0, cr4
     8a0:	0c5001f3 	ldfeqe	f0, [r0], {243}	@ 0xf3
     8a4:	40005400 	andmi	r5, r0, r0, lsl #8
     8a8:	0001282e 	andeq	r2, r1, lr, lsr #16
     8ac:	009f1316 	addseq	r1, pc, r6, lsl r3	@ <UNPREDICTABLE>
     8b0:	00000000 	andeq	r0, r0, r0
     8b4:	4c000000 	stcmi	0, cr0, [r0], {-0}
     8b8:	4e080004 	cdpmi	0, 0, cr0, cr8, cr4, {0}
     8bc:	02080004 	andeq	r0, r8, #4
     8c0:	4e007d00 	cdpmi	13, 0, cr7, cr0, cr0, {0}
     8c4:	50080004 	andpl	r0, r8, r4
     8c8:	02080004 	andeq	r0, r8, #4
     8cc:	50087d00 	andpl	r7, r8, r0, lsl #26
     8d0:	ee080004 	cdp	0, 0, cr0, cr8, cr4, {0}
     8d4:	02080004 	andeq	r0, r8, #4
     8d8:	ee107d00 	cdp	13, 1, cr7, cr0, cr0, {0}
     8dc:	f4080004 	vst4.8	{d0-d3}, [r8], r4
     8e0:	02080004 	andeq	r0, r8, #4
     8e4:	00087d00 	andeq	r7, r8, r0, lsl #26
	...
     8f4:	00045800 	andeq	r5, r4, r0, lsl #16
     8f8:	00046808 	andeq	r6, r4, r8, lsl #16
     8fc:	72000708 	andvc	r0, r0, #8, 14	@ 0x200000
     900:	02000a00 	andeq	r0, r0, #0, 20
     904:	04829f1a 	streq	r9, [r2], #3866	@ 0xf1a
     908:	048d0800 	streq	r0, [sp], #2048	@ 0x800
     90c:	00070800 	andeq	r0, r7, r0, lsl #16
     910:	000a0072 	andeq	r0, sl, r2, ror r0
     914:	e49f1a02 	ldr	r1, [pc], #2562	@ 91c <_Min_Stack_Size+0x51c>
     918:	e8080004 	stmda	r8, {r2}
     91c:	07080004 	streq	r0, [r8, -r4]
     920:	0a007200 	beq	1d128 <_Min_Stack_Size+0x1cd28>
     924:	9f1a0200 	svcls	0x001a0200
	...
     930:	045a0000 	ldrbeq	r0, [sl], #-0
     934:	04f00800 	ldrbteq	r0, [r0], #2048	@ 0x800
     938:	00070800 	andeq	r0, r7, r0, lsl #16
     93c:	000a0074 	andeq	r0, sl, r4, ror r0
     940:	009f1a04 	addseq	r1, pc, r4, lsl #20
	...
     958:	5c000000 	stcpl	0, cr0, [r0], {-0}
     95c:	68080004 	stmdavs	r8, {r2}
     960:	05080004 	streq	r0, [r8, #-4]
     964:	40007300 	andmi	r7, r0, r0, lsl #6
     968:	046c9f1a 	strbteq	r9, [ip], #-3866	@ 0xfffff0e6
     96c:	04720800 	ldrbteq	r0, [r2], #-2048	@ 0xfffff800
     970:	00050800 	andeq	r0, r5, r0, lsl #16
     974:	1a320073 	bne	c80b48 <_Min_Stack_Size+0xc80748>
     978:	0004769f 	muleq	r4, pc, r6	@ <UNPREDICTABLE>
     97c:	00047e08 	andeq	r7, r4, r8, lsl #28
     980:	73000608 	movwvc	r0, #1544	@ 0x608
     984:	1a800800 	bne	fe00298c <_estack+0xde00018c>
     988:	0004829f 	muleq	r4, pc, r2	@ <UNPREDICTABLE>
     98c:	00048608 	andeq	r8, r4, r8, lsl #12
     990:	73000508 	movwvc	r0, #1288	@ 0x508
     994:	9f1a4000 	svcls	0x001a4000
     998:	08000490 	stmdaeq	r0, {r4, r7, sl}
     99c:	08000492 	stmdaeq	r0, {r1, r4, r7, sl}
     9a0:	00730005 	rsbseq	r0, r3, r5
     9a4:	ac9f1a32 	vldmiage	pc, {s2-s51}
     9a8:	b4080004 	strlt	r0, [r8], #-4
     9ac:	06080004 	streq	r0, [r8], -r4
     9b0:	08007300 	stmdaeq	r0, {r8, r9, ip, sp, lr}
     9b4:	c09f1a80 	addsgt	r1, pc, r0, lsl #21
     9b8:	c8080004 	stmdagt	r8, {r2}
     9bc:	06080004 	streq	r0, [r8], -r4
     9c0:	08007300 	stmdaeq	r0, {r8, r9, ip, sp, lr}
     9c4:	e49f1a40 	ldr	r1, [pc], #2624	@ 9cc <_Min_Stack_Size+0x5cc>
     9c8:	e6080004 	str	r0, [r8], -r4
     9cc:	05080004 	streq	r0, [r8, #-4]
     9d0:	40007300 	andmi	r7, r0, r0, lsl #6
     9d4:	00009f1a 	andeq	r9, r0, sl, lsl pc
	...
     a00:	00010000 	andeq	r0, r1, r0
     a04:	00000050 	andeq	r0, r0, r0, asr r0
     a08:	00000000 	andeq	r0, r0, r0
     a0c:	f3000400 	vshl.u8	d0, d0, d0
     a10:	009f5001 	addseq	r5, pc, r1
     a14:	00000000 	andeq	r0, r0, r0
     a18:	01000000 	mrseq	r0, (UNDEF: 0)
     a1c:	00005000 	andeq	r5, r0, r0
     a20:	00000000 	andeq	r0, r0, r0
     a24:	00040000 	andeq	r0, r4, r0
     a28:	9f5001f3 	svcls	0x005001f3
	...
     a34:	00500001 	subseq	r0, r0, r1
     a38:	00000000 	andeq	r0, r0, r0
     a3c:	04000000 	streq	r0, [r0], #-0
     a40:	5001f300 	andpl	pc, r1, r0, lsl #6
     a44:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     a48:	00000000 	andeq	r0, r0, r0
     a4c:	50000100 	andpl	r0, r0, r0, lsl #2
	...
     a58:	01f30004 	mvnseq	r0, r4
     a5c:	00009f50 	andeq	r9, r0, r0, asr pc
     a60:	00000000 	andeq	r0, r0, r0
