NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
     a64:	00010000 	andeq	r0, r1, r0
     a68:	00000050 	andeq	r0, r0, r0, asr r0
     a6c:	00000000 	andeq	r0, r0, r0
     a70:	f3000400 	vshl.u8	d0, d0, d0
     a74:	009f5001 	addseq	r5, pc, r1
     a78:	00000000 	andeq	r0, r0, r0
     a7c:	01000000 	mrseq	r0, (UNDEF: 0)
     a80:	00005000 	andeq	r5, r0, r0
     a84:	00000000 	andeq	r0, r0, r0
     a88:	00040000 	andeq	r0, r4, r0
     a8c:	9f5001f3 	svcls	0x005001f3
	...
     a98:	00500001 	subseq	r0, r0, r1
     a9c:	00000000 	andeq	r0, r0, r0
     aa0:	04000000 	streq	r0, [r0], #-0
     aa4:	5001f300 	andpl	pc, r1, r0, lsl #6
     aa8:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     aac:	00000000 	andeq	r0, r0, r0
     ab0:	00000200 	andeq	r0, r0, r0, lsl #4
	...
     abc:	30000200 	andcc	r0, r0, r0, lsl #4
     ac0:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     ac4:	00000000 	andeq	r0, r0, r0
     ac8:	30000200 	andcc	r0, r0, r0, lsl #4
     acc:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     ad0:	00000000 	andeq	r0, r0, r0
     ad4:	00000200 	andeq	r0, r0, r0, lsl #4
	...
     ae0:	30000200 	andcc	r0, r0, r0, lsl #4
     ae4:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     ae8:	00000000 	andeq	r0, r0, r0
     aec:	30000200 	andcc	r0, r0, r0, lsl #4
     af0:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     af4:	00000000 	andeq	r0, r0, r0
     af8:	00020300 	andeq	r0, r2, r0, lsl #6
	...
     b04:	30000200 	andcc	r0, r0, r0, lsl #4
     b08:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     b0c:	00000000 	andeq	r0, r0, r0
     b10:	30000200 	andcc	r0, r0, r0, lsl #4
     b14:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     b18:	00000000 	andeq	r0, r0, r0
     b1c:	00030400 	andeq	r0, r3, r0, lsl #8
	...
     b28:	02000000 	andeq	r0, r0, #0
     b2c:	009f3000 	addseq	r3, pc, r0
     b30:	00000000 	andeq	r0, r0, r0
     b34:	02000000 	andeq	r0, r0, #0
     b38:	009f3000 	addseq	r3, pc, r0
     b3c:	00000000 	andeq	r0, r0, r0
     b40:	01000000 	mrseq	r0, (UNDEF: 0)
     b44:	00005000 	andeq	r5, r0, r0
	...
     b54:	00020000 	andeq	r0, r2, r0
     b58:	0000007d 	andeq	r0, r0, sp, ror r0
     b5c:	00000000 	andeq	r0, r0, r0
     b60:	00020000 	andeq	r0, r2, r0
     b64:	0000107d 	andeq	r1, r0, sp, ror r0
	...
     b78:	00010000 	andeq	r0, r1, r0
     b7c:	00000050 	andeq	r0, r0, r0, asr r0
     b80:	00000000 	andeq	r0, r0, r0
     b84:	54000100 	strpl	r0, [r0], #-256	@ 0xffffff00
	...
     b9c:	00510001 	subseq	r0, r1, r1
     ba0:	00000000 	andeq	r0, r0, r0
     ba4:	04000000 	streq	r0, [r0], #-0
     ba8:	5101f300 	mrspl	pc, SP_irq	@ <UNPREDICTABLE>
     bac:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
	...
     bc0:	52000100 	andpl	r0, r0, #0, 2
	...
     bcc:	01f30004 	mvnseq	r0, r4
     bd0:	00009f52 	andeq	r9, r0, r2, asr pc
	...
     be4:	00010000 	andeq	r0, r1, r0
     be8:	00000050 	andeq	r0, r0, r0, asr r0
     bec:	00000000 	andeq	r0, r0, r0
     bf0:	f3000400 	vshl.u8	d0, d0, d0
     bf4:	009f5001 	addseq	r5, pc, r1
	...
     c04:	02000000 	andeq	r0, r0, #0
     c08:	00007d00 	andeq	r7, r0, r0, lsl #26
     c0c:	00000000 	andeq	r0, r0, r0
     c10:	02000000 	andeq	r0, r0, #0
     c14:	00207d00 	eoreq	r7, r0, r0, lsl #26
	...
     c28:	01000000 	mrseq	r0, (UNDEF: 0)
     c2c:	00005000 	andeq	r5, r0, r0
     c30:	00000000 	andeq	r0, r0, r0
     c34:	00010000 	andeq	r0, r1, r0
     c38:	00000054 	andeq	r0, r0, r4, asr r0
	...
     c4c:	51000100 	mrspl	r0, (UNDEF: 16)
	...
     c58:	01f30004 	mvnseq	r0, r4
     c5c:	00009f51 	andeq	r9, r0, r1, asr pc
	...
     c68:	01000000 	mrseq	r0, (UNDEF: 0)
	...
     c74:	00520001 	subseq	r0, r2, r1
     c78:	00000000 	andeq	r0, r0, r0
     c7c:	01000000 	mrseq	r0, (UNDEF: 0)
     c80:	00005900 	andeq	r5, r0, r0, lsl #18
     c84:	00000000 	andeq	r0, r0, r0
     c88:	00010000 	andeq	r0, r1, r0
     c8c:	0000005a 	andeq	r0, r0, sl, asr r0
	...
     ca4:	53000100 	movwpl	r0, #256	@ 0x100
	...
     cb0:	00580001 	subseq	r0, r8, r1
     cb4:	00000000 	andeq	r0, r0, r0
     cb8:	01000000 	mrseq	r0, (UNDEF: 0)
     cbc:	00005600 	andeq	r5, r0, r0, lsl #12
     cc0:	00000000 	andeq	r0, r0, r0
     cc4:	00040000 	andeq	r0, r4, r0
     cc8:	9f5301f3 	svcls	0x005301f3
	...
     ce0:	00910002 	addseq	r0, r1, r2
	...
     cec:	00910002 	addseq	r0, r1, r2
	...
     d04:	04910002 	ldreq	r0, [r1], #2
	...
     d10:	04910002 	ldreq	r0, [r1], #2
	...
     d1c:	00000001 	andeq	r0, r0, r1
	...
     d28:	9f300002 	svcls	0x00300002
	...
     d34:	00560001 	subseq	r0, r6, r1
	...
     d4c:	01000000 	mrseq	r0, (UNDEF: 0)
     d50:	00005300 	andeq	r5, r0, r0, lsl #6
     d54:	00000000 	andeq	r0, r0, r0
     d58:	00150000 	andseq	r0, r5, r0
     d5c:	d8807431 	stmle	r0, {r0, r4, r5, sl, ip, sp, lr}
     d60:	747bfffe 	ldrbtvc	pc, [fp], #-4094	@ 0xfffff002	@ <UNPREDICTABLE>
     d64:	54000c00 	strpl	r0, [r0], #-3072	@ 0xfffff400
     d68:	282e4000 	stmdacs	lr!, {lr}
     d6c:	13160001 	tstne	r6, #1
     d70:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     d74:	00000000 	andeq	r0, r0, r0
     d78:	53000100 	movwpl	r0, #256	@ 0x100
	...
     d84:	74310015 	ldrtvc	r0, [r1], #-21	@ 0xffffffeb
     d88:	fffed880 			@ <UNDEFINED> instruction: 0xfffed880
     d8c:	0c00747b 	cfstrseq	mvf7, [r0], {123}	@ 0x7b
     d90:	40005400 	andmi	r5, r0, r0, lsl #8
     d94:	0001282e 	andeq	r2, r1, lr, lsr #16
     d98:	009f1316 	addseq	r1, pc, r6, lsl r3	@ <UNPREDICTABLE>
     d9c:	00000000 	andeq	r0, r0, r0
     da0:	01000000 	mrseq	r0, (UNDEF: 0)
	...
     dac:	31000200 	mrscc	r0, R8_usr
     db0:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     db4:	00000000 	andeq	r0, r0, r0
     db8:	00000100 	andeq	r0, r0, r0, lsl #2
     dbc:	00000202 	andeq	r0, r0, r2, lsl #4
	...
     dc8:	56000100 	strpl	r0, [r0], -r0, lsl #2
	...
     dd4:	00530001 	subseq	r0, r3, r1
     dd8:	00000000 	andeq	r0, r0, r0
     ddc:	05000000 	streq	r0, [r0, #-0]
     de0:	31007300 	mrscc	r7, LR_irq
     de4:	00009f21 	andeq	r9, r0, r1, lsr #30
     de8:	00000000 	andeq	r0, r0, r0
     dec:	00070000 	andeq	r0, r7, r0
     df0:	24310076 	ldrtcs	r0, [r1], #-118	@ 0xffffff8a
     df4:	009f2131 	addseq	r2, pc, r1, lsr r1	@ <UNPREDICTABLE>
     df8:	00000000 	andeq	r0, r0, r0
     dfc:	01000000 	mrseq	r0, (UNDEF: 0)
	...
     e08:	54000100 	strpl	r0, [r0], #-256	@ 0xffffff00
	...
     e14:	00000001 	andeq	r0, r0, r1
     e18:	00000000 	andeq	r0, r0, r0
     e1c:	00020000 	andeq	r0, r2, r0
     e20:	00009f31 	andeq	r9, r0, r1, lsr pc
     e24:	00000000 	andeq	r0, r0, r0
     e28:	00010000 	andeq	r0, r1, r0
	...
     e34:	00540001 	subseq	r0, r4, r1
     e38:	00000000 	andeq	r0, r0, r0
     e3c:	01000000 	mrseq	r0, (UNDEF: 0)
	...
     e48:	30000200 	andcc	r0, r0, r0, lsl #4
     e4c:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
     e50:	00000000 	andeq	r0, r0, r0
     e54:	00000100 	andeq	r0, r0, r0, lsl #2
     e58:	00000000 	andeq	r0, r0, r0
     e5c:	01000000 	mrseq	r0, (UNDEF: 0)
     e60:	00005400 	andeq	r5, r0, r0, lsl #8
     e64:	00000000 	andeq	r0, r0, r0
     e68:	00010000 	andeq	r0, r1, r0
	...
     e74:	9f310002 	svcls	0x00310002
	...
     e80:	00000001 	andeq	r0, r0, r1
     e84:	00000000 	andeq	r0, r0, r0
     e88:	00010000 	andeq	r0, r1, r0
     e8c:	00000054 	andeq	r0, r0, r4, asr r0
     e90:	00000000 	andeq	r0, r0, r0
     e94:	00000200 	andeq	r0, r0, r0, lsl #4
     e98:	00000000 	andeq	r0, r0, r0
     e9c:	02000000 	andeq	r0, r0, #0
     ea0:	009f3100 	addseq	r3, pc, r0, lsl #2
     ea4:	00000000 	andeq	r0, r0, r0
     ea8:	02000000 	andeq	r0, r0, #0
	...
     eb4:	54000100 	strpl	r0, [r0], #-256	@ 0xffffff00
	...
     ec8:	007d0002 	rsbseq	r0, sp, r2
	...
     ed4:	207d0002 	rsbscs	r0, sp, r2
	...
     eec:	00500001 	subseq	r0, r0, r1
     ef0:	00000000 	andeq	r0, r0, r0
     ef4:	01000000 	mrseq	r0, (UNDEF: 0)
     ef8:	00005400 	andeq	r5, r0, r0, lsl #8
	...
     f0c:	00010000 	andeq	r0, r1, r0
     f10:	00000051 	andeq	r0, r0, r1, asr r0
     f14:	00000000 	andeq	r0, r0, r0
     f18:	f3000400 	vshl.u8	d0, d0, d0
     f1c:	009f5101 	addseq	r5, pc, r1, lsl #2
	...
     f34:	01000000 	mrseq	r0, (UNDEF: 0)
     f38:	00005200 	andeq	r5, r0, r0, lsl #4
     f3c:	00000000 	andeq	r0, r0, r0
     f40:	00010000 	andeq	r0, r1, r0
     f44:	00000056 	andeq	r0, r0, r6, asr r0
     f48:	00000000 	andeq	r0, r0, r0
     f4c:	76000300 	strvc	r0, [r0], -r0, lsl #6
     f50:	00009f01 	andeq	r9, r0, r1, lsl #30
     f54:	00000000 	andeq	r0, r0, r0
     f58:	00040000 	andeq	r0, r4, r0
     f5c:	9f5201f3 	svcls	0x005201f3
	...
     f74:	00010000 	andeq	r0, r1, r0
     f78:	00000053 	andeq	r0, r0, r3, asr r0
     f7c:	00000000 	andeq	r0, r0, r0
     f80:	55000100 	strpl	r0, [r0, #-256]	@ 0xffffff00
	...
     f8c:	01f30004 	mvnseq	r0, r4
     f90:	00009f53 	andeq	r9, r0, r3, asr pc
	...
     fa4:	00020000 	andeq	r0, r2, r0
     fa8:	00000091 	muleq	r0, r1, r0
     fac:	00000000 	andeq	r0, r0, r0
     fb0:	00020000 	andeq	r0, r2, r0
     fb4:	00000091 	muleq	r0, r1, r0
	...
     fc8:	00020000 	andeq	r0, r2, r0
     fcc:	00000491 	muleq	r0, r1, r4
     fd0:	00000000 	andeq	r0, r0, r0
     fd4:	00020000 	andeq	r0, r2, r0
     fd8:	00000491 	muleq	r0, r1, r4
     fdc:	00000000 	andeq	r0, r0, r0
     fe0:	00010000 	andeq	r0, r1, r0
     fe4:	01000000 	mrseq	r0, (UNDEF: 0)
     fe8:	00000001 	andeq	r0, r0, r1
     fec:	00000000 	andeq	r0, r0, r0
     ff0:	00020000 	andeq	r0, r2, r0
     ff4:	00009f30 	andeq	r9, r0, r0, lsr pc
     ff8:	00000000 	andeq	r0, r0, r0
     ffc:	00090000 	andeq	r0, r9, r0
    1000:	01f30076 	mvnseq	r0, r6, ror r0
    1004:	01231c52 			@ <UNDEFINED> instruction: 0x01231c52
    1008:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    100c:	00000000 	andeq	r0, r0, r0
    1010:	76000700 	strvc	r0, [r0], -r0, lsl #14
    1014:	5201f300 	andpl	pc, r1, #0, 6
    1018:	00009f1c 	andeq	r9, r0, ip, lsl pc
    101c:	00000000 	andeq	r0, r0, r0
    1020:	00090000 	andeq	r0, r9, r0
    1024:	01f30076 	mvnseq	r0, r6, ror r0
    1028:	01231c52 			@ <UNDEFINED> instruction: 0x01231c52
    102c:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1030:	00000000 	andeq	r0, r0, r0
    1034:	00000100 	andeq	r0, r0, r0, lsl #2
    1038:	00000000 	andeq	r0, r0, r0
    103c:	02000000 	andeq	r0, r0, #0
    1040:	009f3000 	addseq	r3, pc, r0
    1044:	00000000 	andeq	r0, r0, r0
    1048:	01000000 	mrseq	r0, (UNDEF: 0)
    104c:	00000303 	andeq	r0, r0, r3, lsl #6
    1050:	00000000 	andeq	r0, r0, r0
    1054:	01000000 	mrseq	r0, (UNDEF: 0)
    1058:	00005900 	andeq	r5, r0, r0, lsl #18
    105c:	00000000 	andeq	r0, r0, r0
    1060:	00050000 	andeq	r0, r5, r0
    1064:	24310079 	ldrtcs	r0, [r1], #-121	@ 0xffffff87
    1068:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    106c:	00000000 	andeq	r0, r0, r0
    1070:	00000100 	andeq	r0, r0, r0, lsl #2
    1074:	00000000 	andeq	r0, r0, r0
    1078:	01000000 	mrseq	r0, (UNDEF: 0)
    107c:	00005400 	andeq	r5, r0, r0, lsl #8
    1080:	00000000 	andeq	r0, r0, r0
    1084:	00010000 	andeq	r0, r1, r0
	...
    1090:	9f310002 	svcls	0x00310002
	...
    109c:	00000001 	andeq	r0, r0, r1
    10a0:	00000000 	andeq	r0, r0, r0
    10a4:	00010000 	andeq	r0, r1, r0
    10a8:	00000054 	andeq	r0, r0, r4, asr r0
	...
    10b8:	7d000200 	sfmvc	f0, 4, [r0, #-0]
	...
    10c4:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    10c8:	00000008 	andeq	r0, r0, r8
    10cc:	00000000 	andeq	r0, r0, r0
    10d0:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    10d4:	00000010 	andeq	r0, r0, r0, lsl r0
    10d8:	00000000 	andeq	r0, r0, r0
    10dc:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    10e0:	00000008 	andeq	r0, r0, r8
    10e4:	00000000 	andeq	r0, r0, r0
    10e8:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    10ec:	00000010 	andeq	r0, r0, r0, lsl r0
	...
    1108:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    1114:	01f30004 	mvnseq	r0, r4
    1118:	00009f50 	andeq	r9, r0, r0, asr pc
    111c:	00000000 	andeq	r0, r0, r0
    1120:	00010000 	andeq	r0, r1, r0
    1124:	00000050 	andeq	r0, r0, r0, asr r0
    1128:	00000000 	andeq	r0, r0, r0
    112c:	f3000400 	vshl.u8	d0, d0, d0
    1130:	009f5001 	addseq	r5, pc, r1
    1134:	00000000 	andeq	r0, r0, r0
    1138:	01000000 	mrseq	r0, (UNDEF: 0)
    113c:	00005000 	andeq	r5, r0, r0
    1140:	00000000 	andeq	r0, r0, r0
    1144:	00040000 	andeq	r0, r4, r0
    1148:	9f5001f3 	svcls	0x005001f3
	...
    115c:	007d0002 	rsbseq	r0, sp, r2
	...
    1168:	107d0002 	rsbsne	r0, sp, r2
	...
    1188:	00500001 	subseq	r0, r0, r1
    118c:	00000000 	andeq	r0, r0, r0
    1190:	01000000 	mrseq	r0, (UNDEF: 0)
    1194:	00005400 	andeq	r5, r0, r0, lsl #8
    1198:	00000000 	andeq	r0, r0, r0
    119c:	00010000 	andeq	r0, r1, r0
    11a0:	00000050 	andeq	r0, r0, r0, asr r0
    11a4:	00000000 	andeq	r0, r0, r0
    11a8:	54000100 	strpl	r0, [r0], #-256	@ 0xffffff00
	...
    11b4:	00500001 	subseq	r0, r0, r1
    11b8:	00000000 	andeq	r0, r0, r0
    11bc:	01000000 	mrseq	r0, (UNDEF: 0)
    11c0:	00005400 	andeq	r5, r0, r0, lsl #8
	...
    11dc:	00010000 	andeq	r0, r1, r0
    11e0:	00000051 	andeq	r0, r0, r1, asr r0
    11e4:	00000000 	andeq	r0, r0, r0
    11e8:	55000100 	strpl	r0, [r0, #-256]	@ 0xffffff00
	...
    11f4:	00510001 	subseq	r0, r1, r1
    11f8:	00000000 	andeq	r0, r0, r0
    11fc:	01000000 	mrseq	r0, (UNDEF: 0)
    1200:	00005500 	andeq	r5, r0, r0, lsl #10
    1204:	00000000 	andeq	r0, r0, r0
    1208:	00010000 	andeq	r0, r1, r0
    120c:	00000051 	andeq	r0, r0, r1, asr r0
    1210:	00000000 	andeq	r0, r0, r0
    1214:	55000100 	strpl	r0, [r0, #-256]	@ 0xffffff00
	...
    1220:	00000001 	andeq	r0, r0, r1
    1224:	01000000 	mrseq	r0, (UNDEF: 0)
    1228:	02010101 	andeq	r0, r1, #1073741824	@ 0x40000000
    122c:	00000002 	andeq	r0, r0, r2
    1230:	00010100 	andeq	r0, r1, r0, lsl #2
    1234:	00020201 	andeq	r0, r2, r1, lsl #4
	...
    1240:	9f300002 	svcls	0x00300002
	...
    124c:	9f300002 	svcls	0x00300002
	...
    1258:	00530001 	subseq	r0, r3, r1
    125c:	00000000 	andeq	r0, r0, r0
    1260:	01000000 	mrseq	r0, (UNDEF: 0)
    1264:	00005600 	andeq	r5, r0, r0, lsl #12
    1268:	00000000 	andeq	r0, r0, r0
    126c:	00060000 	andeq	r0, r6, r0
    1270:	00760071 	rsbseq	r0, r6, r1, ror r0
    1274:	00009f21 	andeq	r9, r0, r1, lsr #30
    1278:	00000000 	andeq	r0, r0, r0
    127c:	00020000 	andeq	r0, r2, r0
    1280:	00009f30 	andeq	r9, r0, r0, lsr pc
    1284:	00000000 	andeq	r0, r0, r0
    1288:	000e0000 	andeq	r0, lr, r0
    128c:	2df70070 	ldclcs	0, cr0, [r7, #448]!	@ 0x1c0
    1290:	24310073 	ldrtcs	r0, [r1], #-115	@ 0xffffff8d
    1294:	f71b2df7 			@ <UNDEFINED> instruction: 0xf71b2df7
    1298:	00009f00 	andeq	r9, r0, r0, lsl #30
    129c:	00000000 	andeq	r0, r0, r0
    12a0:	000f0000 	andeq	r0, pc, r0
    12a4:	2df70070 	ldclcs	0, cr0, [r7, #448]!	@ 0x1c0
    12a8:	31060075 	tstcc	r6, r5, ror r0
    12ac:	1b2df724 	blne	b7ef44 <_Min_Stack_Size+0xb7eb44>
    12b0:	009f00f7 	ldrsheq	r0, [pc], r7
    12b4:	00000000 	andeq	r0, r0, r0
    12b8:	01000000 	mrseq	r0, (UNDEF: 0)
    12bc:	00005100 	andeq	r5, r0, r0, lsl #2
    12c0:	00000000 	andeq	r0, r0, r0
    12c4:	001a0000 	andseq	r0, sl, r0
    12c8:	01940475 	orrseq	r0, r4, r5, ror r4
    12cc:	751aff08 	ldrvc	pc, [sl, #-3848]	@ 0xfffff0f8
    12d0:	2102941c 	tstcs	r2, ip, lsl r4
    12d4:	02940875 	addseq	r0, r4, #7667712	@ 0x750000
    12d8:	94187521 	ldrls	r7, [r8], #-1313	@ 0xfffffadf
    12dc:	00712102 	rsbseq	r2, r1, r2, lsl #2
    12e0:	00009f21 	andeq	r9, r0, r1, lsr #30
    12e4:	00000000 	andeq	r0, r0, r0
    12e8:	00020000 	andeq	r0, r2, r0
    12ec:	00009f31 	andeq	r9, r0, r1, lsr pc
    12f0:	00000000 	andeq	r0, r0, r0
    12f4:	00090000 	andeq	r0, r9, r0
    12f8:	02941075 	addseq	r1, r4, #117	@ 0x75
    12fc:	21312431 	teqcs	r1, r1, lsr r4
    1300:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1304:	00000000 	andeq	r0, r0, r0
    1308:	00000100 	andeq	r0, r0, r0, lsl #2
	...
    1318:	30000200 	andcc	r0, r0, r0, lsl #4
    131c:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1320:	00000000 	andeq	r0, r0, r0
    1324:	30000200 	andcc	r0, r0, r0, lsl #4
    1328:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    132c:	00000000 	andeq	r0, r0, r0
    1330:	51000100 	mrspl	r0, (UNDEF: 16)
	...
    133c:	7f710003 	svcvc	0x00710003
    1340:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1344:	00000000 	andeq	r0, r0, r0
    1348:	00000100 	andeq	r0, r0, r0, lsl #2
    134c:	00000101 	andeq	r0, r0, r1, lsl #2
	...
    1358:	30000200 	andcc	r0, r0, r0, lsl #4
    135c:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1360:	00000000 	andeq	r0, r0, r0
    1364:	30000200 	andcc	r0, r0, r0, lsl #4
    1368:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    136c:	00000000 	andeq	r0, r0, r0
    1370:	70000e00 	andvc	r0, r0, r0, lsl #28
    1374:	732df700 	msrvc	CPSR_fsc, #0, 14
    1378:	f7243100 			@ <UNDEFINED> instruction: 0xf7243100
    137c:	00f71b2d 	rscseq	r1, r7, sp, lsr #22
    1380:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1384:	00000000 	andeq	r0, r0, r0
    1388:	70000f00 	andvc	r0, r0, r0, lsl #30
    138c:	752df700 	strvc	pc, [sp, #-1792]!	@ 0xfffff900
    1390:	24310600 	ldrtcs	r0, [r1], #-1536	@ 0xfffffa00
    1394:	f71b2df7 			@ <UNDEFINED> instruction: 0xf71b2df7
    1398:	00009f00 	andeq	r9, r0, r0, lsl #30
    139c:	00000000 	andeq	r0, r0, r0
    13a0:	00020000 	andeq	r0, r2, r0
	...
    13b0:	000c0006 	andeq	r0, ip, r6
    13b4:	9f007a12 	svcls	0x00007a12
	...
    13c0:	000c0006 	andeq	r0, ip, r6
    13c4:	9f007a12 	svcls	0x00007a12
	...
    13d0:	00500001 	subseq	r0, r0, r1
	...
    13e8:	51000100 	mrspl	r0, (UNDEF: 16)
	...
    13f4:	01f30004 	mvnseq	r0, r4
    13f8:	00009f51 	andeq	r9, r0, r1, asr pc
    13fc:	00000000 	andeq	r0, r0, r0
    1400:	00010000 	andeq	r0, r1, r0
    1404:	00000051 	andeq	r0, r0, r1, asr r0
	...
    1414:	7d000200 	sfmvc	f0, 4, [r0, #-0]
	...
    1420:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    1424:	00000010 	andeq	r0, r0, r0, lsl r0
    1428:	00000000 	andeq	r0, r0, r0
    142c:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    1430:	00000018 	andeq	r0, r0, r8, lsl r0
    1434:	00000000 	andeq	r0, r0, r0
    1438:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    143c:	00000010 	andeq	r0, r0, r0, lsl r0
    1440:	00000000 	andeq	r0, r0, r0
    1444:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    1448:	00000018 	andeq	r0, r0, r8, lsl r0
	...
    147c:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    1488:	01f30004 	mvnseq	r0, r4
    148c:	00009f50 	andeq	r9, r0, r0, asr pc
    1490:	00000000 	andeq	r0, r0, r0
    1494:	00010000 	andeq	r0, r1, r0
    1498:	00000050 	andeq	r0, r0, r0, asr r0
    149c:	00000000 	andeq	r0, r0, r0
    14a0:	f3000400 	vshl.u8	d0, d0, d0
    14a4:	009f5001 	addseq	r5, pc, r1
    14a8:	00000000 	andeq	r0, r0, r0
    14ac:	01000000 	mrseq	r0, (UNDEF: 0)
    14b0:	00005000 	andeq	r5, r0, r0
    14b4:	00000000 	andeq	r0, r0, r0
    14b8:	00040000 	andeq	r0, r4, r0
    14bc:	9f5001f3 	svcls	0x005001f3
	...
    14c8:	00500001 	subseq	r0, r0, r1
    14cc:	00000000 	andeq	r0, r0, r0
    14d0:	04000000 	streq	r0, [r0], #-0
    14d4:	5001f300 	andpl	pc, r1, r0, lsl #6
    14d8:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    14dc:	00000000 	andeq	r0, r0, r0
    14e0:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    14ec:	01f30004 	mvnseq	r0, r4
    14f0:	00009f50 	andeq	r9, r0, r0, asr pc
    14f4:	00000000 	andeq	r0, r0, r0
    14f8:	00010000 	andeq	r0, r1, r0
    14fc:	00000050 	andeq	r0, r0, r0, asr r0
    1500:	00000000 	andeq	r0, r0, r0
    1504:	f3000400 	vshl.u8	d0, d0, d0
    1508:	009f5001 	addseq	r5, pc, r1
    150c:	00000000 	andeq	r0, r0, r0
    1510:	01000000 	mrseq	r0, (UNDEF: 0)
    1514:	00005000 	andeq	r5, r0, r0
    1518:	00000000 	andeq	r0, r0, r0
    151c:	00040000 	andeq	r0, r4, r0
    1520:	9f5001f3 	svcls	0x005001f3
	...
    152c:	00500001 	subseq	r0, r0, r1
    1530:	00000000 	andeq	r0, r0, r0
    1534:	04000000 	streq	r0, [r0], #-0
    1538:	5001f300 	andpl	pc, r1, r0, lsl #6
    153c:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1540:	00000000 	andeq	r0, r0, r0
    1544:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    1550:	01f30004 	mvnseq	r0, r4
    1554:	00009f50 	andeq	r9, r0, r0, asr pc
    1558:	00000000 	andeq	r0, r0, r0
    155c:	05280000 	streq	r0, [r8, #-0]!
    1560:	052a0800 	streq	r0, [sl, #-2048]!	@ 0xfffff800
    1564:	00020800 	andeq	r0, r2, r0, lsl #16
    1568:	052a007d 	streq	r0, [sl, #-125]!	@ 0xffffff83
    156c:	05580800 	ldrbeq	r0, [r8, #-2048]	@ 0xfffff800
    1570:	00020800 	andeq	r0, r2, r0, lsl #16
    1574:	0000087d 	andeq	r0, r0, sp, ror r8
	...
    1580:	08000538 	stmdaeq	r0, {r3, r4, r5, r8, sl}
    1584:	0800054d 	stmdaeq	r0, {r0, r2, r3, r6, r8, sl}
    1588:	00500001 	subseq	r0, r0, r1
    158c:	00000000 	andeq	r0, r0, r0
    1590:	f8000000 			@ <UNDEFINED> instruction: 0xf8000000
    1594:	fa080004 	blx	2015ac <_Min_Stack_Size+0x2011ac>
    1598:	02080004 	andeq	r0, r8, #4
    159c:	fa007d00 	blx	209a4 <_Min_Stack_Size+0x205a4>
    15a0:	28080004 	stmdacs	r8, {r2}
    15a4:	02080005 	andeq	r0, r8, #5
    15a8:	00087d00 	andeq	r7, r8, r0, lsl #26
	...
    15b4:	00050800 	andeq	r0, r5, r0, lsl #16
    15b8:	00051d08 	andeq	r1, r5, r8, lsl #26
    15bc:	50000108 	andpl	r0, r0, r8, lsl #2
	...
    15d0:	007d0002 	rsbseq	r0, sp, r2
	...
    15dc:	047d0002 	ldrbteq	r0, [sp], #-2
	...
    15e8:	007d0002 	rsbseq	r0, sp, r2
	...
    15f4:	00000001 	andeq	r0, r0, r1
    15f8:	00000000 	andeq	r0, r0, r0
    15fc:	00090000 	andeq	r0, r9, r0
    1600:	000c0070 	andeq	r0, ip, r0, ror r0
    1604:	2e400130 	mcrcs	1, 2, r0, cr0, cr0, {1}
    1608:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
	...
    1618:	7d000200 	sfmvc	f0, 4, [r0, #-0]
	...
    1624:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    1628:	00000004 	andeq	r0, r0, r4
    162c:	00000000 	andeq	r0, r0, r0
    1630:	7d000200 	sfmvc	f0, 4, [r0, #-0]
	...
    163c:	00000100 	andeq	r0, r0, r0, lsl #2
    1640:	00000000 	andeq	r0, r0, r0
    1644:	09000000 	stmdbeq	r0, {}	@ <UNPREDICTABLE>
    1648:	0c007000 	stceq	0, cr7, [r0], {-0}
    164c:	40013000 	andmi	r3, r1, r0
    1650:	00009f2e 	andeq	r9, r0, lr, lsr #30
    1654:	00000000 	andeq	r0, r0, r0
    1658:	00010000 	andeq	r0, r1, r0
	...
    1664:	00500001 	subseq	r0, r0, r1
    1668:	00000000 	andeq	r0, r0, r0
    166c:	01000000 	mrseq	r0, (UNDEF: 0)
	...
    1678:	51000100 	mrspl	r0, (UNDEF: 16)
	...
    1684:	00000001 	andeq	r0, r0, r1
    1688:	00000000 	andeq	r0, r0, r0
    168c:	00010000 	andeq	r0, r1, r0
    1690:	00000052 	andeq	r0, r0, r2, asr r0
	...
    16a0:	7d000200 	sfmvc	f0, 4, [r0, #-0]
	...
    16ac:	7d000200 	sfmvc	f0, 4, [r0, #-0]
    16b0:	0000000c 	andeq	r0, r0, ip
	...
    16cc:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    16d8:	005e0001 	subseq	r0, lr, r1
    16dc:	00000000 	andeq	r0, r0, r0
    16e0:	01000000 	mrseq	r0, (UNDEF: 0)
    16e4:	00005000 	andeq	r5, r0, r0
    16e8:	00000000 	andeq	r0, r0, r0
    16ec:	00010000 	andeq	r0, r1, r0
    16f0:	0000005e 	andeq	r0, r0, lr, asr r0
    16f4:	00000000 	andeq	r0, r0, r0
    16f8:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    1704:	005e0001 	subseq	r0, lr, r1
	...
    1720:	01000000 	mrseq	r0, (UNDEF: 0)
    1724:	00005100 	andeq	r5, r0, r0, lsl #2
    1728:	00000000 	andeq	r0, r0, r0
    172c:	00010000 	andeq	r0, r1, r0
    1730:	0000005c 	andeq	r0, r0, ip, asr r0
    1734:	00000000 	andeq	r0, r0, r0
    1738:	51000100 	mrspl	r0, (UNDEF: 16)
	...
    1744:	005c0001 	subseq	r0, ip, r1
    1748:	00000000 	andeq	r0, r0, r0
    174c:	01000000 	mrseq	r0, (UNDEF: 0)
    1750:	00005100 	andeq	r5, r0, r0, lsl #2
    1754:	00000000 	andeq	r0, r0, r0
    1758:	00010000 	andeq	r0, r1, r0
    175c:	0000005c 	andeq	r0, r0, ip, asr r0
    1760:	00000000 	andeq	r0, r0, r0
    1764:	01010100 	mrseq	r0, (UNDEF: 17)
    1768:	03030202 	movweq	r0, #12802	@ 0x3202
    176c:	05050404 	streq	r0, [r5, #-1028]	@ 0xfffffbfc
    1770:	00000606 	andeq	r0, r0, r6, lsl #12
	...
    1780:	30000200 	andcc	r0, r0, r0, lsl #4
    1784:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1788:	00000000 	andeq	r0, r0, r0
    178c:	08000300 	stmdaeq	r0, {r8, r9}
    1790:	00009f40 	andeq	r9, r0, r0, asr #30
    1794:	00000000 	andeq	r0, r0, r0
    1798:	00080000 	andeq	r0, r8, r0
    179c:	0294007c 	addseq	r0, r4, #124	@ 0x7c
