NaderMohamed325/Learn-In-Depth/RTOS/Objects/Stm32.s
    17a0:	9f214008 	svcls	0x00214008
	...
    17ac:	007c000d 	rsbseq	r0, ip, sp
    17b0:	027c0294 	rsbseq	r0, ip, #148, 4	@ 0x40000009
    17b4:	08210294 	stmdaeq	r1!, {r2, r4, r7, r9}
    17b8:	009f2140 	addseq	r2, pc, r0, asr #2
    17bc:	00000000 	andeq	r0, r0, r0
    17c0:	12000000 	andne	r0, r0, #0
    17c4:	94007c00 	strls	r7, [r0], #-3072	@ 0xfffff400
    17c8:	94027c02 	strls	r7, [r2], #-3074	@ 0xfffff3fe
    17cc:	047c2102 	ldrbteq	r2, [ip], #-258	@ 0xfffffefe
    17d0:	08210294 	stmdaeq	r1!, {r2, r4, r7, r9}
    17d4:	009f2140 	addseq	r2, pc, r0, asr #2
    17d8:	00000000 	andeq	r0, r0, r0
    17dc:	17000000 	strne	r0, [r0, -r0]
    17e0:	94007c00 	strls	r7, [r0], #-3072	@ 0xfffff400
    17e4:	94027c02 	strls	r7, [r2], #-3074	@ 0xfffff3fe
    17e8:	047c2102 	ldrbteq	r2, [ip], #-258	@ 0xfffffefe
    17ec:	7c210294 	sfmvc	f0, 4, [r1], #-592	@ 0xfffffdb0
    17f0:	21029406 	tstcs	r2, r6, lsl #8
    17f4:	9f214008 	svcls	0x00214008
	...
    1800:	007c001c 	rsbseq	r0, ip, ip, lsl r0
    1804:	027c0294 	rsbseq	r0, ip, #148, 4	@ 0x40000009
    1808:	7c210294 	sfmvc	f0, 4, [r1], #-592	@ 0xfffffdb0
    180c:	21029404 	tstcs	r2, r4, lsl #8
    1810:	0294067c 	addseq	r0, r4, #124, 12	@ 0x7c00000
    1814:	94087c21 	strls	r7, [r8], #-3105	@ 0xfffff3df
    1818:	40082102 	andmi	r2, r8, r2, lsl #2
    181c:	00009f21 	andeq	r9, r0, r1, lsr #30
    1820:	00000000 	andeq	r0, r0, r0
    1824:	00010000 	andeq	r0, r1, r0
    1828:	00000053 	andeq	r0, r0, r3, asr r0
    182c:	00000000 	andeq	r0, r0, r0
    1830:	30000200 	andcc	r0, r0, r0, lsl #4
    1834:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1838:	00000000 	andeq	r0, r0, r0
    183c:	53000100 	movwpl	r0, #256	@ 0x100
	...
    1848:	00000002 	andeq	r0, r0, r2
	...
    1858:	9f300002 	svcls	0x00300002
	...
    1864:	00520001 	subseq	r0, r2, r1
    1868:	00000000 	andeq	r0, r0, r0
    186c:	02000000 	andeq	r0, r0, #0
    1870:	009f3000 	addseq	r3, pc, r0
    1874:	00000000 	andeq	r0, r0, r0
    1878:	01000000 	mrseq	r0, (UNDEF: 0)
    187c:	00005200 	andeq	r5, r0, r0, lsl #4
    1880:	00000000 	andeq	r0, r0, r0
    1884:	05780000 	ldrbeq	r0, [r8, #-0]!
    1888:	057a0800 	ldrbeq	r0, [sl, #-2048]!	@ 0xfffff800
    188c:	00020800 	andeq	r0, r2, r0, lsl #16
    1890:	057a007d 	ldrbeq	r0, [sl, #-125]!	@ 0xffffff83
    1894:	05880800 	streq	r0, [r8, #2048]	@ 0x800
    1898:	00020800 	andeq	r0, r2, r0, lsl #16
    189c:	0000087d 	andeq	r0, r0, sp, ror r8
    18a0:	00000000 	andeq	r0, r0, r0
    18a4:	05680000 	strbeq	r0, [r8, #-0]!
    18a8:	056a0800 	strbeq	r0, [sl, #-2048]!	@ 0xfffff800
    18ac:	00020800 	andeq	r0, r2, r0, lsl #16
    18b0:	056a007d 	strbeq	r0, [sl, #-125]!	@ 0xffffff83
    18b4:	05780800 	ldrbeq	r0, [r8, #-2048]!	@ 0xfffff800
    18b8:	00020800 	andeq	r0, r2, r0, lsl #16
    18bc:	0000087d 	andeq	r0, r0, sp, ror r8
    18c0:	00000000 	andeq	r0, r0, r0
    18c4:	05580000 	ldrbeq	r0, [r8, #-0]
    18c8:	055a0800 	ldrbeq	r0, [sl, #-2048]	@ 0xfffff800
    18cc:	00020800 	andeq	r0, r2, r0, lsl #16
    18d0:	055a007d 	ldrbeq	r0, [sl, #-125]	@ 0xffffff83
    18d4:	05680800 	strbeq	r0, [r8, #-2048]!	@ 0xfffff800
    18d8:	00020800 	andeq	r0, r2, r0, lsl #16
    18dc:	0000087d 	andeq	r0, r0, sp, ror r8
	...
    18ec:	00020000 	andeq	r0, r2, r0
    18f0:	0000007d 	andeq	r0, r0, sp, ror r0
    18f4:	00000000 	andeq	r0, r0, r0
    18f8:	00020000 	andeq	r0, r2, r0
    18fc:	0000087d 	andeq	r0, r0, sp, ror r8
    1900:	00000000 	andeq	r0, r0, r0
    1904:	00020000 	andeq	r0, r2, r0
    1908:	0000107d 	andeq	r1, r0, sp, ror r0
    190c:	00000000 	andeq	r0, r0, r0
    1910:	00020000 	andeq	r0, r2, r0
    1914:	0000087d 	andeq	r0, r0, sp, ror r8
    1918:	00000000 	andeq	r0, r0, r0
    191c:	00020000 	andeq	r0, r2, r0
    1920:	0000107d 	andeq	r1, r0, sp, ror r0
	...
    1940:	00010000 	andeq	r0, r1, r0
    1944:	00000050 	andeq	r0, r0, r0, asr r0
    1948:	00000000 	andeq	r0, r0, r0
    194c:	f3000400 	vshl.u8	d0, d0, d0
    1950:	009f5001 	addseq	r5, pc, r1
    1954:	00000000 	andeq	r0, r0, r0
    1958:	01000000 	mrseq	r0, (UNDEF: 0)
    195c:	00005000 	andeq	r5, r0, r0
    1960:	00000000 	andeq	r0, r0, r0
    1964:	00040000 	andeq	r0, r4, r0
    1968:	9f5001f3 	svcls	0x005001f3
	...
    1974:	00500001 	subseq	r0, r0, r1
    1978:	00000000 	andeq	r0, r0, r0
    197c:	04000000 	streq	r0, [r0], #-0
    1980:	5001f300 	andpl	pc, r1, r0, lsl #6
    1984:	0000009f 	muleq	r0, pc, r0	@ <UNPREDICTABLE>
    1988:	00000000 	andeq	r0, r0, r0
    198c:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    1998:	01f30004 	mvnseq	r0, r4
    199c:	00009f50 	andeq	r9, r0, r0, asr pc
    19a0:	00000000 	andeq	r0, r0, r0
    19a4:	00010000 	andeq	r0, r1, r0
	...
    19b0:	00500001 	subseq	r0, r0, r1
	...
    19c0:	02000000 	andeq	r0, r0, #0
    19c4:	00007d00 	andeq	r7, r0, r0, lsl #26
    19c8:	00000000 	andeq	r0, r0, r0
    19cc:	02000000 	andeq	r0, r0, #0
    19d0:	00107d00 	andseq	r7, r0, r0, lsl #26
	...
    19e8:	01000000 	mrseq	r0, (UNDEF: 0)
    19ec:	00005000 	andeq	r5, r0, r0
    19f0:	00000000 	andeq	r0, r0, r0
    19f4:	00010000 	andeq	r0, r1, r0
    19f8:	00000054 	andeq	r0, r0, r4, asr r0
    19fc:	00000000 	andeq	r0, r0, r0
    1a00:	50000100 	andpl	r0, r0, r0, lsl #2
	...
    1a0c:	00540001 	subseq	r0, r4, r1
	...
    1a24:	01000000 	mrseq	r0, (UNDEF: 0)
    1a28:	00005100 	andeq	r5, r0, r0, lsl #2
    1a2c:	00000000 	andeq	r0, r0, r0
    1a30:	00010000 	andeq	r0, r1, r0
    1a34:	00000055 	andeq	r0, r0, r5, asr r0
    1a38:	00000000 	andeq	r0, r0, r0
    1a3c:	51000100 	mrspl	r0, (UNDEF: 16)
	...
    1a48:	00550001 	subseq	r0, r5, r1
	...
    1a5c:	01000000 	mrseq	r0, (UNDEF: 0)
    1a60:	00005000 	andeq	r5, r0, r0
    1a64:	00000000 	andeq	r0, r0, r0
    1a68:	00010000 	andeq	r0, r1, r0
    1a6c:	00000050 	andeq	r0, r0, r0, asr r0
	...
    1a80:	53000100 	movwpl	r0, #256	@ 0x100
	...
    1a8c:	08740002 	ldmdaeq	r4!, {r1}^
	...
    1a98:	08000590 	stmdaeq	r0, {r4, r7, r8, sl}
    1a9c:	08000592 	stmdaeq	r0, {r1, r4, r7, r8, sl}
    1aa0:	007d0002 	rsbseq	r0, sp, r2
    1aa4:	08000592 	stmdaeq	r0, {r1, r4, r7, r8, sl}
    1aa8:	08000624 	stmdaeq	r0, {r2, r5, r9, sl}
    1aac:	087d0002 	ldmdaeq	sp!, {r1}^
	...
